{
  "collections": [
    "Str8Hell"
  ],
  "description": "In Airport Security we find Hugo Antonin being under investigation, by Martin Merlot and Borek Sokol. Martin checks Hugo’s luggage and finds nothing. But he decides that he has to do a personal inspection. Despite Hugo’s protestations, they threaten to cut off his shirt. But Borek has another idea. He drops his pants and shows off a rock hard cock. Pushing Hugo to his knees he makes him to suck it. Hugo does a very good job and when they stand him up and open his pants they find that he is rock hard too. He is then made to suck on Martin’s big hard cock. His head bobs on that dick until Martin holds it in place and fucks the mouth. Hugo turns his head and finds Borek’s dick waiting, so he sucks that again. Then the guards stand Hugo up and begin to rip his shirt off. Before they get too far Borek starts to examine his ass hole. He pulls the cheeks open to check the hole, and then removes the jeans from Hugo’s legs. The quickly bend him over and Borek’s cock slides into Hugo’s tight ass. He fucks hard as Hugo moans. Borek reaches behind him and finds Martin’s throbbing cock, which his wanks. He fucks Hugo’s ass hard and fast, with Hugo moaning even louder. Then Borek pulls out and his place is taken by Martin, who fucks Hguo real deep. Borek moves round and shoves his cock in the moaning mouth. Then they all move with Martin laying on the floor and Hugo riding his dick. Borek’s cock is being sucked by Hugo too. He rides that big cock as Martin reaches round and wanks him. Then Hugo moves on to his back, legs up and Borek pounds his tight hole some more. Hugo is rock hard as his hole gets worked. He grabs his cock and wanks it fast, until his cums shoots out. Borek continues to fuck that hot ass as Martin kneels over Hugo wanking. Borek is ready to blow and pulls out to dump his cum on Hugo. Martin follows suit releasing a nice load. Hugo sucks Martin’s sticky cock to clean it off, as Borek and Martin kiss each other after a very hot inspection. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Borek Sokol",
      "person_id": 60756
    },
    {
      "name": "Hugo Antonin",
      "person_id": 60752
    },
    {
      "name": "Martin Merlot",
      "person_id": 60757
    }
  ],
  "release_date": "2018-02-28",
  "scene_id": 42975,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "blond",
    "Blowjob",
    "Bondage",
    "brunet",
    "Cop",
    "foreskin",
    "Gay",
    "Hair Pulling",
    "muscular",
    "Spanking",
    "Spit Roast",
    "Tag Team",
    "Partner Studio",
    "Threesome",
    "white"
  ],
  "title": "Hugo, Borek and Martin RAW - AIRPORT SECURITY"
}