{
  "collections": [
    "Str8Hell"
  ],
  "description": "Roco Moric is one hot-assed muscle guy. In this spanking we find him working out, but he has forgotten that he should be doing something else. Ondra Matej arrives to take him to task. He makes Roco do some push ups and other exercises, and decides he needs punishing for missing his shift. He instructs Roco to get undressed, and soon has him naked. As he stands, naked, Roco feels Ondra’s hand slapping his chest and cock, and then he has to do more exercises. Ondra turns him around and starts spanking his hot ass. His hand hits hard on that ass, making it nice and red. Then Roco turns again and the heavy hand starts hitting on his chest again. Each time it lands Roco grimaces. His ass gets it again, marking nicely, before Ondra makes him kneel on the chair and takes a whip to it. Using the whip and the hands really make Roco feel how sore his ass has gotten. With that ass looking so red and sore Ondra moves Roco onto his back, legs up, so the hole is exposed nicely as he spanks again. Two hands then start spanking the ass before Ondra takes a butt plug and starts working it into Roco’s tight ass. The hole gets stretched good and that ass is so red, and spotted as Roco completes the punishment, leaving Roco’s final humiliation to be that he has to wank his cock and shoot his cum as Ondra towers over him. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Ondra Matej",
      "person_id": 60758
    },
    {
      "name": "Roco Moric",
      "person_id": 60759
    }
  ],
  "release_date": "2018-04-25",
  "scene_id": 42976,
  "tags": [
    "Acrylic Plug",
    "Anal",
    "black hair",
    "blond",
    "body builder",
    "Breast Abuse",
    "buttplug",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Flogging",
    "foreskin",
    "Gay",
    "Humiliation",
    "masturbation",
    "Muscle",
    "Role Play",
    "Slapping",
    "Spanking",
    "the chair",
    "Partner Studio",
    "Uncircumcised",
    "white"
  ],
  "title": "Roco Moric - SPANKING"
}