{
  "collections": [
    "Str8Hell"
  ],
  "description": "In this great Raunchy Sex scene we have Hugo Antonin and Jindra Durak. Jindra has Hugo tied, at the wrists, to a wooden frame in the barn. He is naked and Jindra starts playing with his cock. He kisses his way down the body and takes the cock in his mouth, biting and then sucking on it. Hugo’s cock quickly responds, getting very hard indeed. Jindra slap the balls, making Hugo flinch, as he sucks on the dick. Jindra stands and opens his pants, pulling out his own rock hard cock. He wanks both cocks together as he pulls on Hugo’s nipples and kisses him. Then Jindra releases Hugo from the frame, pushing him to the ground and makes him suck some cock. Hugo loves dick and really works his hot mouth on Jindra’s throbbing member. It doesn’t take long before Jindra bends him over and plays with his hot ass, fingering the hole and getting it ready for more. He bends and rims the hot hole before shoving his dick in all the way. He fucks that tight ass deep and hard, spanking it at the same time. His cock really stretches that hole as it pounds away. Hugo changes position, holding the frame as his legs are over Jindra’s shoulders, so his ass can get fucked some more. He takes that thick cock so well, it slides all the way in really working the hole. Then on the floor, legs up over his head Hugo wanks his throbbing cock as Jindra continues fucking him. His wanking soon has that cock shooting a hot load all over his body. Jindra pulls out squat over Hugo’s face so he can rim the hole while a hot load is dumped all over that handsome face. Jindra will be back for more later, so he ties Hugo to the frame again. the cum still all over his face. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Hugo Antonin",
      "person_id": 60752
    },
    {
      "name": "Jindra Durak",
      "person_id": 60751
    }
  ],
  "release_date": "2017-11-17",
  "scene_id": 42970,
  "tags": [
    "Anal Fingering",
    "Athletic",
    "blond",
    "Blowjob",
    "Bondage",
    "brunet",
    "Fingering",
    "foreskin",
    "Gay",
    "Hair Pulling",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Spanking",
    "Tattoo",
    "Partner Studio",
    "white"
  ],
  "title": "Jindra and Hugo - RAUNCHY"
}