{
  "collections": [
    "Str8Hell"
  ],
  "description": "Jason Lucius is a very hot newcomer, who has Tono Milos in his control. Tono is shackled and in just some revealing underwear. Jason is quick to take advantage, groping Tono's crotch and kissing him. Working his way down Tono's sexy body Jason licks the crotch and then goes back up to kiss some more. Pulling Tono's underwear down Jason reveals a rock hard cock. He quickly takes it in his mouth and starts to suck . He sucks on the dick and then slaps it around a little too. Tono's cock is big, but is easily managed by Jason's eager mouth. Jason releases Tono, but keeps hold of him, reaching round to wank him. Jason sits on the floor and positions Tono between his legs, so he can slap and wank at will. He then leans forward and fingers Tono's hot hole. Tono stays hard and wanks his cock as his ass take the finger. Jason is ready for more though and gets naked, shoving his throbbing cock deep into Tono's eager ass. Tono's cock bobs around as Jason's stretches his hole wide. His cock is in, right up to the balls and fucks Tono nice and hard. Tono drops onto his knees, wanking himself as Jason is behind him, slamming his dick deep into that ass. Then, as Jason sits on the floor again, Tono rides that big cock. His ass works up and down the thick shaft taking it all deep in his hole. He moans as he feels the pleasure of having his ass stretched. With that big dick deep in his ass Tono wanks himself to a very fine cumshot. Jason continues to work his dick in Tono's ass a while. Then Tono climbs off and sucks on Jason's cock. He wanks it as well, getting faster and faster until Jason shoots a huge load all over his sexy body, moaning loudly as the cum squirts over him. Then Tono leans over to kiss his hot fuckbuddy at the end of a great scene. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Jason Lucius",
      "person_id": 60760
    },
    {
      "name": "Tono Milos",
      "person_id": 60761
    }
  ],
  "release_date": "2017-12-20",
  "scene_id": 42978,
  "tags": [
    "Anal",
    "Anal Fingering",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Chains",
    "dungeon",
    "Gay",
    "Handjob",
    "Male Handler",
    "Male Sub",
    "Shackle",
    "thirdparty"
  ],
  "title": "Jason and Tono RAW - RAUNCHY"
}