{
  "collections": [
    "Str8Hell"
  ],
  "description": "Arny Donan and Marek Borek are getting ready for some more hot action, in Airport Security, with Alan Carly. Alan is naked on the sofa, in handcuffs, as Arny and Marek start to drip wax on him. Despite Alan’s moans Marek decides that Alan likes the feeling of the wax landing on him, so more is applied. Alan is turned over so that he can get some on his back and ass too. He writhes and moans each time more drips on him. Once they have done enough with the wax Marek and Arny walk off to dispose of it. When they come back they are naked, hard and ready to fuck. Marek is first to get some of Alan’s hot ass. His dick works in and out of Alan’s hole. Arny, meanwhile, is face fucking Alan. Then it is Arny’s turn to have some ass. With Alan laying on his back Arny pounds his ass deep and hard. Marek’s big dick fills Alan’s mouth at the same time. With all this action Alan is rock hard, and he grabs his cock and wanks it. Arny continues to fuck his hot ass as Alan’s cock throbs as it is wanked. He really takes Arny’s cock so well and sucks on Marek’s too. Then Arny pulls out, and wanks himself to a massive cumshot, squirting his juice everywhere. Marek stands between Alan’s legs as he wanks himself to a climax too. Then Arny grabs Alan and throws him out to end a great scene. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Alan Carly",
      "person_id": 60753
    },
    {
      "name": "Arny Donan",
      "person_id": 60754
    },
    {
      "name": "Marek Borek",
      "person_id": 60755
    }
  ],
  "release_date": "2018-05-23",
  "scene_id": 42977,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Domination",
    "foreskin",
    "Gay",
    "gloves",
    "Hot Wax",
    "Muscle",
    "muscular",
    "Spit Roast",
    "Squirting",
    "Tag Team",
    "Partner Studio",
    "Threesome",
    "Uncircumcised",
    "white"
  ],
  "title": "Marek Borek & Arny Donan Use Alan Carly RAW - AIRPORT SECURITY"
}