{
  "collections": [
    "Str8Hell"
  ],
  "description": "Josef Houska and Petr Maslak have been stopped at the airport and taken to Airport Security, where Tom Vojak is ready to inspect their package. Tom opens the package and discovers a number of sex toys. He decides to take them to another room, for further examination. He moves Petr too, into a room equipped for action. Petr’s arms are shackled to a St Andrew’s cross, his chest exposed. Tom keeps up a constant barrage of abuse as he checks out Petr’s sexy body. He puts a ball gag into Petr’s mouth and then lowers his pants to fully expose him. Tom slaps Petr’s face, and plays with his cock as well. Then he begins to whip Petr’s body as well, and kisses all over his body, working down towards his cock. Tom takes the cock in his mouth and begins sucking it as Petr struggles against his restraints. Petr’s dick gets good and hard as Tom sucks and wanks it. Then Tom goes back to deal with Josef, he inspects his luggage too, before taking him into the other room as well. Tom makes Josef remove his tee-shirt and then has a quick suck on Petr’s cock again before lowers Josef’s pants. He shackles Josef’s wrists as well and starts to spank his ass. Josef moans as he feels the heavy hands, and a whip on his sexy body. Tom lowers Josef to his knees. Then he pulls out his own throbbing cock and pushes it into Josef’s mouth. He makes his prisoner suck on that massvie tool, stripping off his uniform at the same time. Josef’s hot mouth really works on that big cock but it is not enough for Tom. He soon has that big dick deep in Josef’s tight ass, fucking him hard and fast. Josef moans as he takes that cock, but his own dick seems to be responding to the pleasure his ass is feeling. Tom really pounds aways and that ass, fucking it as deep as he can go. He moves Josef, onto his back, legs up and continues to stretch that hole with his hard cock. He fucks it so hard, and spanks on Josef’s ass at the same time. Petr is released and stands over Josef wanking his own hard cock as he watches the fucking. Tom’s fucking gets even harder and he unloads his hot load deep inside Josef’s ass. Josef opens his hole up and pushes the hot cum right out of that ass. Then he see Petr’s cock releasing its own hot cum, as he stands over him. Josef reaches up to feel the spent cock and then wanks his own throbbing cock to a lovely cumshot as well. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Josef Houska",
      "person_id": 60762
    },
    {
      "name": "Petr Maslak",
      "person_id": 60763
    },
    {
      "name": "Tom Vojak",
      "person_id": 60764
    }
  ],
  "release_date": "2018-04-11",
  "scene_id": 42980,
  "tags": [
    "Anal",
    "Anal Creampie",
    "Ball Gag",
    "Bareback",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "Creampie",
    "dungeon",
    "Flogging",
    "foreskin",
    "Gag",
    "Gay",
    "Hair Pulling",
    "Leather Cuffs",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Redhead",
    "Tattoo",
    "the cross",
    "Partner Studio",
    "Threesome",
    "Twink",
    "Uncircumcised",
    "white"
  ],
  "title": "Josef, Petr and Tom RAW - AIRPORT SECURITY"
}