{
  "collections": [
    "Str8Hell"
  ],
  "description": "Paul Hunter is in charge of Airport Security today. As he sits at his desk his assistant Robin Valej brings in a traveller, the very sexy straight guy, Rosta Benecky. Paul decides he needs to check Rosta’s luggage. He opens the suitcase and begins to root through it. He finds a dildo, which Rosta insists is for his girlfriend. Then he finds some rope as well and something very sharp, which they think could be used as a weapon. Paul decides that Rosta himself needs further inspection and Robin pats him down and then removes Rosta’s tee shirt. Not content with that Robin then opens Rosta’s jeans and pushes them down. Rosta complains, but the guards insist on checking his ass. They bend him over the table and use the sharp implement on his sexy ass. It looks like a pastry or pizza cutter that is rolled over his ass and legs. Then Robin takes Rosta’s belt and beats his ass with it. Rosta moans as the thick belt lands on his sexy ass. Next Robin grabs the dildo and rubs it up against Rosta’s hole. He pushes it hard against the hole until it slips inside, with Rosta moaning as it goes in all the way. Robin fucks the dildo in Rosta’s tight ass as Paul holds him down. Then the guards decide on more fun. Rosta is pushed to his knees as Paul gets his rock hard cock out. He shoves it into Rosta’s mouth, making him suck it. As Paul fucks his cock into Rosta’s mouth Robin releases his own dick and Rosta is turned and made to suck it. Robin drops his clothes and then shoves his cock into Rosta’s mouth, fucking it in and out. Then Paul takes another turn, his throbbing cock really pounding at the hot mouth, before Rosta it turned again, so Robin’s cock gets more. Rosta is then moved to the table and Paul fucks his cock into that sexy ass. Rosta moans as he feels his hole filled and fucked. His own cock is hard and trapped against the table as his holed gets fucked deep. Robin then takes over and his big cock fucks that tight ass too, before giving it up for Paul again. They keep taking turns fucking that hot ass, putting Rosta onto his back so that he can wank himself as he gets fucked deep. With Robin’s cock deep in his ass Rosta’s wanking makes him cum, shooting his cum over his leg. Robin keeps fucking hard and fast until he is ready to cum. He pulls out and shoots his hot cream over Rosta. Paul too is ready to blow and wanks his cock to shoot over Rosta’s sexy chest. Then the guards leave him alone, with his massive cock still hard and poking out in front of him. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Paul Hunter",
      "person_id": 60768
    },
    {
      "name": "Robin Valej",
      "person_id": 60769
    },
    {
      "name": "Rosta Benecky",
      "person_id": 60770
    }
  ],
  "release_date": "2018-01-03",
  "scene_id": 42982,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "black hair",
    "blond",
    "Blowjob",
    "brunet",
    "Cop",
    "Dildo",
    "Domination",
    "foreskin",
    "Gay",
    "Leather Belt",
    "Male Handler",
    "Male Sub",
    "Straight",
    "Tag Team",
    "Partner Studio",
    "Threesome",
    "white"
  ],
  "title": "Rosta, Robin and Paul RAW - AIRPORT SECURITY"
}