{
  "collections": [
    "Kink Features"
  ],
  "description": "In Episode Six of Hush: Mia Li likes being told what to do, whether it's wearing lingerie to work, or getting tied up and flogged in the Human Resources office. She secretly wants it all. Fortunately for her she works for a sex positive company, in a sexually charged environment, with oversexed HR Director, Helena Locke always at the ready. Mia rushes into Helena's office, concerned about her feelings towards her fellow coworkers, but Helena assures her that her feelings are normal and natural, and to explore them. Helena prompts Mia to get on her knees, to worship her body, starting with her feet, working her way up her legs to her delicious pussy. She then puts Mia on the floor, tears her out of her clothes, and ties her up so she can get at every inch of her sumptuous body without protest. Mia cannot hide her joy as Helena takes total advantage of her, Mia is put in a partial suspension, with only one foot on the ground, while Helena flogs her, teases her, spanks her pussy, and finally fucks her with a strap-on. She plows and finger fucks Mia's slutty cunt, using a vibrator at the same time to drive her wild and make her cum, even while in this stressful bondage position. Helena then lowers Mia to the floor, propping her up on her hands and knees, but keeps her bound by the arms and legs, and rams her cock into Mia's hungry ass. Mia is in fucking heaven as Helena plows her hole, actually making her cum solely from anal sex. She then rolls her onto her back so Mia can use the vibrator again to cum while getting her asshole fully fucked. Meanwhile, blackmail continues to swirl through the office as the company boss Julia Ann learns that Cherry Torn has been fucking the new designer Eliza Jane. Julia will be dealing with Cherry PERSONALLY.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Mia Little",
      "person_id": 51496
    }
  ],
  "release_date": "2018-01-19",
  "scene_id": 42986,
  "tags": [
    "bondage",
    "Cherry Torn",
    "Feet",
    "flogging",
    "lingerie",
    "straight",
    "suspension",
    "vibrator"
  ],
  "title": "HUSH Ep 6: Mia Li Likes It All A Little Too Much"
}