{
  "collections": [
    "Str8Hell"
  ],
  "description": "What a great Raunchy scene we have, with the sex mad Ivan Mraz and step-brothers Romi and Petr Zuzka. We find Ivan gagged and shackled to the bed, naked and with clamps on his nipples. Our sexy step-brothers arrive, wearing see-thru underwear and holding their whips. They have fun, whipping Ivan's hot, writhing body. Ivan moans as he feels the whips, his cock beginning to harden. Romi grabs that cock and is soon sucking on it, before letting Petr have a taste as well. Ivan's cock gets good and hard as Petr sucks it. Then Romi takes over again. They take turns on Ivan's cock and then decide to feed him some cock too. Both are rock hard and release the gag from Ivan's mouth, so he can enjoy some throbbing meat. Romi is naked, and rams his dick in and out of Ivan's eager mouth. Then, as Romi goes back down on his cock, Ivan sucks Petr. They release Ivan's ankles and shackle them over his head, so that his hot ass it available. Romi's hot tongue hones in on that hot ass, and laps at it. Petr then has a taste of hole as well. They again take turns as it. Then they move Ivan onto his knees and Petr gets behind him, ramming his big, hard cock deep into that hot hole. As Ivan moans Petr fucks him deep and hard. Then he pulls out and makes way for Romi to fuck that eager hole. When it is Petr's turn again he climbs and and fucks nice and deep as Romi covers Ivan's mouth . Then Romi gets to fuck that ass again, before his place is taken once more by Peter. Ivan is turned over, onto his back and his hole is pounded some more with Petr first up. Romi kneels close by and wanks his cock as he brother slams in and out of Ivan's ass. Ivan wanks himself too and soon explodes with a hot cumshot. Petr keeps fucking as Romi wanks himself until he shoots a nice load too. His hot cum shoots over Ivan's sexy chest, as Petr continues to pound away at that ass. Petr cant hold back and dumps his creamy load deep in Ivan's hot ass. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Ivan Mraz",
      "person_id": 60765
    },
    {
      "name": "Petr Zuska",
      "person_id": 60766
    },
    {
      "name": "Romi Zuska",
      "person_id": 60767
    }
  ],
  "release_date": "2018-02-14",
  "scene_id": 42981,
  "tags": [
    "Anal",
    "BDSM",
    "bit gag",
    "Blowjob",
    "Bondage",
    "Domination",
    "dungeon",
    "Edging",
    "Flogging",
    "Gag",
    "Gay",
    "Hand Gagging",
    "Leather Cuffs",
    "Male Sub",
    "masturbation",
    "Nipple Clamps",
    "Oral Sex",
    "Rimming",
    "Rope Bondage",
    "Shackle",
    "Spanking",
    "Tag Team",
    "thirdparty",
    "Uncircumcised",
    "Whipping"
  ],
  "title": "Romi, Petr and Ivan RAW - RAUNCHY"
}