{
  "collections": [
    "Str8Hell"
  ],
  "description": "Our handsome Martin Gajda is in for a good time in this Milking Men video. He is wearing his undershirt and briefs as he sits in the chair, ankles and wrists shackled. Then two sets of hands appear, rubbing his beautiful thighs and working up his body to his armpits. Martin laughs as the hands tickle his pits and rub over his chest. The hands move to grope his underwear and then raise up the undershirt. The hands cut and rip the undershirt to show off Martin’s sexy chest, feeling all over it. Then the briefs are cut too, until the cock and balls are only just encased. Fingers slide under the stiffing cock and then the waistband of the briefs is cut and torn asunder to expose Martin’s rock hard cock. The hands feel over his body and wank on his cock. Oil is dripped onto the cock and then rubbed all over it. The hands take turns wanking the cock and rubbing the hot body. Martin says he is cumming so the cock is released to prevent it from happening. Once the urge to cum has diminished the cock is wanked again. Martin keeps moaning and wants to grab his dick to finish off. But he is not allowed. The hands keep wanking the dick and then releasing it just as Martin is about to shoot his load. Each time his dick is released Martin tries to grab it, but the guys stop him from doing so. Then they go back to wanking him. Then they move Martin, raising and tying his legs up, so his ass hole is on show too. His balls are tied and a toy slides into his hot ass as his cock is wanked. His sexy ass is fucked by the toy as the cock is wanked hard. Then the toy is removed and fingers rub all over the sexy hole. The cock is still being wanked and Martin is desperate to cum. He moans so loudly as the wanking speeds up. Then, as he is about to shoot his load, the cock is released again. Finally his legs are released and his cock is wanked until he shoots hit big, creamy, cumhshot all over his thighs. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Martin Gajda",
      "person_id": 60776
    }
  ],
  "release_date": "2018-01-31",
  "scene_id": 42984,
  "tags": [
    "Anal",
    "Athletic",
    "Bondage",
    "brunet",
    "CBT",
    "Dildo",
    "Edging",
    "foreskin",
    "Gay",
    "Handjob",
    "Leather Cuffs",
    "Muscle",
    "Rope Bondage",
    "the chair",
    "Partner Studio",
    "Tickling",
    "white"
  ],
  "title": "Martin Gajda - MILKING MEN"
}