{
  "collections": [
    "Kink Features"
  ],
  "description": "In episode one of an 8-part Lezdom Blackmail series, the lithe and petite Eliza Jane is hired as a designer at an internationally renown lingerie company. On her first day she's asked to wear some of the company's lingerie as part of her \"uniform\", which she loves to slip over her smooth, perfect body. Her new boss Cherry Torn takes the opportunity to see how well her uniform fits... and feels, and how it makes Eliza's hot ass look! Cherry gets just a little carried away spanking her new hire in her office, repeatedly, while Eliza's big-titted redhead coworker Bella Rossi secretly takes photos. Things get down and dirty after work as Bella, Eliza and their beautiful ebony coworker Kira Noir go all-out with spanking, pussy licking, finger banging, anal fingering, flogging, and an intense strap-on DP. Eliza dives in head first, letting Bella toy with her nipples as Kira licks her wet, slutty pussy. They play with every inch of her body as Kira slides her finger into her hungry ass. Eliza's then put on her back and smothered by Bella's hot cunt, then Bella bends over and a hot pile of 3-way pussy licking takes her to orgasm. Finally, Eliza and Bella both put on strap-ons. Bella flogs Kira as Eliza pounds her ass, then Bella joins her, sliding into Kira's pussy as the two of them hammer away at her two hungry holes, making her cum, then cum again. The three of them collapse into a pile of exhausted sweaty sex. Eliza's first day was an exciting one, with more to come. Perhaps more than she can handle! To be continued!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Eliza Jane",
      "person_id": 59596
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2017-12-15",
  "scene_id": 42987,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Big Natural Tits",
    "Big Tits",
    "Clover Clamps",
    "Double Penetration",
    "Ebony",
    "Facesitting",
    "Fingering",
    "Flogging",
    "High Heels",
    "Hitachi",
    "Interracial",
    "Lesbian",
    "LezDom",
    "Lingerie",
    "Nipple Clamps",
    "Nylons Stockings",
    "Paddle",
    "Petite",
    "Redhead",
    "shaved",
    "smooth",
    "Spanking",
    "Straight",
    "Strap On"
  ],
  "title": "HUSH Ep 1: Eliza Jane Ensnared in 3-way Lesbian Blackmail"
}