{
  "collections": [
    "Kink Features"
  ],
  "description": "In Episode Three of Hush... Bella Rossi confronts her boss, Cherry Torn, with the photos she took of Cherry banging the new designer, and all but threatens to go over her head if she doesn't play ball. Shit's rolling uphill now, as the employee blackmails the boss to get everything she wants. Realizing she's cornered, Cherry relents. Bella tears her out of her clothes and throws her into bondage, tying her to the ceiling above and a huge rock below, with her hands behind her back, a spreader bar between her ankles to keep her pussy and ass spread open, and a fat red ball gag in her mouth to keep her shut up. Bella absolutely knows her way around a sub, and she wastes no time putting that bitch to good use. She cracks out her flogger and immediately starts working Cherry's ripe, exposed ass. And in a show of true sadism, delights in tormenting her with a zapper. She holds back for a long time while Cherry whines and pouts, knowing the electricity is coming. And when Bella lets loose, she hits every sensitive spot she can find. Cherry's nipples, her ass, her pussy. She picks the flogger back up and lets Cherry have it, along with the zapper. Cherry can take a lot, and Bella knows this, so she gives a lot. She then sticks her own gorgeous ass in Cherry's face, and Cherry can't hide her pleasure at getting to lick and eat her glorious asshole and pussy. Bella cums hard as her boss eats her sweet wet cunt. She then puts on a strap-on and slides into Cherry's dripping slutty pussy and fucks her deep and hard. She moves to her asshole and fucks her ass too, until both holes are filled and stretched. Finally, Bella puts Cherry on her back and finger fucks her as she cums multiple times. Bella got what she wanted from her boss, but is she finished? Will she still use the photos against her? Who knows? Bella's never been that nice.",
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2017-12-29",
  "scene_id": 42990,
  "tags": [
    "ball gag",
    "bondage",
    "Cherry Torn",
    "electricity",
    "flogging",
    "gag",
    "sadism",
    "straight",
    "Zapper",
    "zapping"
  ],
  "title": "HUSH Ep 3: Bella Rossi Turns The Tables On Cherry Torn"
}