{
  "collections": [
    "Families Tied"
  ],
  "description": "Phoenix Marie is a high protocol anal submissive grand dame you would not want to cross, but self absorbed little slut Anya Olson has no idea what kind of family she has just married into. Petite, gorgeous, and in need of a spanking, Anya attempts to drive a wedge between Xander and his step-mother, but some ties cannot be broken. Phoenix has long been in service to Xander, offering all her holes and care taking the family mansion: It is high time Anya be initiated into a sexual slave lifestyle under Phoenix' perfect round ass.Â \nXander begins Anya's training after a particularly bratty episode, using his belt to beat her ass and control her head for a hot sloppy blowjob. Once she has a swollen red butt and her sir's and thank you's down, she is strapped down to the bed in tight belt bondage, fucked mercilessly, and shocked while begging to cum.Â \nPhoenix will not be comforted, and continues to insist that Anya is untrainable. Xander puts her back under his foot, allowing her only to complain about his wife with his thick cock wedged deep in her throat or with an electric plug deep in her ass. With her huge tits clamped and her step-son pounding her swollen pussy, Phoenix promises to train Anya.\nThe rest of the day is spent turning this pretty little newly wed brat into a humbled fuck toy, begging Mommy for all of her orgasms and thanking her husband properly for every stroke. Crops, rope bondage, zappers, and verbal humiliation are just the beginning for Anya. The true degradation is learning she must lick her husband's cock as he fuck's his step-mother's ass before she can earn any of her own fucking. And if she squirts without permission, Phoenix will be there to punish her with an iron fist.Â",
  "directors": [],
  "models": [
    {
      "name": "Xander Corvus",
      "person_id": 46000
    },
    {
      "name": "Anya Olsen",
      "person_id": 59050
    },
    {
      "name": "Phoenix Marie",
      "person_id": 17093
    }
  ],
  "release_date": "2016-11-01",
  "scene_id": 43000,
  "tags": [
    "anal",
    "ass licking",
    "ball gag",
    "bdsm",
    "blonde",
    "blowjob",
    "bondage",
    "Breast Bondage",
    "Bush",
    "caning",
    "choking",
    "cock sucking",
    "Corporal Punishment",
    "Deepthroat",
    "discipline",
    "drool",
    "electrical play",
    "electricity",
    "electro plug",
    "Family Roleplay",
    "female slave",
    "gag",
    "hair pulling",
    "hand gagging",
    "high heels",
    "Hitachi",
    "humiliation",
    "leather",
    "leather belt",
    "leather cuffs",
    "master",
    "MILF",
    "oral sex",
    "Petite",
    "Pussy Eating",
    "rimming",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "slave",
    "smothering",
    "spanking",
    "Stockings",
    "straight",
    "tag team",
    "tazapper",
    "threesome",
    "Vaginal Penetration",
    "vibrator"
  ],
  "title": "Anal MILF Phoenix Marie Trains Lazy Daughter-in-Law"
}