{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Alex Harper is trying to sell a loft space, but her potential buyers have other things in mind. They waste no time showing her where their real interests lie. Alex barely has time to mention the property before they surround her, rip her shirt off and play with her tits. Her secret desire to be fucked by all five guys quickly bubbles to the surface and she forgets all about selling the place. Instead they're gonna fuck in it and fuck it up. Alex is put on her knees right away and surrounded by huge cocks. One after the other the guys slide their big dicks down her throat and make her suck and slurp and jerk them all. They tie her up to limit her mobility and hold her in position, but keeping her hands free so she can continue to jerk and suck their cocks as they demand. Alex is then put in a partial suspension while standing on one foot, with her wet, slutty pussy open and hungry for cock. The dudes take every advantage, fucking her cunt and throat, then sliding into her desperate, needy ass. Alex takes every big cock, deep and hard, and lusts for more. The guys finally tie her wrists and DP her. Cocks sliding in her pussy and ass, while another pounds in her throat, filling her airtight. They shoot their hot loads all over her face, leaving Alex utterly covered in cum.",
  "models": [
    {
      "name": "Alex Harper",
      "person_id": 60270
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Cyrus King ",
      "person_id": 60686
    },
    {
      "name": "Cody Steele ",
      "person_id": 60685
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    }
  ],
  "release_date": "2017-11-29",
  "scene_id": 43007,
  "tags": [
    "anal",
    "bdsm",
    "Blowbang",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "Double Penetration",
    "gangbang",
    "hand job",
    "role play",
    "Rough Sex",
    "straight",
    "suspension"
  ],
  "title": "Alex Harper Bound and Gangbanged by 5 Horny Homebuyers"
}