{
  "collections": [
    "Bound Gods"
  ],
  "description": "Wearing only a leather dog mask and a jock strap, hands resembling paws bound in black tape, Brian Bonds barks like a dog and wags his tail in his cage, waiting for his master, Jonah Fontana. Jonah enters the room wearing black leather pants and boots, holding a crop, and asks his puppy if he wants to get let out of his cage and play for a while. After a couple of excited barks, Jonah lets his puppy out of the cage and gives him a scratch on the chin. Brian sits like a dog in front of Jonah and begs for his bone. Jonah tells his puppy that he'll have to earn it and crops his back and inserts a butt-plug puppy tail into Brian's asshole before whipping out his hard pierced cock. Through the leather puppy mask, Brian sucks his master's cock while getting cropped. In the next scene Brian is bound with rope on his back to a circular table. Jonah comes in and removes the mask's muzzle and replaces it with a spider-gag in Brian's mouth. Jonah cuts Brian's jock off with scissors and sucks his pup's hard cock. After that, Jonah applies clover clamps to his pup's nipples and across his stomach and even more across his ball-sack. Jonah sticks his hard pierced cock through the spider-gag in Brian's mouth and fucks his face before painfully removing all of the clover clamps. In the final scene, Jonah ties his pup to the outside of his kennel with his ass sticking out. Jonah crops his ass and back hard while Brian whimpers. Jonah then removes Brian's butt plug and replaces it with his cock. Jonah fucks Brian's ass deep and hard sticking his fingers in Brian's mouth making him taste his leather glove. After a hard fucking, Jonah releases his pup from the cage to give him a treat and shoots a huge load all over his leather mask.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jonah Fontana",
      "person_id": 59550
    },
    {
      "name": "Brian Bonds",
      "person_id": 33737
    }
  ],
  "release_date": "2018-02-01",
  "scene_id": 43017,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "cage",
    "clover clamps",
    "Corporal Punishment",
    "couple",
    "crop",
    "domination",
    "gag",
    "gay",
    "humiliation",
    "Jock",
    "leather",
    "Male Sub",
    "mask",
    "master",
    "Nasty Pups Come Out to Play",
    "puppy play",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "submission",
    "whipping"
  ],
  "title": "Puppy Play, Kennel Training"
}