{
  "collections": [
    "Bound Gods"
  ],
  "description": "This week's Men on Edge left new boy Brodie Ramirez tied up in an alley after being edged and teased. As Brodie struggles to get loose, Dominic Pacifico is on the prowl. He took down Brodie and he's back for more. Brodie thinks Dominic is here to release him, but Dominic is just here to watch this slut take even more pain and pleasure. Tired of Brodie's pathetic pleas for freedom, Dominic puts close-pins all over his tongue. Then he lights a candle and drips wax all over Brodie's tongue, chest, cock, balls, and feet. Brodie screams in pain as his whole front is covered by wax. Then Dominic takes a shoe off and rubs his dirty foot all over Brodie's face. Brodie has no choice but to take it, licking Dominic's foot clean in hopes he'll be released. But that's not what Dominic has in store for Brodie. He ties Brodie down and puts a gimp mask on him. He makes Brodie smell his cock before ramming it down Brodie's throat. Taking every inch, Brodie sucks Dominic's cock, gagging on it with drool and spit leaking from his slutty mouth. Dominic flogs Brodie on his back and ass before bringing Brodie's mouth back down on his dick. Finally, Dominic puts a gag in Brodie's loud mouth and fucks this slut's tight asshole. Brodie loves feeling Dominic's fat cock filling him up and enthusiastically works Dominic's cock as he moans around the gag. Dominic knew this horny bitch wanted it and works Brodie's cock till he blows his load all over himself. Brodie begs to be released as Dominic brings him down to his knees and shuts him up with his cock. He uses Brodie's mouth and then gives this slut a big load of cum all over his face. He makes Brodie suck is cock clean, before hauling him off to whore him out to anyone who wants him.",
  "models": [
    {
      "name": "Brodie Ramirez",
      "person_id": 60862
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    }
  ],
  "release_date": "2018-01-25",
  "scene_id": 43014,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "domination",
    "drool",
    "Feet",
    "foot torture",
    "gag",
    "gay",
    "Gimp",
    "hot wax",
    "humiliation",
    "Male Sub",
    "mask",
    "master",
    "pain",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "submission",
    "wax"
  ],
  "title": "Alley Cat Slut: New boy Brodie Ramirez gets tormented & fucked "
}