{
  "collections": [
    "Bound Gods"
  ],
  "description": "D.Arclyte is doing hard time with a hard-on in his one-man cell on Cell Block 3. Laying on his bunk, he thumbs through a dirty magazine stroking his cock when suddenly he's caught by Correctional Officer Nate Grimes. Refusing to give up the contraband, D. and Nate have a tug-of-war for the dirty magazine. D. grabs the officer's wrist twisting it into submission and gets both hands cuffed to the bars, both boots tied to the bars with rope, and gets a bit-gag stuffed in his mouth so the other inmates and guards cant hear his cries for help. D. removes all of Nate's clothes, cutting his underwear off last, revealing Nate's big hard cock. D. slaps and punches Nate's chest and thighs and takes his dick deep down his throat. D. gets the zapper and gives him a few electric shocks making his dick bounce around like a boxer. In the next scene, Nate Grimes gets tied now to the inside of the cell with his shoulders on the ground and his legs tied spread-eagle to the bars with black rope in a jack-hammer position. His eyes are blindfolded and his cock has been smashed inside a cage. D.Arclyte plays with Nate's asshole putting his fingers inside then finds a flogger and flogs Nate's ass while stroking his own cock. After that, D. finds a nightstick and sinks it deep into Nate's asshole, then uses a flashlight to stretch his ass even further. Nate's ass takes the whole flashlight and D. leaves it in there and goes into the cell to fuck his reluctant mouth. In the final scene, Nate is on his back, tied to the bunk with his legs spread, his ass getting fucked by a fucking machine. D. Arclyte walks in and steps over the machine and squeezes his cock into Nates ass along side the dildo attached to the fucking machine, double-penetrating his ass.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "D. Arclyte",
      "person_id": 59025
    },
    {
      "name": "Nate Grimes",
      "person_id": 60088
    }
  ],
  "release_date": "2018-01-18",
  "scene_id": 43015,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "cage",
    "Corporal Punishment",
    "dildo",
    "domination",
    "Double Anal",
    "gag",
    "gay",
    "humiliation",
    "Male Sub",
    "master",
    "Mouth Spreader",
    "Older and Younger",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "submission",
    "Zapper"
  ],
  "title": "Inmate D.Arclyte Captures Correctional Officer, Nate Grimes"
}