{
  "collections": [
    "Bound Gods"
  ],
  "description": "Teddy Bryce is the perfect fresh piece of meat that our sadistic dom has been waiting to sink his teeth into. First Teddy is restrained in tight rope bondage which renders him helpless and exposed to the brutal intentions of the male handler. His perfect body gets meticulously worked over and tenderized with a nasty leather impact tool that looks like the ruler a nun would use to discipline the knuckles of her mischievous students. After the dom punches and slaps the front of his muscled-masochistic-boy-toy, he then clamps clothespins all over his cock and balls. Teddy winces from the searing pain and chokes back tears because he doesn't want to appear to be weak in front of his bronzed idol. As the pain intensifies, Teddy's legs begin to tremble and he begs for mercy. And the dom is only too happy to oblige and rips all the clothes pins off at same time in one massive zipper. Teddy howls from the pain but his cock grows rock hard from the attention and approval of his master. Next Teddy gets splayed out like a pig over a fire pit so his tight ass can be spanked and beaten. The whole back side of his body gets ruthlessly attacked by a heavy leather flogger until shines bright red. Before he can take a breath the ruthless dom shoves his massive cock down Teddy's throat and laughs as his slave chokes and gags while attempting to please him. Satisfied with the devotion that Teddy has shown the handler then flips him onto his back and fucks his tight asshole relentlessly. This sends Teddy into a frenzied state and he begs to blow his load while being stuffed with anal penetration. His master makes him wait and promise to do anything that he is told to do before being allowed to cum. And when he is finally granted permission, Teddy blows a massive load of jizz all over himself. Panting from the ecstasy of release, his dom tears the ball gag out of Teddy's mouth and the shoots a huge load of cum straight down his throat. Teddy licks it all up and begs to cum again.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    },
    {
      "name": "Teddy Bryce",
      "person_id": 59874
    }
  ],
  "release_date": "2018-01-11",
  "scene_id": 43013,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "blowjob",
    "bondage",
    "clothespins",
    "Corporal Punishment",
    "discipline",
    "domination",
    "gag",
    "gay",
    "Handler",
    "humiliation",
    "leather",
    "Male Handler",
    "Male Sub",
    "master",
    "pain",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "Stud",
    "submission",
    "zipper"
  ],
  "title": "Ripped God Teddy Bryce Fucked and Beaten in Rope Bondage by Hot Stud!"
}