{
  "collections": [
    "Men On Edge"
  ],
  "description": "Brodie Ramirez is walking around, lost in an unfamiliar sketchy neighborhood, looking for a party. One wrong turn sends him walking down a dead-end alley where Sebastian Keys and Dominic Pacifico are already waiting, eager to tie up an unsuspecting guy right there on the dirty street and edge his cock. As Sebastian and Dominic approach Brodie in the alley, Brodie gets a bad feeling and tries to run away, but he's caught by Dominic who holds Brodie while Sebastian quickly ties him up with rope. Dominic holds his hand over Brodie's mouth to muffle the screams while Sebastian cuts Brodie's shirt off and pulls his pants down showing his already hard cock through his underwear. Sebastian cuts the underwear off and Dominic squats down and starts sucking Brodie's hard cock. Sebastian wraps some rope around Brodie's cock and balls and ties the other end of the rope to the wall making Brodie's cock even harder. Sebastian starts jerking Brodie off using a flesh-light getting him so close to cumming but Sebastian and Dominic wont let him. In the next scene, Brodie is tied up again with rope but this time on his back with legs spread apart, blindfolded and gagged, still wearing the cowboy boots. They slap his ass and play with his cock. They take Brodie's boots and socks off and simultaneously lick and suck his toes while they jerk his cock and finger his asshole. After that they tickle him making him giggle and squirm. They apply clothespins to Brodie's nipples. Sebastian pulls on Brodie's balls while Dominic jerks his cock letting Brodie cum this time and Brodie shoots his load all over his own stomach. Dominic scoops it all up and feeds it to him and they both just leave him there tied up, naked.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brodie Ramirez",
      "person_id": 60862
    }
  ],
  "release_date": "2018-01-23",
  "scene_id": 43018,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "Clothespins",
    "Edging",
    "Foot Worship",
    "Gay",
    "Handjob",
    "Latin",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Pierced Nipples",
    "Prostate Stimulation",
    "Rope Bondage",
    "the wall",
    "Threesome",
    "Tickling"
  ],
  "title": "Brodie Ramirez Gets Edged in the Alley"
}