{
  "collections": [
    "Families Tied"
  ],
  "description": "Dee Williams is bouncing back from a nasty divorce, finally having found a hard cock worth serving with her skilled mouth, a firm hand to beat her juicy ass red, and a commanding voice worth kneeling for. The only issue is that the Master at hand is much younger, almost the same age as her bratty little minx step-daughter. A couple more months and Aspen will be at college and Dee will be able to live her anal slave slut reality full time, but until then she is determined to keep her little secret. Unfortunately for Dee, her new Master Seth doesn't care much for secrets and clamps her whore clit tightly, beats her ass with canes, flogs those big gorgeous tits a deep red, and still won't let her cum until she promises to tell her daughter about him. Satisfied with her word he bends her head backwards and fucks her throat and then slams her face down on the floor for a good anal pounding - And then Aspen comes home early to find her step mother face down ass up in the family living room.\nWhen Aspen comes skipping down the stairs the next morning and starts shit with Seth he smiles like a cat with a canary. Aspen calls him a gold digger and offers to fuck his brains out if he will leave the house and never come back, but he sees right through her bullshit to a curious little slut in training that just wants to understand what she saw in the living room the other day. Happy to oblige, he throws her over his knee and spanks her little cunt and bouncy ass while she learned to beg and give gratitude. Tied up, skirt tucked into her little pink panties, she gets on her knees to get her face fucked like a good girl when Dee hears a commotion and comes to join. Much to Aspen's astonishment, Dee doesn't care in the least, and quickly joins in to get her revenge fuck, cropping Aspen's young pussy and she bounces on her Step-Mom's new boyfriends dick. Smothers in her Mom's tits, she apologizes time and time again for trying to steal Seth's attention. A firm anal fucking throws her over the edge as she cums with her face in her mother's tits, screaming with pleasure.\nNow that everyone is on board, Seth takes this Mother daughter team for a real ride, tying them both up tightly and taking turns with each hole, enjoying himself sadistically with a zapper. Dee starts squirting like a fountain, and cumming like a whore, but it is Aspen that has the greatest release in this scene, getting pounded out and begging for cum like a filthy bitch.",
  "directors": [],
  "models": [
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Aspen Ora",
      "person_id": 58946
    }
  ],
  "release_date": "2017-11-10",
  "scene_id": 43012,
  "tags": [
    "couple",
    "Family Roleplay",
    "master",
    "MILF",
    "slave",
    "squirting",
    "straight",
    "Zapper"
  ],
  "title": "Only One way to Find Out: Step-Daughter Anally Trained By Busty Step-Mother"
}