{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Cheyenne Jewel and Bella Rossi have both lost a considerable amount of weight and they are now in the lightweight division. The winner of this match will take on Savanna Fox for the lightweight Championship later this year. Bella Rossi and Cheyenne Jewel are both talented skilled wrestlers with all natural beauty. They have wrestled each other many times before. Bella Rossi has not been able to figure out how to beat Cheyenne. Cheyenne is known for giving up her back and Bella Rossi is known for her flexibility which can be used against her. The first round makes the views think Cheyenne has this one in the bag. She quickly gets a dominate position and gets points with deep french kissing and pussy fingering. It looks like it's all over for poor Bella Rossi. Round two is Bella's come back round. She is able to get on top and ass smother Cheyenne. Face sitting, Deep french kissing and tribbing are Bella's forte in round two and she quickly racks up points. Round Three is back and forth and it's a nail biting round for us viewers. This is a hard fought Sex fight between two worthy adversaries. The winner with the most points gets to fuck the loser. The winner face fucks the loser with a sloppy blow jobs. She flips the loser over and licks her asshole then fucks her good and hard in doggy style. The winner hand gags the loser and fish hooks her mouth. The Loser then worships the strong, hard muscles of the winner. The Winner throws the loser onto the mats and challenges her to a sex fight. Whoever cums first is the loser. The two wrestler rub their wet pussies all over each other. The loser cums and is hoisted up into a fire man style lift and carry and taken off the mats",
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2018-01-24",
  "scene_id": 43022,
  "tags": [
    "domination",
    "Face Sitting",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "lift and carry",
    "Pussy Eating",
    "sex fight",
    "straight",
    "strap on",
    "submission",
    "tribbing",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Lightweight Semi Finals with Bella Rossi and Cheyenne Jewel"
}