{
  "collections": [
    "The Upper Floor"
  ],
  "description": "In part two of this kinky fetish party our senior masochistic anal slut Nikki Darling is strung up in tight suspension and fucked in the ass with a giant hard cock. She politely screams and begs for her orgasms, teaching the newbie fresh meat how to properly cum while in pain. Maya watches closely in an athletic squat over a vibrator, learning how to please their sadistic Governess Aiden Starr, who begins to drips burning hot red wax onto Maya's perky young tits, making her cry out and beg to cum while suffering. Both submissive sluts endure the pain of their floggings, croppings, and hot wax, all for those masochistic orgasms at the hands of their Masters.\nMeanwhile, Davey is back to top this time with her sexy play partner Devi Lynne. Thrown around like a little sex doll, Devi howls and screams as she is beaten, spanked, humiliated, and made to beg in front of a crowd of appreciative guests laughing at her plight. When Devi has finally had enough she throws Davey to the ground and double fists her while sucking on her clit piercing, making Davey squirt everywhere. No good deed goes unpunished, and Davey is thrown on her back and held down by another female guests as Davey takes her time fucking Devi's hungry cunt with her fist, and then a sex toy knife. More squirt splashes on the camera as this sadistic lesbian scene climaxes in many screaming orgasms.\nNikki Darling has not been a good senior slave. Her charge Maya is missing her goddamn shoes. Aiden Starr isn't having it, and chases Nikki around the room flogging and degrading her while Nikki searches for the missing shoes. Upon finding them, she is rewarded with a heavy caning, leaving many red strips on her athletic body. Sweating and screaming, Nikki is rewarded with more caning and a vibrator, and eventually her Mistresses fist in her perfect pussy. Nikki's eyes roll back in her head and she begs to cum over and over again while guests all over the room get turned on and start fucking, blowing, flogging, an playing double time. One guest uses rope bondage to turn his playmate upside down so she must lick his boot, while another uses a fucking machine to punish fuck his date. Aiden is inspired and rides an orgasm out on Nikki's face.\nThe last scene is Maya's test. Can she takes cock like a good girl, get cattle prodded, and still remember he mantra? Will Nikki succeed in still the cock for herself and please Aiden Starr?",
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Owen Gray",
      "person_id": 39181
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    }
  ],
  "release_date": "2018-04-06",
  "scene_id": 43033,
  "tags": [
    "Amazing Orgasms",
    "anal",
    "athletic",
    "bdsm",
    "bondage",
    "caning",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "fetish",
    "flogging",
    "hot wax",
    "humiliation",
    "kinky",
    "lesbian",
    "master",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "suspension",
    "threesome",
    "vibrator",
    "wax"
  ],
  "title": "Masochistic Anal Sluts Love It All at the BDSM Ball"
}