{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Nikki Darling is one of our most beautiful and capable masochistic anal sluts, but what good is one perfect whore when we could have two? Aiden Starr tasks Nikki with training up with lithe little teen no nothing slut Maya Kendrick so that she may two be considered a masochistic anal slut. How will The House know she has achieved this goal? Maya will cum, in bondage, shocked with a cattle prod with Aiden's fist is her cute little asshole. The house guests gasp in sadistic humor and disbelief, but Nikki set's her eyes forward and starts by showing Maya how to properly deliver a Upper Floor blowjob, pushing her sweet little face down on that big cock, stealing is to demonstrate how a proper whore gobbles dick, and eventually mounts Maya up on the dick to ride while she takes her beating on the floor from Aiden. Maya has no discipline and cums and sweats and can't keep her pace, but Aiden corrects her with a little electrical punishment and soon she is sitting up, squirting in Nikki's face and begging like a good girl.\nMeanwhile the rest of the party is off and running with hot new couples tormenting, blowing, fucking, and suspending each other in bondage. Hot swingers are decorating all the couches and two local BDSM freaks that we love dearly engage in a hardcore lesbian BDSM scene that leaves Sally Snatch's sweet ass marred red with deep welts from a serious caning and flogging. Her reward? To eat the pussy of her hot mistress Rain DeGrey. House guests perv out watching them get into some serious lesbian mischief and cheer when Rain cums like a slut.\nMaya is strung up in a pile driver ready to be fucked in her ass, clamped, with everyone watching, and a Steward holding a buzzing cattle prod with her glory and name written on it. Will she live up to her new title?",
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Owen Gray",
      "person_id": 39181
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    }
  ],
  "release_date": "2018-01-12",
  "scene_id": 43032,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "caning",
    "cattle prod",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "flogging",
    "humiliation",
    "lesbian",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "squirting",
    "straight",
    "swingers",
    "threesome"
  ],
  "title": "Masochistic Anal Sluts Stuffed With Cock at Holiday Ball"
}