{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The second half of our Halloween Orgy opens with a bit of quality pep talk between Mona Wales and Penny Pax, who she has reason to believe does not accept Mona as her new Governess. It turns out that Penny believes her seniority as a TUF slave should have made her a shoe-in for the Governess. Mona takes her on a degrading walk around the room, asking guests to vote again for Governess, and having Penny explain her position on the matter directly into Mona's ass. Sitting on the furniture, Mona has Penny lick her cunt- and when she is done she is made to beg for a group hug to comfort her because she is a loser. Truly, Penny is such a valuable anal slut, we could never promote her to Governess. Sometimes this what one gets for being to good at their job. Placed back on the floor, Penny has her ass thoroughly fucked by a guest of honor while the house guests continue to exchange partners and fuck on all the couches in a decadent BDSM swingers orgy. Siouxie Q shows up in a ballerina costume and plays tease and denial with her date, moving between having him cane her ass, and lick her perfect asshole in front of a crowd of guests, eventually squirting and cumming on his face. Rodeo Kitten is back to her antics, being caned heavily, having her face and cunt fucked while a line of onlookers clap and cheer. Other guests are busy blowing each other, flogging their submissives in rope bondage, and using the fucking machine. Meanwhile Skylar Snow is tied with her hair to the ceiling and grilled on the rules and begging to cum. She is made to pick her feet up and hang by her hair and tits while Penny is clamped, shocked, and fucked in the ass for failing to teach her new trainee the rules. Skylar is flipped over on her back and rewarded for her hard work with a thoroughly screaming fuck, which results in her squirting and screaming with a pleased Governess taking all the credit and sitting on all slut's faces.Â",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Skylar Snow ",
      "person_id": 60403
    },
    {
      "name": "Michael Vegas",
      "person_id": 47624
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2018-03-09",
  "scene_id": 43031,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "Feet",
    "female slave",
    "flogging",
    "halloween",
    "Hard Parties",
    "humiliation",
    "master",
    "oral sex",
    "orgy",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slave",
    "squirting",
    "straight",
    "swingers",
    "threesome"
  ],
  "title": "Busty Red-Headed Squirting Anal Whores Made to Serve Mona Wales"
}