{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The Upper Floor has much to celebrate with Mona Wales promotion to Governess and a newbie slave slut wannabe on deck for initiation. Senior anal slave Penny Pax rolls her eyes at being passed over for promotion to Governess, but is too busy having her big ass shined by the horny party guests to do anything about it. Our wide eyed new whore on staff Skylar Snow is the perfect sex slave: gorgeous natural tits, big jiggly ass, and an innate horny-ness that leaves her squirting in duress while the BDSM lifestylers laugh at her plight. Her out of control orgasms and screams while be shocked for bad behavior leave the guests inspired, setting off a series of latex sex, fucking, bondage and electro scenes with plenty of submissive babes coerced into untamed orgasms, sucking dick in every corner, and taking it in all their hungry wet holes. Rodeo Kitten endures an extra special beating, caned with heavy bamboo, spanked heavily, and made to gobble cock while machine fucked with the biggest dildo we have ever seen- until she cums so hard that she breaks the cock off the machine leaving the whole crowd jeering and screaming. Meanwhile, Penny has done what she knows best: inspire the cruelty of her handlers who cane and humiliate her as her trainee Skylar gets her big titties fucked and her perfect mouth used. When the guest of honor's dick is properly fluffed, he goes for Penny's perfect ass, railing her untilÂ she begs for orgasms with her slave slut sister in tow. Skylar has problems of her own, with her tits clamped tight, a hitachi jammed on her hungry cunt, and an attentive Mona Wales shocking the shit out her tits with a sadistic smile. When both the slaves cum Mona takes no time in throwing both girls to the floor and getting her fill of their faces, pausing only to feed Penny's ass cum to Skylar and teaching her to beg for more. If you love this part 1 of the Halloween BDSM Orgy, don't miss part 2 to be released soon.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Michael Vegas",
      "person_id": 47624
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2017-12-08",
  "scene_id": 43030,
  "tags": [
    "Anal",
    "BDSM",
    "Big Ass",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Discipline",
    "Female Slave",
    "halloween",
    "Hitachi",
    "Humiliation",
    "Latex",
    "master",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Squirting",
    "Straight",
    "Threesome"
  ],
  "title": "Squirting Slave Sluts Inspire A BDSM Halloween Orgy"
}