{
  "collections": [
    "Strapon Squad"
  ],
  "description": "The submissive and obedient sex slave Kimber Woods has been begging us to end up in the dungeon again. She seems addicted to lesbian domination, threesomes if possible. She loves being slapped and spanked, gagged and fucked roughly, deep and hard down her throat and pussy. We definitely have everything Kimber wants. Brooklyn Daniels and Mena Li heard about her desires and took it upon themselves to bring their kinky Latina hottie over. They place tight leather cuffs around her wrists and ankles, attach them to chains linked to the floor. They step back, revealing Kimber on her back, arms bound to her sides, legs kept spread eagle. Brooklyn and Mena slap her pussy, tits and face awake. They want her to cum a few times before they double penetrate her with their dicks on sticks. A vibrator usually does the trick. They lube her cunt and spread the wand all over her clit and pussy lips. Mena hovers over Kimber with her hung strapon and sticks it deep down her throat. She can't focus on cumming and giving Mena's big black rubber cock a proper deep throat blowjob. She keeps gagging up spit. Our hot BDSM Mistresses unchain Kimber, slap on some pantyhose, pull out the mattress and use chains to wrap her arms around herself like a straitjacket. Brooklyn lubes up her cock, rips the nylon and pushes the dildo deep inside Kimber's pussy. Kimber tries to get away but only ends up taking Mena's rubber cock further in her mouth. Kimber's hot body spread out doggy style, double penetration with huge strapon dildos, will make everyone cum in their pants. They flip her over and keep fucking her rough. They flip her over again and keep the rough sex going. Kimber can hardly move, slapped into the position they want her in. Seems this sex slave does need more training. They pull her off the mattress and take turns fucking her throat. Kimber keeps begging for more. What a good slut she is!",
  "directors": [],
  "models": [
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    },
    {
      "name": "Mena Mason",
      "person_id": 53759
    }
  ],
  "release_date": "2017-12-28",
  "scene_id": 43044,
  "tags": [
    "Asian",
    "Ball Gag",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Chains",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Female Slave",
    "Femdom",
    "Fingering",
    "gloves",
    "Hand Gagging",
    "Hitachi",
    "Kinky",
    "Leather",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nylons Stockings",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "More Lesbian Slave Training for Kimber Woods"
}