{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Talk about a score, Charli Acacia came to us only days after deciding to enter the porn biz, and we got to pop her BDSM cherry! Schwing! Just 19-years-old, Charli thinks she has a long and promising future of getting her ass and pussy destroyed on video, but we had to make sure she's a world-class sex slave. We brought out Master Bruno and nearly every toy, dildo, cattle prod, violet wand, riding crop and whip in his arsenal for this scene. So, do you think Charli made it through the rough sex test? Before you answer that, here's a few of the training exercises Charli received. First, she was collared, chained and tightly bound while straddling a Sybian fuck machine turned all the way up. Her pussy, thighs and tits were spanked hard with a stiff leather riding crop and flogger until she looked like a grilled steak. Next, she was viciously fingerfucked with four fingers while she gave him a sloppy deep throat blowjob. Her pussy was penetrated and pounded out from behind, and then she was secured by ropes and leather straps to a post where her ass was beaten raw. A violet wand shocked her asshole numerous times and a Hitachi vibrator was stuffed into her pussy. By now, her pussy was bright red, but then Bruno pulled out a cattle prod and shocked Charli's fudge pipe and clit over and over. A brutal hardcore fucking finished Charli's painful exam, but did she pass? Find out.",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Charli Acacia",
      "person_id": 55348
    }
  ],
  "release_date": "2018-01-18",
  "scene_id": 43066,
  "tags": [
    "Anal Fingering",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Breast Abuse",
    "Brunette",
    "Cattle Prod",
    "Chains",
    "Clothespins",
    "Collar",
    "Crop",
    "Deepthroat",
    "Dildo",
    "Double Penetration",
    "drool",
    "dungeon",
    "Electrical Play",
    "Facefucking",
    "Female Slave",
    "Fingering",
    "Flogging",
    "gloves",
    "Hitachi",
    "Leather",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "PIV",
    "Rough Sex",
    "Slapping",
    "Slave",
    "Straight",
    "Sub",
    "Sybian",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator",
    "Violet Wand",
    "Zapper"
  ],
  "title": "Charli Acacia #1 Sexual Disgrace BDSM Virgin"
}