{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Brooklyn Daniels has been granted her Mistress status. We're glad. We've paired her and Mila Blaze to unleash some Lesbian BDSM fun on our favorite muscle MILF, international hottie Becca Diamond. She's taken a few hung dicks here at Fetish Network while bound up during hardcore bondage scenes. Can she handle a lesbian domination threesome? Only one way to find out. Brooklyn and Mila start Becca on the sybian fucking machine, tied down with tight rope. You know these two had to bring a rope bondage scene for this strong booty. She struggles and tries to get off but she isn't going anywhere. These two Mistresses know what they're doing. Diamond is known for her deep throat and pussy swallowing talents. When she sees the strapons her Mistresses are wearing, she rethinks taking dick all together. She has no choice. She's deep throat-ed within seconds, both mean girls taking turns fucking her skull in. Both turn the vibration and speed up and down, tormenting Becca's infamous meaty clit. They slap her tits and want to hear say what dirty whore she is, a nasty bitch. It takes a few slaps and throat pounding to get it out of her. They finally pull her of the sybian and tie her to two horizontal posts, wrists and ankles keep her in place, kept in the doggy position. Everyone knows it's perfect for double penetration. Becca really experiences two massive rubber dicks entering both ends at the same time. The Mistresses pull out their dicks on sticks, slipping them in through spanking, slapping and water boarding. Maybe Becca will think twice before doing another scene with us.",
  "directors": [],
  "models": [
    {
      "name": "Becca Diamond",
      "person_id": 55119
    },
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    }
  ],
  "release_date": "2018-01-11",
  "scene_id": 43063,
  "tags": [
    "BDSM",
    "Big Tits",
    "black hair",
    "Blonde",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Female Slave",
    "Femdom",
    "Fetish",
    "Fingering",
    "Fisting",
    "gloves",
    "Hair Pulling",
    "Latin",
    "Lesbian",
    "LezDom",
    "MILF",
    "mixed",
    "Muscle",
    "muscular",
    "natural boobs",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "slim",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Sub",
    "Sybian",
    "Tag Team",
    "thirdparty",
    "Threesome",
    "Vaginal Fisting",
    "Vaginal Penetration",
    "Water Boarding",
    "white"
  ],
  "title": "Hot Muscle MILF Becca Diamond's 1st Lesbian Domination"
}