{
  "collections": [
    "Everything Butt"
  ],
  "description": "Two of the hottest bodies and most divine asses in the industry come together to shower our members with an overloaded butt madness! Savannah Fox and Bella Rossi are no stranger to the extreme anal play of Everything Butt so the two waste no time diving right into the action. First Savannah makes Bella submit to her domineering and sadistic intentions. She toys with her and tests the limits of her depraved sensuality. Slicing off her skimpy lingerie revealing Bellas perfect pussy and tight asshole. Savannah dives in deep and inhales the intoxicating bouquet of aromas emanating from Bellas divine backside. She licks and tickles her butt hole and warms it up for the extreme anal penetration that is coming. Once Savannah sees how hungry her asshole is she probes it with the small end of enormous butt plug. Bella purrs and moans from the sheer ecstasy of experience and begs to be penetrated deeper. Savannah pushes deeper and grins with delight as her submissive female slaves asshole gapes and swallows the massive anal toy. Savannah toys with Bella's sensitive clit with the end of vibrator and she immediately cums from the stimulation. As Bella's body gyrates and quivers from the first of many multiple orgasms she gasps and begs her mistress for more. And Savannah is only too happy to oblige and she smiles a coy grin as she rips orgasms after orgasm from Bella's soul until they become painful and unwanted. And when Bella can't handle a second more of the torment Savannah tosses the cum slut to the floor and demands that she worship her asshole. Savannah straps a massive dildo onto Bella makes her cram it deep into her hungry butt. Bella becomes incensed with a wild sexual fever and pounds Savannah's asshole. Everytime that Savannah cums she pulls the dildo out and gapes her butthole, spreading it wide open with her fingers. She makes Bella plunge her over and over until her delight reaches a fevered pitch and she squirts all over her submissive soaking her from head to toe. Savannah rolls around in a pool of her own female ejaculation, quivering and laughing with depraved delight.",
  "models": [
    {
      "name": "Savannah Fox",
      "person_id": 47440
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2018-02-09",
  "scene_id": 43074,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "athletic",
    "buttplug",
    "dildo",
    "dominatrix",
    "gape",
    "gaping",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "lingerie",
    "multiple orgasms",
    "prolapse",
    "straight",
    "vibrator"
  ],
  "title": "Hot Bodies Bella Rossi and Savannah Fox Gape, Anal Fuck, and Squirt!!"
}