{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Today we have a slender muscular blonde taking on muscle goddess. These are two of our most impressive new girls. Serene Siren is this season’s rookie champion. Kelli Provocateur is a powerful ebony muscle babe who impressed us all last season when she squashed the ultra powerful, muscle goddess, Brandi Mae. Today is an action packed 100% competitive match up between two fierce competitors. These girls do leg scissors, breast smothers, coerced kissing, passes, reversals. This match is action packed. It’s so action packed in fact, that one wrestler exerts herself too much and can not continue after two rounds of wrestling which leads to a very controversial ending. The ref has these girls do a sex fight to determine the winner. After the loser cums all over the mat, the winner has her way with her. Loser is made to cum over and over and then fucked good and hard with a strap on fucking then face sat and made to eat the pussy of the winner. One thing’s for sure. The rivalry between these two girls isn’t over. They want a rematch, They want it to go all three rounds and whoever wins is going to brutally grudge fuck the loser to settle the score once and for all",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Kelli Provocateur",
      "person_id": 39587
    },
    {
      "name": "Serene Siren",
      "person_id": 50289
    }
  ],
  "release_date": "2018-02-07",
  "scene_id": 43070,
  "tags": [
    "Anal",
    "Black",
    "black hair",
    "Blonde",
    "bottom",
    "Champion",
    "Domination",
    "Ebony",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "Muscle",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "sex fight",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Kelli Provocateur vs Serene Siren"
}