{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Simone Garza is a hot curvy Latina MILF looking to finally get a victory on Ultimate Surrender. Jenna Fox is an orgasmic little all Natural little Filly looking to get her first victory on Ultimate Surrender as well. Both these girls have wrestled for US several time and neither has had a victory. Today someone has to win and who ever loses is going to be deemed the biggest loser of Ultimate Surrender 2018. These girls start out friendly but as the match goes on, the giggling stops and the muscles come out. Each girl gets their game face on and the pins, kisses, smothers and finger ensues. This match comes down to the final seconds. One girl is able to take control in the final minutes of round 3 and she pins her opponent in a school girl bully pin then makes her opponent get kisses, Face sat, toe fucked finger fucked and down right woman handled. One girl has no answers for her opponent in the final minutes. Just when you think one girl has taken the match in a boring squash match, The girl from behind kicks into gear and racks up a ton of points and humiliates her aggressive opponent. In the prize round, the winner take the losers, face and pussy with brutal throat fucking and vaginal strap on fucking. Then the winner sits on the losers face and rides it until the winner is exhausted with orgasms.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Jenna Foxx",
      "person_id": 59055
    },
    {
      "name": "Simone Garza",
      "person_id": 60272
    }
  ],
  "release_date": "2018-02-14",
  "scene_id": 43071,
  "tags": [
    "Anal",
    "Black",
    "black hair",
    "bottom",
    "Brunette",
    "Curvy",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Latinx",
    "Lesbian",
    "LezDom",
    "MILF",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Latina MILF Simone Garza vs Young Orgasmic Jenna Foxx"
}