{
  "collections": [
    "Everything Butt"
  ],
  "description": "Sheena Rose is a petite tattooed honey who needs to get a medical check up. She looks up free clinics online and finds her way into Stunning MILF Doctor’s Office run by Syren De Mer. Dr. Syren does a medical exam on the pretty little Sheena and clears her for any and all physical activity. Once the exam is over, Dr. Syren tells Sheena to pay the receptionist at the front. Sheena is surprised! She has no money to pay and thought she was getting a free exam. Syren warns the young naive Sheena that nothing in life is free and tells Sheena she is willing to take multiple anal installments as payment. Syren slowly opens up Sheena’s tight ass with glass toys and fingers. Sheena’s ass is so tight it squeezes the doctor’s fingers. Syren keeps fucking Sheena’s ass as Sheena cums again and again. She pops a glass plug in an out of Sheena’s ass before getting a long glass toy and twisting it all the way in Sheena’s tight asshole. All the anal orgasms open Sheena’s asshole up until it’s gaping wide open. Syren licks and sniffs the yummy open hole of her patient. To open Sheena up even more, Syren inserts an inflatable plug in Sheena’s ass and pumps it until Sheena achieves the stretch the doctor is looking for. Now that Sheena has a good stretched out hole, Syren is able to get her gloved hand into the little thing’s ass. She fists Sheena’s greedy hole as Sheena cums harder and harder. This is Sheena’s very first time taking a fist in her asshole and she loves it so much she can’t stop cumming. As a reward, Syren allows Sheena to wear a fat strap on cock and fuck her big MILF ass until it’s leaking with anal cum. Syren farts all over Sheena’s face and Sheena sniffs all the delicious ass out of the beautiful Milf’s gaping asshole.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Sheena Rose",
      "person_id": 52312
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2018-02-23",
  "scene_id": 43075,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Blonde",
    "buttplug",
    "Dildo",
    "Doctor",
    "Dominatrix",
    "fake boobs",
    "Farts",
    "Gaping",
    "Lesbian",
    "LezDom",
    "MILF",
    "natural boobs",
    "Petite",
    "Prolapse",
    "Redhead",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "MILF Doctor demands Anal Installments from Broke Young Blonde"
}