{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Arabelle Raphael is a beautiful tattooed brunette looking to get impregnated. She's tried every fertility clinic on the planet and was just about to give up until her friend, Jasmeen LeFluer, told her about an amazing clinic that has a 99.9% success rate for insemination. We get a sneak peek at the things the clinic does to get their girls impregnated. Lena Kelly is the sexy doctor for Arabelle's insemination today. She has gone over Arabelle's file and has determined that Arabelle is the perfect candidate for this procedure. Lena insists that in order for the procedure to work, both the doctor and the patient must be at heightened states of arousal. Lena has Arabelle start with toe and foot sucking. Arabelle takes off Lena's shoe and licks Lena's feet and sucks on her toes. She works her mouth up towards Lena's crotch and starts sucking on Lena's beautiful cock. Arabelle deep throats on the long throbbing cock of the hot TS doctor. After a nice long sloppy blow job, Lena decides she's ready to start arousing Arabelle with so good anal fucking. Lena fucks Arabelle's tight asshole until she feels Arabelle's ovaries dropping into the right spot. Then Arabelle is flipped into missionary position for the deepest penetration possible to insure the insemination takes. Lena busts her hot creamy load into her patient's wet pussy. Immediately Arabelle knows she has gotten pregnant.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Lena Kelly",
      "person_id": 61007
    }
  ],
  "release_date": "2018-02-26",
  "scene_id": 43077,
  "tags": [
    "Big Tits",
    "black hair",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Curvy",
    "Doctor",
    "fake boobs",
    "Feet",
    "Foot Worship",
    "mixed",
    "natural boobs",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Ts Lena Kelly's Anal Fertility Clinic Gets Arabelle Raphael Pregnant!"
}