{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The stunning Nikki Darling hasn’t been able to achieve orgasm with any of her partners. She has been working extremely hard at it, but nothing he does is working. She is able to reach intense orgasms through solo masturbation but has not reached that level of intimacy with her partner. The brilliant and beautiful Dr. Helena Locke has been working with Nikki Darling through her Orgasm Clinic and today’s appointment is ready to go to the next level. Dressed in tight black clothing Nikki patiently awaits her doctor on a medical exam table. Helena Locke walks in and commands attention in her doctor’s coat and thigh high stockings. Helena has a few questions for Nikki, has she been doing her homework? Has Nikki had any experience with bondage, discipline? Has Nikki experienced same sex attraction. It’s timne for an intense hands on session. Helena tears off Nikki’s clothes before spanking her round ass. Helena must work Nikki’s ass hard to bring the correct blood flow and sensitivity to Nikki’s body. After turning her ass red, Helena works on Nikki’s perky perfect breasts and torments her nipples to arousal. Is Nikki ready to orgasm with Helena? A Hitachi is brought out for Nikki to use which brings a huge squirting flood orgasms. Helena’s hands pound Nikkis engorged vulva to orgasm again and again. After fisting that tight perfect pussy, it’s time for round 2. Tied up in tight rope bondage suspension, Helena brings out the flogger to do more sensitivity work on Nikki’s ass and body. Nikki must also learn how to give orgasms before she can truly receive them. Her mouth is used to suck and fuck Helena’s pussy, getting it dripping wet. Finally a dick on a stick comes out to fuck Nikki’s pussy to orgasm. For the final round of treatment, Helena brings out her big cock strap on. Nikki’s pussy is pounded hard while clothespins are clamped to her tight body. For her final orgasm treatment Nikki’s ass is fucked hard with deep anal. The anal penetration causes Nikki to scream in pleasure over and over and over again.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    }
  ],
  "release_date": "2018-03-15",
  "scene_id": 43084,
  "tags": [
    "Anal",
    "BDSM",
    "Black",
    "black hair",
    "Bondage",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Discipline",
    "Doctor",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Fisting",
    "Hitachi",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "masturbation",
    "natural boobs",
    "Nylons Stockings",
    "Pussy Eating",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Lesbian Orgasm Clinic: Hot Patient Prescribed BDSM Squirting Therapy"
}