{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Daisy Ducati catches roommate Lauren Philips masturbating to hardcore lezdom porn and using her butt plug! Lauren is so embarrassed and starts dressing, but Daisy isn't going to let this slut get away that easily. She cancels her evening plans and dominates her roommate! Lauren moans as Daisy pushes the plug in and out of her asshole. When Daisy breaks out her strap-on cock, Lauren can't wait to get fucked. Lauren's boyfriend would never fuck her up the ass! Daisy wastes no time pushing her beautiful cock into this anal slut. Lauren loves getting fucked in her ass and reaches her hand back to finger her cunt. Stuffed in both holes, Lauren is a very happy slut. She cums hard on Daisy's cock and then is tied up. Now helpless, Lauren squirms as Daisy breaks out the rest of her toys. Daisy flogs and canes Lauren all over her body. Then she teases Lauren with the zapper. Lauren's eyes widen in fear as Daisy runs it all over her body. Daisy tells Lauren she'll go easy on her with the zapper -- if Lauren licks her pussy good enough! She sits on Lauren's face and Lauren sucks eagerly at Daisy's cunt. Daisy cums hard on Lauren's face and then decides to fuck Lauren with a dick on a stick. Lauren's cunt clamps down hard around this cock, and she cums hard as Daisy slides it in and out of her pussy. Now it's Daisy's turn for more orgasms. She frees Lauren so Lauren can slip her fingers into Daisy's cunt. Lauren's fingers slide in easily and soon her whole fist is in Daisy! Daisy cums hard on Lauren's fist and squirts all over Lauren's bed. Lauren laps up her cum like a good little slut.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2018-04-26",
  "scene_id": 43088,
  "tags": [
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "femdom",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "redhead",
    "slave",
    "straight",
    "strap on",
    "Voyeurism Fantasies",
    "Zapper"
  ],
  "title": "Horny roommate anally dominates redhead slut"
}