{
  "collections": [
    "TS Seduction"
  ],
  "description": "Casey Kisses knows exactly what to do with bad boys. And new fucktoy Ruckus is a bad boy until proven otherwise. Casey crops Ruckus all over his body and pinches his nipples. She caresses him all over, feeling all his body has to offer. Ruckus responds to every touch, eager to prove to his Mistress that he's a good submissive. He eagerly takes her cock in his mouth, gagging on every delicious inch. He licks her asshole and jerks her cock while she perches on his face. Now that Casey knows Ruckus is a good boy, she moves him to the bed. She flogs his ass and back to remind him of his place. He takes every hit, and is rewarded with Casey's ass hovering above his face. He licks her ass and takes her cock as she fucks his throat. He worships her tall shiny black boots from the foot all the way up her thighs. Next he removes her boots and worships the beautiful feet inside them, sucking, licking, and kissing them all over. Casey is pleased that Ruckus is behaving and gives him what all her slaves want, her gorgeous cock. She slips her cock in Ruckus' greedy asshole and pounds him in doggy, using his hips to slam her cock deep inside him. Then she flips him over and fucks him hard on his back. Ruckus loves getting filled up with his Mistress' cock and has to stop himself from cumming without permission. Once Casey has had her fill, she blows her load all over her pet's face. Ruckus licks her cock clean and then is allowed to cum. He cums quickly, all over Casey's perfect breasts. And like a good boy, he cleans up his mess, licking and sucking all his cum off his Mistress.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2018-01-23",
  "scene_id": 43089,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "Blowjob",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Feet",
    "Male Sub",
    "natural boobs",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Casey Kisses Teases and Fucks Submissive Slut Ruckus"
}