{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Maya Kendrick is a good girl who has done a lot of bad things, so bad, that Mona Wales is hired to kidnap Maya and teach her a lesson. Maya wakes up in an indiscriminate location, tied up and gagged. First, Mona cuts open Maya’s clothes and puts clamps on her nipples. When Maya refuses to tell Mona what she’s done, Mona slaps, punches, and flogs her until Maya admits she seduced a married woman. She says she’s sorry but Mona knows it’ll take more to teach this slut a lesson. She makes Maya lick her boots, and spanks her cute ass. She fingers Maya’s cunt, restricts her airflow, and commands Maya to cum. Next, Maya is bound with her delicate feet in the air. She has a mousetrap pulling her vulva lips apart. Mona canes her feet before sitting on her face. Maya strains to lick Mona’s perfect pussy. Once Mona cums, she fingerbangs and fucks Maya with a dick on a stick. This pain slut loves getting fucked, and squirts all over Mona’s toys. Maya is rewarded by getting to lick Mona’s asshole till Mona cums all over her face. Finally, Maya gets all her greedy holes filled by Mona’s strap on cock. Mona fucks the shit out of Maya and Maya cums over and over again as her holes are stuffed. She’ll do anything for Mona. Mona decorates Maya’s body in close-pins and fucks Maya’s ass as she rips them off.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2018-02-15",
  "scene_id": 43081,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mousetrap",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Pussy Eating",
    "shaped",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "white"
  ],
  "title": "Retaliation: Mona Wales punishes tough little slut!"
}