{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Gorgeous redhead lesbian pain slut Emma Heart is dressed in a tight pink mini skirt and all tied up in restrictive rope bondage, waiting for her new beautiful Mistress Bella Rossi. But, long time house slave Violet Monroe in her house stockings, garter and leather harness wants to get her devilish taste first. Violet Monroe cuts and tears off Emma's tight clothes revealing her perky nipples before grabbing Emma's milky tits and shoving her fingers down her wet gagged throat. Violet tries to get her hands all over Emma's tight red pussy but is caught by Bella. How dare Violet just take what she wants in Bella's Dungeon. Both slaves need to be taught a brutal corporal punishment. The flogger, whip and cane come out to turn these white asses red! Both slaves scream in pain before orgasming in perfect harmony. Bella spits in Violet's shocked face, and chokes Emma heart into orgasm. Both slaves get fucked hard with huge strap-ons and eat each others tight wet pussy. Emma is a foot slut and loves sucking on violets painted toes. This pleases their demanding mistress and she decides it's time for Violet to give up all her holes. Deep anal strap on fucking gets Violet singing. But that's not the finale. Emma strapson again and fucks Violet's pussy hard before Bella goes for the ass again. Deep hard double penetration gets all the women screaming!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Violet Monroe",
      "person_id": 20284
    },
    {
      "name": "Emma Heart",
      "person_id": 53895
    }
  ],
  "release_date": "2018-03-01",
  "scene_id": 43082,
  "tags": [
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "dominatrix",
    "Double Penetration",
    "dungeon",
    "Facesitting",
    "femdom",
    "Fingering",
    "humiliation",
    "leather",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "pain slut",
    "Pussy Eating",
    "redhead",
    "harness",
    "rope bondage",
    "slave",
    "Stockings",
    "straight",
    "strap on"
  ],
  "title": "Young New Slave Brutally Inducted Into The Redhead Lesbian Dungeon"
}