{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The busty and beautiful Ivy Lebelle is caught stealing Chanel Preston's hidden stash of cash! Ambushed by Chanel and woman-handled into submission, Ivy is terrified - stammering and beading with sweat - but still unwilling to give up the name of her boss. That's not problem for Chanel, who knows how to extract information from tough whores like Ivy. Trussing the determined slut up with duct tape and ripping every shred of tight clothing off of her body, Chanel buzzes a taser in Ivy's face and grazes it over her thighs, making this terrified thief scream and beg for mercy. Spanking and flogging Ivy's juicy ass, caning her feet, squeezing her puffy nipples, and slapping her ripe tits finally gets Chanel the intel she wants! Still shaking with fear and guilt at having given up her boss, Ivy begins to moan as Chanel rubs her swollen clit, sensitive from the interrogation. Sinking slowly deeper into Chanel's mind games, Ivy's tight cunt gets wet with pleasure as orgasm after orgasm is ripped from her body, struggling against the duct tape that binds her. But Chanel isn't going to let her toy go so soon! She binds Ivy onto her back, splaying the dripping lips of her pussy wide open with clothespins and fucking her with one hard cock and then another, in missionary and doggy, continuing to tear orgasm after orgasm from this hungry slut! Chanel rides Ivy's face, smearing her makeup with cum and cunt as she gets her own pleasure before flipping Ivy over and fucking her deep in the ass. This little thief whore can't stop cumming as Chanel fucks her tight asshole in missionary and doggy, screaming from the overwhelming pleasure of constant orgasm. Finally spent, little Ivy is thrown back to her boss, who's even more devious and twisted than Chanel...",
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Ivy LeBelle ",
      "person_id": 60683
    }
  ],
  "release_date": "2018-03-29",
  "scene_id": 43083,
  "tags": [
    "bdsm",
    "bondage",
    "caning",
    "clothespins",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "flogging",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "slapping",
    "slave",
    "spanking",
    "straight",
    "strap on",
    "submission",
    "taser"
  ],
  "title": "Busty Thief Captured and Tased to Orgasm!"
}