{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Olive is super excited to shoot for Whipped Ass, and she wants it all: spanking, flogging, fucking, anal, pussy licking...everything! She's a natural submissive, ready to please, and with Cherry Torn calling the shots, she gets it all and more! Cherry spanks her and inspects her, teaching her how to show gratitude, and the importance of asking for permission before cumming. Every time Olive cums she has to ask, and she has to endure pain at the same time. Olive is spanked relentlessly, then paddled on her feet and desperately hungry pussy, testing her endurance. She's then rewarded by getting her wet cunt finger-fucked. Cherry hands her a vibrator and Olive cums repeatedly. Olive is then put in a partial suspension with a ball gag and her ass out, and Cherry flogs her sweet ass, tenderizing her for what's to come. She climbs in front of Olive and makes her eat her wet, slutty pussy, and her tight asshole, making her cum again and again. Olive is finally spread open while Cherry fucks her pussy with a strap on. She pounds Olive and crops her, all while using her hole in every way. She turns her over and fucks her ass, making her cum multiple times. Finally, Cherry slides her fist into Olive's worn cunt and fists her, which Olive simply can't get enough of, and she cums hard, just before Cherry decides enough is enough, and says no more!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Olive Glass ",
      "person_id": 60453
    }
  ],
  "release_date": "2018-04-12",
  "scene_id": 43087,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "Cherry Torn",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "flogging",
    "gag",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "Pussy Eating",
    "slave",
    "spanking",
    "straight",
    "strap on",
    "suspension",
    "vibrator"
  ],
  "title": "Olive Glass Puts Up Every Hole For Whipped Ass"
}