{
  "collections": [
    "TS Seduction"
  ],
  "description": "Marcelo arrives at an employment office thirsty for a new job. He waits all day for super sexy secretary TS Foxxxy to call him for an interview. When Foxxxy announces the office is closing, Marcelo pleads with her for any chance to speak to someone. He says he'll do anything for some help. Foxxxy isn't impressed but she decides to see how far this loser will go. She orders him to massage her feet and Marcelo immediately falls to his knees to lick and kiss her shiny black heels. He sucks on the heel of her shoes before removing them to worship her stocking clad feet. Marcelo can't believe he's getting to take off her stockings and put his disgusting mouth on a goddess like TS Foxxxy. He kisses her feet and sucks on her toes. She rubs her feet all over his face and stuffs them in his mouth. After worshiping her feet, Marcelo gets to worship her cock and ass. He eagerly takes her whole cock in his wet slut mouth, choking as he takes it deeper and deeper. Foxxxy moans as Marcelo licks her perfect asshole, burying his pink tongue between her cheeks. Now that she's sampled his mouth, she bends him over her desk to give him a good hard pounding. Marcelo is such a filthy anal whore, his ass swallows Foxxxy's beautiful cock as she opens his asshole on her cock. Then she sticks her whole fist into his greedy slut hole. Impaled on her fist, Marcelo moans as Foxxxy fist fucks him and slaps his disgusting hard cock. Then she flogs his back and ass as he begs for more, delirious for more cock. Foxxxy fucks him again, thrusting her hard cock into this pathetic hole. Marcelo is so hard from getting fucked and used, he blows his load all over his stomach and eager licks it off Foxxxy's fingers. Then Marcelo is brought to his hands and knees as he sucks Foxxxy off. She cums hard into his open mouth and makes him clean up her cock before kicking him out and telling him to come back tomorrow.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Marcelo",
      "person_id": 46090
    },
    {
      "name": "TS Foxxy",
      "person_id": 20055
    }
  ],
  "release_date": "2018-05-29",
  "scene_id": 43095,
  "tags": [
    "Anal",
    "Blowjob",
    "Choking",
    "Cock Worship",
    "Feet",
    "Male Sub",
    "Nylons Stockings",
    "Role Play",
    "Straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Hole for Hire: Desperate schlub sucks cock for job prospects"
}