{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Aiden Starr devotes her day to testing out potential slave Rick Fantana. Rick is tied, with e-stim pads on his thighs and a mask over his face. Aiden turns up the electricity and breaks out the zapper. Rick screams a electricity courses through the pads, causing his muscles to seize. He follows Aiden's every instruction, hoping that he will be worthy of being her slave. Aiden inserts a large metal butt plug into Rick's greedy ass and attaches it to the tens unit. The butt plug pulses with electricity adding to Rick's sensory overload. Aiden puts nipple clamps on Rick and edges him until he's begging to cum. His cock leaks with pre-cum but this pathetic meat knows he's not allowed to cum without permission. Next, Rick is tied on all fours. Aiden face fucks him and Rick takes every inch of her fat cock. His gags make Aiden giggle in delight. He begs her to fill his slutty fuckhole and groans as Aiden pushes her thick strap-on into his asshole. She fucks him hard, pounding every inch of her cock into this worm. Rick is a true buttslut and his cock is hard and leaking the whole time. Finally, Aiden uses Rick's face and his cock to orgasm. Her perfect pussy bounces up and down on his dick. She makes him lick her beautiful asshole. Once she cums, perhaps it'll be Rick's turn. Aiden edges Rick, tormenting his hard weeping cock. Eventually she grants him permission and he cums hard. Aiden pushes all his cum down his throat and then grasps his sensitive cock, jerking it hard as Rick screams in agony.",
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Rick Fantana",
      "person_id": 59599
    }
  ],
  "release_date": "2018-01-30",
  "scene_id": 43096,
  "tags": [
    "bdsm",
    "bondage",
    "CBT",
    "Corporal Punishment",
    "dominatrix",
    "electricity",
    "Face Sitting",
    "femdom",
    "Fingering",
    "humiliation",
    "Male Sub",
    "mask",
    "nipple clamps",
    "orgasm denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight",
    "TENS Unit",
    "Yes, Mistress",
    "Zapper"
  ],
  "title": "Aiden Starr pounds fresh meat"
}