{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Petitioning slave Adrian Marx wants to worship at the altar of the Divine Bitches. He thinks he's worthy of being a slave because he can take pain, and eagerly approaches Mistress Lea Lexis. Lea takes one look at this loser and is not impressed. She berates Adrian for his pathetic performance, sloppy appearance, and lack of decorum. She strips him of his clothes and person. He is owed nothing and can only hope to serve, if he can pass his training. Lea starts with caning Adrian all over his chest. Once those pretty pink marks appear across his skin, she moves on to flogging, face slapping, and inspection of his body. Since he claims to be strong, she makes him hold himself up over a taser. Will this worm be able to avoid getting shocked? Then Lea cuffs him for more impact play and makes him hold his legs up so she can flog and inspect his asshole. Next, Lea pushes a plug in and out of his ass to prepare him for her cock and spanks his ass, before plunging her cock into Adrian's tight ass. Adrian moans get louder the deeper and deeper Lea thrusts her cock in. Lea laughs as this whore tries to wiggle down on her cock and makes him work it up and down. And when his ass pushes Lea's cock out, she punishes him with hard smacks all over his body. Finally, Lea has Adrian cuffed with a dildo-gag on his face. She teases him and lets him play with his cock off and on as she rides the toy strapped to his face. Once his cock is nice and hard, she decides to take it for a test drive. But as soon as she guides it in her perfect pussy and starts riding it, Adrian begs to cum. This pathetic worm can't even put his Mistress' pleasure before his own. His penis is worthless. So Lea decides to lock his cock away for good, and goes back to her dependable dildo. She rides her toy to orgasm and then punishes Adrian with the cane.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Adrian Marx",
      "person_id": 60961
    },
    {
      "name": "Lea Lexis",
      "person_id": 17836
    }
  ],
  "release_date": "2018-02-13",
  "scene_id": 43097,
  "tags": [
    "BDSM",
    "Bondage",
    "Caning",
    "CBT",
    "Chastity Play",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "Humiliation",
    "Male Sub",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slapping",
    "Slave",
    "Straight",
    "Sub",
    "Taser"
  ],
  "title": "Fresh Meat: Lea Lexis takes new sub for a test drive!"
}