{
  "collections": [
    "TS Seduction"
  ],
  "description": "The divine Jessica Fox has permanently locked her anal slut boss, Corbin Dallas, in a dank, dark, disgusting dungeon to serve her every whim. To begin Dallas’ daily dose of punishment, the gorgeous Jessica teases him in his cage, poking, prodding, and cropping her locked-up toy. Teasing Corbin with a whiff of her delicious toes and arches, Jessica allows Dallas to lick and suck at her shiny black heels, driving this foot slut into a frenzy. With Dallas clearly desperate for any kind of attention from his goddess, Jessica next allows him to lick at her clear purple latex and taut, round ass. Corbin gobbles up every inch of Jessica’s hole, sucking and licking and begging for more. Determined to extract every inch of devotion from her whore, Jessica stuffs Corbin’s begging mouth full of her cock, choking him as he tries to swallow it whole, dribbling spit through the bars of his cage. Finally, to put her whore of a boss in his place once and for all, Jessica shoves her cock deep into Corbin’s eager pink asshole, fucking him in missionary and doggy on top of his pitiful cage. Desperate to please his mistress, Corbin shoots his load all over Jessica’s graceful feet before licking every drip from between her toes.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    },
    {
      "name": "Jessica Fox",
      "person_id": 17013
    }
  ],
  "release_date": "2018-04-17",
  "scene_id": 43090,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Cage",
    "Choking",
    "Cock Worship",
    "dungeon",
    "Feet",
    "Latex",
    "Latinx",
    "Male Sub",
    "natural boobs",
    "Role Play",
    "Straight",
    "Swallow",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "white"
  ],
  "title": "Out Foxed 2: Big Boss Becomes Dungeon Anal Whore"
}