{
  "collections": [
    "TS Seduction"
  ],
  "description": "BOYFRIEND PUNISHMENT: After a long day dominating submissive cuck butt sluts at the dungeon, the gorgeous TS Foxxy deserves to come home to clean laundry, dinner on the table, and a devoted boyfriend ready to serve! What does she get instead? Mike Panic. This lazy slob played games on the couch all day, and Foxxy has had enough! Shaming and humiliating her boyfriend for his disgusting habits, Foxxy bends Mike over her knees and gives him a well-deserved spanking. Shocked to be the target of Foxxy's dominant hand, Mike is still resistant as he slides each of Foxxy's sweaty, stocking-covered toes from her shiny stilettos. He services her tired toes, taking each delicate tootsie into his mouth as Foxxy crops his lazy ass. As his next punishment, Foxxy chokes Mike with her delicious hard cock and buries Mike's face in her taut round ass. Finally learning his lesson, Foxxy's lazy boyfriend gobbles each up hungrily, gagging on her dick and slurping her tight delicious hole. To drive her point home and ensure that she never comes back to a dirty house again, Foxxy gives Mike a curative dose of dick, pounding his over-eager puckering hole over and over again in doggy and missionary, before finishing with a messy 69 double blowjob. After cumming on Mike's chest, Foxxy milks her boyfriend of his thick white seed, feeds it to him, and then tastes it herself. Is his laziness finally cured? Or will he dare to procrastinate again just to get another taste of Foxxy.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mike Panic",
      "person_id": 41034
    },
    {
      "name": "TS Foxxy",
      "person_id": 20055
    }
  ],
  "release_date": "2018-03-06",
  "scene_id": 43091,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Cock Worship",
    "dungeon",
    "fake boobs",
    "Latin",
    "Male Sub",
    "Role Play",
    "shaped",
    "Spanking",
    "Straight",
    "Tattoo",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "TS Foxxy Punishes Slob Boyfriend With Spanking & Nonstop Pounding!"
}