{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Loser internet Troll Marcelo has irritated his mistress for the last time! The stunning busty brunette femdom goddess Chanel Preston will need to deliver severe punishment to this pathetic man loser. Tied up in restrictive rope bondage, Marcelo’s face is gaged and covered. He is humiliated in sexy sheer women’s stockings. His tiny cock pathetically hangs there as he is tormented with corporal punishment. The cane comes out and inflicts severe pain to Marcelo’s saggy body. Clothespins are applied to his sensitive skin as he screams. He’ll scream even louder when they are violently removed. Chanel delivers sharp pain to Marcelo’s scrotum with the crop. This loser like’s it! He is willing to do whatever it takes, whatever humiliations is needed, to please his mistress. Spread out on all fours and his ass in the air, Chanel Preston brings out a HUGE cock strap on. Marcelo’s greedy man hole takes all of her packed heat deep in his ass. This anal whore will take a fucking for his goddess. Well if the strap on wasn’t enough, Chanel Preston has more. Her fist! She punch fucks Marcelo’s ass with her fist. He takes a deep anal fisting. All these screams is getting Chanel Preston hot. It’s time for her to take true pleasure from this worm. A strap on cock is tightly positioned over Marcelo’s face and he gets a front row view of his queen fucking his head. Tied up in tight rope bondage there is nothing he can do but pleasure his mistress to orgasm. After satisfying all her needs Chanel crushes her pathetic troll and stomps all over his body with her beautiful feet. Her black long stockings are gorgeous on her nude body. Finally extremely hot candle wax is poured all over this troll until he screams.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Marcelo",
      "person_id": 46090
    }
  ],
  "release_date": "2018-02-27",
  "scene_id": 43098,
  "tags": [
    "Anal Fisting",
    "BDSM",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Fisting",
    "foreskin",
    "Hot Wax",
    "Humiliation",
    "Latinx",
    "Male Sub",
    "Nylons Stockings",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "white"
  ],
  "title": "Chanel Preston Brutally Schools Internet Troll"
}