{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Delirious Hunter has her sights set on pain slut slave DJ. She covers his chest in plastic clips and has him tied in place by his wrists, ankles, cock and balls. Hooded, unable to see his Mistress, DJ waits anxiously, yelling in pain as Delirious brushes those delicate clips across his chest. Delirious laughs at DJ's pain, amused, and pleased to see her slave's chest flushing a bright pink. After removing the clips, she flogs his chest and back, delighted by his pain. She brings out a rubber slapper and tenderizes his man flesh. But Delirious doesn't only want DJ's pain, she wants his ass wide and gaping around her fat cock. She has him bound to a rolling dolly so she can move him back and forth on her cock. DJ yelps as Delirious pounds his asshole. Her cock is so deep in his ass he can't think straight. Afterward he cleans off her cock with his mouth and is rewarded by getting to taste his Mistress' pussy and ass. Now that his ass is fucked open, Delirious decides to see how well her toy works. She uses his tongue to cum hard. She bites his cock before sliding it in her powerful tight cunt. DJ almost loses blows his load at the feeling of her glorious pussy. Her muscles clench down on his sensitive cock as she rides him hard and rough to orgasm. Now that she's cum, it's time to see how much pain and pleasure his pathetic dick can take. Delirious edges DJ as she rips open her stockings and makes him worship her feet. DJ begs to cum as Delirious tugs his cock without mercy. Finally he spills all over her hands, but Delicious isn't done yet. She continues to stimulate his sensitive cock as DJ yells in pain, thanking his Mistress as she makes him take it.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Delirious Hunter",
      "person_id": 56555
    },
    {
      "name": "DJ",
      "person_id": 20225
    }
  ],
  "release_date": "2018-04-24",
  "scene_id": 43103,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Gaping",
    "Humiliation",
    "Male Sub",
    "Nylons Stockings",
    "Orgasm Denial",
    "Pain",
    "Pain Slut",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slapper",
    "Slave",
    "Straight"
  ],
  "title": "Svelte Blonde Delirious Hunter Punishes and Fucks Buttslut Slave"
}