{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Tough rancher babe Mona Wales brings on new ranch hand Pierce Paris to help her around the farm. Pierce is 100% Grade A Beef and a bonafide horndog. All the blood in his body rushes straight to his huge boner as his hot new boss shows him around. Once Mona leaves him to work, he whips out his fat cock. But as soon as he starts pullin’ the pud, Mona returns and catches him redhanded. Mona knows there’s only one thing to do with farmboys like Pierce – treat ‘em like the cattle she breeds and this here young buck looks like he’ll be proper breeding stock. She stuffs his mouth full of hay and instructs him to continue jerking off until he spills his seed. She inspects his balls and crushes his face with her ass. She covers his balls in closepins and makes him moo as she jerks him off into a bucket. Then she ties him up on all fours and shoves her big fat cock into his tight ass. Pierce struggles in bondage but is unable to escape Mona’s relentless pounding. Once Pierce is all stretched out, she uses his own cum to fist his asshole. She deposits his load of cum back in his ass and continues to jerk him off. Now that he’s stuffed full of jizz, she strings him up. Pierce hangs upside down, unable to move. Mona flogs him all over his front before letting him lick her asshole. Mona cums hard all over his stupid animal face and brings him down so she can take his meat for a test drive. He worships her cunt with his eager tongue and then begs her to use her cock. Mona is ready to see how well this stock breeds and slides her cock right into her wet warm cunt. She rides Pierce rough and dirty, and makes him moo like the cow he is. Her orgasms keep coming as she squirts all over his pathetic face. Once he blows his final load, Mona decides it’s time to use the cattle prod to mark her new piece of meat.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2018-03-27",
  "scene_id": 43101,
  "tags": [
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "Cattle Prod",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "white"
  ],
  "title": "Rancher Mona Wales Breeds New Beefcake Pierce Paris"
}