{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Eliza Jane is a sweet, petite blonde on the outside, but she's a sadistic, devious seductress on the inside. Corbin Dallas arrives for his weekly appointment, and she runs him through the ringer. She starts by suspending him over the bed, teasing his cock in chastity, and gagging him with a ball gag. She then proceeds to abuse him with clothespins and a crop, swatting the clothespins off of him in striking, stinging succession. She humiliates him by feeding him her beautiful feet. Then takes the gag off and shoves his face in her ass to make her cum. While he's still in chastity she puts on a monstrous strap-on and rams the massive fucker into his tight hole. Corbin takes the beastly thing as Eliza slams him deep and hard, deriving enormous pleasure from his pain. She then flips him over, and shoves her fist into his ass, working him and pumping him while he loses himself in the sensation of being so filled and fucked. Finally, Eliza gives Corbin a taste of what he's been wanting. She makes a deal with him, if he can make her cum, he might get to slide into her perfect, dripping pussy. So she sits on his face, sliding her wet cunt all over his mouth and tongue until she cums. Then she uses his cock to get off, riding him until she cums yet again. As a reward, she makes him cum while she's sitting on his face, then feeds him his own hot load.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Eliza Jane",
      "person_id": 59596
    },
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    }
  ],
  "release_date": "2018-03-13",
  "scene_id": 43100,
  "tags": [
    "ball gag",
    "bdsm",
    "blonde",
    "bondage",
    "CBT",
    "Chastity",
    "clothespins",
    "Corporal Punishment",
    "crop",
    "dominatrix",
    "Facesitting",
    "Feet",
    "femdom",
    "Fingering",
    "fisting",
    "gag",
    "humiliation",
    "Male Sub",
    "orgasm denial",
    "pain",
    "Pegging",
    "Petite",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight"
  ],
  "title": "Corbin Dallas Gets Deep Fisted and Fucked by Eliza Jane"
}