{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Lilith Luxe is a masseuse who gets a lot of whiny, complaining executives as clients. When D Arclyte comes in, she decides he's the perfect subject to take her special, high-pressure treatment. Instead of a regular session, D is subjected to bondage, flogging, ass spanking, hard anal pegging, two clothespin zippers, tease and denial... and he loves it and hates it all simultaneously! Lilith starts out slow, spanking D to get him ready for what's to come. She spits in his asshole, teasing it with her fingers. She then subjects him to breath play, smothering him in her perfect ass and pussy. D doesn't know which way is up when she later ties him to the massage table and flogs him hard, mocking his complaints about his cushy job. She then takes full advantage of his exposed ass and pegs his hole deep and hard, all while telling him about all the other clients she's done the same thing to in the past. She then sits on his face, making him lick her wet slutty cunt until she cums, and each time she does, she rips off a zipper of clothes pins. Finally, she uses his hard cock to get off, treating him like a piece of meat and comparing him to one of her lesbian girlfriends, until he blows his load. She smears his cum all over his face, and walks out knowing he'll be back for more!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Lilith Luxe",
      "person_id": 55114
    },
    {
      "name": "D. Arclyte",
      "person_id": 59025
    }
  ],
  "release_date": "2018-05-08",
  "scene_id": 43104,
  "tags": [
    "bdsm",
    "bondage",
    "CBT",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "femdom",
    "Fingering",
    "flogging",
    "humiliation",
    "lesbian",
    "Male Sub",
    "orgasm denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "smothering",
    "spanking",
    "straight",
    "zipper"
  ],
  "title": "Lilith Luxe Pounds The Stress Out Of Her Whiny Little Client D Arclyte"
}