{
  "collections": [
    "Bound Gods"
  ],
  "description": "Jack Hunter wakes up scared, blindfolded and bound in rope. He has no idea what is going on, but he's sure this must be a misunderstanding. He demands captor Pierce Paris release him -- surely his father can fix this. But Jack is in for a rude awakening. His father owes powerful people some money, and now Jack has been taken and held as collateral. While he anxiously waits for this father to pay up, he is at the mercy of the man in charge of holding him. Pierce can't wait to rough up this little rich boy. He tears his clothes off, and bites Jack's nipples. He tastes Jack's long fat cock, and punches him hard on the chest. He duct-tapes Jack's mouth shut so he doesn't have to listen to Jack's pathetic moans and pleas for help. Next, Jack is held in a strict bondage position, with his arms tied back and his neck tied forward. Pierce spanks Jack's ass red, and flogs his ass and back. He puts on leather gloves and fingers Jack's asshole. He spits it and licks it, getting it ready for what's to cum. Then Pierce pushes three different humongous dildos in Jack's ass. Each is bigger than the next, and Jack's horny hole swallows each one of them up. His cock hard, Jack moans as his ass gets stretched wider and wider. Now that Jack is properly stretched, he can take Pierce's huge monster dick. Jack is gagged and suspended with a leg up, giving Pierce the perfect access to Jack's sloppy asshole. Pierce rams his rock hard cock in and out of Jack's hungry hole, as Jack moans around the gag. Finally Pierce cums hard all over Jack's face. He removes the ball gag and makes Jack suck his dick clean. Then he lets Jack down and jerks his cock till he blows his load. Pierce checks in with his men, only to find that Jack's dad has skipped town. Looks like Jack is in need of a new daddy and Pierce has a new toy. Pierce pushes the gag back in Jack's mouth and leaves him bound and caged until the next time he's needed.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Pierce Paris",
      "person_id": 56974
    },
    {
      "name": "Jack Hunter",
      "person_id": 58734
    }
  ],
  "release_date": "2018-02-08",
  "scene_id": 43109,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "domination",
    "dragon dildo",
    "gag",
    "gay",
    "gloves",
    "humiliation",
    "leather",
    "leather gloves",
    "Male Sub",
    "master",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "submission"
  ],
  "title": "Rich Boy Jack Hunter Gets Punished & Fucked for his Father's Debts!"
}