{
  "collections": [
    "Families Tied"
  ],
  "description": "Deep in erie suburban calm, Kira Noir waits patiently for her big step-brother Mickey to return home and play with her. A gorgeous babe with a lithe dancer’s body and an undeniably masochistic sensuality, she is committed to the D/s contract they made years ago. Unfortunately for everyone, Mickey is returning home with his hot new punk rock girlfriend Leigh Raven in tow, ready to introduce her to the family and put his taboo past with Kira behind him. Thinking no one is home, he starts making out with Leigh and tries to bring her into his room, only to be intercepted by Kira who takes no pains to disguise her disapproval of alt girl Leigh and makes it clear she is still her brother’s number one. Leigh is a bit shaken, but soon soothed by hot sex and an introduction to Mickey’s old sex toy collection in his bedroom. Flogged, clamped, throat fucked, made to respond to commands, gagged and fucked within an inch of her life, Leigh is a perfect tattooed slut, oozing with sexual energy and cumming again and again on Mickey’s cock. Aroused by the sounds of Mickey fucking, Kira comes to watch the fun and rub her cunt hungrily through his bedroom window. She gets caught and waved off by Mickey, but not before she gets her pussy all wet watching the new girlfriend get pounded. She lays out the rope and the electrical toys in her old bedroom and waits for him to come punish her for peeping. Without fail, Mickey storms in and has his anger converted to sexual heat by Kira’s submissive desire. Put in a tight choke predicament tie where she must keeps her arms up high behind her back or choke herself out, Kira takes her punishment with pleasure. She shakes with lust when shocked repeatedly and asks for more, getting her soaked cunt cattle prodded multiple times. Mickey clamps her tiny tits, and she begs and drools until she gets her tight ass pounded by her big step-brother’s huge cock. She obediently chokes herself out when commanded, cumming with her eyes rolling back in her head. Mickey warns her this was the last time and retreats from her room, but there is no last time for Kira. She hunts and seduces Leigh in the family kitchen, convincing her she will need to be an anal pro to keep Mickey in a relationship and offers to teach her how. Completely falling for the trap, Leigh has her perfect body stripped down as she innocently listens to directions, holding trays, taking hard cane strokes, and finally having her ass licked and fucked by Kira. Just as Kira planned, Mickey comes back from his errand to find them fucking in the kitchen, leaving him no choice but to put them both in line. A strict zipper, more harsh caning, orgasm training, anal, bondage, and anal fisting bring this new triad into a kinky unity, with Kira happily on the bottom serving the new couple.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Leigh Raven",
      "person_id": 59527
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    }
  ],
  "release_date": "2018-05-25",
  "scene_id": 43106,
  "tags": [
    "Anal Fisting",
    "big dick",
    "Black",
    "black hair",
    "Bondage",
    "bottom",
    "Caning",
    "Couple",
    "Family Roleplay",
    "Fisting",
    "Kinky",
    "natural boobs",
    "other hair color",
    "Predicament Shoots",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "white",
    "Zipper"
  ],
  "title": "Not Good Enough: Bratty Step-Sister Anal Trains The New Girlfriend"
}