{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch Cherry Torn can't wait to break in lucky new slave Luis Long. Luis is a shy submissive with no formal training who gets to bask in the radiance of Cherry Torn for his first professional shoot ever! Cherry teaches him how to present himself -- on his knees, with his eyes forward. She teaches him how to address her, makes sure Luis knows she owns him, and breaks in her new meat with a zapper, flogger, and intense spanking! When Cherry reaches in between his legs to inspect her cock, she finds it dripping wet! What a dirty leaky slut. Luis struggles to please his Mistress and nervously scurries to obey her every command. Next, Luis is bound in rope with his legs spread. Cherry knows what this little slut needs -- a good hard fucking. She opens up his tight asshole with her cock and fucks him deep in his ass. Luis moans as Cherry plunders his ass, thrusting deeper and deeper. This slut loves getting fucked so much his cock stays rock hard and dripping while Cherry uses her new hole. Finally, Cherry decides to test her toy's orgasm potential. She rides his face, using his tongue on her glorious pussy and asshole. She cums hard on this slut's face before turning attention to her cock. Luis moans in ecstasy as Cherry pushes her cock inside her cunt and takes it for a test drive. Her voluptuous ass bounces up and down as her pussy swallows up that cock. Luis is so hard it hurts and begs to cum as Cherry has orgasm after orgasm and clenches down on her cock. Cherry know her slut wants to cum, but does he deserve to? No! Especially not after his first day of training. He may be able to follow directions but he's a long way from being allowed the pleasure of cumming. Maybe next time.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Luis Long",
      "person_id": 61081
    }
  ],
  "release_date": "2018-04-10",
  "scene_id": 43102,
  "tags": [
    "bdsm",
    "bondage",
    "CBT",
    "Cherry Torn",
    "Corporal Punishment",
    "dominatrix",
    "Facesitting",
    "femdom",
    "Fingering",
    "humiliation",
    "Male Sub",
    "orgasm denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "spanking",
    "straight",
    "Zapper"
  ],
  "title": "Cherry Torn Trains New Slut Luis Long"
}