{
  "collections": [
    "Families Tied"
  ],
  "description": "London River is already in a slutty slather when Mickey comes home from college, setting in on him as soon as he walks through the door. She looks like a suburban et dream with her big melon tits rolling around in a sports bra, her tight athletic body coiled and ready to get fucked. Unfortunately for her, Mickey has been thinking it is time to stop their little affair, and he is going to abstain even though his father isn't home for another day. That fucking slut London has other plans, and strips down naked to deliver a sandwich with the crusts cut off and her sweet pussy to Mickey in his bedroom. Realizing he can't keep this cougar down, he ties her up in a strappado, clamps her big milky titties, and face fucks her on the porch until she is begging to cum and red in the face from being thoroughly slapped around. Right when she thinks she is going to be allowed to cum he tells her to go to the store to buy him another type of deli meat.\nOn her way way out of the house she runs right into nosy little neighborhood whore Cherry Torn, who quickly works out that Mickey, her favorite teen dick ont he side is home from college. Sneaking up to the house to get dicked down once London has left, Cherry has the smirk wiped off her pretty face when Mickey thrown her down on the living room floor, ripping her clothes off and cropping the shit out of her pussy, tying her tits up tight, and spanking her ass a deep red while she begs for more. More comes in the form of a hard collegiate dick in her pretty ass, and cumming with her face ground in the shag carpet. London comes home and tried to act shocked and angry, but Mickey throws her ass down on the floor, ties her up, and uses her mouth to cleans Cherry's ass off his dick. London curses out Cherry between having a cock shoved in her mouth and being slapped around. Jealous and territorial she tries to claim Mickey's cock as hers to ride, but her eyes are bigger than her pussy and she ends up tied on her back, getting shocked and slapped and fucked in both her holes, culminating in Cherry shoving her entire fist in that uppity bitch's bubble butt, fucking her into a hot red gaping orgasm with Mickey uses his Step-Mothers face. Humiliated and fucked out, London makes Cherry sucks her son's dick real good, spitting in her face and grabbing her by the hair. Mounting Cherry up on his dick, she bounces her up and down little a little sex doll. Her step-son's cum load belongs to her, and she pushes Cherry back off his cock an get on her back to work that hot cream out of her son's dick.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    }
  ],
  "release_date": "2018-03-30",
  "scene_id": 43105,
  "tags": [
    "anal",
    "Anal Fisting",
    "athletic",
    "ball gag",
    "bdsm",
    "big tits",
    "Breast Bondage",
    "Cherry Torn",
    "Cut",
    "Family Roleplay",
    "Flexible Fucks",
    "gaping",
    "housewives",
    "spanking",
    "straight"
  ],
  "title": "Slutty Housewife Anal Showdown for Step-Son's Huge Cock"
}