{
  "collections": [
    "Families Tied"
  ],
  "description": "Penny Pax is a naughty little house slut that loves being bent to the will of her dominant, cocksure boyfriend, Seth Gamble. She knows and loves her place in Seth's world, crawling towards him and begging for his cock with just the sexy sway of her hips. Looking up from his reading, Seth answers the call of Penny's body, grabbing her throat and gorgeous, flowing red hair as he restrains her and tugs at the clamps on her nipples. Seth spanks her, zaps her, slaps her pretty pussy until it's pink with pain, and tugs at the clamps again. Penny moans and writhes with the desire to please her master as Seth pushes himself on her, parting her lips with his thick cock. Penny gags and spits, choking as Seth pumps in and out, taking her throat as he pleases. He then does the same with her cunt, taking it for himself, making his pretty pet beg to cum as he fucks her until her eyes roll back in her head. Bing bong! The doorbell interrupts Seth and Penny's kinky tryst, and Penny crawls obediently to open the door. Seth's stepmom, Chanel Preston, shoves her way past Penny, who's shocked - Seth has never told her anything about his family or past. Hot and bothered, Chanel scolds Seth, demanding that he return home to his large inheritance and lavish lifestyle. Scoffing, Seth sends her away, but before she leaves, Chanel offers Penny a deal: she leaves Seth, and Chanel pays her handsomely for her trouble. Penny refuses at first, but the temptation is too great - she betrays Seth, whose stepmother returns the next day to gloat over her success at turning yet another of Seth's slutty subs against him. Seth lunges at Chanel, grabbing his stepmom's throat and pressing her face against his dirty feet. She licks between his toes, relishing her stepson's surge of power, and begs for his cock in her mouth. Seth makes his stepmother earn it - slapping, choking, and flogging her until she deserves to gag and spit on her stepson's thick dick. With clamps on her tits and a thick set of canes against her thigh, Chanel cums hard, bucking against Seth's hand. He then ties Chanel up, legs akimbo, and he canes her beautiful arched feet as he fucks her and press the vibrator hard against her clit - making Chanel scream and beg for more. With Penny's return imminent, Seth straps his still shaking and cum dripping stepmother to the Sybian. Returning to this torrid scene, Penny knows Seth has heard about her betrayal, and that she's in for a brutal punishment. Seth strips Penny of her clothes, slapping at her face and body as he shoves his cock deep into her throat and then Chanel's. As his stepmother licks his balls, his girlfriend chokes on his cock, both gazing up doe-eyed into his stone-cold face. Now Seth wants more. He takes all of Penny's holes - fucking her cunt, into her ass, right into Chanel's mouth, back and forth again and again until both are moaning in ecstasy against Seth's cock. Used up and dripping wet, Seth's girlfriend and stepmother beg for his cum, and he delivers - all over Chanel's face and Penny's round pink ass. That's what you get for betraying Seth Gamble.",
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2018-05-11",
  "scene_id": 43107,
  "tags": [
    "Brutal Punishment",
    "choking",
    "Family Roleplay",
    "Feet",
    "flogging",
    "gag",
    "kinky",
    "master",
    "mean mommy",
    "pain",
    "slapping",
    "straight",
    "sybian",
    "vibrator"
  ],
  "title": "Step-Mother Chanel Preston Fucks Son & His Cheap Whore Girlfriend!"
}