{
  "collections": [
    "Bound Gods"
  ],
  "description": "New meat Cesar Xes arrives late to petition to serve the House. Leather Top Sebastian Keys is unimpressed with this slave's tardiness, but as Cesar strips, revealing a hard body and nice cock, Sebastian decides to give Cesar a chance. Cesar prostrates himself before the throne. Sebastian inspects his body and smacks him with a long leather paddle. Upon command, Cesar flips over, revealing beautiful cock. Sebastian sucks on Cesar's cock, and continues to paddle him all over, until his skin is a nice deep red. Then Sebastian lets Cesar worship his leather and smell his sweaty balls, before having him lick his asshole to prove his dedication. Next, Cesar is bound upside down, his mouth at the perfect dick-sucking height. After making Cesar suck his cock, Sebastian flogs Cesar all over his chest, stomach, and dick. Cesar twitches and moans with every hit. Then Sebastian uses Cesar's wet warm mouth. He thrusts his cock in and out of Cesar's hole and edges Cesar right until Cesar is ready to cum. But he's not allowed, not yet. Finally, Cesar is tied with mouth gagged, his legs spread and hole exposed. An electrified cock ring sends current through his aching throbbing cock. Sebastian breaks out the violet wand and runs it along Cesar's thighs and ass. Cesar shakes with every shock, whimpering and drooling around his gag. His ass twitches as Sebastian pushes the violet wand inside his asshole. Sebastian fucks this slave's ass with electricity and discovers this whore is an electroslut. Cesar loves getting shocked in his ass, and moans as the violet wand slides in and out of his tight hole. Now that his ass is warmed up, Sebastian slips his own cock into Cesar's tight ass. He pounds Cesar's hole relentlessly while stroking Cesar to orgasm. Cesar cums hard, and gets to worship Sebastian's leather and cock again. Sebastian uses Cesar's mouth before blowing his load all over Cesar's face. Initiation complete, Cesar crawls off into the darkness until he can be of use again.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Cesar Xes",
      "person_id": 60954
    }
  ],
  "release_date": "2018-02-22",
  "scene_id": 43111,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "domination",
    "electricity",
    "gag",
    "gay",
    "humiliation",
    "leather",
    "Male Sub",
    "master",
    "Paddle",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "submission",
    "top",
    "violet wand"
  ],
  "title": "New Slave Cesar Xes petitions the House"
}