{
  "collections": [
    "Bound Gods"
  ],
  "description": "It’s HustlaBall’s 5 Year Anniversary and Dominic Pacifico is overseeing fresh meat Alson Caramel at Entourage Bathhouse. As Alson cleans before the big party, Dominic impresses upon him the importance of this event and decides to warm this slut up before the doors open. Dominic manhandles Alson, pressing him up against the post, and spanks Alson’s perfect ass. Alson eagerly takes the impact and drops to his hands and knees to sniff Dominic’s crotch and worship his leather jockstrap. Then he licks Dominic’s boots as Dominic smacks his ass with a crop. Alson may be new to BDSM but he loves having sex in front of a loud crowd and can’t wait to be made a slutty cumdump at the party. He sucks Dominic’s cock, gagging as Dominic ravages his throat. Then Dominic pushes Alson’s jockstrap out of the way and alternates between sucking and smacking Alson’s pretty cock. Just when Alson is about to cum, Dominic pulls away and goes to open the doors. Now that there’s an audience, Alson is bound in rope for the first time and blindfolded. Dominic flogs and smacks Alson all over his ass, back, chest, and stomach to the cheers of the crowd. Alson moans with every hit, arching his back and offering out his ass. Then Dominic decorates Alson’s nipples and cock with closepins. He places extra closepins on Alson’s tongue and smacks him all over his chest. Finally, Alson is gagged and bound with his hole exposed. Dominic’s fist slides easily into Alson’s slutty asshole. His hole stretched wide open for all to see what a good slut he is, Alson moans as Dominic fist-fucks his hole open. Dominic’s cock follows his fist, and Dominic pummels Alson’s hole. Alson loves getting fucked in public and moans around his gag as Dominic gives him a good rough pounding. Then he gets pulled up on his knees and tastes his ass on Dominic’s cock as Dominic fucks his mouth. Finally, Dominic blows his fat load all over Alson’s face. He leads a cum-soaked crawling Alson into the crowd so more men can use this Alson’s ass however they please.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alson Caramel",
      "person_id": 60960
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    }
  ],
  "release_date": "2018-03-01",
  "scene_id": 43112,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Fisting",
    "Gag",
    "Gay",
    "Humiliation",
    "Jockstrap",
    "Latinx",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Public",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Tattoo",
    "unshaved"
  ],
  "title": "New meat Alson Caramel fisted and fucked for HustlaBall!"
}