{
  "collections": [
    "Bound Gods"
  ],
  "description": "Thrown from the vehicle during a car crash, Draven Navarro lies unconscious on the side of the highway in the dirt. When he wakes, Draven makes his way to his car, looking for his friend Cody, but Cody is nowhere to be found. Draven frantically heads back to the abandoned town to look where he suspects Cody may be. As Draven looks at the ground and discovers a frightening mask, he’s suddenly abducted by the Lord of Sodom, Pierce Paris. He’s taken to an abandoned building where he’s bound with rope vertically to a steel bed frame leaned against a wall. The Lord of Sodom slowly enters the room wearing his mask, a harness of chains, and a leather jock covered in sharp metal spikes. He quickly takes Draven’s pants and underwear down and spanks his ass with his leather glove. He slaps it hard and spreads Draven’s big muscular ass to see his frightened asshole. The Lord of Sodom takes out a steel speculum and plunges it deep into Draven’s ass and opens it up, revealing the pink insides of his hole. Then he takes the speculum out of Dravens ass and replaces it with his massive hard cock and aggressively pounds Draven’s asshole while Draven prays for it all to end. Next we find Draven standing with both arms and one leg bound in rope, tied to the ceiling, him to balance on just one leg, as drool pours from his mouth-gag. In walks The Lord of Sodom, wielding a leather flogger. He spins Draven around and flogs his ass hard. Then he fucks his face before stuffing his giant cock back in Draven’s ass and fucks him fast and hard while Draven is fully suspended. Next, The Lord of Sodom puts Draven down on his knees and applies clover clamps across his chest and makes him cum. He finally uses Draven’s mouth to shoot his demon seed across his face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2018-04-26",
  "scene_id": 43119,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "Bound For Sodom",
    "brunet",
    "Chains",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "drool",
    "Gag",
    "Gay",
    "Humiliation",
    "jock",
    "Leather",
    "Male Sub",
    "Mask",
    "master",
    "mixed",
    "muscular",
    "harness",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Speculum",
    "Submission",
    "switch",
    "Tattoo",
    "white"
  ],
  "title": "Bound For Sodom: Part 2"
}