{
  "collections": [
    "Bound Gods"
  ],
  "description": "Cody Winter and Draven Navarro are two Mormons taking a road trip to the Missionary Training Center. When they stop in the middle of the desert to take a look at an abandoned town, they get spooked by a sign on the ground that reads \"Sodom\". They run out of the ghost town and crash their car resulting in their abduction by a creepy Sheriff and the \"Lord of Sodom\". Sheriff Dallas Steele takes Cody to a quiet place outside and ties him from head to toe with rope to a giant cement pillar sticking out of the sand. Sheriff Steele grabs Cody's cock through his pants and pulls. He leans in to Cody's face and tells him sternly who's boss and then rips Cody's shirt open. The Sheriff cuts Cody's underwear off and pulls out a crop, slapping Cody's stomach and cock. Sheriff Steele gets medical clamps and locks one to each of Cody's nipples and one more to clamp Cody's foreskin shut then uses the crop once again. The Sheriff gets on his knees, removes the clamp and sucks Cody's cock. After that, Cody gets on his knees still tied to the pillar and reluctantly gets face-fucked by the Sheriffs big dick. Next we find Cody blindfolded, balancing on a tractor tire with a spreader bar between his legs, tied up with rope to a bridge with his hands behind his back. The now naked Sheriff Steele whips him hard with his flogger all over Cody's body, demanding Cody to submit to the Lord of Sodom. Refusing to submit, Sheriff Dallas Steele takes Cody inside an abandoned building and ties him up one more time, bent over a counter with one leg up and fucks his ass hard and deep until he unleashes his load all over Cody's face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dallas Steele",
      "person_id": 61115
    },
    {
      "name": "Cody Winter",
      "person_id": 59548
    }
  ],
  "release_date": "2018-04-19",
  "scene_id": 43118,
  "tags": [
    "anal",
    "bdsm",
    "big dick",
    "blowjob",
    "bondage",
    "Bound For Sodom",
    "Corporal Punishment",
    "crop",
    "domination",
    "foreskin",
    "gay",
    "humiliation",
    "Male Sub",
    "master",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "submission"
  ],
  "title": "Bound For Sodom: Part 1"
}