{
  "collections": [
    "Bound Gods"
  ],
  "description": "When Pierce Paris loses a bet to Sebastian Keys you better believe things will get crazy! Sebastian strips Pierce of his leather, roughly pushes him to his knees, and ties his hands behind his back. He chokes Pierce before throwing him on the ground and exposing his tight ass. He spanks Pierces ass until it's bright red and then breaks out the cane. It's Pierce's first time being caned, and each hit stings worse than the last. Sebastian takes off Pierce's boots and canes his beautiful size 12 feet, licking his toes as his strikes intensify. Then he rolls Pierce over and restricts his breathing as he jerks Pierce's cock. Just when Pierce is about to blow his load, Sebastian pulls back. He gags Pierce and ties him up spread eagle on a wooden frame. No piece of Pierce's skin is safe from the lash. Pierce screams as Sebastian uses a fat leather strap on his ass. Then Sebastian breaks out the floggers and flogs Pierce all over his back, ass, and cock. Pierce's skin flushes a rosy red as Sebastian beats this hunky beefcake over every inch of flesh. Next Sebastian blindfolds Pierce and has Pierce suck his cock. After all that warm up, Pierce is eager for dick and once Sebastian is done using his mouth, he plunges his dick into Pierce's greedy asshole. Pierce moans as Sebastian fucks him hard and fast, pounding every inch of his cock into Pierce's warm tight hole. Then Sebastian blows his load all over Pierce's fat cock before sucking it all off. But Sebastian isn't finished with his plaything just yet. He pushes Pierce to the floor and has Pierce remove his boots and worship his feet. He commands Pierce to put his ass up in the air and then pushes his toes into Pierce's ass. Pierce moans as Sebastian foot fucks him. As the foot pushes deeper and deeper, Pierce cums hard all over the carpet.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Pierce Paris",
      "person_id": 56974
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2018-03-29",
  "scene_id": 43116,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Strap On",
    "Stud",
    "Submission"
  ],
  "title": "Sore Loser: Muscle stud Pierce Paris Gets Beat and Foot-Fucked"
}