{
  "collections": [
    "Bound Gods"
  ],
  "description": "Myles Landon is the strong silent type, a muscled dom who lets his big, thick dick to do the talking for him. His boy, Chance Summerlin, is genuinely eager to please, and Myles takes every advantage of him. Chance scuttles into the room at Myles’ order, and obediently does as he’s told, showing his smooth ass and asshole, licking and worshiping Myles’ leather codpiece, and taking a good cropping on his ass. Myles then ties Chance face-up to the top of a cage and sucks his cock, teasing him with pleasure before doling out the pain. He puts clover clamps on Chance’s ball sack and flogs him in that stress position, so the sensations reverberate through him. Myles then climbs up on the cage and fucks Chance’s throat with his thick fuckin cock, pushing the head into his throat as he gags and chokes. Finally, Chance is bound with his ass up on a couch and Myles rams his huge cock into his ass. Chance loves getting fucked by that thick cock, even if it’s a strain. At the same time, Myles shocks him with a zapper, hitting him with electric zaps all over his body and a fat dick in his ass. Myles finally shoots his load all over Chance while he lays helpless beneath him, ropes of cum hitting his face and body. Finished, Myles stroked Chance off and makes him cum, then leaves him there, sweaty, stretched and spent.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Chance Summerlin",
      "person_id": 60103
    },
    {
      "name": "Myles Landon",
      "person_id": 60444
    }
  ],
  "release_date": "2018-02-15",
  "scene_id": 43110,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "body builder",
    "Bondage",
    "brunet",
    "Cage",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gay",
    "Humiliation",
    "Latinx",
    "Leather",
    "Male Sub",
    "master",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "smooth",
    "Submission",
    "top",
    "white",
    "Zapper"
  ],
  "title": "Myles Landon Punishes Chance Summerlin With Huge, Thick Cock"
}