{
  "collections": [
    "Bound Gods"
  ],
  "description": "Bound Gods first timer Dane Stewart is a slab of fresh muscle meat off the streets. This tattooed straight stud walks into this dungeon with no clue what brutal torment is about to be inflicted. His pretty straight dude face and tight denim jeans aren't going to get him far in this house. Made to always face forward and stand at attention for the house master, Sebastian Keys is ready to train his new slave. Dane is instructed to strip down for a detailed inspection by his new leather clad master. Dane isn't here to just take the pain, he is being trained to embrace it. Starting with the riding crop Sebastian inflicts a brutal corporal punishment. Every part of Dane's body is beaten red. This gets Dane's huge thick cock rock hard which catches Sebastian's attention. After a brutal cock and ball torment by the riding crop, Sebastian grabs and stretches out Dane's balls until this submissive stud screams in pain. Dane's screams get Sebastian's cock hard! Dane is put into restrictive rope bondage and leather restraints as the training continues. This stud's muscle body is flogged birght red before dane is put into a fully blacked out blindfold. With out his sense of site, Dane has no idea what's coming next. Nipple clamps are fiercely applied and ripped off causing huge screams. Dane is made to then choke deep throat Sebastian's cock. After deep sloppy blowjob, Dane is ready for the final training. Bound with his ass in the air, hot candle wax is poured over Dane's body. These screams are all Sebastian needs to begin a brutal deep anal fucking. Dane is pounded hard and both studs cum huge thick white loads of cum.",
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Dane Stewart ",
      "person_id": 61114
    }
  ],
  "release_date": "2018-04-12",
  "scene_id": 43117,
  "tags": [
    "anal",
    "bdsm",
    "blindfold",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "domination",
    "dungeon",
    "gay",
    "humiliation",
    "leather",
    "Male Sub",
    "master",
    "muscle",
    "nipple clamps",
    "pain",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "straight",
    "straight stud",
    "Stud",
    "submission",
    "wax"
  ],
  "title": "Endure The Pain: Straight Stud Dane Stewart Slave Training"
}