{
  "collections": [
    "Bound Gods"
  ],
  "description": "New to KinkMen, Sean Maygers is all in! And thick muscle stud Colby Jansen is ready to use and abuse him as he pleases. Colby strips him out of his clothes and starts pounding on Sean's tight muscled body, working him up for the thorough punishment he's in line for. He bends him over a beaten wooden table and plants his face in his ass, working Sean into a fucking frenzy, making him already desperate to get his hole worked. But Colby has plans for him before getting to that point. He spanks that perfect ass, then flips him over and binds him to the table on his back. He uses the zapper to send shocking electrical charges through Sean's balls and nipples, all the while teasing his huge cock with a combination of pain and pleasure. Colby then flips him around again, puts a ball gag in his mouth and ties him to the table with his ass out, so he can flog the fuck out of him. Fully tenderized, Sean is put on his hands and knees and blindfolded. Colby crops his sweet ass, and eats his hungry hole, warming him up for a deep hard fuck. He climbs up on the table and slides in, pounding inside Sean's stretched ass. Sean takes that hard cock deep and long, as Colby puts all his musclebound weight into each thrust. Finally, still blindfolded Sean is allowed to cum but only while he sucks Colby's hard cock. Colby then makes him eat his own cum off his boots as he shoots his own hot load all over his demoralized face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Colby Jansen",
      "person_id": 34457
    },
    {
      "name": "Sean Maygers",
      "person_id": 61017
    }
  ],
  "release_date": "2018-03-08",
  "scene_id": 43113,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "Zapper"
  ],
  "title": "Newcomer Sean Maygers Gets Bound and Fucked By Huge Stud Colby Jansen"
}