{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Trussed and tied with rope like a Christmas roast, no body part is off limits for Lily Ligotage’s cruel master and his evil bag of tricks. A ball gag is necessary to muffle the screams this cute and curvy girl next door type makes as she is toyed, throat fucked, clothespins on her nipples and beef curtains, shocked with a cattle prod on her brown star and throbbing clit, and all of her private spaces are violated with a variety of big fat dildos on broomsticks. Only Lily’s complete bondage will lead to the total submission her master seeks. Lily’s BDSM training session kicks off with cruel and painful humiliation at the business end of a cattle prod. Her asshole and clit are stung with jolts of high voltage while the master viciously fingerfucks her and then relentlessly ravages her love holes with his huge hung cock. Next, he stuffs a vibrating wand deep in her snatch and then gives her over-excited, shaved pussy an introduction to his leather whip. Her entire body quivers with ecstasy with every caress of the flogger. A rough sex fisting finale wraps up this completely off the chain show. Yeah, Lily is a real deal pain slut!",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Lilly Ligotage",
      "person_id": 55115
    }
  ],
  "release_date": "2018-02-08",
  "scene_id": 43122,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "Cattle Prod",
    "Choking",
    "Clothespins",
    "Curvy",
    "Deepthroat",
    "Dildo",
    "dungeon",
    "Electrical Play",
    "Facefucking",
    "Female Slave",
    "Fingering",
    "Fisting",
    "Flogging",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Latinx",
    "Leather",
    "Male Handler",
    "master",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Straight",
    "Sub",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "Vaginal Fisting",
    "Vaginal Penetration",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "Lily Ligotage #1 Sexual Disgrace Living The Dream"
}