{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Seems no one warned the hot and horny Zoey Foxx how intense we get here at Fetish Network. She's experimented sexually with a few boyfriends with domination and bondage, but nothing like what we have planned for her second round of slave training. This time she's tied to a crate with leather and chains, testing her flexibility, her legs kept in a split, her arms pulled in the same directions, nipple pumps aching her nipples. She can't stop shivering. Her Master finally walks in, hung dick hard and grabs Zoey's head, turns it and fills her mouth with his cock. So much spit oozes out of her mouth. We're sure she's hoping for a clear breath of air. She gets what she wants when her Master moves between her legs. Her leg tied back gives him enough room and access for whatever he wants with her pussy. He loves pounding in a cunt rough and hard, going as deep as he can. He grabs her hair again, using it to pull her down more on his cock. He then moves back and forth, taking turns obliterating her throat and pussy. Zoey seems to love every minute of her BDSM session. She gladly gives him sloppy deepthroat blowjobs and begs to be fucked more and fast. He surprises her with something special: a vibrator. He places it on her clit and watches her body tremble from multiple orgasms. It looks too much to handle. He has to hold her down and gag her with his cock. The scene is so hot, her Master decides to give her a load of his cum. She loves it. She swirls it around her mouth before swallowing it. Another successful sex slave made.",
  "directors": [],
  "models": [
    {
      "name": "Zoey Foxx",
      "person_id": 44716
    },
    {
      "name": "James Kickstand",
      "person_id": 48660
    }
  ],
  "release_date": "2018-02-15",
  "scene_id": 43126,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Chains",
    "Deepthroat",
    "Domination",
    "dungeon",
    "Fetish",
    "Gag",
    "Leather",
    "Leather Cuffs",
    "master",
    "multiple orgasms",
    "PIV",
    "Rough Sex",
    "Slave",
    "Straight",
    "Sub",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Zoey Foxx Returns for More Bondage Slave Training"
}