{
  "collections": [
    "Men On Edge"
  ],
  "description": "On top of a wooden cross suspended by ropes in what appears to be some kind of shipping container, Josh Hunter lays asleep, strapped to it with a multitude of leather belts, wearing only underwear and a bit-gag. When he wakes up, he struggles and yells for help but no one can hear him. His captors, Sebastian Keys and Chance Summerlin enter the room and run their hands up and down Josh's slim hairless athletic body. His cries for help turn into moans of pleasure when Sebastian cuts Josh's underwear off and starts playing with his already hard cock. Chance sucks the pre-cum off of his cock while Sebastian pulls on his balls. Josh gets really close to cumming several times but Sebastian and Chance are having too much fun denying him the pleasure. Sebastian applies nipple suction cups to Josh's nipples then the two tickle Josh making him squirm and convulse. They lick and suck Josh's feet while jerking his cock sending his pleasure meter to the limits. In the next scene Josh is now strapped to the bottom of the suspended cross, his arms, legs, and torso bound in plastic wrap. Sebastian fucks his mouth with a dick on a stick while Chance has fun sucking Josh's cock. Sebastian shoves a vibrating butt-plug into Josh's ass while Chance jerks and sucks his cock. Sebastian slides the dick on a stick into Josh's ass and with each push of the stick into his tight hole, the wooden cross swings back and forth and with every upswing, Chance catches Josh's dick in his mouth waiting there with his mouth open to catch it again and again. After edging Josh's cock all day, Chance and Sebastian finally let him cum and Chance jerks his cock fast with his mouth open and gets a huge hot load right in his face. The two leave the room with Josh still tied to the cross and say that the'll be back for seconds.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Josh Hunter",
      "person_id": 60958
    }
  ],
  "release_date": "2018-02-20",
  "scene_id": 43120,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "bottom",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Leather",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "slim",
    "the cross",
    "Tickling",
    "top",
    "Twink"
  ],
  "title": "Muscle Twink Josh Hunter Edged in Captivity"
}