{
  "collections": [
    "Infernal Restraints"
  ],
  "description": "Charlotte Sartre thinks she is on a simple shopping trip, just like any other weekend. She goes into a furniture store, looking for some kind of chair to help furnish her new apartment, and O.T. is more than happy to help her look around his shop. She says she doesn't need anything too comfortable, which is good since the array of chairs he had are all made of metal pipes bent into strange shapes. Eventually she sits down on one, her legs spread by the metal, and O.T. locks her neck into a metal collar. A girl with this little common sense doesn't deserve to get out of that bondage, but O.T. knows what she does deserve.\nO.T. ties Charlotte's hair into pigtails and wraps them across her face and through her mouth to make a gag, which he then tapes in place with masking tape. With her legs open wide, her tights are exposed, so he takes his knife and cuts out the crotch from them so he can better reach between her legs. He takes the piece of fabric he cut away, balls it up, and sticks it in her nose so she has an even harder time breathing. Then he rubs his hand over her pussy through her panties to get her ready for their next activity.\nCharlotte is shackled onto a pole, her wrists and ankles locked in in some heavy metal bondage, and a metal wire gag laced through her mouth and pulling at the sides of her lips and her cheeks. That only hurts, but doesn't do a great job keeping air from getting in or out, so O.T. pulls a plastic bag over her head to help with some breath play. Then he starts whipping and flogging her body. Each ragged breath and each whine she tries to let out only makes her more aware of the suffocation and makes her more scared. What happens next will have you at the edge of your seat.",
  "directors": [],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    }
  ],
  "release_date": "2017-12-27",
  "scene_id": 43125,
  "tags": [
    "BDSM",
    "bit gag",
    "Bondage",
    "Collar",
    "Dildo",
    "Double Penetration",
    "dungeon",
    "Female Slave",
    "Fingering",
    "Flogging",
    "Gag",
    "gloves",
    "High Heels",
    "Male Handler",
    "Metal Bondage",
    "Metal Plug",
    "Nylons Stockings",
    "Pierced Nipples",
    "Shackle",
    "Spanking",
    "Straight",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator",
    "Whipping"
  ],
  "title": "Sitting Pretty"
}