{
  "collections": [
    "Infernal Restraints"
  ],
  "description": "It doesn't matter how much she says she doesn't want it, Sasha Heart is going to be getting some tough attention from O.T. today. He's got to have her and she's got to hold on tight and hope that whatever he is planning, he gets it over with soon. She is freaking out the second that she sees him, but Sasha can't stop him. He can do anything. He takes his time, letting her panic build as he runs his hands over body, outside of her clothes, before he strips her naked and starts to play with her tits. He grabs her by the pussy and instantly tears are in her eyes. And the worst is yet to come.\nSasha is soon screaming, begging O.T. to be more gentle. He zaps her with his high voltage prod to make sure she knows exactly how badly he can hurt her. Rumor has it that this girl is a squirter, and if that's true then O.T. is going to be tormenting her snatch for hours. Sure enough, some quality time with the hitachi has her fountaining across the dungeon floor. Too bad for her, but good news for him. Now he knows he won't get bored for a quite a while.\nThere is no escape. The bondage keeps her pussy out in the open while he pounds it with every dildo he has on hand. She's barely able to get a word out through her cum drunk delirium, and she's wasting her breath complaining that he's going too deep. The unrelenting tool splits her snatch and her body betrays her, almost knocking her out with the intensity of the orgasm.",
  "directors": [],
  "models": [
    {
      "name": "Sasha Heart",
      "person_id": 57271
    }
  ],
  "release_date": "2017-12-21",
  "scene_id": 43130,
  "tags": [
    "BDSM",
    "bit gag",
    "Blonde",
    "Bondage",
    "Breast Abuse",
    "Caning",
    "Cattle Prod",
    "Crying",
    "Dildo",
    "Domination",
    "drool",
    "dungeon",
    "Electrical Play",
    "Fear Play",
    "Female Slave",
    "Hitachi",
    "Male Handler",
    "Metal Plug",
    "Nipple Clamps",
    "Pain",
    "Predicament Bondage",
    "Squirting",
    "Stocks",
    "Straight",
    "thirdparty",
    "Tickling",
    "Vibrator"
  ],
  "title": "Gotta Have Heart"
}