{
  "collections": [
    "Infernal Restraints"
  ],
  "description": "Eden Sin loves nothing more than the feeling of a big hard dick in her mouth. She loves the feeling as it thrusts in and out, running along her tongue, poking at the back of her throat with its tip. What she loves even more is recording it so that she can watch later to work on her technique and admire her work. O.T. is just the next guy up on her list as far as she's concerned, but he's not going to have any part of that.\nWhen she goes to unbutton his pants and get her lips around his cock, he handcuffs her wrists, instead, and locks her ankles to the floor in metal shackles. For the moment it just seems like he wants to do something a little kinkier than what she had planned, but it soon becomes clear that he has a little more in mind than that as he pushes Eden onto her back and locks her down by her neck as well. Her mouth is going to get some fucking, alright, but it's going to be on O.T.'s terms.\nHe straps her down, mummified, onto an inclined table with only her head, feet, and nipples revealed. He takes advantage of the nipples almost immediately, attaching clamps which he then ties down to her toes so that when she squirms, and she will squirm, her tits are tugged at. Then he takes a huge black dildo and starts to shove it into Eden's mouth. He pounds it in and out until the girl is covered in her own drool. This is a lesson in dick sucking she won't soon forget.",
  "directors": [],
  "models": [
    {
      "name": "Eden Sin",
      "person_id": 60026
    }
  ],
  "release_date": "2017-12-22",
  "scene_id": 43131,
  "tags": [
    "bit gag",
    "Bondage",
    "Deepthroat",
    "Dildo",
    "Doctor",
    "drool",
    "Feet",
    "Female Slave",
    "Gag",
    "High Heels",
    "Hitachi",
    "Male Handler",
    "Metal Bondage",
    "Metal Plug",
    "Mouth Spreader",
    "mummification",
    "Nipple Clamps",
    "Shackle",
    "Small Tits",
    "Straight",
    "Tattoo",
    "thirdparty",
    "Vibrator"
  ],
  "title": "Oral Fixation"
}