{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Slave Kimber Woods is masturbating without permission. Even worse, she lies about it when Aiden Starr arrives to check up on her. This kind of selfish behavior will not fly in Aiden's dungeon! Aiden has Kimber squat in her heels and commands her to masturbate. Kimber hurries to obey her Mistress and is immediately ready to cum. But Aiden won't let Kimber off so easily. She makes Kimber edge herself as she canes Kimber's cute perky breasts. After much begging, she allows Kimber to cum but makes her continue to rub her wet pussy. She canes Kimber's asshole and flogs her ass and back. She fingers Kimber's slutty pussy and Kimber begs to cum over and over again only to be denied at Aiden's pleasure. Next, Kimber is restrained to metal pipes on all fours. Aiden closes up her whore pussy with closepins and canes her closed up pussy and her cute little feet. Kimber screams in pain as Aiden tests her dedication. After removing the closepins on Kimber's pussy, Aiden gives Kimber a hard fucking with a dick on a stick. Kimber moans as Aiden's cock slides into her. All the pain she's taken only makes her hornier. She pushes back on Aiden's cock, eager to get fucked. Aiden fucks her cunt relentlessly through multiple orgasms as Kimber squirts all over Aiden's cock. Next, Aiden smothers Kimber with her juicy ass. Kimber struggles to breathe under Aiden's ass and works hard to lick her Mistress' pussy. Once Aiden cums, it's Kimber's turn to get fucked. Aiden gags her slave, straps on a cock and thrusts it in Kimber's hungry pussy. Kimber loves the attention and moans as Aiden works her dick in and out of her cunt. Then this slut begs Aiden to fuck her ass. Aiden drills her cock into Kimber's tight asshole and fucks it wide open. So happy to get her Mistress' attention, Kimber cums hard on Aiden's dick in her ass over and over again.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    }
  ],
  "release_date": "2018-01-18",
  "scene_id": 43136,
  "tags": [
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "dominatrix",
    "dungeon",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "multiple orgasms",
    "pain",
    "pain slut",
    "Pussy Eating",
    "slave",
    "straight",
    "strap on"
  ],
  "title": "Aiden Starr's Classic Lezdom Dungeon with Kimber Woods "
}