{
  "collections": [
    "Infernal Restraints"
  ],
  "description": "Phoenix Rose is a lovely and giving girl. Today she has even gone so far as to completely give herself to O.T. as a little play toy. O.T. is so excited and grateful for the gift and he wants to prove it in the only way he knows how: brutal bondage and multiple intense orgasms. He bends Phoenix over, takes out his trusty knife, and cuts away her panties so that he can get a good look at her and really get to work.\nHe starts off nice and simple with an old favorite of his, the cane. He swings it at her ass and the noise that comes off it is absolutely lovely, but not quite as good as the noises coming out of Phoenix. Her shrieks get higher pitched and more entertaining when he takes out the cane and starts beating it hard against her bare back until it turns pink. She squirms a bit, but the belt bondage around her wrists and ankles keeps her firmly in place, like a doll in her packaging.\nAfter that out come the vibrators and the metal ass hook. He fucks her ass and alternates using the hitachi and the celebrator, two of our most powerful and intense vibrators, until she squirts all over herself. Cumming like that after so much build up from the beating must be a lot to take, so naturally he decides she deserves another go at it. This time she gets to take the metal hook in her pussy which adds even more pleasure. What a lucky toy Phoenix turned out to be.",
  "directors": [],
  "models": [
    {
      "name": "Phoenix Rose",
      "person_id": 60910
    }
  ],
  "release_date": "2018-01-18",
  "scene_id": 43134,
  "tags": [
    "Ass Hook",
    "Big Ass",
    "bit gag",
    "Blonde",
    "Bondage",
    "Breast Bondage",
    "Collar",
    "Fingering",
    "Gag",
    "gloves",
    "High Heels",
    "Hitachi",
    "Metal Bondage",
    "Rope Bondage",
    "Shackle",
    "Single Tail",
    "Spanking",
    "Squirting",
    "Straight",
    "Tattoo",
    "thirdparty",
    "Vibrator",
    "Whipping"
  ],
  "title": "Tinker Toy"
}