{
  "collections": [
    "Device Bondage"
  ],
  "description": "She is crouched in a corner, her back against the cold brick walls. A bar sits low and tight across her lap with leather straps holding her knees apart, keeping her in a squat. There is a collar around her neck and her wrists are attached to the back of it. She explains how she likes to play in her personal life. cyd tries to make her position a bit more interesting by moving a strong propane heater right next to her. She wriggles around a bit, trying to get away from the heat. A few minutes later she cyd pulls her shirt up over her head, tying it off above her arms like a sack of potatoes. She struggles inside the cloth, pressing her face against it so we can see her ghostly profile and hear her labored breathing.\nNext we find her in the spanish stirrups with a spider gag holding her mouth open wide. One foot of the stirrups is chained up above her to the ceiling and she twists her arms around as she lies on her back, as though she thinks she might actually get free. cyd pushes a speculum into her wet cunt and advises her to relax her muscles as he opens it wider and pokes around inside with a sharp stick. He proceeds to wedge a large butt plug deep into her asshole but quickly switches it out for the biggest one he can find. She lets out a few moans and screams as the huge hunk of rubber disappears inside her ass, but quickly quiets down. cyd congratulates her on taking the biggest thing he's ever put in anyone's ass before rewarding her efforts with the hitachi.\nHer last position keeps her on her knees with her arms behind her and her head tied back at a terrific angle to an ass hook. She looks directly up at her fate - a fucking machine mounted to the wall right above her mouth. cyd orders her to show him how well she sucks cock and she eagerly obliges, gagging and spewing drool in every direction across the room.",
  "models": [
    {
      "name": "Amber Rayne",
      "person_id": 12631
    }
  ],
  "release_date": "2007-03-09",
  "scene_id": 4313,
  "tags": [
    "muscle",
    "ass hook",
    "the wall",
    "gag",
    "leather",
    "collar",
    "speculum"
  ],
  "title": "Machinehead"
}