{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Dee Williams is a horny Mrs. Claus, desperate for cock while Santa's delivering presents. She orders up five hard dicks for Christmas and gets exactly what she needs. When the men arrive, Dee immediately services them. She chokes on their cocks, sucking them long and hard, taking them deep into her throat. The spit flows as she goes from one hard dick to another, hungry and desperate. Dee's tied to a table with her arms behind her back while the men take turns fucking her mouth. But she takes them all and doesn't slow down, squirting and cumming everywhere as the men have their way with her. Dee's then tied in a full suspension with her ass and pussy sticking straight out to fuck. The guys plow both of her holes while she wails, taking it all, deep and hard. At the same time she's still getting her throat fucked, and every one of her holes is dripping wet. She keeps on squirting, seeming to lose all control as she's pounded and savaged. Dee finally gets what she really wants when the guys DP her, again and again. One huge cock after another plowing into her hot cunt and her hungry ass. She's fucked airtight with another cock in her throat. She can barely keep up as she's fucked every which way, and then men shower her with their thick, boiling cum. Seems Mrs. Claus can have her cum... and eat it too.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Cyrus King",
      "person_id": 60686
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Ray Black",
      "person_id": 60687
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2017-12-27",
  "scene_id": 43138,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "christmas",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "holidays",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rough Sex",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Suspension",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "While Santa's Away, Mrs. Claus Will Play"
}