{
  "collections": [
    "Infernal Restraints"
  ],
  "description": "Lily Lane is absolutely, totally trapped. Her wrists are held together by brutal hose clamps, her ankles are held together by another set. Hell, she didn't even know that they came in a size large enough to hold her thighs together, but here she is: living proof. Her entire body is held in place by metal and all that she can do is to lie there and whimper as O.T. comes to her to cut the bit of clothing she has off her body.\nLily is one of the bendiest girls O.T. has ever seen and he seems intent on taking complete advantage of that fact. He takes her and bends her legs all the way back so that her feet are way above her head, and then locks her down so there is no way for her to wiggle out of the position. With Lily folded in half like this it gives O.T. the perfect opportunity to get at that pussy of hers, which he knows is just begging to be played with.\nO.T. takes out the hitachi, the most powerful handheld vibrator we have, and presses it right on her clit. Then, with his other hand, he starts finger fucking the life out of her. Lily is moaning and crying out and it looks like she's about to cum. And then it happens. She starts squirting all over the place like a fountain. More specifically, because of the position that she is in, Lily starts squirting all over her own face. She's cum drunk and humiliated, and O.T. hasn't even brought out the hook yet.",
  "directors": [],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    }
  ],
  "release_date": "2017-12-25",
  "scene_id": 43132,
  "tags": [
    "Big Tits",
    "bit gag",
    "Bondage",
    "Crying",
    "dungeon",
    "Feet",
    "Female Slave",
    "Fingering",
    "gloves",
    "Hand Gagging",
    "High Heels",
    "Hitachi",
    "Male Handler",
    "Metal Plug",
    "Nipple Clamps",
    "Squirting",
    "Straight",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Hoesed"
}