{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Brooklyn Daniels is a great BDSM Mistress, a fan favorite for all of our lesbian domination threesomes. Yet, she's tied up in the dungeon, her long skirt still on. Seems like she's in trouble with our other Mistresses. Who says a Dominant can be turned into a sex slave for slut training? At Fetish Network, fuck the rules. Brooklyn needs to learn her lesson. Mila Blaze and Lexy Villa enter and shake her up. They spin her into the doggy position and tear open her panties, revealing her sweet pussy and tight asshole. Everyone now gets to see what's underneath her uniform. They shove a few fingers inside her and fiddle with her g-spot. They want to see her squirt since she makes other sex slaves shoot pussy juice all over themselves. Lexy loves to water board her whores with a big jug of water, drenching Brooklyn throughout. Now Daniels will know how it feels to be deep throat-ed and fucked deep and rough with big black strapon dildos. Mila and Lexy give it to her the way she gives it to others. Mila shoves her rubber dick down Brooklyn's pussy as Lexy taunts and splashes water on the face, skull fucking her in between. They want to bind her in a bent over position, shackling her wrists to posts. Perfect! They can double penetrate her better. There's so much water and spit dripping from Brooklyn's face. She's slapped and spanked, zapped with an electro wand, taking more rubber cock in her mouth and pussy. The dicks on a stick are pulled out and ready for action, stuffing Daniels more. We're not sure she was prepared for this caliber of hardcore bondage sex. They leave her apologizing for being a dirty slut.",
  "directors": [],
  "models": [
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    },
    {
      "name": "Lexy Villa",
      "person_id": 53826
    }
  ],
  "release_date": "2018-02-22",
  "scene_id": 43140,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "Breast Abuse",
    "Chains",
    "Collar",
    "Destruction",
    "Domination",
    "drool",
    "dungeon",
    "Female Slave",
    "Femdom",
    "Fetish",
    "Fingering",
    "gloves",
    "Hair Pulling",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Mouth Spreader",
    "Nipple Clamps",
    "Slave",
    "Straight",
    "Sub",
    "Tag Team",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration"
  ],
  "title": "Brooklyn Daniels is Up for Slave Training with Mila Blaze & Lexy Villa"
}