{
  "collections": [
    "Men On Edge"
  ],
  "description": "Mason Lear has been caught! Sebastian Keys and Brodie Ramirez drag their new victim into their domain. Mason struggles as these two men string him up from the ceiling. Mason protests, but Brodie knows it's all for show. He can see Mason's fat cock straining to be freed. And once Brodie starts rubbing, all Mason's pleas to stop become pleas to cum. But Sebastian and Brodie aren't done with their plaything yet. They wrap Mason's cock in leather and hang weights from his balls. Mason's cock gets even harder as more weights are added. As soon as Brodie starts sucking his cock again Mason is ready to cum. Sebastian shoves Brodie's head down on Mason's cock over and over again, laughing as Mason struggles to cum. Sebastian and Brodie grant Mason release from torment and instead start tickling him! Mason laughs, squirming, as he twists in bondage, unable to escape their seeking fingers. Next Mason is suspended in rope bondage, with his legs spread. As Brodie teases his cock, Sebastian attaches small nipple cylinders to his sensitive nipples. Mason moans as blood rushes to the area. The longer they are on, the more sensitive they become. Then Sebastian screws a butt plug into Mason's tight hole. Mason begs to cum, but before he can cum, Sebastian has to taste those delicious feet! Mason moans as Sebastian uses his tongue over Mason's heels, arches, and his toes. He's so loud Brodie decides it's time to shut this slut up. He peels down his pants and shoves his hard cock straight into Mason's warm waiting mouth. Being stuff from both ends drives Mason crazy! He blows a fat load all over the floor and licks the remnants of his cum off Sebastian's hands.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Mason Lear",
      "person_id": 60275
    }
  ],
  "release_date": "2018-04-03",
  "scene_id": 43149,
  "tags": [
    "Athletic",
    "BDSM",
    "black hair",
    "Bondage",
    "Edging",
    "Feet",
    "Gay",
    "Leather",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "Tickling",
    "Weights",
    "white"
  ],
  "title": "Mason Lear Gets Taken and Edged"
}