{
  "collections": [
    "Men On Edge"
  ],
  "description": "Sexy fucker Cesar Xes thinks he’s on a simple hookup date with Chance Summerlin. But it turns into an intense, 3-way edge session when Sebastian Keys crashes the party. They tie Cesar up in a standing position, blindfold him and bind his hands behind his back so they can get at every inch of him. Chance teases his big hard cock through is underwear before unleashing it, letting his fat meat swing straight out. Chance and Sebastian take turns deep throating Cesar’s huge dick, taking him right to the edge repeatedly. They then use a jack off toy on him, keeping that big dick rock hard and so damn close to cumming. They spin him around and fuck his ass with a dick on a stick, while jerking his cock at the same time. Still blindfolded, Cesar can’t see a damn thing. He can only feel his ass getting fucked and his cock getting worked to the edge. He’s then tied down to a busted up old couch, with his arms above his head, his mouth gagged and his legs spread. Chance and Sebastian suck his sweet cock and use a vibrator toy on him, driving him crazy and making him almost blow his load again and again. Chance worships his feet while Sebastian continues on his cock, then Chance jerks and sucks him. When Cesar finally cums, his load explodes out of his cock until he’s soaked in his own hot seed.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cesar Xes",
      "person_id": 60954
    }
  ],
  "release_date": "2018-05-01",
  "scene_id": 43148,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blindfold",
    "Bondage",
    "Edging",
    "Feet",
    "foreskin",
    "Gay",
    "Latinx",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "Tickling",
    "Vibrator"
  ],
  "title": "Cesar Xes Gets His Huge Cock Sucked And Edged"
}