{
  "collections": [
    "Men On Edge"
  ],
  "description": "The tables have turned and Sebastian Keys gets edged! In the first scene, Sebastian is bound with his wrists behind his back, his neck and leather harness are bound to a tie point above him, and his legs are kept open by a spreader bar. Drool leaks out around his gag, leaving a sticky trail down his chest. Pierce Paris enters, eager to have control over the man who has so often devised his own torment. Pierce slips on his leather gloves and proceeds to tug down Sebastian's leather pants revealing a rock hard cock. He takes it in his mouth, relishing Sebastian's struggles. He breaks out two hitachis and runs them along Sebastian's cock, using the vibration in tandem with his mouth to tease Sebastian. He brings out the violet wand and shocks Sebastian's cock and balls. Sebastian tries to thrust deeper and deeper in Pierce's mouth, seeking relief, but Pierce denies him every time. Next, Sebastian is blindfold and suspended upside down. His ass is filled with electricity as Pierce fucks him with the violet wand. Sebastian hips buck as he strains to fuck himself, and Pierce knows this greedy slut wants more. He pushes a metal electrified butt plug into Sebastian's asshole and cranks up the electricity. Sebastian struggles to blow his load, but as soon as he gets close, Pierce pulls back. The teasing continues as Sebastian is put in leather bondage, standing upright, with the electrified butt plug still throbbing in his ass. Pierce continues to tease him, keeping him right on the edge of cumming for as long as possible. Finally he allows Sebastian to cum, but that doesn't stop him from continuing to milk Sebastian's sensitive cock. Once Sebastian is drained, Pierce tickles him relentlessly and all Sebastian can do is laugh.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2018-04-17",
  "scene_id": 43147,
  "tags": [
    "BDSM",
    "Blindfold",
    "Bondage",
    "drool",
    "Edging",
    "Electrical Play",
    "Gag",
    "Gay",
    "gloves",
    "Leather",
    "Leather Gloves",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "harness",
    "Rope Bondage",
    "Tickling",
    "Violet Wand"
  ],
  "title": "Director Sebastian Keys gets edged!"
}