{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "He found me! I thought I'd lose him for sure. He left me in his lair again, arms tied tight behind me, a potato sack over my head. I couldn't see anything. I only realized he was in the room when he pulled the sack off. He immediately pulled me onto his filthy couch and shoved his dick down my throat. Every time I pulled away for air, he pushed my head back down, sliding his huge dick as deep as he could down my throat. He's always so rough with me. I begged him to be nice which only made things worse. He grabbed a vibrator and tormented my clit with it, making me cum so many times. The vibration from the toy and cumming so much kept my legs trembling throughout the rest of my session. I never thought I'd want a break from cumming. But I didn't get it. He tied me to the couch, legs pulled opened, my arms still tied behind me. He rammed his dick deeper in my pussy. His dick is so big. My pussy finally tightened back up from the last time he had me bound. He wanted to open me right back up, pounding me in, covering my mouth from all the screaming he caused me to do. He's instilled so much fear in me, yet I love being his slutty sex slave. When he squirts his load all over my face, I laughed. I was so happy to finally taste his seed.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Lola Love",
      "person_id": 61345
    }
  ],
  "release_date": "2018-03-01",
  "scene_id": 43151,
  "tags": [
    "big dick",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "brunet",
    "Deepthroat",
    "dungeon",
    "Facefucking",
    "Facial",
    "gloves",
    "High Heels",
    "Hitachi",
    "Hood",
    "Latin",
    "natural boobs",
    "PIV",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "versatile",
    "Vibrator"
  ],
  "title": "Lola Love is Bound Once Again"
}