{
  "collections": [
    "Yesirboys"
  ],
  "description": "Master Aaron takes his boy toy Alex Roman to a dark underground dungeon. As they sit in a shady corner, Aaron orders his personal slave to please him. As good as Alex may know what his master likes, tonight it's simply not good enough. What would satisfy him far more is sharing his toy with Leo Bunny, who's spotted the two from a distance and is obviously enjoying the view.\nAaron beckons to Leo who doesn't need any convincing at all.\nHe immediately pushes his rock hard cock inside the submissive boy's hole and mouth.\nWhat follows is a hot threesome with lots of rough fucking and sucking, building up to Alex being double penetrated.\nBoth masters put their sub on the floor, having him suck both their solid dicks, shooting hot loads of cum which completely cover the boy's face.\nThat's all they wanted, they walk off l, leaving Alex to finish himself off.\nThe boy, so hungry for more cock finds himself a stretching toy and rides himself to a climax, shooting his own load far in front of him, splattering all over the concrete floor.\nThis scene has got a particularly dark setting, resembling a sex dungeon as good as they come. Cold light shining through narrow gaps and moving shadows from a watching crowd on the fore plan. We're sure this hot scene will pull you right in as if you're part of the action.",
  "directors": [],
  "models": [
    {
      "name": "Alex Roman",
      "person_id": 61045
    },
    {
      "name": "Leo Bunny",
      "person_id": 61046
    },
    {
      "name": "Master Aaron",
      "person_id": 60724
    }
  ],
  "release_date": "2018-04-04",
  "scene_id": 43164,
  "tags": [
    "Anal",
    "Anal Fingering",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Chains",
    "Choking",
    "Collar",
    "Dildo",
    "dungeon",
    "Gay",
    "Jockstrap",
    "Male Sub",
    "master",
    "masturbation",
    "harness",
    "Rough Sex",
    "Slave",
    "Spit Roast",
    "Sub",
    "Tag Team",
    "Tattoo",
    "thirdparty",
    "Threesome"
  ],
  "title": "Double Trouble"
}