{
  "collections": [
    "The Upper Floor"
  ],
  "description": "In part two of our raucous BDSM sex bonanza, Karlee Grey is taught to serve up her orgasms in discipline her slutty anal trainee Vanessa Sky with a firm spanking hand. Governess takes special pleasure in making Karlee squirm and beg for her orgasms, squirting uncontrollably all over her huge tits while the crowd gets horny and cheers her on. Meanwhile Ramon takes Vanessa on a fuck ride through the whole party, humiliating and fucking her deep in her ass just as she likes it. He rides her like a little slut pony all over the room, railing her on every couch and making her beg like a whore for every orgasms speared on his hard dick. The guests get overwhelmed with all the sex in the air, clapping for the house slaves and making mischief of their own. Gorgeous women are spanked by their Master's, fisted, made to suck dick on their knees, and cum in screaming sweaty piles on the sybian. One house guests is covered in tight bondage and hot wax while her latex clad Mistress keeps her under tight control, requesting a thank you with every scream. Aiden Starr joins in the fun, having Karlee lick her cunt until she cums on that little bitches face with great enjoyment. Ramon still hasn't had enough, and after having Vanessa lick his cock clean after her wild anal ride, her brings her to heel at the front the room for one final test. Meanwhile one of our guests of honor is tied in an incredible split position by her Master and has her cunt whipped red with a cat-o-nine tails and still begs her have her whole pussy filled and cums with permission on her Master's hand. All eyes turn to the front of the room where Vanessa is hung like a piece of meat in full suspension, made to recite the rules as she is fucked in the ass. Karlee squats like a good girl over a hitachi and suffers for her submissive trainee's fun with tight clover clamps on her labia and nipples, pulled off slowly and painfully by Aiden Starr until she is ready to get on her knees and get her pussy fisted, soaking the carpet with squirt and begging for Ramon's hot cum all over her face. Looks like the house is finally back in order.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Karlee Grey",
      "person_id": 59568
    },
    {
      "name": "Vanessa Sky",
      "person_id": 60690
    }
  ],
  "release_date": "2018-05-04",
  "scene_id": 43161,
  "tags": [
    "Anal",
    "BDSM",
    "Best Bound Breasts",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Hard Parties",
    "Hitachi",
    "Hot Wax",
    "Humiliation",
    "Latex",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "Squirting",
    "Straight",
    "Suspension",
    "Swingers",
    "Sybian",
    "Threesome"
  ],
  "title": "Sexy Anal Submissive's Serve BDSM Swingers' Ball"
}