{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The night is alive with holiday cheer as hot swinger babes line up to suck dominant dick and get their beatings in this wild yule tide BDSM orgy. Meanwhile, Stefanos has proclaimed that The House will return to the basics: protocol, rules, hierarchy. But busty slave slut Karlee Grey already has the cock deep down her throat and is bouncing her tits like she doesn't remember a single rule. It will be up to newbie Vanessa Sky to get her rules through painful zipper the guests can rip off of her in exchange for hints. meanwhile Karlee is getting dicked down and screaming for permission to cum, which she is roundly denied by a cruel crowd. Beaten with her fucking Karlee howls while Vanessa tried to absorb her training with tight rope digging into her flesh and a hitachi fixed against her hungry cunt. When she is finally able to recite the rules, Vanessa is thrown onto the floor and get her anal reward while Karlee is flogged and fucked and further denied her orgasms. Meanwhile, the crowd has melted into a total BDSM orgy with spankings, rope bondage, lines of blowjobs, and our very special guests of the night playing with an electro box that denies its beautiful inhabitant any vision through its two way mirrored walls. All she can hear is the vibrator on her pussy and the violet wand closing in on her flesh. When the hatch is finally opened for her to breath, her mouth is stuffed with cock. Earning her way out of the box does not offer much relief, and she is immediately tormented with a terrifying taser and fucked with the largest candy cane anyone has ever scene. Covered in glitter like a little ornament, her master uses her like a fuck doll while she begs for cum. Vanessa learns that pain and pleasure roll downhill when she is made to hold buckets of her sister submissive squirt, her buckets getting heavier with each orgasm in tight rope suspension. the corwd is really worked up, single tailing and fucking each other, while Vanessa struggles to prove herself and stay in an athletic squat, holding her buckets proudly, and cumming like a proper whore, waiting her turn with the dick so that she may beg for each anal orgasm from the crowd. Happy Holidays!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Karlee Grey",
      "person_id": 59568
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Vanessa Sky",
      "person_id": 60690
    }
  ],
  "release_date": "2018-02-09",
  "scene_id": 43160,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Hitachi",
    "holidayparty",
    "holidays",
    "Humiliation",
    "master",
    "Oral Sex",
    "Orgy",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Squirting",
    "Straight",
    "Suspension",
    "Taser",
    "Threesome",
    "Vibrator",
    "Violet Wand",
    "Zipper"
  ],
  "title": "Anal Submissive Sluts Ravaged & Squirting at Holiday Winter Orgy"
}