{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Tommy Pistol is on a mission to reform the hot slutty lesbian that stole his wife away from him. It's a wild ride for curvaceous redhead Lauren Phillips when Tommy kidnaps her with a plan to fuck her cheating ass straight! Hidden away in some dingy warehouse Tommy has Lauren captive tied up tight in skimpy lingerie with her big tits exposed and a ball-gag in her mouth. He torments her with the zapper and throat fucks her with his hard dick fully convinced her lesbian ass will crave cock by the end of the day. After a good long blow job he leaves her tied up and chained to the wall but Lauren finds a way to escape and makes a mad dash to get out of town. When Tommy discovers she is gone he is even more hellbent on reforming the whore who took the most important thing way from him-his wife! He tracks her down and continues the Reformation! In doggie position Lauren gets punished with the flogger on her ass and thighs and then Tommy fucks her pussy and her ass until she's gaping and begging him to stop. He disciplines her with the cane on her delicate feet and asshole as she apologizes for fucking his wife. It's still not enough she needs to learn her lesson so Tommy flips her over on her back and ties her ankles behind her head and stuffs her ass full with a huge glass dildo while he fucks her pussy. Double penetration drives her wild as he goes back and forth between her tight ass and pussy. He vibes her clit with the Hitachi and takes her over the edge into wild, banging orgasms. Tommy, The Reformer, pounds Lauren so long and hard she's gotta be loving that cock by the time he shoots his hot load all over her sweet, wife- stealing, cheating face!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2018-02-09",
  "scene_id": 43171,
  "tags": [
    "anal",
    "bdsm",
    "big tits",
    "blowjob",
    "Corporal Punishment",
    "dildo",
    "domination",
    "Double Penetration",
    "Feet",
    "Flexible Fucks",
    "gag",
    "Gaping",
    "Hitachi",
    "humiliation",
    "lesbian",
    "lingerie",
    "Predicament Shoots",
    "redhead",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "the wall",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "The Reformer, One Man's Quest for the Perfect Pussy"
}