{
  "collections": [
    "TS Seduction"
  ],
  "description": "Wearing a mixture of lace and latex, the lovely Jessica Fox sets everything on her table just right for the tea party she is hosting for her gimp guest, Tony Orlando. Tony doesn’t say a word through his black latex gimp mask, he just sips quietly like a polite guest. First, Jessica unzips Tony’s tight black latex pants and places his balls in a cup of hot tea. Soon after, Jessica makes him get down on the floor and lick all of her black latex thigh-high stockings. He removes her high-heeled shoes and licks her feet and sucks her toes through the latex. Jessica then puts one knee on the table and shoves Tony’s head into her ass and puts his tongue to work. Tony sucks her cock from behind and tongue-fucks her asshole like an obedient slave. Jessica then commands Tony to lie across the table with his ass presented, and with not much resistance Jessica shoves her whole latex gloved hand into Tony’s asshole and fucks him with her fist. Underneath her fist still buried in Tony’s ass, Jessica finds room to slide her cock along with it and jerks her own cock inside of his ass. Jessica removes her fist and makes Tony spread hiss ass wide to take her hard cock and pounds Tonys ass deep and hard. Jessica flips him over on the table and tells him to take off the mask. On his back with his legs spread, Jessica continues to fuck Tony’s ass until she pound all the cum out of him. Finally Jessica makes Tony get on his hands and knees and she slowly slides all five toes of her latex covered foot into his ass while she jerks herself off, shooting a massive load all over his back. She compliments him on what a polite guest he’s been and sends him crawling away.",
  "directors": [],
  "models": [
    {
      "name": "Jessica Fox",
      "person_id": 17013
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2018-02-06",
  "scene_id": 43174,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Blowjob",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Feet",
    "Gimp",
    "Kinky",
    "Latex",
    "Latinx",
    "Male Sub",
    "Mask",
    "natural boobs",
    "Nylons Stockings",
    "Role Play",
    "shaved",
    "Slave",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "TS",
    "TS Fucks Male",
    "versatile",
    "white"
  ],
  "title": "Kinky Tea Party: Jessica Fox and Tony Orlando"
}