{
  "collections": [
    "Infernal Restraints"
  ],
  "description": "Adorable Lydia Black is about to join O.T.'s extensive collection of perverted sex toys. Once he's got her in her new dress and make-up she is exactly right to replace the doll he broke last week. Lydia thought she was meeting him for a quick smoke before she headed home, but at this point she will be lucky if she ever sees daylight again. He takes his time in stripping her naked, going over every inch of her body looking for any defect. She's exposed and humiliated, trying desperately to ignore how dirty his hands and words make her feel.\nLydia is one sexy catch. Quite flexible and fully poseable, this might be the best little punching bag he has brought home yet. Metal restraints pull her limbs out wide while a latex mask leaves her in the dark. She tries to scream and struggle when he starts working her pussy with the whip, but in the end it starts to sound more like moaning than anything else. A quick check between her legs shows him that she is adjusting to her new life nicely.\nDripping wet, Lydia probably thinks that if she can suffer through enough he will reward her with his cock. It's true, in a sense, since he has 8 inches of cold steel on hand to extract multiple orgasms from her poor, abused cock socket. He works her pussy until she squirts, and then starts railing her ass with the same metal member. Both holes leave her bucking against her bondage as the waves of ecstasy roll over her.",
  "directors": [],
  "models": [
    {
      "name": "Lydia Black",
      "person_id": 60714
    }
  ],
  "release_date": "2018-03-15",
  "scene_id": 43176,
  "tags": [
    "Anal",
    "Ball Gag",
    "BeaverDay",
    "Blindfold",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "Bush",
    "buttplug",
    "Chains",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "drool",
    "dungeon",
    "Female Slave",
    "High Heels",
    "Latex",
    "Male Handler",
    "Mask",
    "Metal Bondage",
    "Metal Plug",
    "multiple orgasms",
    "Pain",
    "Punching",
    "Rope Bondage",
    "Sadism",
    "Shackle",
    "Single Tail",
    "Small Tits",
    "Stocks",
    "Straight",
    "Submission",
    "Tattoo",
    "thirdparty",
    "Tickling",
    "Vibrator",
    "Whipping"
  ],
  "title": "Dolled Up"
}