{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Beautiful redhead slut Violet Monroe might think she’s found the wrong address while searching for a temp agency, but she’s definitely in the right place, because the 5 horny dudes she runs into are ready to put her to work. They don’t have her answering phones or anything like that. Instead she’s answering their demands, getting tied up, and being bent over so they can employ every hole she’s got. First the guys surround her, convincing her she’s got the job, no interview required. They fill her mouth and throat with huge cocks, face fucking her and choking her, making sure she knows what her other holes are in for. They tie her down to a bench with her wrists and ankles bound, and her torso and legs tied close together so she can barely move. She’s rigged to the ceiling so all she can do is lay there propped up on her stomach while the guys fuck her feet and slam her mouth full of cock. Violet’s then fully suspended on her side, with one leg straight up in the air so the dudes have clear access to her wet pussy, hungry ass and spit-dripping throat. She’s fucked at both ends, in all her holes, like the dirty whore she is. She’s then taken down from the suspension but remains in bondage while the guys DP her hot cunt and stretched out ass. Violet takes all the giant dicks as the dudes take turns on her, fucking her throat then fucking her holes, slamming her on them while she screams for more. The whole job devolves into a free-for-all, where every man takes every hole, fucking Violet and using her they way each of them wants to. Violet doesn’t know which end is up or who’s got their raging dick in her at any given moment, all she knows is she wants more! Finally she gets their hot loads, one huge blast of cum after the other, drenching her face, getting in her hair, and coating her tongue as she swallows it down. It’s a job she won’t soon forget, and will definitely hope is temp-to-perm.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Cyrus King",
      "person_id": 60686
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Violet Monroe",
      "person_id": 20284
    }
  ],
  "release_date": "2018-01-24",
  "scene_id": 43170,
  "tags": [
    "Airtight",
    "Airtight Playlist",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Choking",
    "Corporal Punishment",
    "Double Penetration",
    "Feet",
    "Gangbang",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Redhead",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Straight",
    "Suspension",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "Violet Monroe Takes A Temp Job Getting Stuffed Airtight"
}