{
  "collections": [
    "Infernal Restraints"
  ],
  "description": "Lorelei Lee is having a relaxing day at home. She's cleaned some, cooked some, and has just eaten when she decides it's time to take a long luxurious bath with her new bath bomb. She fills up the tub with nice hot water, climbs in and drops the bomb. As all the water turns color, however, she slips into a fantasy. As her vision fades, she sees a man with a hazmat suit walk in, and before she goes out, he grabs her.\nLorelei wakes up shackled to a hospital bed by her wrists and ankles. She tries to scream but there is a cloth jammed into her mouth, held there with tape. The gag girl really starts freaking out when the man in the hazmat suit comes back. He introduces himself as Doctor O.T. and says he is there to get a few samples. She wriggles and writhes as he takes samples, and then swabs the inside of her pussy.\nNext she finds herself in a medical examination chair, her feet stuck in stirrups and her legs spread. Doctor London River comes in and sticks a metal plug in her ass, and then starts vibrating her pussy with a hitachi. Some of his methods seem questionable at best, bordering on downright absurd, but the good doctors are stuck in their ways. They absolutely need to make sure this girl isn't sick, and if she is they have to help her get better. The only way to do this, of course, is through electroshock therapy.",
  "directors": [],
  "models": [
    {
      "name": "Lorelei Lee",
      "person_id": 758
    }
  ],
  "release_date": "2018-03-01",
  "scene_id": 43175,
  "tags": [
    "Anal",
    "Blonde",
    "Bondage",
    "Cattle Prod",
    "Chains",
    "Collar",
    "Dildo",
    "Doctor",
    "Electrical Play",
    "Electro Plug",
    "Fear Play",
    "Feet",
    "Gag",
    "gloves",
    "Hitachi",
    "Leather Cuffs",
    "Medical Fetish",
    "Metal Plug",
    "PIV",
    "Straight",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "10 Insex Lane"
}