{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Tommy's ex wife, Alana Cruise buys Tommy's house out from under him she tries to blackmail him into getting back together again. But Alana is the worst mistake he ever made so he looses it and grudge fucks his ex wife into submission to reclaim his home.\nFirst Alana makes Tommy \"lick it like you used to\". On the couch legs spread wide Tommy licks and fingers his ex-wife's pretty pussy until she is writhing and moaning like old times. He knows just what she likes so he ties her up with rope and punishes her with the flogger demanding that she back off and leave him alone with the one piece of property has has left to his name. Alana begs him to fuck her so he stuffs her full of his hard cock and then lets her clean it with a deep messy throat fuckin'. Then on all fours in doggie Alana is tied up tight with her sexy thigh high stockings still on, ass in the air she sucks Tommy's cock and then gets a good work out in both her slutty holes. And for the grand finale Alana is on her back legs spread open, Tommy goes right in to fuck her pussy, torments her with the zapper, squeezes her perky tits, chokes her and then gives her ass a proper pounding until she is loosing her mind with orgasms. Then with the lease in her mouth he fucks her some more in reverse cowgirl and shoots his load all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Alana Cruise",
      "person_id": 60194
    }
  ],
  "release_date": "2018-02-02",
  "scene_id": 43172,
  "tags": [
    "Anal",
    "BDSM",
    "Best of Anal",
    "Blowjob",
    "Corporal Punishment",
    "Domination",
    "Humiliation",
    "Nylons And Stockings",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Anal Alimony"
}