{
  "collections": [
    "Infernal Restraints"
  ],
  "description": "Ashley Lane and Lauren Phillips have unwittingly found themselves at the hands of a mad man, the likes of which they have only seen in movies. He has them tied up, Ashley down on her knees, her feet between the legs of Lauren Phillips who is standing over her. That's when O.T., their captor, comes in with his knife. He slides it under the sleeve of Lauren's dress and tears it away from her, leaving her perfect tits exposed.\nAfter the scare tactics it's time for the real suffering. O.T. takes out the whip and starts cracking it against the girls' skin. He is merciful at first, starting with with Ashley on the bottom, but as he moves up to Lauren, he steadily moves closer to hitting Ashley's soft sweet face with the stinging tip. When the girls are properly scared he moves them to the floor for a barrage of different torments.\nHe moves the two girls through an array of positions. First they are cuffed to the floor, heads by each other's feet, trying to protect one another from a cane beating with their own bodies. Then he has them down on all fours, a pole in each of their mouths and their asses, connecting them like a serpent, as he has another go at them with the whip. Finally he leaves it to the girls to hurt each other, locking a pear inside one and connecting it to a wire wrapped around the head of the other. The only thing left for them to do is distract each other the only way they know how, with pleasure.",
  "directors": [],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2018-03-29",
  "scene_id": 43183,
  "tags": [
    "69 Position",
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "buttplug",
    "Caning",
    "Corporal Punishment",
    "Deepthroat",
    "dungeon",
    "Feet",
    "Female Slave",
    "Male Handler",
    "Metal Bondage",
    "Redhead",
    "Shackle",
    "Single Tail",
    "Straight",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "Vibrator",
    "Whipping"
  ],
  "title": "Paired"
}