{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We're excited to share we've found another hot kinky cougar who definitely deserves disgrace for being a slut. Fetish Network introduces Dani Dare. She's traveled the world and has had some great times but we're sure her experience in our dungeon will top the rest. She seems like a natural submissive and obedient sex slave. She loves being slapped and spanked, gagged and fucked roughly, deep and hard down her throat and pussy. We definitely have everything Dani wants. She is placed on the leather couch, legs chained wide apart, hands down and out of the way. Her new BDSM Master comes in and slaps her pussy awake. He wants her to cum a few times before he penetrates her. A vibrator usually does the trick. He lubes her cunt and spreads the wand all over her clit and pussy lips. After awhile, he climbs up on the sofa and stuffs his hung cock deep down her throat, making her give him a sloppy blowjob. She keeps gagging up spit, her pussy tightening every time. He finally sticks his meat inside her cunt and pounds away, fucking her deep and rough, the sex she prefers. We here no struggle or complaint from this naught Cougar. She takes his dick like a champ. So she's flipped around, her arms, shoulders and head over the back of the couch, her ass up and ready for more penetration. Dani's hot body spread out doggy style will make everyone cum in their pants. She can hardly move as she is slapped into the position she's wanted in and taken how her Master pleases.",
  "directors": [],
  "models": [
    {
      "name": "Dani Dare",
      "person_id": 56941
    },
    {
      "name": "James Kickstand",
      "person_id": 48660
    }
  ],
  "release_date": "2018-03-22",
  "scene_id": 43181,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "Choking",
    "Clothespins",
    "Deepthroat",
    "dungeon",
    "Facefucking",
    "fake boobs",
    "Fetish",
    "High Heels",
    "Hitachi",
    "Kinky",
    "Latin",
    "Leather",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "Nipple Clamps",
    "PIV",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "thirdparty",
    "top",
    "Vaginal Penetration",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Hot Cougar Dani Dare Gets Fucked Hard in Bondage"
}