{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We all thought the Dungeon Master let his sex slave Kimmy Lee go after their last session. We were wrong. The Asian beauty was kept in a dog cage, kept in the doggy position in rope bondage, sitting on a sybian fucking machine with a huge black dildo on a fucking machine aimed at her asshole. No model on Sexual Disgrace has taken the machine in her asshole. Everyone give it up for Kimmy! The session starts. Lee can’t move so she will endure every inch of the long and thick rubber dick penetrating her deep, teasing her with the control panel. This slut loves it, whining for her Master the way he likes. He enjoys make the machine go as fast as possible, testing Kimmy’s anus. This is anal sex to the extreme. He gets jealous and wants it for himself. He opens the cage door and leads Kimmy out on her hands and knees like a pup, running his hands all over her body, spanking her ass and tits, leaving hand prints. He shoves his dick deep down her throat, bobbing his whore’s head on it. When there’s enough spit, he pulls her up on the sofa and penetrates her asshole. It seems he wants to wreck it. He fucks her rough, deep and hard, making her clean his pole off in between. He slips it into her pussy as well. Kimmy loves being used by her Master, cumming whenever he tells her to, riding his dick the best she can. She is left trembling.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Kimmy Lee",
      "person_id": 56661
    }
  ],
  "release_date": "2018-03-29",
  "scene_id": 43182,
  "tags": [
    "Asian",
    "big dick",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "brunet",
    "Brunette",
    "Cage",
    "Deepthroat",
    "Dildo",
    "dungeon",
    "Facefucking",
    "fake boobs",
    "Female Slave",
    "Hair Pulling",
    "Latinx",
    "Machine Dildo",
    "Male Handler",
    "master",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Slave",
    "Spanking",
    "Straight",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "Partner Studio",
    "toned",
    "Vaginal Penetration",
    "versatile"
  ],
  "title": "Kimmy Lee has been Kept in a Cage for Deepthroat BJs & Anal Sex"
}