{
  "collections": [
    "Everything Butt"
  ],
  "description": "Francesca Le has come home from a long day of work to tend to her house Pet. Alana Cruise is said house pet who has been tied up in rope bondage and left in Francesca's Living room to wait patiently until Francesca returns. Alana has been bound with rope wrapped around her nude body, her pretty brunette hair left loose. Francesca enters the living room in her beautiful MILF business attire. Under her blouse and skirt she has a sexy set of lingerie. Francesca is very pleased to see her house pet obediently waiting her return. Not only is Alana bound and waiting in a very submissive position, she is waiting with a jeweled buttplug in her ass which pleases Francesca greatly. Francesca spanks her pet as a reward for waiting like perfect slut. Alana's legs and ass undulate and thrust towards each of Francesca's blows. Alana is enjoying her spanking so much that she farts her butt plug out while francesca is playing with it. Francesca pops the toys in and out of Alana's ass all the mean while giving her the greatest spanking of her life while farting toys out of her asshole. Francesca wants to test her pet's anal skills out. She is not an experienced Anal slave which is why Francesca is moderately gentle with her but still pushes her limits since that is what the anal slave wants. Francesca fingers Alana's asshole with 5 fingers working her way up to an anal fisting until Alana can take no more. Then Alana takes the 2ft long slink as much as she can into her asshole until she must call mercy to her anal trainer. Francesca the rewards her anal slave in training with her own big beautiful asshole while she face sits Alana and makes her lick and sniff her beautiful butthole. After Francesca cums she rewards her pet with a big anal strap on. She fucks Alana's asshole until its Raw. Francesca pulls, Alana's hair and bondage chest harness so that she can thrust deep into Alana's nearly Virgin Asshole. Once Francesca has had her fun with her slave, she ties her back up and leaves her there until next time.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Francesca Le ",
      "person_id": 36526
    },
    {
      "name": "Alana Cruise ",
      "person_id": 60194
    }
  ],
  "release_date": "2018-03-09",
  "scene_id": 43199,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "bondage",
    "brunette",
    "buttplug",
    "dildo",
    "dominatrix",
    "farts",
    "fisting",
    "gaping",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "lingerie",
    "MILF",
    "prolapse",
    "harness",
    "rope bondage",
    "slave",
    "slink",
    "spanking",
    "straight",
    "strap on"
  ],
  "title": "Alana Cruise is an Anal House Pet"
}