{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "London Rivers wishes for the best sex of her life, and genie Cassie Woods appears magically from a lamp to fulfill her wildest fantasies! Trussed in rope and squirming on the bed, London looks Cassie up and down suspiciously, \"I like girls, but I need dick,\" she purrs, and Cassie gives her a knowing look. Whipping back her flowing skirt to reveal a hard, glistening cock, Cassie is quick to shove her gorgeous dick deep down London's throat, gagging her and making her droll spit all over her ropes. Wet and ready, the devious and beautiful Cassie takes London's other hole - pushing deep and far into London's waiting, hungry cunt as she screams out her pleasure. Cumming over and over again on Cassie - first in cowgirl, then missionary, then in doggy - London confesses to the genie that she's never cum so much, and truly her wish has been fulfilled! But Cassie isn't done with London quite yet! She uses London for her delicately arched feet, moaning as London slides her cock through her foot pussy and sucks on toe after deliciously beautiful toe. London then straps on a long and thick cock, sliding it deep into Cassie's tight little asshole, fucking her into oblivion as Cassie strokes her cock and begs for more! In missionary and doggy, Cassie's wishes are truly coming true as well! In a final, pleasure-driven moan, Cassie shoots her load high onto her own tits, and London leans down for a final kiss from this magic genie.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cassie Woods",
      "person_id": 61005
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2018-03-26",
  "scene_id": 43193,
  "tags": [
    "blowjob",
    "Cock Worship",
    "Feet",
    "role play",
    "straight",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "whipping"
  ],
  "title": "Like Girls But Need Dick? Cassie Woods Grants London's Wish!"
}