{
  "collections": [
    "Device Bondage"
  ],
  "description": "Cadence reached out and said that she need some therapy, and that only The Pope could cure her. She needed it to be rough, but not like usual; a lot rougher than that. We experience this quite often, when the models need to get the devil out and this is the only way they know how to in a healthy way. The cathartic feeling that calms them only comes from a brutal session with The Pope. Cadence begins in a standing position with a burlap sack over her head. Her legs are spread and she is totally helpless. There is not going to be a warm up today because what is going to happen is so brutal that it's a waste of time to do so. Her flesh glows a bright red as it falls under an assault from the leather floggers and whips. She has a maniacal laugh that grounds her, but we know that she is terrified and this is the only response her body will allow in this moment. Next Cadence is in a doggy position with a large bowl in front of her. The Pope enters and fills it with water, then begins the brutality of tormenting her again. This time she is being dunked in between the beatings. She starting to break, but The Pope keeps her right on the edge. In the final scene we have her on a fucking machine and before he even touches her, we see Cadence staring to crack under the pressure. A massive zipper is applied to her flesh and then covered in hot wax. The machine is still sliding in and out of her pussy and the orgasm is powerful on it's own, but ripping the zipper off at the exact moment will ensure extreme suffering. There are lots of tears and even sobbing, but one ting is for sure. Cadence is leaving a lot stronger than she was when she arrived.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    }
  ],
  "release_date": "2018-05-17",
  "scene_id": 43190,
  "tags": [
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Destruction",
    "Domination",
    "Faces Of Pain",
    "Fingering",
    "Handler",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "Straight",
    "Submission",
    "The Pope",
    "Zipper"
  ],
  "title": "The Destruction of Cadence Luxe"
}