{
  "collections": [
    "TS Seduction"
  ],
  "description": "Corbin Dallas is done with the country life and wants to pursue his dreams in the big city. He makes his way by foot after writing a letter explaining where he's gone. Night falls and after a long hike through the country he finds a barn and decides that it would be a good place to rest his head for a while and continue on his journey in the morning. While asleep on a hay bale, Venus Lux struts in wearing daisy dukes and a cowboy hat, carrying a shovel. She bangs the shovel on the ground and wakes Corbin up suddenly and explains to him that this is her barn, and that if he wants to spend the night, he's gotta earn his keep. She makes him lick her cowgirl boots clean. She pulls her hard cock out from her daisy duke shorts and tells him to clean that too. With enthusiasm, Corbin sucks, gags, and chokes on Venus' big cock. She turns around and shoves his face between her ass cheeks and Corbin licks her asshole good and clean. After that, Venus bends Corbin over a table and slides her fat cock into his tight asshole and pounds it deep and hard. She slaps his ass and pinches his nipples then flips him over with his back on the table and his legs spread. She fucks his ass hard until Corbin is begging to cum. Venus tells him he can't cum until she says he can but it feels too good in Corbin's ass and he shoots his load across the room without permission. As a punishment, she scoops up his load and makes him eat it while she continues to pound his ass raw. Venus shoots a huge hot cream pie into Corbin's ass leaving it dripping with her cum.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Venus Lux",
      "person_id": 41417
    },
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    }
  ],
  "release_date": "2018-02-20",
  "scene_id": 43197,
  "tags": [
    "anal",
    "blowjob",
    "Cock Worship",
    "creampie",
    "Male Sub",
    "role play",
    "straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Earn Your Keep: Venus Lux's Country Barn Seduction"
}