{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Miss Jane Judge is a Army Private who is being tested by one of the most Brutal Generals, TS Foxxy. Miss Jane is obedient and submissive today, which is a treat for her fans since she NEVER does submissive work. However, we showed her who her General was going to be and she gladly submitted to TS Foxxy. Foxxy starts her test on Miss Jane by putting her in rope bondage and starting with a tushy cropping and spanking. Miss Jane's Tushy turns pink while Foxxy slaps it. Foxxy steps on Miss Jane's all Natural tits with her black heeled boots then makes Miss Jane lick the booty until it shines. TS foxxy removes her boots and makes miss Jane suck her toes and lick her feet through her fishnet stockings. Once Foxxy sees how tough, Miss Jane is, she moves on to something more powerful than pain, Seduction. TS Foxxy reveals her beautiful she cock which is Miss Jane's true weakness. Miss Jane has the cock so close to her face, she sniffs it and tries to lick it and eventually gives in to its power and envelopes the entire cock into her mouth going balls deep. After TS Foxxy face fucks her young Private, she moves on to pussy fucking. She fucks her Private in doggy style so she can slap her ass and smash her face into the mattress. TS Foxxy puts her big booty on to Miss Janes face, smothers her with her giant ass and fucks her beautiful natural tits. Foxxy gets so turned on by the asshole licking that she cums all over Miss Jane's tits.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "TS Foxxy",
      "person_id": 20055
    },
    {
      "name": "Miss Jane Judge",
      "person_id": 61006
    }
  ],
  "release_date": "2018-03-12",
  "scene_id": 43192,
  "tags": [
    "Blowjob",
    "Bondage",
    "Boot",
    "Cock Worship",
    "Feet",
    "Nylons And Stockings",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Spanking",
    "Straight",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Ts Foxxy Turns Busty Foot Soldier Into Boot Worshipping Slut"
}