{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Summer Vengeance series Tournament on Ultimate Surrender! We have 13 of this season's finest veterans and rookies in a single knockout seeded tournament. Today we have our #12 ranked wrestler, Charlotte Sartre, put against our #6 ranked wrestler, Daisy Ducati. Sartre is a tattooed, dark-haired beauty who started this season with an impressive match against Izamar Gutierrez, scoring several points against our top vet. Daisy Ducati, back for more grappling, attacks little Charlotte right off the bat. The size and skill level difference makes it difficult for Charlotte to gain any ground. Daisy traps Charlotte and fingers her while Charlotte squirms away reluctantly getting finger fucked. It isn't a shut out however, Charlotte gets better and better each round and she gets a feel for her opponent. Charlotte executes beautiful sweeps and reversals and gets Daisy's back and to give her a dose of her own medicine. Charlotte mounts Daisy and makes her take deep french kissing. For the Prize round, our wrestlers take the tournament very seriously. The loser herself concedes and states that losers in tournaments deserve to get fucked in the ass. The winner agrees, and even adds that losers deserve to ONLY get fucked in the ass. The winner bypasses the vagina completely and goes straight for the ass fucking then the ass fisting. The loser is left gaping open wide, wet and broken. Our chamption picks up the defeated, submitting loser and carries her gaping ass off the mats.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    }
  ],
  "release_date": "2018-06-27",
  "scene_id": 43198,
  "tags": [
    "Anal",
    "black hair",
    "bottom",
    "Domination",
    "Facesitting",
    "Fingering",
    "Fisting",
    "Gaping",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Lift And Carry",
    "mixed",
    "natural boobs",
    "Pussy Eating",
    "Redhead",
    "shaped",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Charlotte Sartre vs Daisy Ducati"
}