{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Summer Vengeance series Tournament on Ultimate Surrender! We have 13 of this season’s finest veterans and rookies in a single knockout seeded tournament. Johnny Starlight, ranked #10, is a curvy dark haired beauty who was our intermin Rookie Cup champion this season. Penny Barber, ranked #7, is everyone’s favorite big mouthed MILF with a terrible gift wrap hold that gives ever girl problems. Johnny wants to squash Penny and fist her pussy. Penny wants to hand gag and humiliate the sassy little rookie. Penny Barber bullies our rookie in the first round with her signature hold, the “gift wrap” and is able to hold Johnny down. This frustrates her and get her close to orgasm. Sadly, for Penny her weakness is fingers in the pussy and once that happens, it can be game over for her. Today, that’s exactly what Johnny needs to do. The winner of this match will move on in the tournament which means more money, more fame, and more fans. One girl gets trapped, fingered relentlessly and is utterly broken by the end of the match. The winner has her way with the loser. The winner hand gags, hair pulls, and puts feet in the mouth of the loser and fucks her pussy in brutal fashion.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Johnny Starlight",
      "person_id": 60491
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    }
  ],
  "release_date": "2018-06-13",
  "scene_id": 43196,
  "tags": [
    "Anal",
    "Big Tits",
    "Brunette",
    "Champion",
    "Curvy",
    "Domination",
    "Facesitting",
    "Feet",
    "Fingering",
    "Gag",
    "Hand Gagging",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "MILF",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Penny Barber vs Johnny Starlight"
}