{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Kaisey Dean is a sex slave superstar, the likes of which we have NEVER encountered! We’ve had our share of exceptional BDSM babes pass through our dungeon doors, but few have shown the enthusiasm and love of pain Kaisey does? and this early in her career! Once you see this hot training and rough sex session, you won?t believe this is Kaisey’s first time shooting! We thought she was lying too. This blazing scene begins with Kaisey in bondage shackled to a table with her ankles and wrists bound together so she’s spread open like a turkey waiting for stuffing? and that’s just what Bruno does with an evil fucking machine that hammers Kaisey’s pussy like a jackhammer. He also beats her nipples and clit with a leather crop. Next, Kaisey gets a black Hitachi wand applied to her battered, red clit while the fucking machine drives her insane with ecstasy. Several screaming orgasms later and she?s begging for Master Bruno’s cock! Kaisey gets the dick, but not before giving him a sick deepthroat blowjob and taking a brutal rough g-spot massage and the violet wand. And then she gets fucked!",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Kaisey Dean",
      "person_id": 55766
    }
  ],
  "release_date": "2018-04-05",
  "scene_id": 43191,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Caning",
    "Collar",
    "Crop",
    "Deepthroat",
    "dungeon",
    "Electrical Play",
    "Facefucking",
    "Female Slave",
    "Fingering",
    "Gag",
    "gloves",
    "Hitachi",
    "Latinx",
    "Leather",
    "Leather Belt",
    "Leather Cuffs",
    "Machine Dildo",
    "Male Handler",
    "master",
    "natural boobs",
    "Pain",
    "PIV",
    "Rough Sex",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "Vibrator",
    "Violet Wand",
    "white"
  ],
  "title": "Kaisey Dean Sexual Disgrace Anything Goes"
}