{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "My breasts and wrists were tied with leather cuffs and chains, giving me a full on bondage experience, my master throwing me onto a dirty old mattress. He wanted to tear me apart. He first slid his thick piece of meat down my throat. He ordered me to get it nice and wet as he fingered my pussy, pulling on my g-spot. I’m sure he was testing it out to see if I was ready. I found out soon enough. He tossed me on my hands and knees, ramming his dick deep in me. There was so much spit pouring out of my mouth every time he made me give him a blowjob. I could feel it throbbing. He was relentless. He pounded me in good, holding me down with his rough hands. He fucked me on missionary, doggy and on my side, training his slave to take dick in whatever position. Every time I screamed for more, he would cover my mouth and gave me exactly what I wanted. It was too much to handle at times. I didn’t think I could take such a dick so rough. But I didn’t care. Whatever it took to taste his cum, I’d do it without hesitation. I’ll definitely be waiting for more.",
  "directors": [],
  "models": [
    {
      "name": "Dillion Carter",
      "person_id": 61348
    },
    {
      "name": "James Kickstand",
      "person_id": 48660
    }
  ],
  "release_date": "2018-04-26",
  "scene_id": 43205,
  "tags": [
    "Ball Gag",
    "big dick",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "brunet",
    "Brunette",
    "Chains",
    "Collar",
    "Deepthroat",
    "dungeon",
    "Facefucking",
    "Female Slave",
    "Hand Gagging",
    "Latinx",
    "Leather",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "natural boobs",
    "PIV",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "versatile",
    "white"
  ],
  "title": "Dillion Carter Awaits Slave Training Bound and Gagged"
}