{
  "collections": [
    "Everything Butt"
  ],
  "description": "Kendra Spade and Isabella Nice are potential new members for the Pi Cum Louder Sorority. Today, the house mother is putting these two natural nineteen year olds to the test to see if they can be sisters in the sorority. Since true sisterhood is a group of women who appreciate each other for their strengths as well as their faults, Casey is going to be accepting of the fact that these two girls have no anal experience, limited lesbian experience, and little to no bondage experience. As a matter of fact, today is little Isabella's first time ever doing bondage and only her third time trying anal. Casey's first instruction for these two stunning nineteen year old girls is to have them lez out together for her amusement. Kendra and Isabella are both stunning all-natural brunettes with flawless young skin, long slender legs, tight round butts, and cute natural breasts. Kendra and Isabella really start getting into their instructions. They deep french kiss each other passionately and take each others clothing off until Casey interrupts them and gets the spanking and anal play started. Casey puts Kendra over her knees and starts popping toys into her ass until Kendra is gaping. Kendra and Isabella's gape aren't good enough for Casey, so Casey ties them get up in bondage and uses the speculum on them both to make sure their assholes stay open the way they should stay open. We get a nice look deep into Kendra's pink asshole. Kendra writhes and undulates with pain and pleasure as her asshole is stretched beyond what she knew it could do. Poor little Isabella can barely take the speculum. She takes it one notch wider and asks for mercy. Kendra is then rewarded with some heavy anal strap on fucking while Isabella is also rewarded for pushing her anal limits. Isabella is rewarded with licking Casey's big beautiful gape.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Isabella Nice",
      "person_id": 61113
    },
    {
      "name": "Kendra Spade",
      "person_id": 60694
    }
  ],
  "release_date": "2018-03-23",
  "scene_id": 43200,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Bondage",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gape Capers",
    "Gaping",
    "Lesbian",
    "LezDom",
    "Pain",
    "Rimming",
    "Spanking",
    "Speculum",
    "Straight",
    "Strap On"
  ],
  "title": "Anal Sorority Sisters"
}