{
  "collections": [
    "Infernal Restraints"
  ],
  "description": "Samsara used to be O.T.'s favorite girl to play with, but since he found Sierra Cirque, the only use he has for her is as a place for Sierra to sit or, on her good days, a tool to make Sierra cum. He hogties Sierra with shackles and lays her down on what she at first thinks is a bench, but what turns out to be Samsara, bound to pieces of wood with belts to form a table. What first gives it away is the whining. No matter what Sierra says, she can't get her to shut up so that she can focus on O.T. fingering her wet pussy, so the two of them decide to put that mouth to work.\nO.T. shackles Sierra so that she is sitting with her legs spread and Samsara's face right between them. Then uses Samsara for all she is good for: making Sierra cum when his fingers get tired. She has a bit gag in, so it's a little harder for her to lick Sierra's pussy, but she doesn't have much of a choice. If she can't even do that what's the point of her? After working and working she finally gets Sierra off, making her squirt all over Samsara's face.\nDripping wet with the cum of the girl O.T. has replaced her with, Samsara is then shackled upside down so that Sierra can use her as a chair while O.T. flogs both of their pussies at once and then starts fucking Sierra with a metal pussy hook. He keeps going until she squirts again and O.T. reminds Samsara that she doesn't get to cum anymore. She has lost that privilege. She is completely humiliated and completely useless.",
  "directors": [],
  "models": [
    {
      "name": "Samsara",
      "person_id": 57244
    },
    {
      "name": "SierraCirque",
      "person_id": 57347
    }
  ],
  "release_date": "2018-04-12",
  "scene_id": 43208,
  "tags": [
    "BDSM",
    "Big Natural Tits",
    "bit gag",
    "Bondage",
    "Clothespins",
    "Collar",
    "Destruction",
    "Domination",
    "drool",
    "dungeon",
    "Female Slave",
    "Fingering",
    "Gag",
    "Hitachi",
    "Leather Belt",
    "Leather Cuffs",
    "Male Handler",
    "Metal Bondage",
    "Metal Plug",
    "Pet Play",
    "Piss Play",
    "Fluids",
    "Pussy Eating",
    "Squirting",
    "Stocks",
    "Straight",
    "Submission",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "Vibrator"
  ],
  "title": "Cuckold Cunt"
}