{
  "collections": [
    "Families Tied"
  ],
  "description": "With a sexy young body and an airy sense of entitlement, Chloe Cherry is any Step-Mother's worst nightmare. Whenever Chloe needs some more money, she has no qualms about popping by her Step-Father's house to suck his dick and get another loan. Submissive and sexually curious, this has been a long standing agreement with her and her Daddy/Master Tommy Pistol, but when she rolls up unexpected in a hot little dress looking for some good fucking and a little lipstick money, Tommy is a bit apprehensive- until Cherry gets on her knees and puts her greedy little hands all over his cock without permission. Clearly in need of a submissive training update, Tommy takes her through her paces with intense face fucking, spanking, hard flogging, nipple clamps, and some humiliation. What do bad girls get when they steal orgasms? They get fucked in the ass, bent over on the kitchen floor and used like a little sex doll. Enjoying both her holes Tommy gets close to cumming, but hears the sound of the front door opening and puts his cock away, demanding that Chloe get in her clothes FAST. His new fiance has stopped by - the gorgeous and intimidating Helena Locke. She takes one hard look at Chloe and you know there is going to be trouble for this little blonde minx.\nOnce Tommy has left them alone to get acquainted Helena takes full advantage of the situation, stripping Chloe of her heels and dress, throwing her naked teen body on the floor and making her pick up her clothes while being brutally flogged, zapped, and spanked. Helena stuffs her fist in that sweet young pussy, only to deny Chloe of orgasms. As head bitch and new step-mother Helena will always get her orgasms first, and grinds her pussy on Chloe's face as she flails and screams from her spankings. Having came on Chloe's face, she takes her thoroughly humiliated young miss downstairs to receive further punishment and discipline.\nTommy returns to a comforting domestic scene: Chloe tied down to the Sybian with a full zipper and a service gag holding a perfect scotch just for him. Only problem is, he didn't request this, and it seems his type A submissive bride to be has gotten a little bit ahead of herself. After Chloe apologizes for her misbehavior and shakes like a whore on the Sybian while being flogged, choked, and throat fucked, she has her zippers pulled off and struggles through the most painful orgasm of her life. She's not the only one bound for punishment. Helena is bent over the couch and has her perfect athletic body covered with thick cane stripes for being so presumptuous as to punish Tommy's daughter for him, and assuming a role of dominance in his hierarchy. Fucked and begging for orgasms with a pink cropped pussy and red spanked ass, Helena leads by example, and shows Chloe how to really degrade herself and beg to cum like a slut.The whole new family unit takes a fuck ride on the couch, double stuffing Chloe's pussy and ass, and sucking Daddy's dick real good like a team.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2018-02-16",
  "scene_id": 43203,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blonde",
    "Discipline",
    "domestic",
    "Double Penetration",
    "Family Roleplay",
    "Flogging",
    "Gag",
    "Humiliation",
    "master",
    "Nipple Clamps",
    "Spanking",
    "Straight",
    "Sybian",
    "Zipper"
  ],
  "title": "Gold-Digging Anal Teen Learns the Old Fashioned Way"
}