{
  "collections": [
    "Families Tied"
  ],
  "description": "Elegant and sexually voracious Cherie Deville, and her innocent teen accomplice Summer Day are a formidable strength of female wiles. They are living the good life scamming and black mailing local tech nerds off online dating sites. Cherie sets the trap with, and Summer is bait, playing a virgin teen geek that just wants to try some cock for her first time. Cherie and Summer have been working successfully, taking blackmail payments and ruining men's lives until they tangle with Tommy. Geeky, shy and vulnerable, until he gets in the bedroom and turns into a BDSM rage demon. Cherie invites him over for their fourth date and gets more than she bargained for once he drops a plastic bag over her head, cinches her in tight leather belt bondage, and covers her perfect tits with tight clamps. Intense breath and fear play renders Cherie into a convulsing orgasm machine, begging for more flogging, more dick, more punishment - she's almost sad when the planned fake phone call comes in, calling her into work.\nCherie lays the trap perfectly, leaving Tommy alone with Summer so she can take full advantage of Tommy's blue balls and weakness for hot girls in glasses. Summer lays her nubile body against his hard dick, says her lines, and soon has some hot nerd cock down her throat. Once her huge tits come out the plan is in motion, with her climbing on top of him to grind out a couple orgasms on his dick before Cherie comes storming back in, feigning shock, demanding compensation, and sending Tommy packing. Unfortunate for her and Summer, the dating service has been alerted to their antics and sent out an email profiling their operation to other dating site patrons. Tommy is sick of hot women taking advantage of him and goes right back into the house rental to finish his perfect week end. Taping Cherie's hands behind her back and taping a vibe to her swollen clit, he throws Summer on the floor and beats her ass with her fake chemistry book. Spanking her ass bright red, he decides to shove his geek cock up her ass and make her scream and beg in front of her step mother. Shoving his dirty dick in her mouth, he has her promise Cherie they will have lots of fun this weekend. Tommy's idea of fun is testing Cherie and Summer's familial loyalties to each other with voice activated electro torment, anal sex, fisting, cropping, intense deep throating, pile driver bondage, and making Mommy cum on her lying, cheating daughter's face.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Summer Day",
      "person_id": 59412
    }
  ],
  "release_date": "2018-03-16",
  "scene_id": 43204,
  "tags": [
    "bdsm",
    "bondage",
    "couple",
    "Double Penetration",
    "Family Roleplay",
    "fear play",
    "fisting",
    "flogging",
    "leather",
    "leather belt",
    "spanking",
    "straight"
  ],
  "title": "The Honeypot: Mother Daughter Scam Artists Anally Punished By Tech Nerd"
}