{
  "collections": [
    "Strapon Squad"
  ],
  "description": "We all thought Mistress Riley Ray let her sex kitten Marina Angel go after their last session. We were wrong. Riley kept Marina in a dog cage, wrists chained to the cage, sitting on a sybian fucking machine with a huge dildo pushed through the rails to act as her water dispenser. Is everyone ready for some pet play? Riley starts the session off with the sybian. Marina can't move so she will endure every bit of vibration Riley gives her, teasing her with the control panel. Marina begs to orgasms over and over, soaking the vibration pad. It makes Riley jealous. So she pulls out her favorite dildo, props her leg over the cage, pushes aside her panties and jack hammers her pussy. That makes Mistress Riley Ray squirt all over her hot and kinky pet who laps it all up. The lesbian domination doesn't end there. Riley opens the cage door and leads Marina out, running her hands all over, spanking her ass and tits, leaving hand prints all over. Riley takes the same dildo she used on herself and makes Marina cum a few times with it, making Marina clean it with her mouth, deep down her throat, making Marina gag up more spit. Riley is ready to fuck. She even pumps up Marina's pussy. She slips on her enormous 10\" strapon, spreads Marina's legs and practically wrecks Marina's hole, pounding in every inch. She fucks her rough, deep and hard, on the floor and on top of the cage. Marina loves being used by her Mistress, cumming whenever Riley tells her to, backing up on the rubber dick. Riley leaves Marina trembling. But Riley isn't done with her yet. She pushed Marina back in the cage for more fun later on.",
  "directors": [],
  "models": [
    {
      "name": "Marina Angel",
      "person_id": 55082
    },
    {
      "name": "Riley Reyes",
      "person_id": 55057
    }
  ],
  "release_date": "2018-04-19",
  "scene_id": 43201,
  "tags": [
    "black hair",
    "Blonde",
    "Breast Bondage",
    "Cage",
    "Chains",
    "Collar",
    "Crop",
    "Dildo",
    "Domination",
    "dungeon",
    "Female Slave",
    "Femdom",
    "Gag",
    "Kinky",
    "Latin",
    "Leather",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "masturbation",
    "natural boobs",
    "Pet Play",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Sybian",
    "thirdparty",
    "toned",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Riley Ray Plays with her Caged Pet Marina Angel"
}