{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Wearing a skimpy yellow tank top showing off most of her perfect petite natural tits and also sporting tight white stretch-pants over her round athletic ass, Whitney Wright gets some help from her workout buddies to help with her form. When one thing leads to another, she ends up naked and tied up with rope on her knees, surrounded by five cocks, rock hard and ready to get sucked. They all take turns face fucking Whitney as she tries her best to pleasure them all. In the next scene the fellas tie her wrists to her ankles on her back with her legs spread wide open. They then proceed to take turns fucking her tight pussy with their dicks while she gets her mouth stuffed with more cocks. They flip her over into doggie and continue pounding her pussy one at a time, using her like a sex doll. Next they put her on her back again but this time they all take turns fucking her asshole. The biggest cocks are challenged by the tightness of her hole but with some lube and a good shove, they all get a turn inside. In the following scene, Whitney gets double penetrated in doggie while taking a throat full of cocks. They all rotate taking turns fucking her ass while her pussy is anchored to another dick. In the final scene, Whitney takes cocks in both holes again. She rides on top of a cock in her ass while the others fuck her pussy hard. When the guys are ready to blow their loads they tell her to get on her knees and they all simultaneously shoot five hot loads all over her face and with a big smile on her face she rubs all of their cum into her tits and the rest of her body.",
  "directors": [],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Cyrus King",
      "person_id": 60686
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Whitney Wright",
      "person_id": 61018
    }
  ],
  "release_date": "2018-02-07",
  "scene_id": 43209,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Petite",
    "Role Play",
    "Rough Sex",
    "Straight",
    "top",
    "white"
  ],
  "title": "Whitney Wright Gets Help Stretching Her Holes"
}