{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When a newly widowed mob wife, Raven Hart, gets a visit from her deceased husband's crime partner, Tommy Pistol, she learns the truth about her dead husband: he gambled her away in a poker game. Tommy is ready to collect his fortune which is in the form of Raven's big tits, curvy ass and her wild kinky ways! She can't believe what's happening, that her husband would do such a thing but it doesn't matter cuz\nTommy takes charge, bends her over and gives her a good firm paddling to show her who's boss now. She is wearing thigh high black stockings, a tight black dress hiked up around her hips and no panties. He paddles and spanks her firm ass until its red and stinging.\nTommy ties her up tight and she sucks his hard cock deep into her throat and fits his whole dick and balls in her mouth. He crops her pussy and her tits and tells her he is going to have his way with her all day! Raven is tied up on all fours in doggie with a ball-gag, back arched, ass up high with platform stilettos and a blue rhinestone butt-plug.\nFlogging session to get her warmed up and then Tommy fucks her pussy good until it's ass time. He removes the butt-plug and stuffs his stiff dick deep in her tight ass. He tops it off with the Hitachi on her sensitive clit and fucks both her holes back and forth and she's loving it.\nAfter all that intense action Raven gets on top of Tommy in cowgirl and rides his cock all the way home. Tommy plays with her huge tits while she's grinding on his dick, he grabs her womanly hips and drives his cock deep inside her ass until she comes. She licks his dick clean, flips over with legs spread wide and Tommy goes to town pounding her slutty holes until she squirts everywhere. He slurps it up and rubs her pussy 'til she does it again! They go further into pound town with Raven's tits bouncing around until she is loosing her mind and Tommy shoots his hot load all over her face. And that is the story of The Made Wife. They lived happily ever after.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Raven Hart",
      "person_id": 60671
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2018-03-30",
  "scene_id": 43214,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blowjob",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Flogging",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Nylons Stockings",
    "Paddle",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "top",
    "Vaginal Penetration"
  ],
  "title": "The Made Wife"
}