{
  "collections": [
    "Device Bondage"
  ],
  "description": "\"I remember this day fondly. It was the first time Tana and I worked together, and she made it abundantly clear that she wasn't going to just give it up. If I wanted it, I was going to have to take it,\" said The Pope. Hearing this we all knew that it was going to be an epic shoot, because The Pope is known for taming mouthy sluts like Tana. She smirks at him with every strike of any implement, so he quickly assesses the situation and adjusts accordingly. If she insists on making him earn it, then he will do so. She begins on her back with her hips thrust forward and her legs spread. The Pope begins to poke and prod to find out about what makes her tick, but she proves to be tougher than he thought. He puts clamps on her pussy and spreads it wide; now he has her attention. She seems playful even in pain, so he goes with it and we get a very authentic bondage scenario. Next she is on her knees with her face down and ass up. Her feet get a hearty dose of bastinado, and her luscious ass gets a nice caning. Multiple orgasms are ripped from her juicy wet pussy before moving on to the final scene. Tana is spread eagle on the floor and a zipper is applied to her flesh. Her pussy and other tender parts are zapped with electricity. The vibe is pressed firmly against her pussy and then at the exact moment, it is ripped from her flesh giving her the most intense orgasm of her life. She brags that her cockiness intimidates a lot of men, but it's clear that she is just another toy for him to play with.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Tana Lea",
      "person_id": 61416
    }
  ],
  "release_date": "2018-12-13",
  "scene_id": 43222,
  "tags": [
    "BDSM",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Electrical Play",
    "fake boobs",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "multiple orgasms",
    "Pain",
    "Redhead",
    "Straight",
    "Submission",
    "The Pope",
    "white",
    "Zipper"
  ],
  "title": "Tana Lea Is A Hard Nut to Crack"
}