{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Angel Allwood wants to give her boyfriend a gift for his birthday. He wants to see her get fucked by five strange guys. It didn't take her much time to find 5 hung studs wiling to come to her house and fill all her holes air tight. She waits by her phone in sexy lingerie, masturbating to the thought of five cocks destroying all her holes. Her phone rings and she tells the guys that the door is open. In walk five guys who immediately drop their pants and whip out their hard cocks and Angel gets face-fucked by everybody. Then the guys strip her naked and tie her up in rope bondage with her hands bound behind her back and put two zippers of clothespins on her big beautiful tits. They continue having their way with her mouth and she does her best to please them all. In the next scene Angel is suspended in bondage with her legs in the air with a plethora of rope. All five guys take turns fucking Angel's tight pussy while the others use her mouth to pleasure their cocks. Next they take her down from being suspended and position her on her knees with her big beautiful round ass popped out and she takes all of their dicks in her ass. All five guys pound her ass deep and hard. They flip her over and give her a vibrator and she cums hard with a huge dick pounding her ass some more. She asks to be double-penetrated and they reposition her to accommodate her request. Angel gets fucked in her ass and pussy at the same time while she sucks off the others. Finally after getting DP'd, the guys tell her to get on her knees and give Angel five cocks worth of cum all over her face.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Angel Allwood",
      "person_id": 52348
    },
    {
      "name": "Cyrus King",
      "person_id": 60686
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Ray Black",
      "person_id": 60687
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2018-02-21",
  "scene_id": 43229,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Curvy",
    "Double Penetration",
    "fake boobs",
    "Gangbang",
    "Lingerie",
    "mixed",
    "muscular",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Tattoo",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Angel Allwood Fucks Five Strangers"
}