{
  "collections": [
    "BLEU"
  ],
  "description": "A young woman innocently skips down a back alleyway only to stumble upon a curious scene in an upstairs window. Her curiosity is piqued and she just can't help but investigate further. Hidden behind a banister, she spies two lesbian lovers in the midst of their steamy affection for one another. She knows to look away but is too engrossed by the scene before her.\nAs she continues to spy her innocence turns into the forbidden and awakens a desire in her that she can't quite put a finger on, and her hand begins to touch parts of her she's been told not to. Her mind wanders as she's absorbed in these new desires. So much so that suddenly she is abruptly discovered by the lovers and her hiding place is compromised. They drag their captive into their world and deliver to her a first-hand, merciless experience of their own passion. They sexually dominate the young submissive, making her experience sublime pleasures again and again.\nLittle Hot Riding Hood knows she should not be there, that she should grab her clothes and run in fear! But, as the lovers continue their manipulations upon her - their newly discovered sex toy, she can't help but to stay and learn far more than she ever hoped.",
  "directors": [],
  "models": [
    {
      "name": "Carly",
      "person_id": 186
    },
    {
      "name": "Mina Meow",
      "person_id": 20519
    },
    {
      "name": "Varla Vex",
      "person_id": 61040
    }
  ],
  "release_date": "2018-04-02",
  "scene_id": 43225,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Brunette",
    "Chains",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Femdom",
    "Fingering",
    "Fishnets",
    "gloves",
    "High Heels",
    "Hood",
    "Leather Belt",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Nylons Stockings",
    "Pussy Eating",
    "Redhead",
    "Spanking",
    "Sploshing",
    "Straight",
    "Strap On",
    "Tag Team",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration"
  ],
  "title": "Little Hot Riding Hood: Chapter Two"
}