{
  "collections": [
    "Everything Butt"
  ],
  "description": "The gorgeous Savannah Fox takes out her two foxy MILF butt sluts to play! Dark haired Penny Barber is so glad to be out of her cage, and super blonde London River is eager to get fucked. First Savannah must make sure each ass is tender. She spanks her toys' asses and takes a deep whiff. She uses Penny's mouth to warm up London's asshole and when Penny gets mouthy, she shoves her head right in between London's cheeks. Then London gets to lick and smell Penny's delicious asshole. Once these two sluts are all warmed up, Savannah breaks out the toys! She starts with the fat, cold stainless steel double ended dildo. She teases Penny with it before plunging it in London's greedy asshole. For Penny's asshole, Savannah chooses a glass corn on the cob dildo. Penny squirms as the cold toy gets pushed slowly in and out of her asshole. These hungry slutholes are aching for more and Savannah knows just how to satisfy them. She has London hold Penny's legs open as she slides her fist right into Penny's ass. Penny screams as the fist slowly sinks into her ass and tries to squirm away, but is unable to escape and made to orgasm on Savannah's fist. Then Penny holds London's legs open as Savannah pushes her fist into London's slutty asshole. Once the fist is in, London can't stop cumming as Savannah fist-fucks her hole. As a reward for being so good, London gets stuffed with Penny's fat cock. London moans as her ass is fucked and Savannah is so turned on, she starts masturbating and fucking her own asshole. The more London screams, the more aroused Savannah is. She squirts all over London, covering her dirty sluts in cum.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Savannah Fox",
      "person_id": 47440
    }
  ],
  "release_date": "2018-04-06",
  "scene_id": 43237,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Cage",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Lesbian",
    "LezDom",
    "MILF",
    "natural boobs",
    "Prolapse",
    "Redhead",
    "shaved",
    "Straight",
    "Strap On",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "2 Butt sluts get Fisted & Fucked"
}