{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Blonde, giant tits, big booty, and completely submissive; London River is the kind of wanton whore that can never be satisfied. If she isn't whimpering on the floor licking the boots of sadistic male dom she can't be happy. Her giddy excitement at the prospect of being fucked and bound with inescapable rope bondage and brutal sex makes her flustered and unable to answer the questions her male handler presents to her. But as soon as a massive cock is shoved into her mouth she warms up suddenly feels satiated and comfortable. Her taskmaster works over her massive boobs and thighs with a heavy single tailed whip. She flinches and yelps as each smack from the impact play shakes her entire body. She begs to cum as she made to pull metal clover clamps off her erect and perky nipples. But the male dom loves to deny his submissive female sex slaves their depraved desire to have multiple orgasms and tells his hungry whore, \"no.\" Next she gets tied in a full suspension that leaves her hungry whore holes vulnerable and exposed to the terror of sadistic hands. While being choked and throttled, a huge dick thrusts in and out of her teeny pink pussy. Gasping for air and lost in subspace, she quivers from the first of her many orgasms. She is then immediately tied on her hands and knees with her perfect ass pointed straight up in the air. The entire back side of body gets abused and devastated with wooden cane that leaves long and thick welts on her ass and thighs that glow bright red. As she weeps and begs for mercy from the corporal punishment, she gets fucked ruthlessly from behind. Tired and broken, she is then tied with her feet behind her head and her arms trapped behind her back. She finds herself completely helpless, vulnerable, and exposed. The sadistic dom wastes no time and begins to fuck the shit out of her once again. She cums again and again until she has no idea where she is or what she is doing. And in this helpless state she gets showered by a massive load of jizz that drips and pools all over her used up body.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2018-08-01",
  "scene_id": 43239,
  "tags": [
    "bdsm",
    "blonde",
    "blowjob",
    "bondage",
    "clover clamps",
    "Corporal Punishment",
    "domination",
    "Feet",
    "Handler",
    "humiliation",
    "Male Handler",
    "MILF",
    "multiple orgasms",
    "pain",
    "pain slut",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "suspension",
    "thirdparty",
    "Vaginal Penetration"
  ],
  "title": "Pain Slut MILF London River Brutalized with Rough Sex and Rope Bondage"
}