{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Summer Vengeance series Tournament on Ultimate Surrender! We have 13 of this season's finest veterans and rookies in a single knockout seeded tournament. Jasmeen LeFleur, ranked #9, is a tattooed, dark haired beauty who started this season with an impressive match against our muscle goddess Brandi Mae. Bella Rossi, ranked #8, is a little disappointed to be ranked in the mid level wrestler area but is more than happy to kick everyone's ass to show the world what's she's all about. Jasmeen has been training privately and looks more ripped than ever with solid and beautiful muscle. Bella too has been training but she's been doing something a little bit different. She's been domming on Whipped Ass and other Femdom sites, whipping girls into shape and making them cum on her command. Jasmeen shows some explosive power today in this showdown. She gets trapped and fingered but is able to explode out of the positions and gain control. This is a hard fought battle for both girls but at the end of the day, only one can move on in the tournament. The winner fucks the loser's pussy and ass ruthlessly. No mercy, all holes taken! The champion then makes the loser worship her muscles, lick her sweaty armpits, and eat her pussy. She then facesits the defeated grappler and rides her face to orgasm!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Jasmeen LeFleur",
      "person_id": 59623
    }
  ],
  "release_date": "2018-06-06",
  "scene_id": 43233,
  "tags": [
    "Anal",
    "Champion",
    "Domination",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Muscle",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Penetration",
    "Whipping",
    "Wrestling"
  ],
  "title": "Jasmeen LeFleur vs Bella Rossi"
}