{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Arielle Aquinas is a strong willed prisoner of war. She refuses to give in to the demands of her tall, beautiful, busty captor, Chelsea Marie. Chelsea is determined to break her prisoner and she’s going to do whatever it takes to make this little slut submit. Arielle is tied in rope bondage to make sure she doesn’t try to do anything funny and to make sure she HAS to take all the punishment that Chelsea is going to dish out. Chelsea wants to really get into Arielle’s head so she’s going to have Arielle suck cock and get fucked so hard that Arielle become compliant. Chelsea whips out her big cock and face fucks Arielle while Arielle squirms in her tight rope bondage. Arielle is so reluctant about sucking the cock she begs Chelsea to stop but Chelsea keeps going, warning Arielle all along that soon she is going to be fucked. Chelsea lives up to her promises and fucks little Arielle’s tight pink pussy. Chelsea pounds on Arielle’s pussy, slamming her rock hard cock into Arielle’s wet cunt. As Arielle become more compliant, Chelsea takes her out of her bondage, gets her into doggy position and slams her pussy more with throbbing cock. Chelsea builds up to orgasms and pops a big hot load onto Arielle’s puckered butthole. Chelsea sucks up her own seed and drools all over her freshly fucked slave’s asshole.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Arielle Aquinas",
      "person_id": 59748
    },
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    }
  ],
  "release_date": "2018-04-23",
  "scene_id": 43232,
  "tags": [
    "Blonde",
    "Blowjob",
    "Bondage",
    "Cock Worship",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Chelsea Marie Pounds Strong-Willed Arielle Aquinas Into Submission"
}