{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Summer Vengeance series Tournament on Ultimate Surrender! We have 13 of this season's finest veterans and rookies in a single knockout seeded tournament. Today we have our #4 ranked wrestler Cheyenne Jewel, put against our #5 ranked wrestler Savannah Fox. Savannah is a tattooed, blonde-haired beauty who started this season with impressive matches against some of our elite wrestlers. Cheyenne is is a fit and agile wrangler who has proven herself over. Once the arm wrestling starts, we can see why these girls were ranked so closely. The first round puts Savannah in trouble. She has no answer for Cheyennes brute strength. Cheyenne's muscles seem to be too much for the flexible Savannah. In Rounds 2 and 3, Savannah makes a huge come back. She's able to get control and really capitalize on her positions. She scores more points while having control. She does a lot of deep kissing and fingering. This match comes down to the final seconds. It's a nail biting sex fight. The score difference between these two warriors is 1 points. The loser is utterly broken and humiliated. The winner drags the loser into the locker room to show all the other girls who might be getting dressed in there, what happens to losers who don't have enough heart to fight hard enough and who lose by one fucking point. The loser fucks the winner's face, pussy and asshole. Losers should be fucked in the ass, and that's exactly what happens. The winner makes the loser lick her sweaty armpits while the winner flexes her muscles. The loser is left in a puddle of shame in the locker room.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Savannah Fox",
      "person_id": 47440
    }
  ],
  "release_date": "2018-08-01",
  "scene_id": 43235,
  "tags": [
    "Anal",
    "Blonde",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "sex fight",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Savannah Fox vs Cheyenne Jewel"
}