{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Summer Vengeance series Tournament on Ultimate Surrender! We have 13 of this season’s finest veterans and rookies in a single knockout seeded tournament. Today we have our #7 ranked wrestler, Penny Barber, put against our #1 ranked wrestler, Mistress Kara. Penny is a curvy, big-titted, big-assed, brunette MILF who is known for cumming on the mats. Her wrestling skills is honed but her compulsive lust on the mats have lost her many fights. This is why she is ranked #7. Kara “The Queen” was originally ranked #2 behind Ariel X but Ariel has had to pull out of the tournament due to injury. Dee Williams will take Ariel’s place. Kara will be bumped to #1 ranking, Dee Williams will default to #2 ranking. Kara is the Queen for a reason.. She easily dominates her opponents and makes them call her Daddy. Right of the bat, Penny is able to secure a Head Scissor and it puts Kara into trouble. Penny takes the lead in the beginning of the match and this mentally effects both wrestlers. Kara tries to come back in full force but is it enough to win her this match? Kara knows she promised to give up anal if she lost on Ultimate Surrender again, so there is a lot on the line here today! These girls give it everything they’ve got but only one can move on. The winner drags the loser into the locker room. Loser is fisted in the pussy and fucked in the ass. She is then humiliated and made to concede her loss: she’s out of the tournament and the chamption moves on to the next victim!",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    }
  ],
  "release_date": "2018-07-11",
  "scene_id": 43236,
  "tags": [
    "Anal",
    "Brunette",
    "Curvy",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "MILF",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "shaped",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Penny Barber vs Mistress Kara"
}