{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Savannah Fox returns to her Physical Therapist Dr. Nina Lawless to continue her treatment for a recovering knee injury. After a few stretches, Dr. Lawless assesses that for a full recovery it would require a lot more time and money. Savannah being tight on funds asks if there is any other way she could pay the bill, and before she could even finish her sentence, Dr.Nina had already pulled out her super hard cock and started moving it towards Savannah’s mouth as Savannah lay there on the examination table. Savannah sucks and deep throats her big cock getting it drenched in her spit. They both get completely naked and Nina has Savannah get on her back and ties up her legs and arms with resistance bands. Nina beats her legs and feet with a stick to break up the knots in Savannah’s muscles then places a vibrator on her pussy. Nina then gets so turned on fucking Savannah’s feet that her cock can’t help but leak pre-cum. Nina climbs on top of Savannah’s bound body and slowly licks Savannah’s armpits before having her way with her mouth, shoving her dick down Savannah’s throat and fucking her eager mouth. Nina then positions herself over Savannah’s face and gets her asshole and taint licked and sucked. Nina frees Savannah’s legs and lifts them over her head and Nina licks Savannah’s asshole getting it ready for her cock. Nina slides her stiff cock into Savannah’s asshole and fucks it deep and sensually leaving it gaping open. Nina then has Savannah get on top of her and shoves Nina’s cock back in her ass once again and twerks her ass with Nina’a cock still buried in it. Nina regains control once again and has Savannah get on her hands and knees and slides her hard cock in and out of her gaping asshole, then pounds her ass until she cums all over Savannah’s back.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Nina Lawless",
      "person_id": 52751
    },
    {
      "name": "Savannah Fox",
      "person_id": 47440
    }
  ],
  "release_date": "2018-04-09",
  "scene_id": 43231,
  "tags": [
    "Anal",
    "black hair",
    "Blowjob",
    "bottom",
    "Cock Worship",
    "fake boobs",
    "Feet",
    "Gaping",
    "natural boobs",
    "Redhead",
    "Role Play",
    "shaved",
    "spit",
    "Straight",
    "Tattoo",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Lawless Anal Therapy"
}