{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Summer Vengeance series Tournament on Ultimate Surrender! We have 13 of this season's finest veterans and rookies in a single knockout seeded tournament. Today we have our #6 ranked wrestler Daisy Ducati, put against our #3 ranked wrestler, Izamar Gutierrez. Daisy is a tattooed, red-haired beauty who started this season with impressive matches against some of our most orgasmic rookies. Daisy has been easily ripping orgasms out of her opponents left and right and today is not different than any other match she's been in. She makes her opponent cum HARD. Izamar is a little disappointed to be ranked 3rd behind Dee Williams so she is going to have to just prove the world she's better than the rankings say she is. Today these girls fight hard and fast. They slam each other, pin each other, finger each other, and lick each other out. The sexual tension is thick between these two girls. They both desperately want to make each other cum and move on in the tournament. This match seems like it's going to be lopsided however a couple of orgasms on the mat has the score catch up fast and one of the wrestlers looks like she's going to fall behind and lose. This is 100% true SEX FIGHTING at it's finest. You gotta see this one to believe it! Shocking ending, shocking outcome, and shocking punishment for the loser. Our champion terrorizes the loser with orgasms and a vaginal fisting, then fucks the loser into submission. The winner of this match moves on to face Mistress Kara.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    }
  ],
  "release_date": "2018-07-25",
  "scene_id": 43234,
  "tags": [
    "Anal",
    "Champion",
    "Couple",
    "Domination",
    "Facesitting",
    "Fingering",
    "Fisting",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Fisting",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Izamar Gutierrez vs Daisy Ducati"
}