{
  "collections": [
    "Everything Butt"
  ],
  "description": "Charlotte Sartre is a very disobedient inmate at the all women’s prison. She’s been keistering anal toys and copulating with the other female prisoners. The Butthole Prison has brought attention to the Warden on this issue. Anal Warden, Dee Williams is a no nonsense busty MILF who has been known for doing extraordinarily cruel and unusual things to her female inmates. Charlotte denies she’s done anything wrong and seems to think she can prove her innocence by NOT being able to fit any toys into her “tight ass”. If the anal toys don’t fit, you must acquit. Unfortunately for anal hungry Charlotte, try as hard as she can to keep her asshole tight, it just wants to stay open and suck up everything in its path. You could drive a truck through Charlotte’s loose butthole. Dee starts with a nice firm over the knee spanking. Charlotte’s tushy turns bright red and she writhes with pain and pleasure. The spanking isn’t enough punishment, so Dee starts fingering and plugging Charlotte’s asshole with toys. Charlotte’s ass starts gaping wide open and Dee knows right away that she has caught her Anal Toy Smuggler and needs to administer a full anal examination. Dee then has to check the entire asshole so she performs a body cavity search putting her entire fist into Charlotte’s ass. Determined to understand how Charlottes has been getting all these toys past the prison inspections, Dee has Charlotte demonstrate how she was able to stretch her ass out for keistering. Charlotte puts a giant red butt plug in Dee’s asshole so that Dee can see how easy it is to hide things in buttholes. After learning how Charlotte is doing her bad deeds, Dee must perform one last punishment, She straps on a huge anal dildo and strap on fucks her poor, powerless inmate, leaving her asshole gaping wide open.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2018-04-20",
  "scene_id": 43238,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Big Tits",
    "black hair",
    "Blonde",
    "bottom",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Fingering",
    "Gaping",
    "Lesbian",
    "LezDom",
    "MILF",
    "natural boobs",
    "Pain",
    "Prolapse",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Butthole Prison: Dee Williams Locks Up Charlotte Sartre for Anal Fraud"
}