{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Chloe Cherry endures the brutality of newcomer Donnie Rock and his cool, sinister sadism, suffering through 4 bondage positions with flogging, cropping, spanking and nipple clamps. She starts, willingly bound to a post by the neck and wrists, with her legs locked to the floor. Donnie manhandles her, toying with her, then striking a deal with her… he’ll let her breathe if she takes the whip! She agrees, and so he releases the rope around her neck and in exchange he flogs her, still locked to the floor and the post. He then clamps her incredibly sensitive nipples and face fucks her until the spit is running down her body. Fully uses, she’s left there to wallow in her own drool. Next she’s gagged, tied up face-down on a table with her ass up. Donnie takes full advantage of her in this position, fucking her pussy with pure, selfish intent and slapping her ass to keep her propped up. Chloe’s then put in a partial suspension, fully horizontal with only one foot touching the ground. A heavy bucket is suspended from her nipples by two clothes pins, while her pussy’s cropped and slapped, then fucked again! Finally, Chloe is bound to a fuck box on her back, with her legs spread while Donnie fucks her and threatens her with a zapper. He ultimately makes her cum on his cock while he’s fucking her wet, desperate cunt, then blows his load all over her gagged face, demanding that she lick it all off.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Donnie Rock",
      "person_id": 61078
    }
  ],
  "release_date": "2018-05-09",
  "scene_id": 43240,
  "tags": [
    "Amazing Orgasms",
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "drool",
    "Flogging",
    "Humiliation",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Sadism",
    "Slapping",
    "slim",
    "Spanking",
    "Straight",
    "Sub",
    "Submission",
    "Suspension",
    "Partner Studio",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "The Stinging Torment of Chloe Cherry"
}