{
  "collections": [
    "SW Nude"
  ],
  "description": "In a great Dream Set we have Rado Zuska paired with Martin Porter for a wrestling match. They both announce themselves as they strip naked, showing off two perfect bodies. Each seems to be ready for a hard match, as they bounce on their toes, getting ready to start. As the match starts they are quickly on the mats, bodies entwined and rolling all over the place as each tries to gain a good hold. The cocks flail around as the guys wrestle. The first round ends as Rado gains a good neck hold on Martin. As Martin tries to gain a hold Rado's sexy ass is on show, the cheeks quite wide apart. Each guy's muscles are straining as they fight. It take a while but Martin prevails in round two. As a celebration he waves his dick in Rado's face. The exertions of round two affect Martin who quickly submits in the third. Rado returns the favor waving his cock at Martin. For the next round it is Martin who gets a great arm hold to get a quick submission. As the rounds progress things get dirty with Rado suffering some heavy ball squeezing to make him submit. Things get very rough as the match progresses, and as Rado takes a good lead. He brandishes the score cards at Martin. We also get some great shots of Martin's big, sexy ass, as Rado gets yet another submission, in round 14. Rado tries a face squeezing but doesn't succeed, so he moves to a great neck hold and Martin submits again. Still the guys wave their cocks as they win rounds, with Rado victorious and getting very cocky about it. He throws Martin to the floor and stands over him, flexing his muscles, after a great match. Rado does this by getting Martin sucking on his big cock. It doesn't take Martin long to get that cock rock hard and throbbing as his hot mouth works all over it. Rado fucks the dick deep into that eager mouth, with Martin sucking and lick all over it. His tongue laps at Rado's tight balls too and then he offers up his hot ass as well. Rado is ready for it and rams his awesome cock deep into the hole, fucking it nice and deep. His thick cock stretches the hole and goes in all the way, with Martin's cock rock hard as he feels his ass being taken. He loves the feeling of that cock in his ass and grabs hold of his own dick to wank it. Then Rado sits on the floor and Martin slides his hot ass down over that throbbing cock, riding up and down on the thick shaft. As he rides that dick Martin wanks his own cock hard and fast. His ass bounces on the cock, slamming down onto Rado's balls as he does so. His wanking speeds up even faster as he keeps working is ass over Rado's cock. As he wanks himself Martin's cock squirts a big cumshot up over his hot body, while his ass is still filled with Rado's dick. Rado fucks up into that sexy ass, working the hole real well. To go even deeper he moves Martin onto the mats and fucks him missionary style. Then Rado pulls out and dumps his hot cum all over Martin's balls. Martin goes off to get some drinks so the two of them can relax and enjoy a refreshing drink before going off to the shower to clean up. Once in the shower they wash all the cum and sweat off and Rado takes the chance to release his fluids right at the end of a great scene.",
  "directors": [],
  "models": [
    {
      "name": "Martin Porter",
      "person_id": 61060
    },
    {
      "name": "Rado Zuska",
      "person_id": 61061
    }
  ],
  "release_date": "2018-02-23",
  "scene_id": 43247,
  "tags": [
    "Anal",
    "Bareback",
    "Blowjob",
    "Gay",
    "Handjob",
    "leg scissors",
    "Muscle",
    "Pain",
    "Piss Play",
    "Fluids",
    "Spanking",
    "Submission",
    "Tattoo",
    "thirdparty",
    "Uncircumcised",
    "Wrestling"
  ],
  "title": "Rado vs Martin - WRESTLING"
}