{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "It's a test of lust and endurance for Carmen Caliente, who's bound, gagged and fucked relentlessly by Derrick Pierce. Carmen is in rope bondage the entire time, with barely a moment to rest. First she's partially suspended from the ceiling, with one foot tied to her neck by a tether, so if she wants to stand, she has to do it on the other foot. Derrick uses her in this position to flog her and finger fuck her, using her pussy and getting her off, then face fucking her. He then turns her around and slams her wet cunt with his hard cock. She's then tied to the floor with her pussy and ass straight up, total access for Derrick to torment and fuck. He crops her hungry fucking cunt, then uses a vibe on her before driving his hard cock into her. He then face fucks her before sliding his wet cock back into her pussy and fucking her again. Carmen cums over and over in this position, unable to do a damn thing about it. Carmen's then put in a full suspension, with her hands tied behind her back and he legs spread. Derrick takes full advantage, slamming her desperate pussy then face fucking her. Ultimately Carmen is tied to a fuck bench, with her legs fully spread, a ball gag in her mouth, and nipple clamps tormenting her nipples. She drools all over herself as Derrick uses her, making her cum repeatedly as he fucks her and uses a vibe on her simultaneously. He shoots his load all over her, and leaves her a blubbering, cum soaked mess.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Carmen Caliente",
      "person_id": 54927
    }
  ],
  "release_date": "2018-05-03",
  "scene_id": 43241,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Best Bound Breasts",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Humiliation",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Sub",
    "Submission",
    "Suspension",
    "thirdparty",
    "Vaginal Penetration"
  ],
  "title": "Carmen Caliente Does It All For Dick"
}