{
  "collections": [
    "SW Nude"
  ],
  "description": "We just had to get newcomer Ben Mondo in for a wrestling match. This guy has been such a bit hit with members, so we did everything to persuade him in,and paired him up with Tomas Melus. Tomas is very hot too, they look very evenly matched as they help each other warm up. Then the match starts, with Ben in the dark trunks soon struggling to free himself from Tomas' strong hold. He doesn't manage it though, and has to submit. Then the guys remove the underwear and are straight back into the match. Their muscled bodies look so good as they grapple, moving all over the mats, trying to get a hold on each other. Ben comes up with the winning hold in the second round, to level the score. But his success is short lived as Tomas quickly has him under control, getting another submission. The guys really do try hard to get a grip on each other, which allows us some great views of asses, spreading naturally, and cocks flailing around, as they strain against each other's efforts. Tomas proves himself to be a very good wrestler, as he builds a commanding lead over Ben. Each of them builds up a hot sweat as they roll all over the floor, bodies closely entwined. Ben needs to quickly do something to gain some ground and he gets his second point, after grabbing Tomas' balls. Tomas returns the favour, tugging on Ben's nuts, to restore his lead. It seems that is the way to get a quick submission and Ben resorts to it again. at 8-3 they take a breather, to oil each others' sweaty body. Then it is on with the match, which Tomas quickly wins 10-3. After the victory they settle down for a wank off, getting their cocks good and hard. They take a turn at wanking each other for a while. Then wanking themselves again Ben is the first to shoot a nice big load. Tomas keeps wanking and his cum squirts all over the place. The guys then go to the shower and help each other get rid of all that sweat and oil.",
  "directors": [],
  "models": [
    {
      "name": "Ben Mondo",
      "person_id": 61057
    },
    {
      "name": "Tomas Melus",
      "person_id": 61058
    }
  ],
  "release_date": "2018-02-26",
  "scene_id": 43248,
  "tags": [
    "body builder",
    "brunet",
    "foreskin",
    "Gay",
    "Handjob",
    "leg scissors",
    "masturbation",
    "Muscle",
    "Straight",
    "Submission",
    "Tattoo",
    "thirdparty",
    "Uncircumcised",
    "white",
    "Wrestling"
  ],
  "title": "Tomas vs Ben - WRESTLING"
}