{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "The beautiful Britney Amber is looking cute in her pretty flower dress while she sets up for a Tupperware party before her guests arrive. When five burly guys show up, they immediately seem disinterested in the Tupperware and turn her party into their party. They grab at her big tits and lift her skirt and although at first reluctant, Amber gives in and lets them have their way. They collectively tear off her dress in seconds, leaving her completely naked. She gets to her knees and they pull out their big hard cocks for her to suck. They all take a turn fucking her face while her two free hands jerk off the other cocks. One of the guys pulls out some rope and ties her arms behind her back and they continue taking turns shoving their dicks down her throat. They then bend her over a table and get in line to fuck her tight pussy while she sucks off the others. In the next scene Britney is naked on her back with her legs and wrists tied up with a plethora of rope and now they want to fuck her ass. They take turns pounding her ass and pussy back and forth deep and hard while she sucks off the others. In the final scene, Britney is nearly torn in half by getting double penetrated by two huge cocks while in rope bondage. With a mouth full of cock, Britney screams and moans as she gets both her pussy and ass stuffed. They take turns pounding her ass hard from the back while her pussy is anchored to another cock. One of the guys stands up, carrying Britney with his dick still buried in her pussy. The other guys line up and one by one they come from behind and shove their dicks back in her ass for some more DP action. Finally on her back, they double penetrate her one more time until both her holes are wrecked and leave her covered in cum.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Britney Amber",
      "person_id": 57340
    },
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Ray Black",
      "person_id": 60687
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2018-03-07",
  "scene_id": 43245,
  "tags": [
    "Airtight",
    "Anal",
    "BDSM",
    "bestof2018",
    "Big Tits",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight"
  ],
  "title": "Tupperware Party, Britney Amber Gets Stuffed Air Tight "
}