{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Maya Kendrick just wants to get out of her cage, and she says she’ll do anything to make that happen, even take five hard cocks in every hole. So the guys let her out, and immediately cash in. She chokes down every big cock like a woman on a mission, serving the guys the way they demand. When the time comes to fill her other holes, she puts them up willingly, sucking cock at the same time she’s getting her slutty pussy slammed. The guys tie her up in two different suspensions, and she takes their rock hard dicks in both, as she’s twisted up in the rope, fully immobile, plowed and choked with cock in her ass and pussy. They let her down but keep her tied as they fill her airtight, double penetrating her pussy and ass while sliding cock down her throat. She cums multiple times during the DP, losing her head as the guys drill her repeatedly. Finally, she begs for their cum, and the shoot it all over her innocent face and into her mouth. In a final humiliation, she’s put back in her cage, where gets the last huge load.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Ray Black",
      "person_id": 60687
    }
  ],
  "release_date": "2018-03-21",
  "scene_id": 43246,
  "tags": [
    "Airtight",
    "Airtight Playlist",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Cage",
    "Corporal Punishment",
    "Curvy",
    "Double Penetration",
    "Gangbang",
    "Humiliation",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rough Sex",
    "Straight",
    "Stud",
    "top",
    "white"
  ],
  "title": "Sweet Maya Kendrick Gets Every Hole Slammed Deep And Hard In Bondage"
}