{
  "collections": [
    "SW Nude"
  ],
  "description": "Jindra Durak and Marek Borek had a very good wrestling match, and a quick reprise of it see Marek gain a very good victory. Then, as Jindra holds Marek's arm aloft, to recognize his victory the two of them begin to kiss. They look so good as their hot, sweaty bodies are in close, naked contact. Their cocks are hard, as Jindra wanks them both together. Then Marek takes hold of Jindra's in his hand and they wank each other. Jindra drops to his knees and takes Marek's throbbing cock into his mouth. He sucks on the cock and licks Marek's tight balls. Marek fucks his cock deep into Jindra's mouth. Jindra wanks himself as he sucks on that big cock. His head bobs on Marek's dick, his mouth stretched wide as he takes the fat dick as deep as he can. Marek pushes Jindra's head onto the cock and really fucks his face. Marek goes onto his knees as well and pushes Jindra onto his back, leaning over him. He kisses Jindra some more as he lays between his legs. Then Marek sucks on Jindra's rock hard cock, doing a great job of it too. After kissing again they move to a 69, with Marek on top. They suck each other with both cocks so very hard. Jindra then stands and bends over, offering up his hot ass. Marek quickly has his dick deep inside that hot hole. He fucks Jindra's ass hard and fast, going as deep as he can. Jindra wanks himself as Marek pounds away at his hole. Jindra's cock stays so hard as Marek fucks him deep. He drops onto his knees, and Marek continues to fuck him from behind. That ass gets worked so well, with that big dick deep inside. They move to spoon position with Jindra wanking hard and Marek fucking deep. As Marek's dick works that hot hole Jindra continues wanking himself and soon shoots a nice sticky load of cum over his belly. Jindra continues to fuck that sexy ass until he is ready to cum too. Then he pulls out and scoots up to Jindra's face and wanks himself as he cums too. Jindra sucks on the spent cock before the two of them go off to the shower to help each other clean up. [Note: The spoken language in this film is Czech]",
  "directors": [],
  "models": [
    {
      "name": "Jindra Durak",
      "person_id": 60751
    },
    {
      "name": "Marek Borek",
      "person_id": 60755
    }
  ],
  "release_date": "2018-02-22",
  "scene_id": 43242,
  "tags": [
    "69 Position",
    "Anal",
    "Athletic",
    "big dick",
    "blond",
    "Blowjob",
    "brunet",
    "CBT",
    "Choking",
    "Domination",
    "Facesitting",
    "foreskin",
    "Gay",
    "Humiliation",
    "Jockstrap",
    "leg scissors",
    "masturbation",
    "Muscle",
    "muscular",
    "Oral Sex",
    "Pain",
    "Rimming",
    "Submission",
    "Swallow",
    "Tattoo",
    "thirdparty",
    "top",
    "Uncircumcised",
    "white",
    "Wrestling"
  ],
  "title": "Jindra vs Marek - WRESTLING"
}