{
  "collections": [
    "SW Nude"
  ],
  "description": "After a hard fought match, in which Arny Donan was victorious he and Roco Moric are very horny and decide to have some further action. They stand, face to face, rubbing each other's sweaty bodies, as they kiss. They both get hard as they enjoy the kisses and Arny grabs Roco's cock and wanks it. Roco takes hold of Arny's too, but only briefly, as Arny drops to his knees and starts to suck. His mouth works over Roco's stiff cock and bobs up and down on it. He wanks the throbbing cock too as Roco's balls get very tight. Roco moans, breathing heavily as Arny really does a great job of sucking on that cock. He looks up into Roco's eyes as he comes off the cock and licks up and down the shaft. Roco lays on the floor and Arny positions himself so they can suck each other. Both cocks are good and hard as they suck. Then Arny lays down so that Roco can really work on that dick. His mouth wraps tight around the head, taking it deep into his throat. Then they sit up and kiss, before Arny turns and shows his ass, for Roco to fuck him. He moans as he takes that dick deep in his hot hole. Roco grabs Arny's hips, for leverage, as he works his cock in and out of his eager hole. Then he moves Arny onto his back, on the floor, legs in the air, and continues to pound his hole. That ass is getting a good, hard fuck as Roco's hips thrust back and forth, slamming his cock all the way in. Arny moans as he takes the cock and then they move, for Arny to ride up and down on Roco's meat. His ass is stretched wide as he moans with pleasure at the feeling of cock deep inside him. Roco is soon ready to blow his load and pulls out to dump his cum over Arny's hot chest. Arny wanks himself too, until he cums as well. After a very hot fuck they go off to the shower and help each other clean up.",
  "directors": [],
  "models": [
    {
      "name": "Arny Donan",
      "person_id": 60754
    },
    {
      "name": "Roco Moric",
      "person_id": 60759
    }
  ],
  "release_date": "2018-05-10",
  "scene_id": 43256,
  "tags": [
    "69 Position",
    "Anal",
    "Blowjob",
    "Gay",
    "Handjob",
    "leg scissors",
    "Muscle",
    "sex fight",
    "thirdparty",
    "Uncircumcised",
    "Wrestling"
  ],
  "title": "Arny vs Roco - WRESTLING"
}