{
  "collections": [
    "SW Nude"
  ],
  "description": "Arny Donan and Martin Porter are two very hot, muscled, studs. They are in for a wrestling match. Arny boasts of his success in the past and thinks he will win. Martin is also keen to show that he can be a winner too. Then they strip naked and start the match. The look so good as their naked bodies are soon rolling around on the mats as they try to get a good hold on each other. With Arny gaining a decent leg hold we get a good view of Martin's sexy ass. Martin frees himself but is soon in a neck hold which leads to the first submission. In round two Martin is quickly in action and gains a decent hold to win the point. They keep up the pressure on each other as the match progresses with Arny moving into a lead. In order to do so he resorts to some ball squeezing to gain submissions. But he does use some more traditional holds as well, to end up victorious, standing over Martin and flexing his muscles in celebration. As his reward for his victory, after standing and posing over Martin, Arny pulls him to his knees and has his cock sucked. Martin works on that cock, quickly getting it nice and hard. Arny holds Martin's head, pushing it onto his throbbing cock. Martin is an eager sucker, doing a great job on that cock. When Arny has been sucked for long enought he has Martin lay back, pulling his legs up over his shoulder, so his ass is high int the air. Arny shoves his rock hard cock, deep into Martin's as and starts to fuck him good and hard. His cock slams into Martin's ass as they both moan with pleasure. That ass gets spread nice and wide by Arny's cock as he keeps working the hole. Then Arny moves Martin onto his side and spoons with him, slamming his cock in and out of that sexy ass. Martin grabs his own throbbing cock, wanking it hard and fast. Arny keeps pounding away at taht ass as Martin wanks. Martin suddedly stops his wanking, as his cock erupts with his creamy cum. Arny keeps fucking Martin's ass until he is ready too. Then he pulls out and wanks himself to shoot his load over that sexy ass. He milks his cock to get all the cum out and then both of the guys go off to the shower to clean up.",
  "directors": [],
  "models": [
    {
      "name": "Martin Porter",
      "person_id": 61060
    },
    {
      "name": "Arny Donan",
      "person_id": 60754
    }
  ],
  "release_date": "2018-02-27",
  "scene_id": 43250,
  "tags": [
    "Anal",
    "Bareback",
    "Blowjob",
    "Gay",
    "leg scissors",
    "masturbation",
    "Muscle",
    "Submission",
    "Tattoo",
    "thirdparty",
    "Uncircumcised",
    "Wrestling"
  ],
  "title": "Martin vs Arny - WRESTLING"
}