{
  "collections": [
    "SW Nude"
  ],
  "description": "Jirka Mendez and Steve Peryoux had a wrestling match, which is briefly reprised today, showing that Jirka was victorious. As he celebrates his victory Jirka takes his rewards, by pushing Steve to his knees and having him suck some cock. He sucks it very briefly before standing again and kissing Jirka. As they kiss they take hold of each other’s cocks and wank. Both those dicks get very hard from the wanking and Steve goes back down on his knees to take Jirka’s stiff dick in his mouth. He licks and kisses and then sucks on that throbbing cock, licking the balls too. Jirka grabs the back of Steve’s head and pulls it further onto his cock. Steve is expert at sucking and really does a great job, keeping Jirka so rock hard. He manages to take the whole dick deep in his mouth before coming off it and wanking it as well. Then Steve sits on a stool, leaning backwards, with his dick available. Jirka quickly shows that he is up for some sucking too and gets to work on Steve’s rigid pole. Steve is breathing heavily as Jirka’s hot mouth works on his cock. Having sucked that beautiful dick for a while Jirka lays on the wrestling mats so they can 69 with each other, as Steve lays head to toe with him. They 69 so well and then separate, with Steve using his feet to wank on Jirka’s cock. His feet wrap either side of the cock and wank it good. Then, with that cock so rock hard Steve gets and sits his ass right down on it. He rides up and down on Jirka’s cock, wanking himself as he works his hole. Then, as Steve is ready to cum Jirka starts fucking his cock up and deep into that eager hole. Steve shoots his big load of cum all over the wrestling mats as Jirka keeps fucking him. Then he turns onto his knees, presenting his ass to Jirka who gets behind him and rams his big dick in and out of that hole. He really throws Steve a hot, hard fuck, working that hole so good. He grabs Steve’s arms and pulls him back onto that cock as he keeps up his fucking. Then Jirka turns Steve over onto his back. His cock goes back in that ass and fucks it hard and fast. Soon Jirka feels the cum bubbling up as he fucks with long deep strokes. He pulls out and wanks the cum out of his cock, squirting all over Steve’s sexy body. Steve takes hold of the cock and milks the rest of the cum out of it. Then they both go off the the shower to clean up.",
  "directors": [],
  "models": [
    {
      "name": "Jirka Mendez",
      "person_id": 61062
    },
    {
      "name": "Steve Peryoux",
      "person_id": 61063
    }
  ],
  "release_date": "2018-03-15",
  "scene_id": 43252,
  "tags": [
    "69 Position",
    "Anal",
    "Athletic",
    "Bareback",
    "big dick",
    "blond",
    "Blonde",
    "Blowjob",
    "brunet",
    "Feet",
    "foot fetish",
    "footjob",
    "foreskin",
    "Gay",
    "leg scissors",
    "Muscle",
    "muscular",
    "sex fight",
    "Squirting",
    "Tattoo",
    "Partner Studio",
    "white",
    "Wrestling"
  ],
  "title": "Jirka vs Steve RAW - WRESTLING"
}