{
  "collections": [
    "SW Nude"
  ],
  "description": "Tono Milos and Paul Belonek are both very good looking guys. We find them as they are wrestling with Paul scoring a big win over Tono. As he reward he has Tono on his knees sucking his very large cock. Tono does a great job on Paul's cock getting it hard in no time at all. That massive cock swells in his mouth, soon growing to its full, impressive length. As it grows Pauls balls tighten up against the thick shaft. Tono's mouth is able to wrap around the cock and he takes as much of the cock as he can. Tono loves that big dick a looks up into Paul's eyes as he sucks. His own cock grows as he sucks and Tono then stands up and wanks both cocks together as he kisses Paul. Paul then drops to his knees and begins to suck on Tono's dick. His body still glistens with sweat from the wrestling as he works on Tono's cock. As he sucks the cock Paul feels Tono begin to thrust a little, fucking the dick in and out of Paul's hot lips. He lays on the floor and Tono gets down, next to him and sucks on that huge cock again. Paul reaches round and wanks Tono as he is being sucked. But Paul needs more than that and soon he is sitting his hot ass down on Tono's cock. He rides the throbbing cock, sliding his hot ass up and down on the shaft. His balls bounce on Tono's belly as he rides the dick.Then Tono wanks Paul as he rides. Paul turns around and continues riding that rigid cock. His own dick is still hard as he takes Tono deep in his ass. Then they move to missionary position with Paul wanking himself and hard fast as Tono slams his cock in and out of that sexya ss. Paul's hand is wrapped around his cock wanking it until it releasing his hot, flying cum. Tono pounds that ass as Paul shoots his load and keeps up fucking as hard as he can. He turns Paul onto his knees and fucks him some more, from behind. His cock slides in and out of that ass, going nice and deep. He is soon ready to blow too and pulls out to shoot his cum over Paul's sexy ass. Then our sexy pair stand up and kiss before going off to the shower to wash off all the sweat and sex from they hot bodies.",
  "directors": [],
  "models": [
    {
      "name": "Paul Belonek",
      "person_id": 61059
    },
    {
      "name": "Tono Milos",
      "person_id": 60761
    }
  ],
  "release_date": "2018-02-28",
  "scene_id": 43251,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "black hair",
    "Blowjob",
    "brunet",
    "Bush",
    "foreskin",
    "Gay",
    "leg scissors",
    "masturbation",
    "Muscle",
    "slim",
    "thirdparty",
    "Uncircumcised",
    "white",
    "Wrestling"
  ],
  "title": "Tono vs Paul - WRESTLING"
}