{
  "collections": [
    "SW Nude"
  ],
  "description": "Alan Carly and Hugo Antonin, two very hot straight guys who really know how to have a good time have enjoyed a great wrestling match. They decide to have one final round, with Alan pinning Hugo to the floor. As his legs are on Hugo's shoulders Alan's cock is over his mouth and he soon has Hugo sucking on it. That cock is big and very hard as Hugo's mouth works on it. He licks the shaft and takes the dick deep into his mouth as Alan pulls his head onto it. Then Alan turns around and the begin a 69, his dick deep in Hugo's mouth. Alan leans over and sucks on Hugo's stiff cock as well, lapping at it and sucking it hard. Then Alan moves and, as Hugo lays on the floor, sucks that beautiful hard cock. He licks Hugo's balls as well and up the shaft taking the cock deep into his mouth. Hugo's hip thrust upwards, fucking that cock into Alan's mouth, fast and hard. Then his legs are up over his head as Alan's tongue laps at his hot hole. Hugo moans with pleasure as he feels the tongue on his hole. His pleasure becomes more intense when he turns over and Alan shoves his big cock deep into that tight ass and fucks it deep. Hugo takes that cock so well,moaning as Alan fucks him with nice long strokes. His cock really stretches the hole and Hugo reaches under to wank on his cock as his ass gets it hard. Alan then lays on the wrestling mats and Hugo climbs on, sliding his ass down over that big cock. He rides the cock, with his own dick rock hard. That sexy ass slides up and down on Alan's thick shaft as Hugo grabs his dick and wanks it. His wanking it so fast as he rides on Alan's dick. That ass really works Alan's cock. Then Alan takes over fucking up into that sexy ass as Hugo keeps wanking. They move to spoon and Alan pounds away at Hugo's eager hole, slamming his cock in as hard as he can. Hugo wanks hard and his hole gets pounded deep and hard. He shoots a massive load all over the mats and Alan keeps fucking his ass until he is ready to cum too. He kneels over Hugo and dumps his creamy cum all over his body. Then he leans forward to kiss Hugo before they go off to the shower to help each other clean up.",
  "directors": [],
  "models": [
    {
      "name": "Alan Carly",
      "person_id": 60753
    },
    {
      "name": "Hugo Antonin",
      "person_id": 60752
    }
  ],
  "release_date": "2018-03-29",
  "scene_id": 43253,
  "tags": [
    "69 Position",
    "Anal",
    "Athletic",
    "Bareback",
    "black hair",
    "Blowjob",
    "brunet",
    "foreskin",
    "Gay",
    "leg scissors",
    "Rimming",
    "sex fight",
    "Straight",
    "Tattoo",
    "thirdparty",
    "Uncircumcised",
    "white",
    "Wrestling"
  ],
  "title": "Alan vs Hugo - WRESTLING"
}