{
  "collections": [
    "SW Nude"
  ],
  "description": "In a lovely dream set wrestling match we have two very studly guys, Arny Donan and Marek Borek. They announce themselves to each other and then strip naked and get straight on with the match. Their beautiful bodies look so good as they start to grapple, with asses and cocks on show. Arny is the one who manages to get a hold and the subseqent submission for the first point. But Borek it not going to roll over so easily. He quickly takes the next round. As they win a point it seems that they will wave their dicks in the opponents face each time. For the third round it is again Marek who gets a good hold and wins the point. Arny responds with a point of his own, after a good neck hold. The next round sees Marek, after some tussling gain a point with a good arm hold. As the begin the next round Arny's foot catches Marek in the balls and they briefly halt as he rubs them. Back wrestling again and Arny levels the score and pushes Marek to his knees to rub his cock over that handsome face. Rolling all over the floor in round seven shows off some great ass shots before Marek gains the submisson. He repeats the success in the next round too, so Arny has to redouble his efforts if he is not to fall too far behind. He succeeds in his efforts to claw back one point. As he holds the cards aloft his flexes his biceps. Then he is quickly on his back, with Marek all over him, but he manages to extricate himself, at least for a while. When Marek manages to get on top again Arny resorts to some ball squeezing to gain the submission and to level the scores. In the next round it is Marek who seems to have the upper hand and he gets a great hold on Arny. As Marek falls back onto the mats he lifts Arny with him, so that both are laying, with legs in the air and their beautiful ass holes on show. Arny submits from that hold and has Marek's cock rubbed in his face, licking it as well. Again Arny is able to respond and to level the score at 6-6. In a hard fought round 13 it is Marek who again comes out on top. The results in Arny going even harder for the next round and getting a good leg hold to gain the point. The final point and the victory is achieved by Marek who pushes Arny back to the floor and stands over him to celebrate his victory. Marek Borek and Arny Donan all hot and sweaty as they end their wrestling match. Then Arny is pulled onto his knees to suck Marek's big, stiff dick. His hot mouth works that fat cock licking and sucking it. Then Marek slaps it against Arny's face before shoving it back into his mouth. Arny has a voracious apetite for cock and really gets to work on Marek's. But Marek wants more and soon as Arny bent over on the mats, and is fucking his ass deep and hard. That throbbing cock works in and out on Arny's ass, making him moan with pleasure. Marek really pounds the hole, stretching wide and spanking on the ass too. They move to missionary position and we really see that huge cock working Arny's eager hole. Arny takes it so well. Then he is back on his knees, with Marek climbing on and riding hard. His cock pounds that hot hole until he is ready to blow and he pulls out to shoot a big load all over Arny's chest. Then Arny wanks his own cock as Marek stands over him, and delivers his own load. After the all that exertion they sit and enjoya beer before going off to the shower to clean up.",
  "directors": [],
  "models": [
    {
      "name": "Arny Donan",
      "person_id": 60754
    },
    {
      "name": "Marek Borek",
      "person_id": 60755
    }
  ],
  "release_date": "2018-05-24",
  "scene_id": 43257,
  "tags": [
    "Athletic",
    "brunet",
    "foreskin",
    "Gay",
    "muscular",
    "Spanking",
    "Straight",
    "Submission",
    "thirdparty",
    "top",
    "white",
    "Wrestling"
  ],
  "title": "Arny vs Marek - WRESTLING"
}