{
  "collections": [
    "SW Nude"
  ],
  "description": "Alan Carly took on Viktor Burek in a submission wrestling match. We have a quick reprise of that match and then watch as the two hot and sweaty bodies embrace each other, after Viktor's victory. They kiss, and rub each other's hot and sweaty body. Alan's cock gets very hard and Viktor drops to his knees to suck on it. He takes the big cock in his mouth and sucks as Alan's hips make a thrusting motion. Alan fucks his dick in and out of Viktor's eager mouth. He moans as his cock feels the pleasure of the sucking. The Viktor stands and they kiss each other again. Alan drops to his knees to return the favor, and suck on some cock. He takes Viktor's cock in his mouth and sucks it voraciously. His head bobs on the swollen dick, taking it all into his mouth. Viktor drops to the mats and is soon on his back, legs in the air, with Alan fingering his hole. Alan fingers it deep and then rims that hot hole too. As he fingers it some more he sucks on Viktor's cock, then it is back to tongueing the hole. Alan's cock is throbbing and needs some action, so it finds its home in Viktor's ass, fucking it standing up. Viktor reaches back and grabs Alan's ass as his hot hole is pounded by that big cock.Loving that dick in his hole Viktor lays on the mats so that Alan can pound his ass some more. He wanks himself as Alan really fucks him deep and hard. That hard fucking sends Viktor over the top and he shoots a huge cumshot all over himself. Then he turns over, onto his belly, for Alan to fuck him some more. That big cock stretches Viktor's ass, as he moans. Alan keeps up his hard fucking of Viktor's hole, until he is ready to cum. Then he pulls out and wanks his cock, shooting the hot cum onto Viktor's ass. Alan milks his cock to release all the cum and then rubs that sexy ass, pulling on the cheeks to check out the hole. He turns Viktor over and kisses him once more before they both go off to the shower.",
  "directors": [],
  "models": [
    {
      "name": "Alan Carly",
      "person_id": 60753
    },
    {
      "name": "Viktor Burek",
      "person_id": 60791
    }
  ],
  "release_date": "2018-04-12",
  "scene_id": 43254,
  "tags": [
    "Anal",
    "Anal Creampie",
    "Anal Fingering",
    "Bareback",
    "Blowjob",
    "Fingering",
    "Gay",
    "leg scissors",
    "Muscle",
    "Rimming",
    "Submission",
    "thirdparty",
    "top",
    "Uncircumcised",
    "Wrestling"
  ],
  "title": "Alan vs Viktor - WRESTLING"
}