{
  "collections": [
    "SW Nude"
  ],
  "description": "Rado Zuska and Marek Borek are a pair of very hot, muscled studs. They are in for a wrestling match and Marek certainly lets Rado know that he means business, pushing him across the room. But Rado isn’t worried, he is already a champion fighter. They strip naked showing those hot bodies and beautiful cocks. After warming up they start the match, soon rolling over the mats with Marek getting a quick submission. Rado comes back quickly winning the next round. It seems that they will taunt each other, by rubbing their cocks in the other’s face as they win each round. Some hard wrestling takes place, with the muscles straining and stretching as each guy gives his all to win. Those big cocks flop around as they grapple with each other, and the asses get spread naturally, showing some nice tight hole too. Marek is ruthless as he gains a huge advantage, despite Rado’s best efforts. But Rado wont give up, resorting to some ball squeezing to win a round. They keep fighting to the end, with Marek victorious and really celebrating in style, posing as well as slapping the score cards on Rado’s face. With Marek victorious the action moves on to the winner’s rewards. Fist Rado sucks on Marek’s cock, getting it nice and hard. He licks on Marek’s tight balls too and takes the cock right down his throat. Then Marek gets what he really wants, his cock deep in Rado’s ass. Rado is on his back legs in the air as Marek pounds his hot ass. Rado’s dick is rock hard too and he wanks it as Marek fucks him. Marek then stands Rado up and bends him over to fuck him some more. His throbbing cock works that ass real well, stretching the hole wide. Rado drops to his knees on the mats, with Marek continuing to use his hot ass, his dick slamming all the way in. He works that hole so good with Rado taking it all. Marek keeps fucking until he dumps his hot cum deep in that ass and then makes Rado push the cum back out of his ass. Then Marek gets Rado in a neck hold until he dumps his hot cum too, all over the wrestling mats.",
  "directors": [],
  "models": [
    {
      "name": "Marek Borek",
      "person_id": 60755
    },
    {
      "name": "Rado Zuska",
      "person_id": 61061
    }
  ],
  "release_date": "2018-04-26",
  "scene_id": 43255,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "Blowjob",
    "body builder",
    "brunet",
    "Champion",
    "foreskin",
    "Gay",
    "leg scissors",
    "Muscle",
    "sex fight",
    "Slapping",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "Uncircumcised",
    "white",
    "Wrestling"
  ],
  "title": "Marek vs Rado RAW - WRESTLING"
}