{
  "collections": [
    "Revenge of the Baroness"
  ],
  "description": "The Baroness has gone undercover as a Proctologist. During a supposed prostate exam she's able to overpower IT-Specialist, Mr. Bates, who works for one of Mr. Kayne's companies. The bizarre examination should determine whether Mr. Bates knows the whereabouts of Mr. Kayne or not. By the way, such examinations are an extra special pleasure of the Baroness. The kinky doctor has her patient tied up, fixated and completely helpless. For some reason the Baroness feels a bit more sadistic and adventurous than usual today. First she prepares her patient's cock to introduce one of her beloved toys. Mr. Bates is shivering in pain. Without mercy she gives him some vibrating sounding. For a short moment, she almost forgets the very purpose of the torment and just plays with the power she has over him. Then she decides to fill him up: Mr. Bates has to take a very kinky enema: three liters of special juice. With additional nipple torment and unbearable cock stimulation the Baroness brings her victim very close to his limit. How long does he need to suffer like this until he gives the Baroness the information she wants?",
  "directors": [],
  "models": [
    {
      "name": "Baroness Davina Dust",
      "person_id": 61080
    },
    {
      "name": "Mr. Bates",
      "person_id": 61090
    }
  ],
  "release_date": "2018-03-16",
  "scene_id": 43263,
  "tags": [
    "Anal",
    "Anal Stretching",
    "BDSM",
    "Big Tits",
    "Bizarre",
    "black hair",
    "Blonde",
    "Bondage",
    "Breast Abuse",
    "CBT",
    "Chastity Play",
    "Clothespins",
    "Corporal Punishment",
    "Deprivation",
    "Doctor",
    "Domination",
    "Dominatrix",
    "Edging",
    "Electrical Play",
    "Electro Plug",
    "Enema",
    "Fear Play",
    "Femdom",
    "Fetish",
    "foreskin",
    "gloves",
    "Handjob",
    "High Heels",
    "Hood",
    "Kidnapping Play",
    "Kinky",
    "Latex",
    "Male Sub",
    "Mask",
    "Medical Fetish",
    "natural boobs",
    "Nipple Clamps",
    "Nipple Torment",
    "Orgasm Denial",
    "Pain",
    "Prostate Stimulation",
    "Sadism",
    "slim",
    "Smothering",
    "Sounding",
    "Straight",
    "thirdparty",
    "white"
  ],
  "title": "Ep 6 - Bizarre Examination: at Dr. Dust's Mercy"
}