{
  "collections": [
    "Revenge of the Baroness"
  ],
  "description": "Mr. Chambers a.k.a. rubber doll Emily had withheld information. Now it was time to ruthlessly punish him. The Baroness really enjoys tormenting her slave if he is suffering in agony. Her long fingernails dig into the soles of his feet, he writhers in pain. The latex sissy is introduced to electro-play and eventually receives the full charge. Maybe the little filthy slut already regrets that he withheld information? It doesn't matter as I, the Baroness, am just starting to have fun. Electro-play on the nipples and the cock is always a welcome torment to make awkward slaves amenable and make them talk. The total loss of control would loosen Mr. Chambers' tongue. But once again the Baroness had to notice how much others fear her arch enemy, Mr. Kayne. The Baroness punishes her latex sissy harder and gives him some anal stimulation - the painful way. Mr. Chambers is desperate, and his situation hopeless. Breath control and continued torment aggravate it. The Baroness significantly pushes his limits. Finally he is at the end of his strength. He is broken. Now - completely enslaved - he would prove himself useful as a rubber maid for the first time. For the Baroness it's time to just relax and enjoy the knocking-off time. Her wet body dressed up in latex, so close in front of him and yet always out of reach, the Baroness draws a bath. Is this the worst torment for her slave? She plays with him. Using her power as he is her mindless object with only one purpose - to serve her. But finally she still has a little surprise for her slave: The cold cage of steel. It's his destiny: Imprisoned by his goddess, unsatisfied, full of lust, suffering so long as he doesn't give the Baroness information she wants to hear.",
  "directors": [],
  "models": [
    {
      "name": "Baroness Davina Dust",
      "person_id": 61080
    },
    {
      "name": "Mr. Chambers",
      "person_id": 61079
    }
  ],
  "release_date": "2018-03-06",
  "scene_id": 43261,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Bizarre",
    "Blonde",
    "Bondage",
    "brunet",
    "Cage",
    "CBT",
    "Chastity Play",
    "Corporal Punishment",
    "Corset",
    "Deprivation",
    "Discipline",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Electro Plug",
    "Electrode Punishments",
    "Feet",
    "Femdom",
    "Fetish",
    "First Anal",
    "Flogging",
    "foot fetish",
    "Foot Worship",
    "foreskin",
    "High Heels",
    "Humiliation",
    "Kinky",
    "Latex",
    "Male Sub",
    "natural boobs",
    "Paddle",
    "Pain",
    "Slave",
    "slim",
    "Smothering",
    "Straight",
    "Submission",
    "Suspension",
    "thirdparty",
    "Whipping",
    "white"
  ],
  "title": "Ep 4 - Suspension, Electro-Play and Torment by the Baroness"
}