{
  "collections": [
    "Revenge of the Baroness"
  ],
  "description": "The Baroness has a new assistant for her mission of tracking down Mr. Kayne: Princess Zuleika, who in her real life is a financial consultant. This sweet little thing turns out to be a cunning, dominant, sadistic, little bitch. But her instruction isn't finished yet! She still is an apprentice of the arts of subduing, enslaving, and educating men. The next victim is one of her clients: Pathetic Mr. Littleton. Mr. Littleton had no way of knowing the extent of the pure hellfire the two dommes were to inflict on his unwilling skin. Seduced by the two mistresses in classical business outfits, he suddenly finds himself completely helpless and captive tied and chained to the wall of their dungeon. Dressed in hot latex outfits the ladies have lots fun tormenting their slave with clothespins, CBT, spanking, nipple torture, and flogging. Having had enough of his moaning and complaining, they put a ball gag into his mouth and give him endless tease and denial. Then they torment his cock with hot candle wax and weights, but Mr. Littleton really can take some pain. He is far too proud to lick boots of the Princess, so the Baroness decides to continue with psychological mindfucking - what an insane game! Sudden pain out of nowhere. The mistresses push Mr. Littleton to his limits.",
  "directors": [],
  "models": [
    {
      "name": "Baroness Davina Dust",
      "person_id": 61080
    },
    {
      "name": "Princess Zuleika",
      "person_id": 61089
    },
    {
      "name": "Mr. Littleton",
      "person_id": 61087
    }
  ],
  "release_date": "2018-03-30",
  "scene_id": 43264,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Bizarre",
    "Blindfold",
    "Blonde",
    "Bondage",
    "Brunette",
    "CBT",
    "Chains",
    "Clothespins",
    "Collar",
    "Corporal Punishment",
    "Deprivation",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Fear Play",
    "Femdom",
    "Fetish",
    "Flogging",
    "Gag",
    "Handjob",
    "High Heels",
    "Hot Wax",
    "Humiliation",
    "Kidnapping Play",
    "Kinky",
    "Latex",
    "Leather Cuffs",
    "Male Sub",
    "Mask",
    "Nipple Clamps",
    "Nipple Torment",
    "Nylons Stockings",
    "Orgasm Denial",
    "Pain",
    "Sadism",
    "Slapping",
    "Slave",
    "Spanking",
    "Straight",
    "the wall",
    "thirdparty",
    "Weights"
  ],
  "title": "Ep 7 - The Business Slave: Seduced by Two Mistresses"
}