{
  "collections": [
    "Revenge of the Baroness"
  ],
  "description": "Baroness Davina Dust has a new assistant supporting her on her chase for Mr. Kayne: Sweet Princess Zuleika. A cunning, dominant, sadistic, little bitch. In her real life she is a financial consultant and one of her clients should turn out to be the perfect victim to train her: Pathetic Mr. Littleton. If he knew what would happen to him - he probably would have backed off. Mr. Littleton actually wanted to fuck the Baroness and the Princess in a threesome. He'll get the threesome, but he won't be the one doing the fucking. Tied and chained to a bench he is spanked and paddled. Then the two mistresses put on their strap-ons and show him some their way of involuntary anal and blowjob. Transformed into a will-less, submissive object, Mr. Littleton has to demonstrate his readiness of tongue while Davina Dust and Zuleika enjoy some lesbian time. By his extensive licking, Mr. Littleton puts the mistresses in a merciful mood. They decide to release him. He is allowed to wank himself off - under their strict control. And once again he would be humiliated by them - the wet and golden way.",
  "directors": [],
  "models": [
    {
      "name": "Baroness Davina Dust",
      "person_id": 61080
    },
    {
      "name": "Mr. Littleton",
      "person_id": 61087
    },
    {
      "name": "Princess Zuleika",
      "person_id": 61089
    }
  ],
  "release_date": "2018-04-13",
  "scene_id": 43265,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Bisexual",
    "Bizarre",
    "Blindfold",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "Brunette",
    "CBT",
    "Chains",
    "Corporal Punishment",
    "Deepthroat",
    "Deprivation",
    "Dildo",
    "Discipline",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Femdom",
    "Fetish",
    "First Anal",
    "Flogging",
    "gloves",
    "High Heels",
    "Hood",
    "Humiliation",
    "Kidnapping Play",
    "Kinky",
    "Latex",
    "Leather Cuffs",
    "Lesbian",
    "Male Sub",
    "Mask",
    "Paddle",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Slapping",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "thirdparty",
    "Threesome"
  ],
  "title": "Ep 8 - Kinky Threesome: the Fuck of His Life"
}