{
  "collections": [
    "Revenge of the Baroness"
  ],
  "description": "The Baroness has tracked one of Mr. Kayne's helping hands: Mr. Friend. She restricts him in a bondage device in the hall of her dungeon. While tormenting her blindfolded victim with intense electro play, she makes him understand that he is about to face something unexpected. In his most daring dreams he wouldn't have thought of this kind of surprise! He still can't see what's waiting for him in the next room: One of the Baroness' bisexual slaves. She ties the bi-slave to a bondage chair, just a few steps away from Mr. Friend. She beats and teases him, spits into his mouth, and gags him. Then it's time to bring Mr. Friend to the scene. She knows that the horny worm is straight as an arrow, but this is about to change - in a ruthless way. Tied up and controlled by the TENS unit, the Baroness turns him into her cock-sucking bitch. To make him improve his efforts, the Baroness gives him some anal stimulation and ass whipping. Once finished, she leaves the two restricted slaves together alone.",
  "directors": [],
  "models": [
    {
      "name": "Baroness Davina Dust",
      "person_id": 61080
    },
    {
      "name": "Mr. Friend",
      "person_id": 61085
    },
    {
      "name": "The Piece",
      "person_id": 61091
    }
  ],
  "release_date": "2018-05-25",
  "scene_id": 43268,
  "tags": [
    "Anal",
    "Anal Fingering",
    "BDSM",
    "Big Tits",
    "Bisexual",
    "Bizarre",
    "black hair",
    "Blindfold",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "CBT",
    "Chastity Play",
    "Collar",
    "Corporal Punishment",
    "Deprivation",
    "Discipline",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Electrical Play",
    "Electrode Punishments",
    "EMS Pads",
    "Femdom",
    "Fetish",
    "Flogging",
    "foreskin",
    "Gag",
    "Gimp",
    "gloves",
    "Hair Pulling",
    "Hand Gagging",
    "Hood",
    "Humiliation",
    "Kinky",
    "Leather Cuffs",
    "Lingerie",
    "Male Sub",
    "Metal Bondage",
    "Mouth Spreader",
    "natural boobs",
    "Nylons Stockings",
    "Oral Sex",
    "Rope Bondage",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Submission",
    "Tens Unit",
    "thirdparty",
    "Uncircumcised",
    "Whipping",
    "white"
  ],
  "title": "Ep 11 - Involuntary Bi Punishment: a Bad Surprise by the Baroness"
}