{
  "collections": [
    "Revenge of the Baroness"
  ],
  "description": "The Baroness has tracked down Mr. Hansen. He is the former lawyer of Mr. Kayne and he may know his current whereabouts. She lurks, awaiting him in the forest he visits for evening walks. She takes him by surprise, overpowers him, and ties him up in the middle of a thicket between two trees. While she starts to torment and interrogate him, the Baroness makes a decision: She's not only looking for the information anymore, she wants to enslave him completely. So she immensely enjoys showing him the true meaning of pain. She torments his nipples until they are burning intensely, but her victim can take a lot . He still refuses to give up any information about Mr. Kayne. So the Baroness starts to work on his cock - the hard way. While doing this, Mr. Hansen becomes so horny that the Baroness gets a new idea: To use his weakness to transform him into her personal chastity slave. She ties him in a strict hogtie which is even more uncomfortable lying on a hard, moist forest floor. The Baroness enjoys the power she has over him and starts to take his breath. She controls his breath until he finally gives her another clue. Although she has what she wanted, she's not done with him yet. To get Mr. Hansen totally obedient she uses an old very effective method: chastity.",
  "directors": [],
  "models": [
    {
      "name": "Baroness Davina Dust",
      "person_id": 61080
    },
    {
      "name": "Mr. Hansen",
      "person_id": 61086
    }
  ],
  "release_date": "2018-03-07",
  "scene_id": 43262,
  "tags": [
    "BDSM",
    "Big Tits",
    "Bizarre",
    "Blindfold",
    "Blonde",
    "Bondage",
    "Caning",
    "CBT",
    "Chastity Play",
    "Clover Clamps",
    "Corporal Punishment",
    "Crotch Rope",
    "Deprivation",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Fear Play",
    "Femdom",
    "Fetish",
    "Flogging",
    "Hand Gagging",
    "High Heels",
    "Hood",
    "Humiliation",
    "Kinky",
    "Leather",
    "Male Sub",
    "Nipple Clamps",
    "Orgasm Denial",
    "Outdoor Abduction",
    "Outdoors",
    "Pain",
    "Public",
    "Rope Bondage",
    "Slave",
    "Smothering",
    "Straight",
    "takedown",
    "thirdparty",
    "Weights"
  ],
  "title": "Ep 5 - Tied up in the Public Forest: Outdoor Torment by the Baroness"
}