{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Mike and Sam lie boot to boot on a long bench, each playing with his own asshole and dick. Peter lubes them up and puts a two-headed dildo up their assholes, making them scoot closer together to accommodate it, then fucking them with it while they beat their meat. He pulls the dildo out of Shane, telling Mike to keep fucking himself with it, and himself fucks Shane while squeezing Shane's balls. Peter pulls out of Shane, has Mike get off the bench and Shane lie flat on it, then feeds Shane one end of the two-headed dildo, making him suck it before having him slide it back up his ass and start playing with it. Peter goes over to Mike, who is standing by a post and crossbeam, and tightly ties up Mike's cock and balls with a rolled bandanna, then puts Mike in a standing spreadeagle and flogs him. When Mike cries out too much, he gags him with a bandanna. He ties Shane's wrists to the top of the bench, which is actually a rack, and his feet to the bottom, wraps a parachute harness around Shane's balls, attaches rope to them and and to an overhead anchor, and pulls them up high. He sucks and bites on Shane's nipples, replaces the parachute harness with rope around Shane's balls, and ties the end of the rope around Shane's neck, slaps Shane's balls a little, then starts hitting him all over with a riding crop, including balls and nipples. When Shane cries out too loudly, Peter gags him with a plug gag, then starts smacking him before going back to flogging Mike, pausing during the flogging to wrap Mike's head in a wide Ace bandage. He returns to the flogging, which is very heavy, before eventually taking Mike down.",
  "directors": [],
  "models": [
    {
      "name": "Mike Stone",
      "person_id": 61101
    },
    {
      "name": "Peter Sparrow",
      "person_id": 61103
    },
    {
      "name": "Shane Stevens",
      "person_id": 61102
    }
  ],
  "release_date": "2018-03-09",
  "scene_id": 43276,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "BDSM",
    "black hair",
    "Bondage",
    "Boot",
    "bottom",
    "CBT",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "dungeon",
    "Feet",
    "Flogging",
    "Gag",
    "Gay",
    "Leather",
    "Leather Cuffs",
    "Male Handler",
    "Male Sub",
    "master",
    "masturbation",
    "Pain",
    "Predicament Bondage",
    "rack",
    "harness",
    "Rope Bondage",
    "Sadism",
    "Tattoo",
    "thirdparty",
    "top",
    "white"
  ],
  "title": "Alley Pigs in Bondage: Who's Getting Fucked Now?"
}