{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "A New York City alley. Rain. Peter Sparrow relieving himself against the wall. Mike stops to watch. Peter takes him back to his place where, after they kiss and Peter turns on the light, Mike sees Shane in his cage and gets a little scared. But not scared enough. They kiss noisily and wetly, and next thing they’ve stripped their outerwear off and are going at it hot and heavy. Peter is in control, twisting Mike’s tits and then taking Mike over to the cage to suck Shane’s dick, whispering filth and orders in Mike’s ear. Mike strips, slips a butt plug up his ass, gets on his knees in front of Shane’s cage and cuffs himself in front, then lays back and edges himself, pulling in and out on the butt plug, while waiting for Peter. Peter returns, stomps Mike for a moment, tells him to put his socks and boots back on and while Mike’s doing that, unlocks the cage where Shane stands hooded and bound. Peter removes the hood and releases Shane from the cage, leading him over to the St. Andrew’s cross and attaching him to it. He wraps suspension restraints to Mike’s ankles and hoists him in the air upside down, slaps him, spanks his ass hard, then lets him dangle as he returns to Shane for a kiss. He gets some rope and ties up Mike’s balls, then attaches the rope to Shane’s balls across the room. He applies medical clamps to Mike’s nipples, smacks his belly hard, ties a rope to the clamps, clamps Mike’s penis and connects the rope from his nipples to his penis, tugging on it. He applies clover clamps to Shane’s nipples, and the rope on Mike’s balls and dick to the chain connecting the cover clamps. He hits Mike’s balls, then goes back and forth, kissing and beating both bound guys, snapping and tapping their balls with his fingers. He swings Mike by the rope connecting his nipples and dick. He is tender and cruel. He pounds Shane in the belly, unclamps Mike’s cock and tits and smacks his tits to make them hurt, then lowers Mike.",
  "directors": [],
  "models": [
    {
      "name": "Mike Stone",
      "person_id": 61101
    },
    {
      "name": "Peter Sparrow",
      "person_id": 61103
    },
    {
      "name": "Shane Stevens",
      "person_id": 61102
    }
  ],
  "release_date": "2018-03-08",
  "scene_id": 43275,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "buttplug",
    "Cage",
    "CBT",
    "Chains",
    "Clover Clamps",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "dungeon",
    "Gay",
    "Gimp",
    "Hood",
    "Jockstrap",
    "Kinky",
    "Leather",
    "Male Sub",
    "master",
    "masturbation",
    "Nipple Clamps",
    "Pain",
    "Piss Play",
    "Piss Play",
    "Predicament Bondage",
    "Punching",
    "Rough Sex",
    "Sadism",
    "Slave",
    "Spanking",
    "Suspension",
    "Tattoo",
    "the cross",
    "the wall",
    "Partner Studio",
    "white"
  ],
  "title": "Alley Pigs in Bondage: A Cage, A Cross and Upside Down Suspension"
}