{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Shane, plugged, still lies on the table, arms over his head and tied down behind him. Peter brings Mike over to the table to suck Shane’s cock. Peter leans against the walls behind them, lubes up his own cock and enjoys giving instructions to Mike and watching him and Shane, coming over to push Mike’s head all the way down on Shane’s cock. While Mike continues sucking Shane and works a thumb up Shane’s ass, Peter smacks his cock against Shane’s plug gag, removes the gag, kisses Shane, unties his hands, then feeds Shane his own cock, which Shane sucks ravenously, as he also sucks Peter’s balls and ass. Peter crouches over Shane’s head, the better to feed him his cock, balls and ass, which Shane licks and spits on and sucks. A moment later Peter is leaning over Shane to suck Shane’s cock while Shane sucks Peter’s cock and Mike licks Peter’s ass. Shane is replaced on the bench by Mike, who sucks Peter’s cock while Shane sucks his. Mike sucks Peter’s balls. Peter has both guys lie on their backs, head to head. he has Mike suck his cock, Shane suck his balls while he fondles Shane’s ass and plays with Shane’s asshole. He has Shane spread and contract his own asshole and fingerfucks him. Shane and Mike kiss, then Shane sucks Peter’s cock and Mike sucks Peter’s balls. Peter puts on a cockring. Both Shane and Mike vie for a taste of Peter’s cock. Deepthroating. Peter skullfucks Shane while Mike alternates eating Peter’s ass and sucking his balls.",
  "directors": [],
  "models": [
    {
      "name": "Mike Stone",
      "person_id": 61101
    },
    {
      "name": "Peter Sparrow",
      "person_id": 61103
    },
    {
      "name": "Shane Stevens",
      "person_id": 61102
    }
  ],
  "release_date": "2018-03-12",
  "scene_id": 43277,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "black hair",
    "Blowjob",
    "Bondage",
    "Deepthroat",
    "dungeon",
    "Facesitting",
    "Facefucking",
    "Gag",
    "Gay",
    "Leather",
    "Male Handler",
    "Male Sub",
    "master",
    "Oral Sex",
    "Orgy",
    "Rimming",
    "Tattoo",
    "Partner Studio",
    "Threesome",
    "white"
  ],
  "title": "Alley Pigs in Bondage: Skullfuck Orgy"
}