{
  "collections": [
    "Everything Butt"
  ],
  "description": "Ariel X brings suspect Maya Kendrick back to the last scene of her crime. Wide eyed Maya claims she's never been here before, but Ariel knows better than to trust the words of this slut. Arial decides to re-enact the events from that night when the criminal known as the Infamous Butthole Fister fisted their last victim. Ariel spanks and sniffs Maya's asshole before sliding a butt plug straight in Maya's ass. Every time Ariel pops it in and out Maya hungry hole gapes wide open ready for more. Ariel pries Maya's asshole open with her fingers to get a good look at Maya's pink insides. Then Ariel grabs the 2 foot long slink monster and pushes it almost all the way in Maya's ass. Maya moans as the toy sinks in, inch by inch, stretching her open and filling up her insides. Now that Maya's hole is properly stretched, Ariel takes turns pushing her fists into Maya's ass. Maya has never been fisted anally before and she loves feeling her asshole swallow Ariel's hands. She cums hard on Ariel's fists over and over again, her body shaking with orgasms. Once that Maya's ass is gaping open, Ariel wants to see what Maya can do to her asshole. Maya slides a fat plug into Ariel's ass and then replaces it with her fist. Ariel can't stop cumming as Maya fist fucks her. With her hand in Ariel, Maya admits she is the culprit! With this confession, Ariel knows she must punish Maya, and fucks her ass with a huge strap-on cock. Maya's eyes flutter up as Ariel pounds her pretty pink asshole. Maya's ass is left raw and gaping -- the fister has become the fisted.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2018-05-04",
  "scene_id": 43289,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Prolapse",
    "shaved",
    "slim",
    "slink",
    "Straight",
    "Swallow",
    "white"
  ],
  "title": "Maya Kendrick Gets Fisted and Fucked by Ariel X"
}