{
  "collections": [
    "Bound Gods"
  ],
  "description": "In 7 scenes from 4 shoots, we see some of the most intense flogging and fucking of Bound Gods. Christian Wilde and Micah Brandt start us out, with some savage ass flogging. Christian doesn't hold back as he wails on Micah's tight muscle ass, the flogger often striking his sensitive asshole, again and again. Micah strains in a partial suspension, bent over with his ass out so Christian has a clear shot. Christian fucks him with a police baton, before resuming the brutal flogging session. He then ties Micah to an iron bed and gags him, and drips hot wax on him as he slams his ass full of thick hard cock. Tormented, restrained and fucked, Micah unloads while Christian plows him, then takes Christian's hot load in his eager mouth. In the second shoot, Connor Maguire takes full advantage of a fully bound and restrained Aarin Asker. Aarin is tied down to a bench press, where Connor flogs the fuck out of him while face fucking him. He then rams his hard cock into his ass and fucks him. Aarin's bondage hold his legs wide open so he can't push back. He just has to take Connor's selfish, savage cock. Aarin finally blows all over himself with Connor's cock sliding in his ass, and gets a face full of cum as Connnor shoots it into his mouth. In the third shoot, Kaden Alexander is fully abused and tormented by an insatiable Christian Wilde. Once again Christian shows his potent skill with the flogger, relentlessly wailing on Kaden, who's tied with his hands behind his back on a rotating platform. Christian is able to flog every inch of Kaden's body at will. He then suspends Kaden against a post, and drives his thick hard cock straight up his hungry asshole. Kaden is at his mercy, unable to resist or move, with both hands bound and legs spread. Christian lets him down solely to facefuck Kaden and blow his load in his mouth, then puts Kaden on the floor and makes him get himself off with Christian's boot planted on his cumsoaked face. In the fourth scene, Trenton Ducati fully subjugates, objectifies and uses Max Cameron. The flogging is intense as Max is tied with his hands above his head, but otherwise able to move, if not resist. Trenton rakes the flogger over Max's tight body and hard muscle ass. Then completely has his way with him, fucking his desperate ass full of that giant hard cock. The sex is unrelenting as Trenton uses Max in every way, slamming his hole hard and deep in multiple positions. Trenton blows his load all over Max's face, then gets Max off and makes him eat his own boiling cum.",
  "models": [
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Micah Brandt",
      "person_id": 57628
    },
    {
      "name": "Aarin Asker",
      "person_id": 58219
    },
    {
      "name": "Kaden Alexander",
      "person_id": 59146
    },
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    },
    {
      "name": "Max Cameron",
      "person_id": 57500
    },
    {
      "name": "Connor Maguire",
      "person_id": 46426
    }
  ],
  "release_date": "2018-03-22",
  "scene_id": 43281,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "domination",
    "flogging",
    "gay",
    "hot wax",
    "humiliation",
    "Male Sub",
    "master",
    "muscle",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "suspension",
    "wax"
  ],
  "title": "Flogged 'n' Fucked!"
}