{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Summer Vengeance series Tournament on Ultimate Surrender! Today we have our #2 ranked wrestler, Izamar Gutierrez, put against our #1 ranked wrestler, Mistress Kara. Izamar, \"La Diabla\" is a curvaceous, big-tittied, big-assed, brunette MILF latina. Her wrestling skills are very good but she has taken on Kara many times and has never been able to figure out how to stop Kara's signature move. Kara \"The Queen\" was originally ranked #2 behind Ariel X but Ariel has had to pull out of the tournament due to injury. Dee Williams will take Ariel's place. Kara will be bumped to #1 ranking, Dee Williams will default to #3 ranking. Kara is the queen for a reason. She easily Dominates her opponents. She has one move that every single wrestler seems to get stuck in. A move that enables her to keep control while burying fingers deep into her opponents' pussies. She gets this hold on Izamar late in round 1. Izamar is trapped and frustrated. She's seemingly giving up while Kara fingers away. Round 2 is when Izamar is able to figure out how to stop Kara. She takes offensive, powering in and out of holds. She stops Kara in her tracks which makes for a very exciting match from here on out. Izamar has better cardio and conditioning than Kara. The later rounds are when wrestlers are usually able to take advantage of Kara. Because Kara is the biggest, strongest wrestler on the roster, she is able to use her power and strength in the early rounds to get a high score. Kara does have a weakness and it is conditioning and power conservation. We see La Diabla chip away little by little at Kara. This is her best performance against Kara yet. Is it enough to win? The final wrestling round is called and only one girl can win. Ariel announces who will move on in the tournament and be able to take the prize today. The winner revels in her victory. She fucks the losers smug face and puts the loser on the mat to worship her feet, muscles, armpits and power. The loser if fucked good, hard and fast. The loser if taken with a lift and carry into the locker room where she is smothered with ass and pussy with face sitting.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Izamar Gutierrez",
      "person_id": 30590
    }
  ],
  "release_date": "2018-08-08",
  "scene_id": 43288,
  "tags": [
    "Ariel X",
    "brunette",
    "domination",
    "Facesitting",
    "Feet",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "lift and carry",
    "MILF",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tournament",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Mistress Kara vs Izamar Gutierrez"
}