{
  "collections": [
    "Everything Butt"
  ],
  "description": "Throughout the night, Kimber Woods and Cheyenne Jewel have been playing strip poker with Aiden Starr. Both Kimber and Cheyenne sit there fully nude having lost their last article of clothing and Cheyenne wants to play just one more hand. Aiden is mildly amused with the hubris of her two naked playmates. She is willing to play one more hand, but the completely naked girls are going to have to come up with something to bet. Kimber has the brilliant idea to wager their assholes. The cards are dealt and Aiden tells the girls to show their hand. Aiden wins and is determined to show these two little losers what it means to give up their asses. Aiden bends the girls over and brutally spanks their asses until they are bright red. She pops toys in and out of their holes, making them gape wide open. The girls lick and suck each other's assholes and the toys that come in and out of them. Aiden ramps up the energy with some heavier anal play. She puts the entire two foot long slink all the way into Cheyenne's asshole. She pushes it in and pulls it out, making Kimber lick and gag on the long toy that was buried deep inside Cheyenne's ass. Kimber's asshole gets stretched wide open with the metal speculum. We see deep into her asshole, getting a glimpse of her pink asshole walls. Cheyenne gets throat fucked by Aiden's fists which makes Cheyenne drool puddles of spit down into Kimber's pried open asshole. Aiden really wants the girls to ante up more so she lays them down and ass fists both the girls hole's until they beg for mercy. Both girls have explosive anal orgasms. Cheyenne's asshole is punished the most for her being a horrible card player. Cheyenne is bent over and strap on fucked in the asshole right over Kimber's pretty face. Kimber waits with her tongue out to suck the cock right when it comes out of Cheyenne's ass. Cheyenne get's pounded good and hard until her asshole is dripping with her own anal cum and Kimber licks it all up.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    }
  ],
  "release_date": "2018-06-15",
  "scene_id": 43293,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Ass To Mouth",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "drool",
    "Fisting",
    "Gag",
    "Gaping",
    "Lesbian",
    "LezDom",
    "Prolapse",
    "Rimming",
    "slink",
    "Speculum",
    "Straight",
    "Strap On"
  ],
  "title": "Strip Poker: Three Anal Whores Go All In"
}