{
  "collections": [
    "Everything Butt"
  ],
  "description": "London River enters the yoga studio of Alexa Nova and right away they start a breathing exercise. Alexa is unsatisfied with London's breathing, so she positions her in \"downward dog\" and tells her to breathe through her ass. Alexa leans in to London's ass and sniffs through her yoga stretch pants. To get a better view, Alexa rips open London's pants, spreads her cheeks, takes another whiff, and sticks her tongue down her hole. Alexa tells London that she has to open her ass more to get the deepest breath so she has her get into \"child's pose\", grabs some rope and ties London's legs together so she cant move. Alexa gets a large metal toy and sinks it into London's asshole to begin stretching it. She pops it in and out to make London's asshole gape. Next, Alexa lies on her back and spreads her legs wide to demonstrate a more advanced yoga technique. London cant help but stick her face next to Alexa's asshole and tongue fucks her. London gets a large metal butt-plug and slides it slowly into and out of Alexa's ass. When her ass is good and stretched, London starts slowly putting each of her fingers into Alexa's ass until all five are inside. When London's whole fist finally gets inside Alexa's ass, Alexa cums hard. London gets inspired and wants Alexa's fist now in her own ass, so she puts herself face down and her ass in the air and Alexa lubes up her hand. Alexa's fist gets instantly swallowed by London's hungry stretched hole and with a vibrator pressed onto London's pussy she has multiple huge orgasms while getting fisted. After that, London gets on her back and Alexa gets her leather strap-on with a huge dildo attached to the front. She fucks London's ass deep and hard and they end the session by pressing their assholes together and trib-fuck.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Alexa Nova",
      "person_id": 57359
    }
  ],
  "release_date": "2018-06-29",
  "scene_id": 43294,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "buttplug",
    "dildo",
    "dominatrix",
    "gape",
    "gaping",
    "leather",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "prolapse",
    "straight",
    "vibrator"
  ],
  "title": "Alexa Nova Teaches London River Ass Stretching Yoga "
}