{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Jasmeen Lefleur is a solid muscular Latina MILF looking to get a full release massage at the infamous TS NURU Massage Parlor. Today, her masseuse is the stunning Kristen Kraves. Jasmeen has decided to sign up for the full service package consisting of a deep penetrating oil massage and deep pussy penetration. Kristen tells Jasmeen to strip completely naked so she can be rubbed down with lots of hot slick oil. Kristen climbs on top of Jasmeens naked body, oils her up and uses her entire body to rub all over Jasmeen's tight muscles. Jasmeen's tired feet are sore and are too in need of a massage so Kristen gets Jasmeen's hard working, sweaty feet oiled up and ready for a rub...with her cock. Kristen fucks Jasmeen's feet with her rock hard cock. Next it's time for Jasmeen's throat massage. Kristen massages the back of Jasmeen's throat with her hard cock, getting it wet and lubricated, working out all the kinks. After that, Kristen ties Jasmeen up in rope bondage so that Jasmeen can't move at all. Jasmeen's big perky tits are bound and oiled, her ass in the air, round, glistening, and spankable. Kristen can't help but stick her tongue in it and lick her pretty hole. Kristen is ready to give Jasmeen her deep internal massage. Kristen slides her cock deep into Jasmeen's perfect, tight pussy. This is exactly what Jasmeen was wanting. She's tied up and can't move away from the deep penetration. The two hot MILFS fuck in doggie and then Jasmeen is flipped onto her back and Kristen spreads Jasmeen's legs and furiously fucks her pussy until both ladies work up to orgasm. Kristen has one last segment to finish up her NURU massage and shoots a hot load of her cum deep into Jasmeen's freshly fucked pussy and tells Jasmeen to let the cum soak in, to help keep hydrated.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Jasmeen LeFleur",
      "person_id": 59623
    },
    {
      "name": "Kristen Kraves",
      "person_id": 61240
    }
  ],
  "release_date": "2018-05-21",
  "scene_id": 43291,
  "tags": [
    "Big Ass",
    "Big Tits",
    "Blowjob",
    "Bondage",
    "Cock Worship",
    "Feet",
    "footjob",
    "MILF",
    "muscular",
    "Role Play",
    "Rope Bondage",
    "Straight",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Kristen Kraves and Jasmeen Lefleur: Full Service NURU Massage "
}