{
  "collections": [
    "Everything Butt"
  ],
  "description": "Tori Avano is an Army Private who is going to get the anal hazing of a lifetime. Dee Williams and Syren De Mer are two MILF commanders who are going to dish out the punishment with glorious tag-teaming action. Poor young Tori is tied up in bondage with her ass exposed and up in the air, ready to take a spanking. Syren De Mer starts the spanking. She warms up Tori's ass with spankings that turn her tushy hot and pink. Dee Williams finishes the spankings, making Tori's pink cheeks so sensitive that she jumps anytime her ass is touched. Syren grabs her flogger and goes to town on Tori's ass, back, and feet. To start, Tori's asshole gets opened up with a metal toy. These anal punishing MILFs know exactly how to open an asshole properly by giving it a good warm-up. The chemistry between all three of these anal whores is strong. Tori's asshole opens from the sexual energy, and just at the right time to attempt to take Dee William's entire fist. This is Tori Avano's very first ever anal fisting. She really wants to impress her commanders. She attempts to take the fist at first but the feelings are too intense for her. She calls mercy but then begs her commanders to try again. One the second attempt, Dee's entire fist goes in and with her ass full, Tori smashes a vibrator against her own clit and makes herself cum. Veteran ass stretcher, Syren De Mer volunteers to show Tori Avano just how its done. Syren takes a full blown anal punching from Dee Williams. Dee and Syren lick up all the gaping holes they create. Finally, Tori is released from bondage and is fully compliant to taking a good hard lesbian anal strap-on fucking from Dee Williams while Syren holds Tori's gaping asshole open and licks all the freshly fucked flesh.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Tori Avano",
      "person_id": 55975
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2018-06-01",
  "scene_id": 43290,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Big Tits",
    "Bondage",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Feet",
    "Fisting",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "MILF",
    "Prolapse",
    "Punching",
    "Rimming",
    "Rope Bondage",
    "Spanking",
    "Straight",
    "Strap On",
    "Tattoo",
    "Vibrator"
  ],
  "title": "Private Tori Avano's Anal Army Initiation"
}