{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Charles Dera’s ex wife, Penny Pax, uploads compromising pictures of Charles to her social media account, Charles is fired for violation of his employer’s moral turpitude clause. When Charles confronts Penny, her silly game is turned into a much more serious BDSM and hard anal encounter. It’s all about Charles today. Penny fucked him over so he’s going to fuck her up!–in all the best ways.\nPenny knew what she was doing when she posted those pictures online–Charles would get mad as hell and come to her house and teach her a lesson with a good hard fucking! He ties Penny up tight, pulls her panties down and fucks her wet and ready pussy while her huge tits bounce around. But Charles is extra aggressive with Penny and she’s not so sure she likes it. He got fired from his job so he is not playing around with this horny bitch. He stuffs his cock in Penny’s mouth and throat fucks her until she is covered in spit and begging him to be gentle. But that ain’t gonna happen cuz she’s gonna learn a lesson by the time he is through with her. Tied up in doggie Charles punishes Penny with the crop and then the flogger–he whips her ass and thighs until they are burning bright pink. Charles fucks her slutty pussy some more until she cums real good. Finally Penny is on her back with legs spread wide open for easy access. Trapped in what looks like a spider’s web rope bondage Charles stuffs Penny’s asshole with a butt-plug cuz he’s getting her ready for some serious anal action. First he fucks her puffy cunt and makes her promise that she is now reformed. Then he pounds Penny’s ass like there is no tomorrow. The hitachi comes out and vibes her clit while she’s getting her ass worked over. Penny is moaning and screaming in pleasure until Charles shoots his fat load all over her pussy. Revenge accomplished.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2018-04-20",
  "scene_id": 43305,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Blonde",
    "Blowjob",
    "body builder",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Hitachi",
    "Humiliation",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Anal Revenge"
}