{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Victoria Voxx is new to Kink.com and hungry to get bound in tight rope predicament bondage and made to suck massive cocks. She is glowing with excitement and radiates the kind of raw sexual energy that makes men salivate with depraved desire. With one leg tied to her waist, see dangles precariously in the middle of the room as her other high heel pirouettes on the floor. Cyrus King spins her around in circles as he shocks her repeatedly with a zapper. She yelps in pain but is determined to please her male handler. Her pussy drips with cum as her dom toys with her teeny pink pussy with an industrial vibrator. After she has her first of many multiple orgasms she gets tossed to the floor and begs to suck dick. Cyrus grabs the back of her head and begins to slam her throat with his stiff rod until she gags and chokes from the rough blow job. He grabs her pony tail and jams the hitachi onto her swollen and hungry cunt until she screams from the pain of the non stop coerced orgasms. Pleased with her hard work, Cyrus decides to reward her by tying her in a missionary position and fucking her tiny whore hole. He slams her pussy and grabs her tight ass with his massive man-hands. As her butt shakes he spanks it until it turns red and sensitive. But this sort of treatment only makes a female sex slave like Victoria hungry for more. Her master flips her onto her back and begins to fuck her swollen and sensitive pussy over and over again. As he jams a vibrator onto her clit she squirms and tries to get away from the relentless stimulation. But the bondage is inescapable and she must endure the torment of the huge dick that is pounding her into submission. At the height of her sexual frenzy she begs for Cyrus to cum all over small all natural tits. He is only happy to oblige and finishes her by blowing a massive load of jizz all over her.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Cyrus King",
      "person_id": 60686
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2018-06-20",
  "scene_id": 43301,
  "tags": [
    "Bondage",
    "Handler",
    "Hitachi",
    "Male Handler",
    "master",
    "multiple orgasms",
    "Pain",
    "Petite",
    "Predicament Bondage",
    "Slave",
    "Straight",
    "Sub",
    "Submission",
    "Vibrator",
    "Zapper"
  ],
  "title": "Petite Fresh Faced Whore Victoria Voxxx Bound in Rope and Brutally Fucked"
}