{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Tied up with rope standing spread eagle sexy Skylar is being punished for touching herself too much. Adorned with a ball-gag and nipple clamps tight on her big natural breasts, Skylar is on the verge of cumming as the Hitachi vibrates her pussy. Her master Ramon disciplines his horny slut with the flogger and the crop but she just gets more excited with every blow. He fingers her pussy until she squirts all over his hand. Ramon leaves his voluptuous slave tied up all night, she gets ancy and makes a great escape from the ropes and dashes off into the hills. Ramon sets out on a Cunt Hunt to trap the horny renegade, and after a hardcore face fucking in the hills, Ramon leads the wayward slave home for more punishment. Not wasting any time Ramon gets inside that ass of Skylar's and fucks her good until she is begging to cum. Then Ramon ties Skylar up on her back. He zaps her, vibes her clit clamps her pussy open and pounds her out until she squirts geyser style all over the place. Then Ramon with his huge cock stretches Skylar's tight ass open with some hardcore anal until he shoots his hot load. And that is the BDSM fantasy tale of a horny slave and her Master.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2018-05-11",
  "scene_id": 43308,
  "tags": [
    "Amazing Orgasms",
    "Anal",
    "BDSM",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Gag",
    "Hitachi",
    "Humiliation",
    "master",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "slim",
    "Squirting",
    "Straight",
    "Stud",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Cunt Hunt 2"
}