{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When a loathsome banker forecloses on her Daddy's ranch, Kira Noir must decide how far she will go to save the family farm. Kira is happily watering the spring flowers in her yard when Tommy Pistol shows up with an eviction notice to take what is his. Thinking it must be a mistake she begs him to retreat but instead of agreeing Tommy negotiates with Kira. \"Show some skin or get the fuck out!\" And not only that she's gonna have to suck some cock to get another week before he returns to take the farm. She can't believe what she is hearing but she loves her Daddy so she will do anything and everything to keep her family home. Kira peels her tight shirt off to reveal her perky little tits. Tommy gets a feel and wants more so things spiral into a perverted, kinky BDSM fuck-fest! She takes off her super short shorts to reveal her banging body and Tommy can't wait to get his cock in that pretty mouth of hers. She reminds herself it's for Daddy so she sucks Tommy's dick with gusto taking it deep down her throat choking and making a slobbery mess until Tommy cums and she swallows every drop. OK a deal is a deal right? She sucked the hell out of Tommy's cock and he leaves but when he returns the next day with a suitcase full of rope and bondage gear Kira can't believe her eyes.\nBefore tying her up he bends her over to spank and paddle her firm round ass. He pulls her tight shorts off and licks her shaved pussy and asshole to get a taste of this sweet innocent farm girl.\nHe ties Kira up in doggie, her mouth gagged and ass high in the air exposing both her innocent holes and stuffs his hard cock inside her pussy. He fucks her and flogs her until she is screaming and moaning and then he fucks her tight little asshole. After all that Tommy puts Kira on her back with wrists tied to ankles and gives her a hardcore pounding in both her slutty holes until he shoots his hot load all over her face. She did it for Daddy! but who's her Daddy now??",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2018-04-27",
  "scene_id": 43304,
  "tags": [
    "Anal",
    "BDSM",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Choking",
    "Corporal Punishment",
    "Domination",
    "Humiliation",
    "Kinky",
    "Latin",
    "natural boobs",
    "Paddle",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "toned",
    "Vaginal Penetration",
    "yesdaddy"
  ],
  "title": "Do it for Daddy"
}