{
  "collections": [
    "TS Seduction"
  ],
  "description": "Sexy tattooed hunk Ruckus has been drilling and hammering all day to finish construction on the dungeon of the divine Miss Natalie Mars. Tossing off the tool belt and pulling out his phone on a break, Ruckus takes a quick look around before flipping to Natalie's nastiest porn. He unzips and slides his cock out, stroking it as Natalie chastises the dirty \"cocksucker\" in her video. Ruckus can only grin, jerking up and down while dreaming of Miss Mars' own delicious cock. Suddenly, the door slams behind him! Natalie has caught Ruckus in the act and is furious choking him, slapping him, and admonishing him for misbehaving in her dungeon! Ruckus confesses to being a fan and Miss Mars is going to make him prove it! She shoves her latex gloved hand down his throat while sucking at Ruckus' cock, making this pervert finally confront his own desire. Making full use of her new toy, Natalie spanks Ruckus, telling him what a filthy cocksucker he is while shoving her fingers up his greedy tight asshole. Ruckus is in heaven. He licks and sucks at Miss Mars' puckered pink hole and gorgeous cock, drooling in ultimate pleasure and marveling at his incredible luck to finally be at the mercy of his porno dream girl. Natalie quickly puts Ruckus in his place showing him with her hard, thick dick that he's here to bring HER pleasure and for HER use. She fucks him deep and fast, mounting him in every position imaginable from doggy to missionary and back. Natalie then tears open her stockings to reveal her adorable piggy's and soft arches, rubbing them against Ruckus' face and teasing each toe and sole into his eager mouth. Miss Mars rubs at Ruckus' cock with her divine feet, and tempts him with her tight wet foot pussy. Natalie then puts Ruckus' meat to good use, sliding his cock deep into her delicious pink hole, bouncing up and down as her own cock slaps thick and hard against her thighs. Miss Mars treats herself to a delightful fucking in doggy and missionary before both she and Ruckus cum all over her gorgeous latex corset. Ruckus hungrily slurps it all up, cleaning the beautiful Miss Mars before she saunters off leaving him to finish his construction work naked and wanting more.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ruckus",
      "person_id": 48209
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2018-05-15",
  "scene_id": 43312,
  "tags": [
    "anal",
    "blowjob",
    "choking",
    "Cock Worship",
    "corset",
    "dungeon",
    "Feet",
    "latex",
    "Male Sub",
    "role play",
    "slapping",
    "Stockings",
    "straight",
    "TS",
    "TS Fucks Male",
    "TS"
  ],
  "title": "Miss Natalie Mars Disciplines Tattooed Hunk With Her Cock"
}