{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Mena Li, our favorite Asian hottie, is no stranger to the Fetish Network dungeon. She’s been sexually disgraced a few times, our inventory of sex toys and goodies all used on her. Only thing that is different this time around is the type of domination. Let’s see if Mena can’t endure a lesbian domination threesome. Lexy Villa and Mila Blaze are the perfect duo to take care of Li. They turn her into a nylon pet, wrapping a pair of pantyhose around her head and collar on her neck with a leash. They leave her in a corner of the dungeon, waiting to be used and wrecked. Finally Mila wanders down and walks Mena around like a puppy. When Lexy enters, it’s time for some BDSM fun. They push her onto the bed and spread her legs apart. The wake it up with a vibrator, making her moan and flinch. She begs to cum but is denied. Let’s see how well she can hold her nut with Lexy’s huge strapon dildo up her cunt. Lexy loves rough sex, pulling Mena onto her rubber black cock deep and hard. Mila shoves her strapon deep down Mena’s throat, making her gag and scream for mercy. They make her apologize for being a dirty slut, continuing the double penetration, slapping her tits and spanking her ass. They pull her around on the bed, flip her back and forth on her back and stomach, legs pulled down by her head. The Mistresses enjoy wrecking her holes. They even brought a dick on a stick, a dildo attached to a handle for jack hammer pussy stretching. Mena says she prefers being a Dominant for a bondage scene, yet she’s such a great sex slave, giving her Masters whatever they want.",
  "directors": [],
  "models": [
    {
      "name": "Lexy Villa",
      "person_id": 53826
    },
    {
      "name": "Mena Mason",
      "person_id": 53759
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    }
  ],
  "release_date": "2018-03-08",
  "scene_id": 43311,
  "tags": [
    "Asian",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "Brunette",
    "Collar",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Fetish",
    "Gag",
    "Latinx",
    "Lesbian",
    "mixed",
    "natural boobs",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "Partner Studio",
    "Threesome",
    "toned",
    "Vibrator"
  ],
  "title": "Lexy Villa & Mila Blaze Wreck Mena Li's Pussy with Massive Strapons"
}