{
  "collections": [
    "Hogtied"
  ],
  "description": "We are always looking for new girls to put in bondage and torment. Kristen started by flirting with The Pope on social media. It seemed harmless enough at first, but she didn't realize that she was playing with fire. We all know what he's capable of and it seems little Kristen wants in on that action. Kristen begins in a grueling predicament bondage position on her knees with her neck pulled to the floor and her chest pulled to the ceiling. The torment begins quickly and now we see why she flirted in the first place. This girl knew what she was getting into; she knew that The Pope wouldn't take it easy on her. Orgasms are administered to reward her suffering before a crotch rope is added to her sensitive pussy. It's time for Kristen to fly, but she again gets the sadistic wrath of his ropes. She is upside down in a single point hip suspension that shows off her nice round ass. Nipple clamps are added for optimal suffering as she is pulled around by them. The final scene holds true to the rest of the day with more strenuous bondage and more suffering. She is blindfolded to increase her awareness when the pain comes. She may have bitten off more than she can chew, but Kristen proves that she will swallow anyway.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kristen Scott",
      "person_id": 60734
    }
  ],
  "release_date": "2018-07-05",
  "scene_id": 43321,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crotch Rope",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Predicament Bondage",
    "Rope Bondage",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "Swallow",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Girl Next Door in Brutal Predicament Bondage with Screaming Orgasms"
}