{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Alana Cruise will do anything for her Prince. Every day she dreams of his big fat cock and when she hears he's back in town, she goes to hang out around the building he's rumored to be in. Prince Yahshua knows this horny bitch is trying to find him, and he makes sure to find her first. He grabs her by the throat and takes her to meet his new crew. Alana's clothes are torn off as she is pushed down to her knees. This horny slut loves the attention and her mouth opens automatically to swallow the rock hard cocks surrounding her. She takes each dick like she was born to suck cock and soon is a sticky spit covered mess. Once these guys get her tied up, Alana could not escape even if she wanted to. They use her gaping mouth and her hands to jerk off their cocks. They tie her to the ceiling with her legs open for easy access. Alana almost cums when the first cock slides into her tight wet cunt. And these men know exactly what a slut like Alana is for -- taking all the dick as hard and fast as they can thrust. Alana screams as these five cocks work her over and when her Prince finally fucks her pussy, Alana cums hard on his thick cock. She squirts all the floor as she is ruthlessly finger-banged. Once the crew brings her down to the floor for more action, Alana's holes get fucked wide open. Dicks pummel her mouth, pussy, and tight asshole. These cocks triple stuff this greedy shameless slut in her mouth, pussy, and asshole. With all her holes filled, Alana is one happy slut. She moans around all their cocks, loving being stuffed. Once everyone gets a turn, they bring her up to her knees and cum all over her pretty little face. Alana kisses, licks, and sucks all their cocks as cum splashes across her face. Finally Prince blows his fat load right into his waiting little whore's mouth. Prince is back and Alana could not be happier.",
  "directors": [],
  "models": [
    {
      "name": "Alana Cruise",
      "person_id": 60194
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Jon Jon",
      "person_id": 35195
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Prince Yahshua",
      "person_id": 38513
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-04-18",
  "scene_id": 43325,
  "tags": [
    "Anal",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Gaping",
    "Role Play",
    "Rough Sex",
    "Straight",
    "Swallow"
  ],
  "title": "Alana Cruise Gets Gangbanged by Prince Yahshua and Crew"
}