{
  "collections": [
    "Divine Bitches"
  ],
  "description": "When latex whore Tony Orlando comes sauntering into Julia Ann's dungeon, he's convinced he knows it all. He's convinced he's seen it all before. Like all men, Tony is cocksure and entirely confident that he knows exactly how best to serve his mistress, without ever listening to what his mistress actually wants and needs. Lucky for Tony, Mistress Julia is patient and kind, and willing to teach her self-assured bitch boy his place in the world. In a deliciously sultry voice truly unique to the latex-clad goddess, Julia Ann humiliates Tony - breaking him down slowly and methodically. Tony endures over-the-knee spankings, licks in between every single one of Mistress Julia's stocking enshrined toes, and is smothered in her voluminous, soft, and radiant tits before being edged into psychological oblivion. Julia then binds her pet, parading him on elbows and knees for her pleasure before delivering a heavy dose of corporal. Tony's cock begins to drip as Mistress Julia then teases his greedy pink hole, plunging her gigantic dick suddenly into her meat toy, drawing deep moans and yips from the nasty slut gobbling up every inch. After thoroughly fucking Tony in doggy until he gapes and cries out from the overwhelming sensation of being entirely full of cock, Mistress Julia mounts her whore's face, using Tony only for his tongue. Fully immersed in her own pleasure, Mistress Julia smothers Tony with her divine ass, giving him taste after heavenly taste of her glorious wet cunt. Julia then uses her other pussy - her foot pussy - to edge Tony, who thrusts desperately between her delicate arches, trying to cum as Mistress Julia taunts and laughs at him. Finally, finally, she allows her pet to release his disgusting, sticky shame all over her divine toes. Tony, of course, has to lick up every single drop.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Julia Ann",
      "person_id": 32896
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2018-05-22",
  "scene_id": 43324,
  "tags": [
    "BDSM",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Latex",
    "Latex Darlings",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight"
  ],
  "title": "Latex Goddess Julia Ann Dominates Dripping Cock Whore"
}