{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Is Liz Rainbow a good girl or a bad girl?! We find out when Cadence Lux makes her debut as a voracious domme lurking in alleyways for the perfect victim. She has Liz Rainbow in tight leather arm bondage as she fondles her and rips orgasms from her aching cunt in the middle of Barcelona. Liz is so turned on by this public humiliation that Cadence decides it is time to find an audience and a strong punishment to challenge this self conscious sweetheart. As she leads her into a dark speakeasy she commands the patrons get involved and help find a dick big enough to satisfy this secretive whore. As Liz is slowly broken down by hard slaps, the taunting of the audience and the threat of the electrical wand, Max Cortes can't help but display his gigantic cock and challenge Liz to take it deep and hard. He pounds her all over the tables and chairs, while Cadence continues to shock and slap her. Liz is such a masochist for humiliation she invites her two best friends to watch her get railed and they rig a painful zipper on her tight figure and watch as she screams in pain as they rip it off. Finally, as she is fucking Max furiously in reverse cowgirl he demands to come on her face and she excitedly gets on her knees and drowns in his hot cum, thanking him and the bar patrons for their intense degradation!",
  "directors": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Liz Rainbow",
      "person_id": 59028
    }
  ],
  "release_date": "2018-10-01",
  "scene_id": 43336,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Humiliation",
    "Leather",
    "Pain",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Voyeur",
    "Zipper"
  ],
  "title": "Spanish Punk Princess Liz Rainbow tormented by Cadence Lux!"
}