{
  "collections": [
    "Public Disgrace"
  ],
  "description": "It is easy to think that because a woman is small she must be easily manipulated, Lilyan Red challenges that assumption as she resists and resists Mona Wales. Her destruction begins with a walk through the village where Lilyan is shoved against cold stone walls as Mona jams fingers up her cunt and torments her nipples until lactating breast milk oozes out! She is flogged and gasping in the center of the road and Mona places a metal bucket beneath the sweet cow. Mona demands that milk fill the bucket in order to please her and promptly attaches the bucket to Lilyan’s pussy lips with strong clamps.\nIf she stands up the weight of the bucket will stretch her poor pussy to the limit, so she maintains a painful squat to try and please her Mistress. Her efforts are dry and useless and Mona can see it will take much more pain and stretching to open the floodgates. There is a very special place for tough girls like Lilyan, Mona decides to take her to a local BDSM club where she knows a more experienced public will be clever and direct with their torment so she can get the April shower she’s looking for. Lilyan is strung up on a beam in the club and the bucket is placed beneath her. As she is prodded, slapped, clamped and spanked she is told she won’t be let down until the bucket is filled! She is manipulated with a vibrator, coming over and over, and still the bucket is dry! Mona is bored by Lilyan and tells the crowd to get a drink because no one wants to wait around for a dry spigot to drip. As they leave the sneaky little slut waters in the bucket and when they get back she is served the brutal punishment of Juan Lucho’s huge dick for depriving the crowd of their requests. As she is fucked while hanging, her tiny pussy is stretched and stretched by his massive cock pumping in and out. She is taken down and fucked blindly on a metal chair while her friends and strangers demand she get fucked harder! Lucho wants to come so he jumps up on a table so she can try to stretch her mouth hole over his enormous member. Soon we see what this little whore is good at and as he covers her big eyes in come she thanks everyone for the humiliation and brutality. Mona grabs her and shoves her into the street to seal the sting of embarrassment on this pint sized powerhouse.",
  "directors": [],
  "models": [
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Lilyan Red",
      "person_id": 56297
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2018-08-06",
  "scene_id": 43339,
  "tags": [
    "April",
    "BDSM",
    "Blonde",
    "Blowjob",
    "brunet",
    "Brutal Punishment",
    "Corporal Punishment",
    "Destruction",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Female Slave",
    "foreskin",
    "Humiliation",
    "Latinx",
    "natural boobs",
    "other hair color",
    "Pain",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "slim",
    "Straight",
    "Stud",
    "Sub",
    "Submission",
    "switch",
    "Vaginal Penetration",
    "Vibrator",
    "Voyeur",
    "white"
  ],
  "title": "Spanish Slut Lilyan Red is Milked, Tormented & Fucked by Mona Wales"
}