{
  "collections": [
    "Public Disgrace"
  ],
  "description": "It's not every day you have a shy little slut like Liz Rainbow around to be abused, but when you get the chance, you take it. Mona is all out filthy in her domination of Liz. As Mona cleverly straps Liz against a wall with duct tape she chides Liz for being a sick and selfish whore. Liz has her mouth taped shut to drown out her screams. She whips and flogs her, decorates the blue haired beauty withÂ pussy clamps, and edges and rips orgasms from her shaking body as train after train rushes by giving the riders a front row seat. After Mona finds an old toilet seat to crown the head of the trashy girl she leads her away from the abandoned station because she has a perfect surprise in mind. Mona serves Liz up hot on a platter to the patrons at the local bar. Shoving Liz into the crowd they descend upon her with glee. Pinching, slapping, caressing hands all around her have her overwhelmed and she is begging to get fucked. She is bent over a bannister and fucked roughly from behind by the ultimate daddy, Max Cortes. She is dragged from there and set in between the bar patrons as Max fucks her deep and hard on a stool. Mona is constantly zapping and striking her and takes Liz to a new, embarrassing low by making her lick and clean her pungent, hairy armpits! Liz practically gags from the shame! She is moved like a rag doll to the bar top and bent over backwards so Max can serve her his fat cock in an upside down throat fuck behind the bar as Mona commands the audience to write all the filth they want on Liz's fair skin. Max can't take it any longer and demands that Liz get to work if she wants his sloppy nut on her body. She rides him harder and harder on top of the bar, practically banging her head on the ceiling until he can't hold it and he covers her in a hot, wet, load of cum. Mona drags her outside to display the face painting and as she walks through the neighborhood onlookers are truly appalled!",
  "directors": [],
  "models": [
    {
      "name": "Liz Rainbow",
      "person_id": 59028
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2018-12-10",
  "scene_id": 43338,
  "tags": [
    "BDSM",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Facefucking",
    "Facial",
    "fake boobs",
    "Female Slave",
    "Hairy",
    "Hitachi",
    "Humiliation",
    "Latin",
    "natural boobs",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Slapping",
    "slim",
    "Straight",
    "Sub",
    "Submission",
    "switch",
    "top",
    "Vaginal Penetration",
    "Voyeur",
    "white",
    "Zapper"
  ],
  "title": "Mona Wales Humiliates Liz Rainbow Beyond Her Sickest Fantasies!"
}