{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Cadence Lux thinks that her vacation in Spain will be an easy walk in the park but as soon as she meets the amazing Ella Nova, her tune changes quickly. Although Ella looks like a sweet and timid blonde, she has a voracious and sadistic appetite for thoroughly wrecking the psyche of her submissive. Ella takes her newfound pet, Cadence Lux, to a local boxing gym to parade her around all of the creepy guys there. Ella pulls Cadence's pants down and shows everyone her holes. She rips holes in Cadence's shirt and pulls out her small perky tits. Ella tells them all how big of a slut Cadence thinks she is and two gym members, Max Cortes and Juan Lucho get their dicks hard and enter the ring to see just how slutty she really is. They take her down in the ring with a nasty, sloppy face fuck and Ella flogs her without mercy. Ella lifts her short dress and shoves Cadence's face into her big beautiful ass and makes her lick it all. Max and Juan take her down and spit-roast her like the whore she is, fucking her and filling her mouth with cock at the same time. Ella fashions a perfect fuck toy using a broomstick attached to a boxing glove to give her a beat down while she is made to orgasm with a vibrator. As she sucks and fucks, the other men in the gym take photos and videos and leer at her while the degradation continues. Finally, Ella has had enough of the circus and demands that they cover her with cum so she can show the town how filthy Cadence really is! Ella takes her filthy pet out for a stroll by the sea. She pushes Cadence down on the rocks and showers her in a fountain of her golden piss as the waves crash behind them.",
  "directors": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "models": [
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Cadence Lux",
      "person_id": 51424
    }
  ],
  "release_date": "2019-01-07",
  "scene_id": 43337,
  "tags": [
    "BDSM",
    "Blonde",
    "Blowjob",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Humiliation",
    "In The Gym",
    "Pain",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "Spit Roast",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Vibrator",
    "Voyeur"
  ],
  "title": "Cadence Lux, Spit-Roasted by Spanish Dick"
}