{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Ashley Lane is truly beautiful, but nothing is more exciting to Mistress Kara than the beauty that pain brings to her submissive. As the elegant blonde is led through the town square she sees the edge of a breaker wall that falls into the sea and Mistress Kara decides to leave her tied to a pillar, at the mercy of the waves. As each wave breaks over Ashley's taught body and drenches her in freezing, salty, seawater, a crowd becomes curious and watches as her nipples harden through her flowing gown and she shivers with each splash. Mistress Kara unties her and drags the soggy slut to the door of a bar. Ashley is thrown onto the ground and used as a welcome mat for the international clientele to trample and Mistress Kara commands her to clean their shoes and suck their heels as a tribute to their hospitality. The bar patrons are extremely aroused as she sniffs their crotches like an animal, searching for the hardest cock in the room. Mistress Kara makes her come and demands to be called Daddy. Mistress Kara hands the onlookers a dick on a stick and a vibrator while she flogs and face fucks Ashley and tells them to make her come as many times as they can. She brings Tommy Pistol over to continue face fucking while she torments the helpless blonde with corporal punishment. As the dick on a stick is jammed in and out of her dripping holes, Ashley loses control and begins to orgasm like a wild bitch in heat, so much that she needs to be held down by the strangers surrounding her. Tommy is so turned on he drops a huge, sticky load on her face uncontrollably as she gasps in gratitude. Mistress Kara solidifies the desecration by squirting all over her fucked up face while the sweating, horny locals look on in shock and disgust. Another slut successfully submerged in shame!",
  "models": [
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Ashley Lane",
      "person_id": 52112
    }
  ],
  "release_date": "2018-07-23",
  "scene_id": 43334,
  "tags": [
    "bdsm",
    "blonde",
    "blowjob",
    "Corporal Punishment",
    "discipline",
    "domination",
    "female slave",
    "humiliation",
    "pain",
    "public",
    "rope bondage",
    "Rough Sex",
    "squirting",
    "straight",
    "submission",
    "Vaginal Penetration",
    "vibrator",
    "Voyeur"
  ],
  "title": "Statuesque Blonde, Ashley Lane, Drenched, Defiled, and Shamed"
}