{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Hadley Viscara is an all-American busty blonde beauty who has just arrived to Spain and is excited to shoot for Kink.com for her very first time out of the United States. Here, Mistress Kara has devious plans in store for the innocent Hadley Viscara. She drags Hadley roughly by the rope that binds her through the Spanish backstreets. Kara rips Hadley's dress off leaving her completely naked while the public hurry by utterly shocked. Mistress Kara applies two pairs of nipple clamps to Hadley's perfect natural tits and then slaps them with her crop. She turns Hadley around and crops her perfect juicy round ass. She pulls up her own dress and presses Hadley's face against her pussy and makes her lick it until Mistress Kara cums all over Hadley's face. Mistress Kara loves watching her plaything squirm so she takes her into a shady dive bar and makes her sit on the bar-top and spread her legs and show everyone her pussy. Mistress Kara slaps Hadley's big natural tits with an acrylic paddle then teases and zaps her with electricity while the people in the bar gasp in shock. Mistress Kara tells all the old nasty men to caress Hadley's beautiful natural tits and so they do with mouths agape, surprised by their stroke of luck. Hadley gets worked up enough to beg for some dick and Tommy Pistol fucks her throat upside down on top of a pool table. He turns her over and fucks this American whore so hard she cums all over his cock. Mistress Kara jumps in on the action with her big cock strapped on and pushes Hadley to the edge with expert strap-on fucking. As the crowd gets wilder, Tommy Pistol takes her down on her knees and gives this filthy slut a proper Spanish welcome, a big fucking load right on her tits.",
  "directors": [],
  "models": [
    {
      "name": "Hadley Viscara ",
      "person_id": 60241
    },
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2018-11-26",
  "scene_id": 43332,
  "tags": [
    "anal",
    "bdsm",
    "big ass",
    "big natural tits",
    "big tits",
    "blonde",
    "blowjob",
    "bondage",
    "choking",
    "Corporal Punishment",
    "crop",
    "curvy",
    "discipline",
    "domination",
    "dominatrix",
    "electricity",
    "female slave",
    "femdom",
    "flogging",
    "Hitachi",
    "humiliation",
    "lesbian",
    "nipple clamps",
    "orgasm denial",
    "outdoors",
    "Paddle",
    "pain",
    "public",
    "Pussy Eating",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "top",
    "Vaginal Penetration",
    "Voyeur"
  ],
  "title": "Innocent Blonde Hadley Viscara Fucked Raw In Trashy Bar"
}