{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Mimosa, like a flower, is buried up to her neck in cold sand on a mediterranean beach, but has her head covered with a bucket like beach garbage. Mistress Kara rips the bucket off to reveal Mimosa's dreadful hair bound into a leash. She delightfully waters this flower with a shower and yanks her from the sand by her leash. While Mimosa holds up buckets of ice cold water and the wind chills her large body, Mistress Kara beats her mercilessly. She is drenched in ice water and led down the beach toward her ultimate degradation. Mistress Kara leads the tightly bound Mimosa into an art Gala, on display for all the patrons. Mimosa shakes her gigantic ass, teasing the crowd and begging for all the cock she can swallow. The crowd does not disappoint! As Tommy Pistol, Juan Lucho, Jordi, and Max Cortes attack her face, jamming their dicks down her throat, one after another, the crowd descends on her, beating her body relentlessly while she struggles to breathe. She is thrown onto a couch and bent over while each man fucks her juicy pussy and brutally punishes her tight asshole. Mimosa is very likely the biggest, toughest submissive out there, but has never submitted to one cock, let alone four! She is left crying and gasping for breath as Mistress Kara holds her head and the crowd shears her hair like a farm animal! She is covered in cum, and every guest spits on her in disgust as she laughs and cries in the center of the derision.",
  "directors": [],
  "models": [
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Max Cortes",
      "person_id": 20131
    },
    {
      "name": "Mimosa",
      "person_id": 57584
    },
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-01-21",
  "scene_id": 43335,
  "tags": [
    "aprilfools-sike",
    "BBW",
    "BDSM",
    "black hair",
    "Blowjob",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Crying",
    "Curvy",
    "Discipline",
    "Domination",
    "Facial",
    "Female Slave",
    "foreskin",
    "Head Shaving",
    "Humiliation",
    "Latin",
    "mixed",
    "muscular",
    "natural boobs",
    "Public",
    "Redhead",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Straight",
    "Stud",
    "Sub",
    "Submission",
    "Swallow",
    "switch",
    "Tattoo",
    "Vaginal Penetration",
    "Voyeur",
    "white"
  ],
  "title": "BBW Mimosa Sacrifices Every Last Dread of Dignity"
}