{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Betty Foxxx is a veteran performer that knows her way around the BDSM world. Mona knows the ultimate humiliation for this experienced domme will be to make her to submit to someone nearly half her age! In Liz Rainbow's debut as a domme, she owns Betty's toned and tan body while thoroughly embarrassing her in public. Mona begins by watching Betty walk around, dressed elegantly, with toilet paper stuck to her shoe. As the shame builds she is commanded to remove her panties and begin walking in the streets with her panties on her head, her gorgeous face covered with smelly and used underwear. Once she pulls her off the street, Mona decides to break the news that Betty will not be getting her punishment from Mona, instead, Betty will become Liz Rainbow and Juan Lucho's plaything for the day! Liz Rainbow awaits her tribute patiently, admiring the clothing in a local shop as the unsuspecting customers shop around her. As Betty Foxxx is tossed into the store the shop owner is horrified but intrigued and all the guests are invited to defile the defiant whore as Mona presents her to Liz Rainbow. Liz stuffs Betty's mouth full of her own panties and proceeds to frighten her with the electric zapper. Betty is shaking and trying to avoid the torment so Liz straps her, legs spread, with duct tape, to a chair. The crowd gathers around her, poking, pinching, and prodding her massive tits and sensitive thighs while she squeals in terror at the sound of every zap. Juan Lucho is changing in the dressing room and is surprised and delighted when he discovers the shenanigans happening outside. He pulls out his dick and happily shoves it into Betty's throat as she is doused in water. Choking and sputtering Betty begs for more and Liz decides to rip the tape off and make her work for her orgasms. As Betty displays her strength by squatting up and down on Juan's dripping cock the crowd cheers for her to work harder and they use a powerful vibrator on her swollen pussy. Juan flips her over so he can fuck her from behind as her head is covered in a paper bag to further cloud her senses. As Juan ejaculates powerfully onto her sweating face Mona returns with a pile of toilet paper to mummify Betty and the embarrassment culminates in a nude, sticky, mummified mess of a woman paraded down the street as onlookers whistle and laugh.",
  "directors": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "models": [
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Betty Foxxx",
      "person_id": 61149
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Liz Rainbow",
      "person_id": 59028
    }
  ],
  "release_date": "2018-07-09",
  "scene_id": 43340,
  "tags": [
    "BDSM",
    "Blowjob",
    "Choking",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Humiliation",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Sub",
    "Submission",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "Voyeur",
    "Zapper"
  ],
  "title": "Tight And Curvaceous Betty Foxxx Fucked In Public By New Young Domme!"
}