{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Spooky ghost, Charlotte Sartre's ultimate fantasy is to be fucked in a graveyard. So Mz. Berlin and Liz Rainbow are here to give her exactly what she wants. They use clamps to torment her nipples and pussy while they slap her thighs over and over. She is fucked with a bone they found on the ground and this little deathslut is so turned on she begs to get drenched on like a bouquet of flowers being watered by sprinklers. As they cover her in hot squirt she wants more and more! They take her to a rooftop overlooking the city and as curious people come up to watch the desecration of her body Juan Lucho fucks her hard in bondage. The dommes zap her, use the crop on her, and intermittently pound her pussy. Juan Lucho bends her into impossible positions so he can ram his huge cock deeper and deeper into the soaked cunt of this dirty girl. As she screams and begs for more, Lady Nala, Mona Wales, and Mz. Berlin set upon her, while she is made to orgasm with a vibrator. Charlotte's made to suck up her puddle and Mz. Berlin shows her off to the city while she leads her into the sunset.",
  "directors": [],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Liz Rainbow",
      "person_id": 59028
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Mz Berlin",
      "person_id": 14228
    }
  ],
  "release_date": "2018-10-29",
  "scene_id": 43341,
  "tags": [
    "BDSM",
    "Big Tits",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Discipline",
    "Domination",
    "Dominatrix",
    "fake boobs",
    "Female Slave",
    "foreskin",
    "Humiliation",
    "Latin",
    "natural boobs",
    "Public",
    "Redhead",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Stud",
    "Sub",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "Voyeur",
    "white"
  ],
  "title": "Spooky Submissive Slut Charlotte Sartre Gets Boned in a Graveyard!"
}