{
  "collections": [
    "Public Disgrace"
  ],
  "description": "Petite and powerful, Nikki Darling is made a fool of by Mona Wales in this sunny, sloppy day at the beach. Suited in tiny shorts, a floaty ring, and water wings, Mona tells Nikki to show off her ridiculous outfit to the beach goers and strut her tight body on the pier. A small crowd gathers, curious about this little spectacle, and Mona invites them to come watch as she leads Nikki toward further humiliation. Mona walks Nikki into a nightclub where she is commanded to excite everyone in the crowd with her cum-soaked, sandy, sweaty body. Ramon Nomar is ready and willing to fuck as Nikki is taken down with a clamps, spanking, and waterboarding. Ramon chokes her with his huge cock. She drools and coughs as he waterboards her again and Mona spits on her already dripping face. Nikki works Ramon's cock into her tight pussy as he leans against an onlooker for support, he makes her deepthroat his dick while the audience directs her and then fucks her in her ass from behind. After a clothespin zipper is ripped from her body she screams and is silenced by two young guys that have jumped in to help keep her still and ready for Ramon to fully penetrate every hole. Ramon busts a nut on her face and she thanks the group for showing her how slutty she really is!",
  "directors": [],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2018-08-20",
  "scene_id": 43346,
  "tags": [
    "Anal",
    "BDSM",
    "Black",
    "black hair",
    "Blonde",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Deepthroat",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Female Slave",
    "Humiliation",
    "muscular",
    "natural boobs",
    "Petite",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "Stud",
    "Sub",
    "Submission",
    "switch",
    "Tattoo",
    "Vaginal Penetration",
    "Voyeur",
    "white",
    "Zapper",
    "Zipper"
  ],
  "title": "Nikki Darling Surrenders Her Holes In Spanish Nightclub"
}