{
  "collections": [
    "Men On Edge"
  ],
  "description": "Dane Stewart’s a big-dicked stud ready to do what he’s told and get what he’s given. Sebastian Keys ties him up, binding his arms to his torso with his hands behind his back, then his ankles together, and hooks the whole rig to the ceiling. Tony Orlando is already working on Dane’s big dick, unzipping his pants to let the long fucker swing out, so he can jerk it and suck it. Dane’s blindfolded so he can’t see a thing. He can only feel the bondage holding him in place and the hot mouth sucking his big cock. Sebastian puts clover clamps on Dane’s nipples to add to the torment, the uses a jack off toy on his hot cock to bring him to the edge of orgasm. Bound, blindfolded and clamped Dane nearly blows his load multiple times. Tony kneels down and continues sucking his hard cock as Sebastian lifts Dane into a suspension, rendering him fully helpless. Afterwards, Dane’s bound to a chair, with a spider gag in his mouth, his arms tied back and his legs spread. Tony continues to jerk and suck his fat dick, toying with his big swinging balls, while Sebastian shoves a dick on a stick into Dane’s mouth to lube it up. He then slides it up Dane’s hungry ass. Dane gets his ass fucked and his cock sucked, brought to the edge repeatedly. He’s then subjected to an electrified jack off toy that sends shocks through his solid cock as Sebastian worships his feet. Finally Dane is allowed to actually cum. Jerked hard and fast by Tony he blasts his load all over his stomach. Tony feeds it to him as his reward, then he and Sebastian tickle him like crazy. He’s left a spent mess, covered in his own cum and sweat, fully worked in every way.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dane Stewart",
      "person_id": 61114
    }
  ],
  "release_date": "2018-06-12",
  "scene_id": 43356,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Clover Clamps",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "spider gag",
    "Stud",
    "Suspension",
    "Tickling",
    "white"
  ],
  "title": "Tattooed Stud Dane Stewart Gets His Big Dick Electrified and Edged"
}