{
  "collections": [
    "Men On Edge"
  ],
  "description": "Zak Bishop is new to KinkMen, but he’s looking forward to getting tied up and having his big dick edged. Sebastian Keys and Chance Summerlin take their time binding him to a metal cross, teasing his cock, using his body, then cutting his clothes off and ripping him out of them. Chance sucks his cock till it’s thick and hard, bringing him to the edge fast. Then Sebastian slides a transparent flesh-light onto that big cock, which Zak fucks feverishly, desperately trying to cum. But they deny him again and again, smacking his slick naked cock to punish him. They tickle him while he’s bound, but he kicks his feet, so they tie his feet down too, while Chance sucks and jerks his big fucking cock. Zak’s ass is then planted on the floor with his arms and legs tied to loops on the wall behind him, spreading his legs so Sebastian and Chance can get at his cock and ass. Chance continues to suck that big cock, while Sebastian slides his fingers into Zak’s ass, which Zak begs for more and more of. But the fingers aren’t enough, so Sebastian fucks Zak’s hungry hole with a vibrating dildo. His hole eats that dildo right up, as he’s brought to the edge yet again. Next, it’s back to fingers, until Sebastian has his whole fist in Zak’s ass, and he fists his beautiful stretched hole while Chance sucks and jerks him. The whole time Zak is blindfolded, so all he can do is feel the sensations of getting fucked and fisted and sucked without seeing a thing. The entire experience is overwhelming as his body shakes and he finally blows his massive load all over himself.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Zak Bishop",
      "person_id": 61162
    }
  ],
  "release_date": "2018-05-29",
  "scene_id": 43355,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Dildo",
    "Edging",
    "Feet",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "the wall",
    "Tickling",
    "white"
  ],
  "title": "New to KinkMen, Zak Bishop Gets Sucked, Edged and Fisted Till He Blows"
}