{
  "collections": [
    "Bound Gods"
  ],
  "description": "New meat Zak Bishop is reporting for slave training at the feet of leather daddy Dominic Pacifico. Master Pacifico wastes no time having Zak strip before binding him to a cross with his limbs spread and starting his lessons. He flogs Zak all over his chest and belly, and uses his hands and mouth to tease Zak's hard cock. Zak responses to every touch, arching to get closer to the pain and pleasure his Master provides. He moans with every hit and thanks his Master for each strike. He struggles not to blow his load as his Master sucks his cock and jerks him off. Master Pacifico continues to flog and crop Zak all over his body, leaving sharp red marks on his skin. He attaches two zippers to Zak's chest and rips them off. Zak screams with release and then gets to wrap his mouth around Master Pacifico's beautiful fat cock. Zak takes every inch of his reward. Finally, Zak is put in a a partial face hood and tied with his arms out. Master Pacifico breaks out a fuck saw and uses it to stretch his slave's ass in preparation for his cock. Zak's whole body shakes as his ass gets pummeled relentlessly. Once Zak's ass is stretched open, Master Pacifico slides his cock into Zak's stretched hungry hole and fucks him hard and deep. Once he's done with that hole, Master Pacifico has Zak suck him off and then blows his fat load all over Zak's chest. Now it's Zak's turn. He cums hard all over his Master's leather boots and gets to lick all his cum off them before being sent off into the shadows.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Zak Bishop",
      "person_id": 61162
    }
  ],
  "release_date": "2018-05-03",
  "scene_id": 43357,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "domination",
    "Edging",
    "Feet",
    "gay",
    "Hood",
    "humiliation",
    "leather",
    "Male Sub",
    "master",
    "pain",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "slave",
    "submission"
  ],
  "title": "Pretty boy Zak Bishop gets trained by Master Pacifico "
}