{
  "collections": [
    "Bound Gods"
  ],
  "description": "Pretty boy muscle stud Casey Everett wakes up in bondage. His limbs are spread and tied out of the way. Twine crisscrosses his body, wrapping him up like a prized piece of meat. He awakes to find his captor Colby Jansen watching from the shadows. Colby has been waiting a long time to get his hands on a perfect specimen like Casey. Colby takes his time cutting his new fucktoy’s clothes off, exposing his hard abs, tight ass, and beautiful cock. Casey struggles in his bonds and screams for help, but he’s not going anywhere. Colby stuffs Casey’s underwear in his wet mouth and continues to finger his asshole and taste his beautiful cock. Casey loses himself in the struggle, his fight to escape making his cock rock hard. He asks to cum, but Colby isn’t having it. He steps on Casey’s cock with his heavy black leather boots, and then strings Casey up like a ballerina in a music box. Casey is blindfolded with his arms and a leg tied up so he must balance with one leg on a rotating platform. Colby flogs Casey on his back and ass before pushing Casey’s mouth down around his rock hard cock. Casey chokes on Colby’s fat cock, drooling leaking from around his lips. He works Colby’s cock, taking it all the way to the balls. Next Colby ties Casey in a stress position, with his arms up, head down, and knees bent, and preps Casey’s ass. He turns up the e-stim pads on Casey’s ass. Casey moans as the electricity makes his muscles clench over and over. Colby sticks an acrylic plug in Casey’s ass so he can see the pink insides of his boy, before sliding his cock deep into Casey’s hungry hole. Casey moans as Colby pummels his ass. Once he’s done, Colby cums hard all over Casey’s face before leading him away for more fun.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Casey Everett",
      "person_id": 60450
    },
    {
      "name": "Colby Jansen",
      "person_id": 34457
    }
  ],
  "release_date": "2018-05-10",
  "scene_id": 43358,
  "tags": [
    "Acrylic Plug",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Fuck toy Casey Everett gets used by beefcake Colby Jansen"
}