{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Casey Calvert returns with her finest submission to date. She is no stranger to rough and brutal rope bondage and wastes no time getting warmed up. She is immediately suspended in the middle of the room, dangling helplessly and exposed to the sadistic intentions of her male handler. As her toned and athletic ass is spanked, her mouth is suspended by a huge rubber ball gag tied to end of a rope. As soon as her jaw tires for gripping the ball gag, a massive cock is thrust into her throat coercing her to gag and choke with delight. She is then restrained in a vicious back bend that draws her arms and feet into maximum extension. Her smooth skin is pulled taut and is ruthlessly abused by leather crop. Tired from the sound of her screams and her pleas for mercy, the dom shoves his cock down her throat and jams a hitachi onto her clit. Casey’s entire body spasms as many unwilling orgasms are ripped from her pussy while nipple clamps yank on her tits. Now that she is warmed up, Casey is flipped onto knees and tied down in a doggystyle position. Before she knows what is happening, the dom takes his giant cock and shoves it into her tight, creamy pussy. Her whole ass shakes while it gets spanked ruthlessly with a leather paddle. She whimpers with delights and begs to cum. But she hasn’t earned the right to orgasm yet and her dom relishes the pain of her orgasm denial. To end the day, Casey is flipped onto her back and is fucked mercilessly in her teeny pink pussy. As sweat pools all over her body she begs to cum with breathless whispers. And when she can’t handle another moment of the hot fucking, the cruel sadist blows a huge load of jizz all over her swollen and engorged pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    }
  ],
  "release_date": "2018-08-29",
  "scene_id": 43368,
  "tags": [
    "Athletic",
    "Ball Gag",
    "Bondage",
    "bottom",
    "Brunette",
    "Crop",
    "Feet",
    "Gag",
    "Handler",
    "Hitachi",
    "Leather",
    "Male Handler",
    "natural boobs",
    "Nipple Clamps",
    "Orgasm Denial",
    "other hair color",
    "Paddle",
    "Pain",
    "Rope Bondage",
    "shaved",
    "smooth",
    "Straight",
    "Sub",
    "Submission",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Bondage Legend Casey Calvert Tied Hard and Fucked Harder by Huge Cock"
}