{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Couple Eliza Jane and Pierce Paris finally have a night off together! Eliza really wants tonight to be special and orders new toys to try out with Pierce. Pierce is hesitant at first, but will try anything for Eliza. He strips for her, revealing his toned fit body. After he's naked, Eliza slaps handcuffs on him and bends him over her knee. Pierce is shocked as Eliza begins spanking him -- hard! He's even more surprised that he kind of likes it. Eliza then begins to trail her petite feet along his body. When her feet land on his cock, Eliza decides it's time to for more pain. She kicks Pierce in his balls over and over again. Pierce moans as Eliza's petite feet bust his balls, and Eliza is delighted. She's never had so much fun! She loves treating her boyfriend like a piece of meat. She sits on his face and uses his mouth to pleasure herself before sinking her pretty teeth into his big fat cock. Next, she zip ties him down and flogs him all over his ass and back. She slides her fat cock into his open mouth. Pierce swallows every inch of her fat cock, getting it all wet for his ass. Eliza splits Pierce's ass open with her strap on, thrusting relentlessly as she pounds Pierce's asshole. Once his ass is stretched wide, she fist fucks his slutty ass before stuffing both his balls into his ass. After his balls are inserted, she pushes her fist inside, fisting him while holding his own balls in her hand. But Eliza isn't done yet. She fits Pierce with a strap-on gag and fucks his face as she tugs on his nipple clamps with a leash. Once she's satisfied, Eliza uses her petite feet to jerk off Pierce. He cums hard, covering her toes in sticky cum. Eliza grabs his dick and furiously keeps jacking Pierce off until he cums again.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Eliza Jane",
      "person_id": 59596
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2018-06-05",
  "scene_id": 43363,
  "tags": [
    "BDSM",
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Couple",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Fisting",
    "Gag",
    "Humiliation",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Petite",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "switch",
    "toned",
    "unshaved",
    "white"
  ],
  "title": "Date Night: Eliza Jane Stuffs Pierce Paris' Balls in His Ass"
}