{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Lexi Foxy has no idea what she is in for when she gets lured into dungeon of true sadist. She quickly finds herself in over her head as she dangles bound and exposed in severe and inescapable rope bondage. As she whimpers through the giant red ball gag that has been shoved into her mouth a male dom beats her perfect round ass with a heavy leather flogger. As he pounds her butt Lexi's pussy begins to glisten with cum. She is a pain slut that wants nothing more than to be beaten and humiliated by real man. Now that this fuck toy has been warmed up Charles shoves his massive cock into her mouth and teaches his female sex slave how to gobble his massive wang. He grabs that back of her head and begins to throat fuck her until she gags and chokes from the rough blow job. She can't fit his huge cock down her throat but she tries again and again despite her pathetic failures. Pleased with her effort to worship his dick, the dom ties her into a doggie style pose and begins to ruthlessly fuck her tiny pink pussy with reckless abandon. Her boney body shakes as she gets rammed from behind. She can barely breath as she gets fucked harder than she has ever been fucked before. Charles the grabs her and flips her onto her back and ties her down securely with her legs spread wide open. The ropes of her bondage dig into her tight skin and leave red welts as she fights against their restraint. Her teeny pussy is swollen and sensitive from being fucked for so hard and so long. She squeals from the searing pain of her over stimulated clit by vibrated repeatedly by a hitachi. And just when she thinks that she can't handle one more multiple orgasm, Charles blows a massive load of jizz all over her abused pussy. Lexi is so cum drunk that she can barely whimper out the words, \"Thank you, master.\"",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Lexi Foxy",
      "person_id": 61319
    }
  ],
  "release_date": "2018-06-06",
  "scene_id": 43366,
  "tags": [
    "ball gag",
    "bondage",
    "dungeon",
    "gag",
    "Hitachi",
    "leather",
    "master",
    "pain",
    "pain slut",
    "Petite",
    "rope bondage",
    "slave",
    "straight",
    "throat fuck"
  ],
  "title": "Skinny Newbie Lexi Foxy gets her Tiny Pussy Pounded in Brutal Bondage"
}