{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The radiant and perfect Goddess Mia Little is arriving home as she receives a phone call from close friend Ruckus. Ruckus has been on four dates this week, and not a one of them is returning his calls. For the good of everyone, Mia decides Ruckus needs an intense training session in how to serve and pleasure women. She puts him on his knees and has him rub and massage her stocking clad feet. She teaches him to worship her feet and instructs him to show endless gratitude to anyone lets him touch them. She lets him worship her voluptuous ass and taste her delicious asshole. She uses her powerful legs to pull him close and put him in a chokehold. She smothers him with her tits. Every time Ruckus fucks up, he gets punished. Mia slaps his face, spits in his mouth, and spanks his ass. Once Ruckus learns to worship, he gets a lesson in fucking. Mia emasculates him, slapping his cock, and opening him up to a world of sensations that don’t revolve around his dick. She ties him to the ceiling, gags him, and binds his hands to a spreader bar. She opens up his tight ass with her fingers and then slides her long fat cock into his ass and gives him a good deep dicking. Afterward Mia ties Ruckus’ wrists to his thighs and teaches him how to give. She rides his face to orgasm, uses his cock, before jerking off above him. Then she has him stand and fuck her until she cuts again! After she is satisfied, she lets him jerk off on her beautiful feet and makes him lick up his mess.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mia Little",
      "person_id": 51496
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2018-07-03",
  "scene_id": 43362,
  "tags": [
    "Asian",
    "Athletic",
    "BDSM",
    "black hair",
    "Bondage",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "Slapping",
    "Slave",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Mia Little teaches clueless loser Ruckus how to serve Women"
}