{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Nadya Nabakova works at her desk, going through papers. The tedious work makes her so sleepy and as much as she tries to stay awake, she cant and falls asleep on her desk. Her boss, Chanel Preston catches her sleeping and wakes her up suddenly by slamming a box down on her desk. Nadya says she's sorry but Chanel says some punishment is in order. Chanel picks up Nadya out of her chair and bends her over the desk, lifts up her dress and spanks Nadya's ass until it turns pink. Next, Chanel strips Nadya naked and flogs her ass and back while scolding her about sleeping on the job. Chanel sticks her fingers in Nadya's mouth getting them wet and ready for her pussy. Chanel finger-fucks Nadya's tight pussy deep, then has Nadya sit on the desk and Chanel gets out the crop. Chanel crops Nadya's perfect perky tits, then spreads her legs to get her pussy cropped making it turn pink against her pale skin. Chanel lays her down on the desk and ties her tits up and ties her wrists to her thighs in rope bondage. She then applies binder clips to her nipples and stomach. Chanel pulls up her skirt and tells Nadya to stick out her tongue and grinds her pussy against Nadya's face while cropping Nadya's pussy, and doesn't stop until she makes Chanel cum. Chanel then gets a dick-on-a-stick and fucks Nadya's pussy with it while she smashes a big vibrator against her clit. Chanel fucks Nadya's pussy on her hands and knees with a strap-on and slides a thumb in her ass to get it ready for her cock. Finally, wearing leather cuffs and a leather harness, Nadya gets her ass fucked by her boss, Chanel with her legs spread on her back, biting down on a ball gag. After cumming with a cock in her ass, Nadya wakes up at her desk, still clothed.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Nadya Nabakova",
      "person_id": 61167
    }
  ],
  "release_date": "2018-05-24",
  "scene_id": 43364,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Leather",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "harness",
    "Rope Bondage",
    "Slave",
    "Straight",
    "Strap On",
    "Sub",
    "Vibrator"
  ],
  "title": "Chanel Preston Punishes Sleeping Employee, Nadya Nabakova "
}