{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Sarah's new boyfriend sells her to a sex trafficker, she manages an escape. But Ramon, her sadistic trafficker, hunts her down and fucks her into submission to enter his rough trade. Before Ramon can offer her up to clients he needs to check out his sexy blonde merchandise. He inspects her big firm tits and her shaved pussy, then he tastes her ass just to know what he is working with. Its all good! He wants to try her out in more ways than one so first he pulls out his big hard cock and tests Sarah's cock sucking skills with a deep throat sloppy blow job. Sarah is handcuffed and chained to a metal table so she isn't going anywhere. Her tits bounce around while she sucks Ramons dick and her pussy is getting wetter by the second. Bound in doggie with a ballgag in her mouth Ramon fucks Sarah's tight ready pussy and stretches her out til she is begging for more. He keeps her in line with the flogger and then vibes her pussy to remind her who is in control. Then a hot ride in reverse cowgirl Sarah bounces up and down on Ramons huge dick as he crops her tits. She is all in a frenzy from this hardcore fucking, her pussy lips pulled open wide with Ramons pounding cock. She licks his fat dick clean and is ready for more. On her back with her long lean legs tied and spread Ramon vibes her clit with the Hitachi, flogs her pale delicate thighs and pounds her little fuck hole out until she has a mind blowing orgasm. Ramon is a relentless fucking machine and drives Sarah crazy as he hammers her pink pussy into sublime submission and blows his load of hot cum all over her.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Sarah Jessie ",
      "person_id": 59871
    }
  ],
  "release_date": "2018-07-06",
  "scene_id": 43378,
  "tags": [
    "bdsm",
    "blonde",
    "blowjob",
    "cock sucking",
    "Corporal Punishment",
    "domination",
    "Hitachi",
    "humiliation",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration"
  ],
  "title": "Rough Trade"
}