{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When party girl Lauren Phillips comes up against dirty lieutenant Tommy Pistol, she is drawn into a world of sex and BDSM as an anal informant. And oh how dirty the lieutenant is. After Red headed beauty Lauren sucks Tommy's cock he tries to get the name of Lauren's supplier so he handcuffs her, ties her up and torments her with the flogger and zapper to get some answers but Lauren isn't giving in so easy. With a ball-gag and nipple clamps Lauren is standing up tied to a ceiling beam. Her tiny waist and big tits are bound with rope and her tall curvy voluptuous body wiggles around trying to escape the blows of this corporeal punishment. Tommy puts Lauren down on her knees in doggie and fucks her tight ass and then her horny pussy back and forth as he tries to break her down into revealing her suppliers name. Tommy fills Lauren's mouth with his big dick and she cleans off her ass and pussy cum. Flipped over on her back tied up tight in twisted bondage Lauren's long legs are stretched behind her head so her slutty holes are wide open and ready to be fucked again. Tommy pounds her ass while he vibes her pussy with the Hitachi and chokes her delicate neck. Lauren is loosing her mind moaning and squealing as Tommy demands the name of Lauren's supplier but this Anal Informant just cums and cums into sweet oblivion.",
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2018-07-13",
  "scene_id": 43377,
  "tags": [
    "bdsm",
    "Best of Anal",
    "big tits",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "curvy",
    "domination",
    "gag",
    "Hitachi",
    "humiliation",
    "kinky",
    "nipple clamps",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Anal Informant"
}