{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Rick stands Jeff against a padded bondage board and rope-harnesses his chest to it, plays with his cock, then tightly ties his legs to the board, does some elaborate bondage on Jeff's cock and balls, gags him with a knot-rope gag, blindfolds him, and finally rope-harnesses his head to the board as well. Rick then plays gently with him. Fade to undoing Jeff's cock and balls so Rick can play with them and Jeff's nipples. Rick attaches clothespins to Jeff's nipples and chest, and is in the process of removing them when Steve comes in to see how things are going.\nCut to: Jeff, plug gagged, ankles and wrists attached together, hoisted in the air. He is spun around, swung back and forth, spanked. The two masters play with his hole, finger fuck him, spank him with their hands and with a leather slapper, and during the abuse pause to kiss. They make out while Jeff swings back and forth. Matt removes Jeff's gag and skull fucks him while Rick slaps his ass; then they turn him around to feed him Rick's cock and continue reddening his ass. They go back to making out. Jeff gets flogged, sucks cock, gets skullfucked and ass-fucked, and obeys both Masters as each in turn uses and abuses him. Each in turn then cums on him.",
  "directors": [],
  "models": [
    {
      "name": "Aaron Tanner",
      "person_id": 268
    },
    {
      "name": "Jason Branch",
      "person_id": 61117
    },
    {
      "name": "Steve Ross",
      "person_id": 61118
    }
  ],
  "release_date": "2018-04-11",
  "scene_id": 43375,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Deepthroat",
    "Discipline",
    "dungeon",
    "Edging",
    "Facefucking",
    "Flogging",
    "Gag",
    "Gay",
    "Handjob",
    "Leather",
    "Male Sub",
    "master",
    "harness",
    "Rope Bondage",
    "slapper",
    "Slave",
    "Spit Roast",
    "Submission",
    "Suspension",
    "Tag Team",
    "Tattoo",
    "thirdparty",
    "Threesome"
  ],
  "title": "Masters & Slaves 1: The Slave Performs"
}