{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Grad School gets very interesting for student Seth Gamble when the Dean's Wife, London River gets involved. London is a stunner, Blonde Bombshell, huge tits, long legs, dressed in a tight pink number with black high heels. The Dean's wife is lounging by the pool when Seth arrives and convinces him to study her body for extra credit. Mrs River thought she was signing up for a quick pussy eating but opens the door for Seth's dominance. Tied up in tight restrictive rope bondage and her huge tits exposed, London's nipples are clamped tight. With a ball gag in her mouth muffling her screams, Seth get's to work on London's tight shaved pussy before moving on to corporal punishment. The crop comes out first and London's thighs take a beating. With the ball gag removed, Seth rams his cock down London's throat for a deep throat cock sucking. Tied up again this time with her ass up in the air and spread open, Seth get's to work on the rest of London's holes. Her pussy is filled and fucked with cock and her ass is zapped with an electric zapper. Her screams can be heard throughout the house. Will the Dean hear? After a thorough pussy punishment, Seth moves up to London's tight asshole for a deep anal fucking. London's ass takes a pounding Seth shoots his hot load all over her tight body. This afternoon romp will surely earn Seth a free ride through grad school.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2018-06-01",
  "scene_id": 43379,
  "tags": [
    "ball gag",
    "bdsm",
    "blonde",
    "blowjob",
    "bondage",
    "cock sucking",
    "Corporal Punishment",
    "crop",
    "domination",
    "gag",
    "high heels",
    "humiliation",
    "Pussy Eating",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Anal Graduate"
}