{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "The lovely London River thoroughly cleans her house in the nude. She prepares her perfect body with lotion and perfume then slips on sexy dark red lingerie. She's anticipating the return of her Master, Prince Yahshua. He's bringing four of his friends home with him so they can all have their way with London's pussy, ass, and mouth. She waits on her knees, masturbating until they get there. Upon arrival, they tear her lingerie from her body, take her out to the garden and they all sit in a circle and pull out their hard cocks. London makes her way around on her knees and gets face-fucked by them all, one by one, deep-throating all of their massive dicks. The guys continue their blow-bang inside where they tie up her tits and tie her hands behind her back with rope. Next, the guys place her on her knees with her ass in the air on top of a red ottoman, now with her elbows tied together and her face pressed into the furniture. One by one, they stuff her pussy with their fat cocks while the others fuck her mouth. The turn her over onto her back, exposing her big beautiful tits bound with rope and continue pounding her pussy and shoving their dicks down her throat. After that, they tie her legs behind her head like a pretzel, then tie her hands to her feet. They take turns fucking her gorgeous round ass, stretching and gaping it. They pound her ass deep and hard making her cum over and over. Her screams muffled by their hand-gags. After that, they cram their huge cocks in her ass, pussy and mouth simultaneously, making her completely airtight. Finally the guys finish on London's face, covering it with their hot loads.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Jon Jon",
      "person_id": 35195
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Prince Yahshua",
      "person_id": 38513
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-05-02",
  "scene_id": 43387,
  "tags": [
    "Airtight",
    "Anal",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Penetration",
    "Feet",
    "Flexible Fucks",
    "Gangbang",
    "Gaping",
    "housewives",
    "Lingerie",
    "master",
    "Role Play",
    "Rough Sex",
    "Straight",
    "top"
  ],
  "title": "Beautiful Busty Housewife, Bound and Banged"
}