{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Raven Haired hottie Lily Lane is digging her own grave as Small Hands watches over her. She is bearing the brunt of a botched mob deal that went down 30 years ago and now she has to pay for something she didn’t do. But she is no pushover, Lily realizes if she is gonna die she may as well end her days well fucked and satiated! Small Hands, but Huge Cock, is up to the venture so he starts by tearing Lily’s shirt off revealing her big, round tits and crams his hard dick down her throat for an epic throat fuck. Vivacious Lily can’t get enough as she sucks cock next to her soon to be grave.\nAfter they get warmed up Small Hands ties Lily up in a dark dungeony cell with nipple clamps and a clothespin zipper pinching tight on her stomach. Lily begs him to hit her! He snaps her ass with the crop, vibes her clit with the magic wand and rips the zipper off right when Lily is about to cum.\nBound tight with her hands above her head and legs spread Small Hands busts into her slutty pussy with that hard cock of his and fucks her silly, first in her wet pussy and then her tight ass. Then into doggie position with rope binding her ankles together Lily’s holes are exposed and ready to be fucked. First Hands whips her with the flogger to get her excited and then pounds her pussy out until she is about to lose it. And then anal as he relentlessly rams his cock into her ass in and out, back and forth between her ass and pussy and she can’t do a thing about it. Finally Lily is on her back in the jail cell with legs spread wide open. The crop, the Hitachi and Small Hands big cock drive Lily wild until she is screaming and squirting and cumming and begging for Small Hands’ huge load. He fucks both her holes like a champ and covers her with his hot jizz. Ahhh, now Lily Lane can “Rest In Peace”.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Small Hands",
      "person_id": 59499
    }
  ],
  "release_date": "2018-06-08",
  "scene_id": 43383,
  "tags": [
    "BDSM",
    "big dick",
    "Big Tits",
    "Blowjob",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Facefucking",
    "fake boobs",
    "Hitachi",
    "Humiliation",
    "Latinx",
    "Nipple Clamps",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "white",
    "Zipper"
  ],
  "title": "The Boss' Daughter"
}