{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When happy couple Bill and Zoey experience disinterest in the bedroom, they turn to pharmaceuticals for help. But their new sex drives push the couple to the extremes of bondage, BDSM and anal sex. Sexy blonde beauty Zoey Monroe takes a dose of ReKindle to jumpstart her sexual desires and boy oh boy does it work! She is voracious for cock. Wearing a skimpy little body suit Zoey seduces Bill with her sexy hot body and goes down on him to suck his dick. She stuffs his big tasty cock way back into her throat sucking, slobbering and playing with her pussy until she is ready to fuck. She throws Bill down on the couch and mounts his firm cock. She rides him hard, her perfect tits bouncing up and down and demands that Bill make her cum! But she just can't get it. Frustrated she leaves the room. Bill decides to take things into his own hands and turn Zoey into his little fuck doll. He takes a handful of ReKindle and things get wild and kinky. Bill ties Zoey up for the first time and introduces her to a whole lotta BDSM toys and tools. First the flogger on her delicate ass, then the zapper, then Bill licks her pretty ass and vibes her pussy until she cums. With all that ReKindle coursing through his veins his appetite for fucking is powerful so he fills Zoey's pussy up real good with his fat hard dick and puts a finger in her ass. He stuffs a metal butt-plug in her ass to prep her for some hot anal and then he strikes! Big cock in tight ass is a recipe for a damn good time so he fucks her ass while she moans and wiggles and cums. Then Bill ties Zoey up on her back with legs spread wide open showing her perfect pussy, ass and tits. Flogger, crop, Hitachi on clit, Bill crams his dick down Zoey's throat and she chokes on it to get it all wet so he can fuck her again. Bill pounds Zoey's wet and ready holes into sublime submission, first her eager pussy then her tight butt until Bill shoots his ReKindled cum all over Zoey's hot tits. When your flame is low, ReKindle!! Get some today!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Bill Bailey",
      "person_id": 46601
    },
    {
      "name": "Zoey Monroe",
      "person_id": 46520
    }
  ],
  "release_date": "2018-06-29",
  "scene_id": 43385,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "buttplug",
    "Corporal Punishment",
    "Couple",
    "Crop",
    "Domination",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "ReKindle"
}