{
  "collections": [
    "Sex And Submission"
  ],
  "description": "In this week's story Seth Gamble has some serious anger issues! He just can not control his rage so he seeks help from sexy redhead therapist Violet Monroe who has some untraditional and kinky therapeutic methods. Violet introduces Seth to her anger management program: rope, flogger, crop, paddle, ball-gag and Hitachi! A whole spread of BDSM tools to help Seth get back in his right mind. Tied up tight in doggie Violet encourages Seth to use her to get all his frustrations out. First he uses the flogger to whip Violet's pale ass until it turns bright pink. This is a win win situation cuz Seth's dick gets harder with every whack and Violet wants more, harder! He crams his dick down Violet's throat and gives her a proper face fuckin' until her mascara is running and she's a slobbering sexy wreck. Her big natural tits are bulging from the rope and bouncing with every thrust of Seth's cock. After some more punishing blows from the paddle and crop Seth slides his long cock inside Violet's wet and ready pussy and pounds her out until its time to fill that tight ass. Hardcore anal action ensues and Violet is a quivering blubbering mess. Finally on her back with wrists tied to her ankles Seth fucks Violet's slutty holes back and forth while he vibes her clit until she is freakin' and cumming and begging for more! The therapy is working! Seth's Anal Rage drives his cock harder deeper and faster into Violets ass until he shoots his load and leaves her covered in his cum. All better now!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Violet Monroe",
      "person_id": 20284
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2018-05-04",
  "scene_id": 43380,
  "tags": [
    "anal",
    "bdsm",
    "big natural tits",
    "blowjob",
    "choking",
    "Corporal Punishment",
    "crop",
    "domination",
    "gag",
    "Hitachi",
    "humiliation",
    "kinky",
    "Paddle",
    "redhead",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Anal Rage"
}