{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "The weekend. Rick and Gabriel arrive at Matt's house. Matt greets them at the door with slave Jeff. The two slaves make eye contact. At a snap of the fingers both kiss the Masters' boots while the Masters slap their asses.\nCut to: Gabriel and Jeff face to face, tied to a steel contraption, ball-gagged, collared, hands tied behind their backs, genitals connected by rope. Ropes also go from their cocks to the top of the contraption. Matt and Rick flog and spank and paddle them and attach weights to the rope connecting their balls. Clothespins are used on them. Ultimately the abuse cools down, the Masters comfort their slaves whose asses and backs are very red, lock them in a puppy cage to get better acquainted, tell them there are no limits on what they can do together, and leave.\nAs soon as the Masters are gone, the slaves kiss passionately. They know each other. They had been boyfriends and might have been lovers had they both not needed more domination, even if Jeff did have a dominant side. Now, both of them happy slaves with Masters, they make love. Gabriel cums. They nestle into comfortable positions and sleep.\nRick and Matt return, unlock the cage, release the slaves. Gabriel licks Matt's boots, Jeff licks Rick's.",
  "directors": [],
  "models": [
    {
      "name": "Jay Ross",
      "person_id": 61116
    },
    {
      "name": "Jason Branch",
      "person_id": 61117
    },
    {
      "name": "Steve Ross",
      "person_id": 61118
    },
    {
      "name": "Aaron Tanner",
      "person_id": 268
    }
  ],
  "release_date": "2018-04-24",
  "scene_id": 43395,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "Cage",
    "CBT",
    "Clothespins",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Flogging",
    "Gay",
    "Male Handler",
    "master",
    "masturbation",
    "Paddle",
    "Pain",
    "Predicament Bondage",
    "harness",
    "Rope Bondage",
    "shoe licking",
    "Slave",
    "Submission",
    "Tag Team",
    "Tattoo",
    "thirdparty",
    "top",
    "Twink",
    "Weights"
  ],
  "title": "Masters & Slaves 1: What's Mine is Yours"
}