{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "The lovely Lena Kelly stands behind the counter of the record store she works at when in walks the sexy, fit-bodied Cheyenne Jewel. Cheyenne tells her she’s not interested in buying records and that she’s heard that Lena makes some side money selling her body and wants to hook up. Lena suspects Cheyenne is a cop. Cheyenne gets naked and pulls out ten thousand dollars cash from her leather boot. Lena decides to throw caution to the wind and joins her in the middle of the store and says for that much money Cheyenne can have anything she wants. They kiss and take their shirts off, licking and sucking each others perfect perky tits. When Lena reveals her hard cock, Cheyenne gets excited and shoves it in her mouth and sucks Lena’s hard cock all the way down her throat. Cheyenne asks Lena to sit on her face and lies down on her back gets her face smothered by Lena’s pretty little round ass. Cheyenne licks and tongue-fucks Lena’s hole then gets a mouthful of cock once again as Lena fucks her face in a sixty-nine position. After that, Cheyenne wants her ass fucked and gets on her knees and presents her pretty hole. Lena shoves her stiff cock into Cheyenne’s tight asshole and pounds it deep hard and fast. Next Cheyenne wants to get her pussy fucked so Lena positions Cheyenne face down, ass up in the air and slides her cock into Cheyenne’s slutty pussy, pounding it hard slapping up against Cheyenne’s perfectly round muscular ass. Lena flips Cheyenne onto her back to continue fucking her pussy. Cheyenne spreads her legs wide and gets fucked while she fingers her own clit brining her to orgasm. Lena cant help but cum and shoots her hot load inside of Cheyenne’s pussy giving her a surprise creampie.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Lena Kelly",
      "person_id": 61007
    }
  ],
  "release_date": "2018-05-07",
  "scene_id": 43398,
  "tags": [
    "Blonde",
    "Blowjob",
    "Boot",
    "Brunette",
    "Cock Worship",
    "Cop",
    "Creampie",
    "fake boobs",
    "Leather",
    "muscular",
    "natural boobs",
    "Role Play",
    "shaved",
    "Slapping",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Lena Kelly's Creampie Surprise"
}