{
  "collections": [
    "Everything Butt"
  ],
  "description": "Mega slut Lily Lane is attending one of the hottest events of the summer – Lea Lexis’ pool party. Lily knows party goers aren’t allowed to enter the main house, but after spying her favorite wine through an open window, she can’t resist! She sneaks in and starts rummaging through the bar. When Lea catches Lily inside, she knows this slut is after more than just a bathroom. Lea leads Lily to her bedroom, throws her on the bed, and decides to have some fun. She ties Lily up and tugs down her bikini bottoms only to find that Lily is wearing a sparkling jeweled butt plug. Lily is embarrassed and promises to leave immediately if Lea releases her, but Lea isn’t about to let that happen, not after finding such a hot slut like Lily Lane stretched open and ready for more. She takes out Lily’s buttplug and starts fucking Lily’s asshole with big metal dildos. Lily moans as the cold metal dicks stretch out her poor asshole. Lea pops them in and out just to watch Lily’s asshole gape over and over again. Next she uses a 2 foot long toy to fill Lily all the way up. Lily is horrified to see what Lea wants to put in her, but her hungry hole swallows up that toy over half way before Lea decides this horny slut ass is ready for her fist. She squeezes all her fingers into Lily and slowly sinks her fist in. Lily cries out as her asshole stretches to accommodate Lea’s fist. Seeing Lily’s ass all stretched open makes Lea want her ass stretched too. She has Lily insert multiple plugs in her own ass, and once she’s got a good gape, she holds her asshole open for Lily to lick. Lily eagerly licks Lea’s ass, turning into quite the obedient little whore. Finally Lea breaks out her huge strap-on cock to fuck Lily. Lily moans as Lea pushes her fat cock into her asshole. Lea loves hearing all of Lily’s slut noises and fucks Lily nice and deep, ramming her cock all the way into Lily’s asshole. Lily loves getting fucked and cums hard all over Lea’s cock. Now that Lily’s ass is all used up, Lea kicks her out and sends her back outside with her ass all loose and wrecked.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Lea Lexis",
      "person_id": 17836
    },
    {
      "name": "Lily Lane",
      "person_id": 50199
    }
  ],
  "release_date": "2018-05-18",
  "scene_id": 43399,
  "tags": [
    "Amazing Orgasms",
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Big Tits",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Fisting's Finest",
    "Gaping",
    "Latinx",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Prolapse",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Party Slut Lily Lane gets anally stretched and fucked by Lea Lexis"
}