{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Leonardo is naked, bandanna-gagged in a sling, with leather restraints on his wrists and rope binding his knees to the sling straps. He works the gag out of his mouth and begs to be released but an unseen top says no and tells him he's about to be fucked. When he continues to protest, the top regags him. // Keith is rope-tied to a chair in a basement, wearing T-shirt, jeans and sneakers. His pants are open, his stiff cock sticks out. A tightly knotted black bandanna holds wadding in his mouth. Keith tries hard to get loose, fingers working blindly toward knots he cannot see. He is successful with some knots, less so with others. He thrashes around helplessly, then stops, tries again. // Except for his white crew socks, lithe and nimble Brent Woods is naked, tape-gagged and rope-hogtied on a brass bed. Working diligently, Brent succeeds in loosening the ropes tying his ankles to his wrists, then frees his feet, leaving only his hands still tied, with ropes around his waist and cock and balls. Eventually, he sits up and loosens the ropes around his waist and genitals. A few moments later the ropes around his wrists are loosening. // Limber Ricardo, fully dressed in jeans, a T-shirt and Converse hightops, is rope-tied on a stool. He struggles to pull his wrists through the ropes binding them, and finally manages to do just that. From there he quickly unties himself. Finally, free, but not bothering to take off his plug gag, Ricardo removes his shirt, pants and briefs, and sets about jerking himself off.",
  "directors": [],
  "models": [
    {
      "name": "Brent Woods",
      "person_id": 61255
    },
    {
      "name": "Keith Evans",
      "person_id": 61256
    },
    {
      "name": "Leonardo Schiavino",
      "person_id": 61252
    },
    {
      "name": "Ricardo",
      "person_id": 61253
    }
  ],
  "release_date": "2018-05-01",
  "scene_id": 43404,
  "tags": [
    "Athletic",
    "black hair",
    "Bondage",
    "Chains",
    "domestic",
    "Feet",
    "foreskin",
    "Gag",
    "Gay",
    "Latin",
    "Leather",
    "Leather Cuffs",
    "muscular",
    "Rope Bondage",
    "Suspension",
    "thirdparty",
    "top",
    "Twink",
    "white"
  ],
  "title": "Now Get Loose: Slingbound, Chairbound, Bedbound, Stoolbound"
}