{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "If there was ever a sex slave in the dungeon who needed an attitude adjustment it's dirty Lydia Black. Not because she's tattooed, pierced and gauged all over, and not because she wears heavy black bondage make-up and shaves the sides of her head, but Lydia needs extra brutal training because of the gleeful grin and twinkle in her eye she has when Master Bruno slaps her around at the beginning of this scorching hot session. Clearly she's a rebellious sort, and will require thorough domination and an extra helping of punishing rough sex to bring her into compliance. A nasty set of rusty chains bind Lydia's wrists and heavy metal slave collar between two railroad ties ready for whatever sexual humiliation Bruno decides to administer. He begins by finger blasting her cunt with gloved hands while also slapping her face repeatedly. Bruno shoves his big hung cock deeply into her mouth giving her no choice but to give him a deepthroat blowjob which evolves into a free-for-all face fuck. Next, he unchains her wrists and bends her over one post and bangs her hard from behind, stopping occasionally to light up her skinny ass with a black leather flogger. Pain slut pig Lydia loves it! Cum drips out of her cunt on Bruno's out strokes, and that's just the first eleven minutes. Wait until you see the last half!",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Lydia Black",
      "person_id": 60714
    }
  ],
  "release_date": "2018-05-03",
  "scene_id": 43401,
  "tags": [
    "Athletic",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Chains",
    "Collar",
    "Deepthroat",
    "Domination",
    "dungeon",
    "Facefucking",
    "Female Slave",
    "Flogging",
    "gloves",
    "Humiliation",
    "Latin",
    "Leather",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "PIV",
    "Rough Sex",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Sub",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Lydia Black Sexual Disgrace Punk Rock Cock"
}