{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "Mistress Aiden Starr has invited seven of her best clients for a very special Sunday brunch. The main course- Slut Bottom Chris’ ass and mouth! She leads her fuck pig out of his cage and makes him kiss the ladies’ feet. He puts his tongue to work as the ladies sip drinks and enormous strap-on cocks bob above his head. Mistress Aiden commands our whore to climb up on the table as Megan Cox greases up his waiting hole and sexy young Jay Taylor steps between his legs, a large black and white dildo bobbing in front of her. Mistress Aiden mocks his teeny tiny little wiener, telling him that he has to be an ass slut because his pathetic cock isn’s enough to satisfy a woman. Jay pounds his man-hole like a seasoned veteran as the other ladies verbally humiliate him. Next, beautiful blonde Maia steps between his legs, with more than a foot of black dildo dangling between her legs. She drives it deep into his waiting hole and then starts pumping it in and out as Chris thanks the ladies for their generosity. Next up is sister Dana DeArmond. While her latex nun’s habit is heavenly, her bright red devil dick promises hell for the Slut Bottom. She meets no resistance when she enters his now gaping rectum. The ridges on Sister Dana’s cock have Chris moaning as she thrusts into his dripping backside. The ladies make him squeal like the ass-pig he is. Sister Dana asks him how it feels to be rammed in the butt-hole by a bunch of strangers, before she asks the lord to show the sinner the way, how to be a good little slut, to be the best whore he can possibly be, in the service of our ladies! Anna Valentina and her giant flesh-colored dildo are next. She’s only gentle for a moment though, before long Anna is pounding the slut like a jack-hammer while she orders him to squeal like a pig, daring him to cry. She makes him beg her to satisfy him while she spits in his face, lube and sweat leaking from his ass. Next in line is Kiki D’Aire, sporting 18 inches of rubber on her hips. While Kiki prepares to assault his anus, Dana realizes that the whore might be thirsty, and spits a mouthful of her drink in his face. Kiki teases Chris with the tip of her dildo before going balls deep into his gaping man-pussy. When she pulls out his ass practically erupts with spent lube. But only for a moment, as Megan Cox quickly fills his vacancy with her big, black anaconda. As Chris borders on tears, Dana mocks him, “poor baby got a big black cock in your ass, boo hoo!” When Megan finishes, he hobbles over to the top of the cage, so more ladies can destroy his ass! Aiden Starr slams a big black dildo into his hole and invites him to guess which famous male porn star it’s molded from. As she bounces on his hips Maia and Anna double-team his mouth. Aiden pulls out and Sister Dana steps in with a rubber hand. Once it’s in place, the boxing nun works out some aggression by punching it while Aiden jack-hammers Chris’ mouth with her big black cock! Always respectful, Chris thanks the ladies for punching his asshole and then Kiki D’Aire comes up with an even bigger toy. How much can his hole take?!? When the giant dildo doesn’t glide right in she starts to question his status as a butt slut. This motivates him and he starts backing onto her toy. Mistress Aiden asks him if he can go airtight for her, but he can only mumble an answer because Maia has a huge ebony dildo stuffed in his mouth. Finally,Chris climbs down off the cage and bends over a table so Anna Valentina can fuck his face while Maia pounds his ass! But that was just a warm-up for the monster cocks of Kiki and Megan Cox. Exclaiming that “ATM makes my pussy wet,” Maia makes Chris like the plastic penis that was just in his ass like an ice cream cone! For the final humiliation, Chris is made to jack himself off. His balls drained, he crawls back in his cage and curls up with a dildo in his mouth, totally spent.",
  "directors": [],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Anna Valentina",
      "person_id": 61209
    },
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Jay Taylor",
      "person_id": 37128
    },
    {
      "name": "Kiki Daire",
      "person_id": 178
    },
    {
      "name": "Maia Davis",
      "person_id": 43599
    },
    {
      "name": "Megan Cox",
      "person_id": 61208
    },
    {
      "name": "Slut Bottom Chris",
      "person_id": 22252
    }
  ],
  "release_date": "2018-04-26",
  "scene_id": 43415,
  "tags": [
    "Airtight",
    "Anal",
    "Anal Stretching",
    "BDSM",
    "big dick",
    "Big Natural Tits",
    "Big Tits",
    "Big Toy",
    "Blonde",
    "Bondage",
    "bottom",
    "brunch",
    "brunet",
    "Brunette",
    "Cage",
    "CBT",
    "Chains",
    "Collar",
    "Corset",
    "Curvy",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Ebony",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fishnets",
    "Gangbang",
    "Gaping",
    "Humiliation",
    "Kinky",
    "Latex",
    "Leather Cuffs",
    "Male Sub",
    "mixed",
    "natural boobs",
    "Nylons Stockings",
    "other hair color",
    "Pegging",
    "Punching",
    "Reverse Gangbang",
    "shaved",
    "Slave",
    "slim",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Seven Dommes Throw a Strap-on Gangbang Party"
}