{
  "collections": [
    "Families Tied"
  ],
  "description": "Smouldering big-titted bitch 18 year old Amilia Onyx is hot for Daddy and rolls up on his new wife ready to steal his cock and her home. After Derrick left her mother, Amilia's school girl crush on him twisted into a perverted obsession, so when her mother sends her to his house with a repayment contract for money owed, she hauls along all his long abandoned sex toys in a bid to humiliate him and coerce him into fucking her. Derrick fucks her, but on his terms, which places her on the floor with her arms wrapped under her huge bouncy tits and locked in place with a leather straight jacket. First that round alabaster ass get's a strict spanking, turning it a nice bright red. She is made to cum on Daddy's crop and take a heavy flogging while she get's her teenage face fucked. Her beautiful eyes beg for cock, so Derrick throws her on her back to start negotiating for repayment terms, which keep getting farther and farther away the more she get's her greedy pussy slammed with her Dad's dick. Cumming like a little whore she squirms and begs to have the vibrator taken off of her, agreeing that no repayment be made for up to a year.\nSatisfied, Derrick let's her get dressed to leave his house, but she runs into his wife India, who would like to have a little talk. Amilia is as rude and bratty as ever, earning herself the business end of the cattle prod and a face full of soggy toast. Humiliated and beaten, she gets her ass thrown on the floor to suck dick while a vibrator lights her clit up. Holding trays and begging to cum, she is made to lick India's pussy until her step-mother cums all over her gorgeous face. India and Derrick are not done with that rich little cunt until she is bound in leather belts, gagged, and screaming for permission to cum while India has her elegant MILF ass pounded by Derrick. Shocked with cattle prod, and thoroughly humiliated, Amilia gets on the floor and sucks whatever is place in front her face while begging for cum like a good little slut should. India enjoys many hot anal orgasms and the view of her newly obedient step-daughter taking a load on her behalf.Â",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "India Summer",
      "person_id": 16909
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Amilia Onyx",
      "person_id": 61275
    }
  ],
  "release_date": "2018-06-22",
  "scene_id": 43416,
  "tags": [
    "18-Year-Old",
    "Cattle Prod",
    "Crop",
    "Family Roleplay",
    "Flogging",
    "Leather",
    "MILF",
    "Spanking",
    "Straight",
    "Straight Jacket",
    "Vibrator"
  ],
  "title": "18 Year Old Busty Rich Brat Amilia Onyx Brought to Heel"
}