{
  "collections": [
    "Families Tied"
  ],
  "description": "When little Kendra's step-sister Natasha shows up unexpectedly at her door, all that the submissive princess can do is pout and whine because her Master, Tommy Pistol, has other plans for the two sisters... Only moments before Natasha's arrival, Mr. Pistol's cock was deep in the wet, hungry asshole of his personal slut and wife, Kendra Spade. Collared and cuff, Kendra jingled into the dining room to bring her Master his breakfast, forgetting Tommy's one requirement - her tits must be presented to him and available for fondling at all time. As punishment for a fully-buttoned blouse, Tommy smears Kendra's face in his buttered toast, clamping her pussy lips together, and spanking his whore for being so fucking greedy for his cock so early in the morning. Kendra soaks up every drop of attention, gagging herself on Mr. Pistol's cock until she's gurgling up strings of spit and cumming over and over again as he fucks her fast and hard in her tight pink asshole. Interrupted all too soon by Natasha, Tommy sends Kendra off to do some shopping for a welcome dinner so that he can have a private moment with Kendra's step-sister to teach her the rules of the house. Shocked by the kinky relationship between them, Natasha is reluctant to accept Mr. Pistol's requirements of discipline and respect, but caves quickly knowing that she'll be allowed to dominate her submissive whore step-sister as well.... Tommy tears Natasha's dress off, revealing her supple tits and round, tantalizing ass. Next he tears into Natasha herself, flogging and spanking her, fucking her tits and mouth before finally fucking her dripping, beautiful cunt - giving her a lesson she won't forget on what it means to be a Master. When Kendra arrives home from shopping, the two are ready to pounce, convincing their sweet submissive that she needs a dose of domination from family. While Natasha spanks, paddles, and slurps at her asshole, Kendra chokes herself on Mr. Pistol's cock before riding it, bouncing up and down as she begs her step-sister for more. Natasha then brings Kendra's face hard against her cunt, rubbing against her step-sister's tongue as she cums while Tommy continues to fuck his favorite little toy. Mr. Pistol fucks Kendra faster and faster in cowgirl and doggy, both in her pussy and her ass, while zapping Natasha with an electric wand. As Kendra cums over and over again on his cock, her asshole gapes and Tommy gives Natasha a taste of her own step-sister's sweet asshole. But Tommy also wants a taste of something different.... The two step-sisters swap, and now it's Kendra that has to beg for her husband to fuck her step-sister as her step-sister buries her tongue deep in Kendra's pulsating pink pussy. As Natasha cums on Tommy's cock, Kendra feels a wave of new submission wash over her, and she eagerly shares her Master's dick with Natasha - the two sucking on his balls and cock until Mr. Pistol covers both sister's faces in cum.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Kendra Spade",
      "person_id": 60694
    },
    {
      "name": "Natasha Nice",
      "person_id": 26297
    }
  ],
  "release_date": "2018-06-08",
  "scene_id": 43418,
  "tags": [
    "discipline",
    "domination",
    "Dose Of Domination",
    "Family Roleplay",
    "flogging",
    "kinky",
    "master",
    "spanking",
    "straight",
    "submission",
    "zapping"
  ],
  "title": "Submissive Step-Sister Gives Up Her Holes & Her Inhibitions"
}