{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Skylar Snow is a horny gang bang slut, and she's so ready to get fucked in every hole she can barely contain herself. She's doesn't have her rent money again, so she takes care of it by giving up her squirting pussy, her tight ass for some deep anal, and her wet hungry throat to her roommate and his 4 friends! She goes all-in right away, eagerly choking down all the cocks, with spit running out her mouth and down her neck. They toss her around between them, each taking turns face-fucking her. It's brutal, but Skylar keeps on going, letting them each take turns deep throating her before they tie her up. She squirts repeatedly as the guys play with her slutty cunt while feeding her cock. They then start pounding her tight little pussy. One cock after the other, they keep passing her around like the fuck slut she is. The whole time she wants more, devouring all the cock she can get. With her pussy still hungry for cock, she takes hard anal and double penetration, pushing her limits. But she keeps taking it, letting the guys have their way with her, slapping her face and spanking her sweaty ass as they fill her up airtight. Finally they all unload on her. Five huge, hot cumloads shooting all over her face and in her mouth! Another month's rent is taken care of!",
  "directors": [],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "John Long",
      "person_id": 61283
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-05-30",
  "scene_id": 43413,
  "tags": [
    "Airtight",
    "Anal",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Choking",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Role Play",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Squirting",
    "Straight"
  ],
  "title": "Skylar Snow Takes 5 Hard Cocks In Every Hungry Hole"
}