{
  "collections": [
    "Families Tied"
  ],
  "description": "Eliza Jane has a twisted sexual obsession with her voluptuous Step-Mommy. After a taboo affair under her father's own roof, Eliza loses track of her disgraced Mommy, but tracks her down to the suburbs, enjoying a fresh start and marriage to a new man. Enraged that she has been betrayed and turned on by finding Ryan Really bare ass naked unaware she is being watched through the window, Eliza knocks on the window and starts a world of dark sexual turmoil. Demanding that Ryan apologize for leaving her like that, Eliza throws her on the ground, ties her big titties up, clamps her milky nipples, and makes her lick her rebellious teen pussy. Ryan laps at her step-daughters cunt until she is thrown over, fucked hard with a strap on, humiliated and made to cum on her step-daughters dick.\nEliza thinks she is in full control, happily eating a sandwich and concocted ways to break up Ryan's marriage when Tommy comes home. No fool to her game, the first chance he gets, Tommy plays Eliza and disciplines her scheming ass with an over the knee spanking, degradation, face fucking, tight rope bondage and some violently hot anal sex, stepping on her head and railing her until she cums like a helpless slut.\nRyan comes home to find her past and her present have collided, resulting in Eliza tied spread eagle before her with her tiny body heavily clamped for punishment. Ryan endures a punishment of her own: Train Eliza to obey Tommy as the man of the house, or kick her out of the house for good. Like a good Mommy, Ryan gets fucked by her husband in doggy while amusing Eliza's clit in a game of positive reinforcement. The rest of the day is hot threesome action, with a resistant rebellious Eliza transformed into a proper daughter sucks dick with her Mommy like an enthusiastic little whore.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Eliza Jane",
      "person_id": 59596
    },
    {
      "name": "Ryan Keely",
      "person_id": 15370
    }
  ],
  "release_date": "2018-07-06",
  "scene_id": 43417,
  "tags": [
    "bondage",
    "Family Roleplay",
    "lesbian",
    "rope bondage",
    "spanking",
    "straight",
    "strap on",
    "threesome"
  ],
  "title": "Lesbian Teen Eliza Jane Gets Anal Revenge From Step Mom Ryan Keely"
}