{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Brent’s wrists are still taped behind his back. Jimmy puts Brent’s white socks back on Brent, then ties the toes together, and with Brent’s legs over his head, Jimmy goes back to sucking Brent’s cock before trying a complicated sixty-nine. Both guys have raging hardons and Brent, topping from the bottom, tells Jim he wants to cum and what Jimmy should do to make him cum. It looks as though Jimmy is going to accede to Brent’s wishes, when he suddenly grabs Brent’s briefs, shoves them in Brent’s mouth, tapes them in, then stands up and tells Brent to get himself free. Cut to Brent tied to a support post in the unfinished house, and seemingly alone. Jimmy is napping on the cot, sleeping heavily. Brent tries to untie his wrists, but can’t quite do it, and after a while, frustrated, calls out to Jimmy who isn’t easy to awaken. Brent is irritated and angry, he wants out. But Jimmy won’t untie him, and they have a real spat, with Jimmy teasing Brent but also speaking some home truths. Jimmy gets a bottle of wine from the kitchen counter, pours a glassful, drinks, then gives some to Brent to drink. Brent takes a mouthful and spits it in Jimmy’s face. This angers Jimmy, who goes to dry off. On his return Brent has succeeded in freeing his hands, and they start making out. Jimmy unties Brent, who acknowledges, once free, that “It was fun. Most of it was fun. Towards the end.” He sucks Jimmy’s dick. Jimmy hoists Brent up and over his shoulder so that they can do a standing sixty-nine, which he apparently enjoys and Brent hates. When Brent refuses to do it Jimmy drops him. Brent goes over to the cot and decides he’s going to take a nap.",
  "directors": [],
  "models": [
    {
      "name": "Brent Woods",
      "person_id": 61255
    },
    {
      "name": "Jim Richards",
      "person_id": 61276
    }
  ],
  "release_date": "2018-05-29",
  "scene_id": 43427,
  "tags": [
    "69 Position",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Couple",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Rope Bondage",
    "Slave",
    "Tattoo",
    "Partner Studio",
    "white"
  ],
  "title": "Bondage Under Construction: Get on Your Knees and Beg"
}