{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "Mistress Cybill Troy is ready for a little playtime with her pets. She gets Marcelo’s attention with her crop across his ass, then yanks his balls between his legs and drags her cigarette across them before binding them tightly behind him. All tied up they are much easier for Mistress Cybill to crop, which she does, making Marcelo scream! Mistress releases slave Jimmy Broadway from his cage, and leads him over to the cross, where she ties his balls to Marcelo’s. Now, when she crops one’s balls, the other feels the pain too. She has Jimmy pull the line tight and then lays a series of sharp blows across Marcelo’s ass with the crop and cane. Marcelo winces in pain as he tugs on Jimmy’s balls. He screams and squirms, trying to make the pain go away! He tries to dodge her blows, but the rope between his legs doesn’t let him. Mistress moves up to Marcelo’s exposed ass, and when he cries out she orders him to stop being such a drama queen. When she switches from the whip to the cane he has to struggle against the pain. She turns him on the cross to expose his front, giving his nuts a good tug to make sure they’re still there. Once she’s assured that they are, she starts working on them with her whip! Will Marcelo break before she’s done? Next, she crops his cock and balls rapidly, making him scream in agony. He dances like a marionette to control the pain. She pulls out some mouse traps, attaching two to his nipples and a third to the tip of his cock. When his screams get too loud for her she clips a clothes pin to his tongue to shut him up. She affixes more clothes pins to his chest and cock and then uses her whip to knock them off! But worse than the pain is the humiliation of having to clean all of them up when his mistress is done.",
  "directors": [],
  "models": [
    {
      "name": "Cybill Troy",
      "person_id": 61206
    },
    {
      "name": "Jimmy Broadway",
      "person_id": 19688
    },
    {
      "name": "Marcelo",
      "person_id": 46090
    }
  ],
  "release_date": "2018-04-30",
  "scene_id": 43421,
  "tags": [
    "BDSM",
    "black hair",
    "bottom",
    "brunet",
    "Cage",
    "Caning",
    "CBT",
    "Clothespins",
    "Collar",
    "Crop",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Femdom",
    "foreskin",
    "High Heels",
    "Humiliation",
    "Kinky",
    "Latex",
    "Latinx",
    "Leather Cuffs",
    "Male Sub",
    "natural boobs",
    "Pain",
    "Predicament Bondage",
    "Sadism",
    "shaped",
    "Single Tail",
    "Slave",
    "slim",
    "Smoking",
    "Straight",
    "Submission",
    "Tattoo",
    "the cross",
    "Partner Studio",
    "Whipping",
    "white"
  ],
  "title": "Mistress Cybill Troy has 'em by the Balls!"
}