{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Summer Vengeance series Tournament on Ultimate Surrender! Today is the moment you've been waiting all summer to see. We have had 13 of this season's finest veterans and rookies in a single knockout seeded tournament. Today we have our #4 ranked wrestler, Cheyenne Jewel, put against our #1 ranked wrestler, Mistress Kara in the season finale. Cheyenne \"The Wrangler\" is an all-natural, muscular, big assed, brunette hard-body. Her wrestling skills are very good, but she has taken on Kara many times and has never been able to figure out how to stop Kara's signature move. Kara \"The Queen\" was originally ranked #2 behind Ariel X, but Ariel has had to pull out of the tournament due to injury. Kara is the Queen for a reason. She easily dominates her opponents and then turns them into servants to please her after each victory. She has one move that every single wrestler seems to get stuck in. A move that enables her to keep control while burying fingers deep into her opponents' pussies. She has landed this move on every girl in this tournament. Today, Cheyenne Jewel is able to stop Kara's move. This is her most technical match EVER against Kara. The girls are so even in the arm wrestling that they end up dragging each other all over the mats trying to gain an advantage. The wrestling is the same way. Zero points are scored in the first half of the first round. The girls circle each other and push each other, trying to catch each other off guard. They are tentative and patient. Each girl knows that one mistake can land them in hot water with fingers buried in their pussies. The match ends with a very low score on the board. The winner gets her hand raised and then drags her opponent to the center of the mats for brutal domination. The winner slaps the losers face and hand gags her as well. To show her dominance, she puts her loser into a head scissor and denies her orgasms while she punches her belly. The loser will only be allowed to cum when the winner allows it. Finally the champion allows the loser to cum and then makes her come again and again and again making her have orgasm overload. The loser is weak from the orgasms which makes her prime for putting into brutal submission holds. The winner takes advantage of this and puts the loser into one submission hold after another. She puts her in a choke, a boston crab, a baby swing and a camel clutch. The loser taps out each time. The winner then takes her strap on cock and fucks the loser until she cums more and more. Finally the winner wants her prize. It is her time to cum. The winner rides the losers face until cum is dripping out of her beautiful winner pussy. This is a winner take all match. The winner lifts and carries the loser off the mats and tells her that every night from today on, she is going to fuck the loser just like she did until the fucking loser can finally beat her in wrestling. This punishment is on going until these two meet again on the mats and settle the score there.",
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Mistress Kara",
      "person_id": 19043
    }
  ],
  "release_date": "2018-08-22",
  "scene_id": 43424,
  "tags": [
    "Ariel X",
    "brunette",
    "champion",
    "domination",
    "Face Sitting",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "muscular",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tournament",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "Cheyenne Jewel vs Mistress Kara"
}