{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the Summer Vengeance series Tournament on Ultimate Surrender! We have 13 of this season's finest veterans and rookies in a single knockout seeded tournament. Today we have our #3 ranked wrestler, Dee Williams, put against our #8 ranked wrestler, Bella Rossi. Dee is a curvaceous, big-titted, big-assed, blonde MILF. Bella is an all natural big-titted redheaded MILF who has only beaten Dee once before in wrestling many years ago right here on Ultimate Surrender. Bella has dropped some weight since their first match and Dee has earned a purple belt in Brazilian Jiu Jitsu. All things considered, this is bound to be a very exciting match. The first round is incredible back and forth action. Each girl gets an advantage with control and kisses on the other girl with tongues down the throat of their opponent. Dee falls behind in the first round. It looks like a big-titted hot blond MILF is in trouble. But Dee gets a second wind and lets her bitch side come out. She starts putting Bella into outstanding holds with chin locks, hand gags and breast smothers. Round three is do or die for these girls. The action again is back and forth. These girls put everything they have into this match. This is a true sexual power exchange. One wrestler is just better and at the end of the match, her hand is raised. The loser has her big tits tied in rope bondage. The tits are slapped and bitten. The loser is tormented with blow jobs and wet willies. The loser is fucked hard and fast by the lesbian winner who is wearing a big strap on dildo and then face sat by the winner until the winner gets her victory orgasm. Finally The Winner proceeds to put the loser in a variety of Scissor holds included body scissors and headscissor. The loser submits over and over proving that she has been bested by her victor in every way possible. The winner has dominated the loser in 100% real competitive sexual wrestling, She has dominated her in the sex round and has dominated her with submission after submission. The winner moves on to face Cheyenne Jewel who got the wild card reentry into the tournament after Savanna Foxxx had to pull out due to injury.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2018-07-18",
  "scene_id": 43425,
  "tags": [
    "Anal",
    "Big Tits",
    "blond",
    "Blonde",
    "Bondage",
    "Dildo",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "MILF",
    "Pussy Eating",
    "Rope Bondage",
    "Straight",
    "Strap On",
    "Submission",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "Bella Rossi vs Dee Williams"
}