{
  "collections": [
    "Public Disgrace"
  ],
  "description": "In a field near the coast on a bright and sunny day Mona Wales leads Lady Nala toward a dilapidated house covered in graffiti. Nala stands firm as Mona flogs, shocks her with a zapper and uses clothespin zippers on her soft flesh. She teases orgasm after orgasm from Nala in the hot sun! Soon, Mona tires of this teasing and decides to make a spectacle of Nala in front of her friends at Rosas5, a local BDSM club. The crowd is ready to see this young lady squirt as they do not get to see her dominated often. Nala is suspended by her ankles from the ceiling and as she is shocked and spanked her friends and guest chant, ready to see her get dicked down like the slut she is! Juan Lucho is ready and face fucks the little beauty until spit is running down her forehead, she is hungry for more and the guests pull out cupcakes to smash on her tits, ass, and face while Juan continues to feed the hungry cumslut his fat cock. Nala is taken down from the ceiling and thrown into the stocks where she will stay still as she is fucked long and hard from behind. Her friends hold her face in their hands as they tell her she fucks better when Juan cannot see her face, instead, a guest rides on her back and teases Juan while her uses Nala's wet pussy. She begs to be let out from the stocks and once she is, the real work begins! They push her body to the limit commanding her to stay strung while she bounces up and down on Juan Lucho's throbbing dick, as the crowd works into a frenzy Juan pushes her down and makes her spread her big ass so he can cover her pink hole with cum. Mona pulls her into the street where she is made to spread her messy cheeks by the street so the world can admire her from the inside out, as passersby look on in disgust, Nala is proud to be such an exposed whore!",
  "directors": [],
  "models": [
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Lady Nala",
      "person_id": 60691
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2018-09-17",
  "scene_id": 43438,
  "tags": [
    "BDSM",
    "Big Ass",
    "Blowjob",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Female Slave",
    "Humiliation",
    "Public",
    "Rope Bondage",
    "Rough Sex",
    "Stocks",
    "Straight",
    "Sub",
    "Submission",
    "Vaginal Penetration",
    "Voyeur",
    "Zapper"
  ],
  "title": "Lady Nala Screams and Begs For More From Mona Wales"
}