{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Dixon and Manfield are both hogtied, head to foot. Manfield is still tapegagged and blindfolded, Dixon is just tapegagged. Nearby, the house slave sits hooded and collared in rigid irons. Sizemore to Dixon: “I told you not to play with him without my permission. I don’t want to have to repeat myself.” He unties Dixon, and makes Dixon untie Manfield. Sizemore removes Manfield’s gag and gives him permission to ask one question, which had better be good. As soon as the tape has been peeled off, Manfield asks to suck Sizemore’s dick, the perfect question. Dixon mounts Manfield. Manfield’s blindfold falls off. “Now we can never let you go,” says Sizemore. At Sizemore’s command, Manfield sucks Dixon’s dick, while Sizemore jerks off over Manfield’s butt, and shoots a huge load. Manfield sucks Dixon as Sizemore spanks his ass. Cut to Dixon and Manfield jerking themselves off, Manfield in Sizemore’s arms. Dixon shoots all over Manfield’s jerking arm. Manfield works his dick hard and asks Sizemore for permission to cum. Sizemore claps a hand over Manfield’s mouth, and says, sternly, “No.”\n\nCut to: The van is stopped by the side of the road in the Hollywood Hills, in the same place where it originally kidnapped Manfield. Dixon and Sizemore go to the back of the van and take out a mat which they lay on the ground. Returning to the van, they lift out a bound, gagged and blindfolded Manfield (in someone else’s tanktop and flowery shorts) and lay him on the mat. They drive off. The ropes aren’t tight it only takes a moment for Manfield to untie himself and remove the blindfold and gag. He starts to walk away, then returns to the mat to pick up the rope he’d been tied with, and with that in his possession he walks off.\n\nCut to: A few days later. At the road stop in the Hollywood Hills. Sizemore is standing by his van as he did before the kidnapping. A runner goes by. Then another runner approaches, clearly the victim, dressed in the same tanktop and shorts they’d sent him home in. Manfield again, as he did at the start of the movie, stops to ask Sizemore if he needs help. Sizemore nods, and they walk together toward the back of the van.",
  "directors": [],
  "models": [
    {
      "name": "Bryan Manfield",
      "person_id": 61281
    },
    {
      "name": "Matt Sizemore",
      "person_id": 61279
    },
    {
      "name": "Sam Dixon",
      "person_id": 61280
    },
    {
      "name": "Tony Santis",
      "person_id": 61278
    }
  ],
  "release_date": "2018-07-10",
  "scene_id": 43433,
  "tags": [
    "BDSM",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "dungeon",
    "Gag",
    "Gay",
    "Hood",
    "Kidnapping Play",
    "master",
    "Rope Bondage",
    "Slave",
    "Spanking",
    "Partner Studio",
    "Threesome",
    "top",
    "white"
  ],
  "title": "Boynapped!: Punished and Redeemed"
}