{
  "collections": [
    "Bound Gods"
  ],
  "description": "Welcome Dante Colle to KinkMen! Dante is new to kink and he’s about to be thrown in the deep end with leather stud Sebastian Keys. Dante begins by worshiping Sebastian’s leather chaps and heavy leather boots. He licks and kisses the leather, relishing the taste for the first time ever. He removes Sebastian’s boot on command and worships Sebastian’s foot. Sebastian moans as Dante licks his foot eagerly, wiggling his tongue in between each and every toe. After Sebastian is satisfied, he reveals Dante’s cock and instructs him to present his ass. Sebastian spanks Dante’s perfect ass before shaving the hair on Dante’s ass cheeks so he can see that bottom turn rosey red with each smack. Pleased with his handy work, Sebastian licks Dante’s asshole as he holds Dante down with his foot. Next, Dante is tied upright and fitted with an open mouth gag. Sebastian flogs Dante’s front, paying extra attention to his rock hard cock. Then he secures Dante facing the wall so he has unrestricted access to Dante’s ass. He flogs Dante’s back and ass, before bringing Dante down to take advantage of his wet open mouth. Sebastian fucks Dante’s face relentlessly and Dante takes every inch as he drools all over himself. Finally, Dante is suspended for the first time ever, bound by rope and vulnerable to Sebastian’s devious desires. Sebastian slips an electric anal plug into Dante’s ass, dialing the electricity up to get Dante’s ass ready for his cock. Dante moans as he feels the electricity course through his asshole. He struggles as Sebastian jerks his cock, unable to escape the sensations. Once Dante is warmed up, Sebastian brings him down to the floor and pushes his cock into Dante’s tight hole. He pounds Dante’s ass while licking Dante’s feet. Finally, he blows a fat load all over Dante and then jerks Dante off on his belly. Covered in cum, Dante is suspended again and left hanging for the next man to find.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dante Colle",
      "person_id": 61292
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2018-05-24",
  "scene_id": 43439,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Feet",
    "Gag",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "the wall",
    "versatile",
    "white"
  ],
  "title": "New slave Dante Colle flogged, fucked, and eager"
}