{
  "collections": [
    "Bound Gods"
  ],
  "description": "C.O. Sebastian Keys drops off fresh faced inmate Tony Orlando with his new cellmate, ripped bad boy Cliff Jensen. Cliff knows a bitch when he sees one and immediately starts pushing Tony around to see what this little quivering prison mouse is made of. Tony tries to act tough but his act doesn’t last long. Cliff can smell the fear coming off him and starts fucking with his new boy. Cliff gives Tony some ink of his own, laying stake to the ass he’s about to claim, but first he decides to have some fun. He ties Tony to the metal bed frame by his neck and ankles, with this arms behind his back. Tony struggles helplessly as Cliff manhandles him and spanks his tight ass until it’s bright pink. Each smack and gruff whisper from Cliff makes Tony harder and harder. Cliff wraps his hands around Tony’s cock, unsurprised to find his new bitch getting off on such rough treatment. He makes Tony get his cock hard before climbing on to the top bunk and fucking the shit out of Tony’s mouth. Tony strains to reach Cliff’s huge cock, eager to have it filling up his mouth. Next, Tony is gagged and suspended from the bed frame as Cliff lounges beneath him. Cliff smacks Tony around and then begins to decorate his nipples and belly with mean clover clamps. Tony cries out around his gag, moaning with pain and pleasure as Cliff strokes and sucks his hard dick. After Cliff removes his gag, Tony goes to work swallowing Cliff’s hard cock as Cliff fucks his mouth. Then Tony it put in a vet-wrapped hood and handcuffed to Cliff’s bunk face down with his ass in the air. Cliff gives Tony’s tight asshole a hard fucking pounding, slamming into him over and over again as Tony moans in ecstasy. Cliff flips Tony over and Tony blows his load all over his belly. Cliff gathers it in his hand, pushing it into Tony’s open mouth, making him clean up his filthy mess. Then Cliff releases Tony and pushes his mouth down on his hard cock. Tony works Cliff’s cock until Cliff’s had enough. Cliff pushes Tony off and then cums hard all over his stomach, and uses Tony’s face to clean it up. Cliff cuts off Tony’s hood and pulls him up, holding him tight as he falls asleep.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cliff Jensen",
      "person_id": 29792
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2018-05-31",
  "scene_id": 43449,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "Hood",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "versatile",
    "white"
  ],
  "title": "Muscle stud Cliff Jensen lays claim to prison bitch Tony Orlando"
}