{
  "collections": [
    "Str8Hell"
  ],
  "description": "Paul Hunter is in the bar cleaning some glasses when Jirka Mendez and Ivan Mraz arrive, wanting a drink. They decide to go down to the dungeon to see if that can find some action. When they get downstairs they here Gabo Cerveny call for help. They find him shackled to the wall, as he has been for hours. Jirka and Ivan decide to have some fun with Gabo, rather than releasing him. The open Gabo's shirt and start playing with his nipples and put a gag in his mouth. Then they think that if they strip his pants off and he is not horny they will release him. But when the pants and underwear come down Gabo's cock is quite swollen, so they decide they cannot release him. Ivan takes hold of Gabo's cock and starts to suck it, getting it good and hard and then Jirka takes over the sucking. Gabo is struggling to release his wrists, to no avail as Jirka sucks him. Then the guys release Gabo, from the shackles, but only so they can use him. Quickly he is made to suck on Ivan's throbbing cock as Jirka drops his pants too. Then Gabo has to suck his cock and take turns on both. He shows that he really knows what he is doing as he sucks. Then Jirka and Ivan shackle him again and pull the rest of his clothes off. Gabo's hot body looks so good, with his big dick swinging as he moves. With all three guys naked Jirka and Ivan start tickling Gabo, their cocks rock hard all the while. Then they turn Gabo around and begin to play with his sexy ass. They soon have him bent over, with Ivan's big cock ready to plough that ass. He slams his cock into the tight hole and pounds away as Gabo has to suck on Jirka's cock too. Jirka and Ivan then change places so that a second cock can slam into Gabo's hole. Jirka fucks him deep and hard ramming in as far as he can with each thrust. They move Gabo so they can fuck missionary style and Ivan pumps away at that hot hole until he is ready to cum. Pulling out he shoots a massive load all over Gabo's ass.Then Jirka shoves his dick into the gaping hole and fucks it hard. Soon he is ready to cum too and he pulls out to shoot his load. Gabo is then allowed to sit up and wank himself to a lovely cumshot, which Ivan enjoys, taking hold of the cock to milk it dry and rub the sticky cum all over it.",
  "directors": [],
  "models": [
    {
      "name": "Gabo Cerveny",
      "person_id": 61290
    },
    {
      "name": "Ivan Mraz",
      "person_id": 60765
    },
    {
      "name": "Jirka Mendez",
      "person_id": 61062
    }
  ],
  "release_date": "2018-09-12",
  "scene_id": 43447,
  "tags": [
    "Anal",
    "Bareback",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Chains",
    "Domination",
    "dungeon",
    "Edging",
    "Gag",
    "Gaping",
    "Gay",
    "Leather Belt",
    "Leather Cuffs",
    "Metal Bondage",
    "Role Play",
    "Rough Sex",
    "Shackle",
    "Spit Roast",
    "Tattoo",
    "the wall",
    "thirdparty",
    "Tickling",
    "Twink",
    "Uncircumcised"
  ],
  "title": "Gabo, Jirka, and Ivan Raw - Duty Bound"
}