{
  "collections": [
    "Str8Hell"
  ],
  "description": "Ivan Mraz is embroiled in some problems in Airport Security. In this Dream Set, he is brought in to see Borek Sokol, by Petr Zuska. It seems that his passport has been lost, and there is some confusion as to how it happened. Petr goes off for coffee and leaves Borek to do paper work. But Borek decides on more that paper work, cuffing Ivan and bending him over the table. Petr returns, and quickly joins in, threatening some anal inspection. He pulls down Ivan's pants and underwear, exposing his ass, and spanking it. As Borek holds Ivan down Petr spreads the naked ass and checks the hole. Borek drips some lube onto the hole and then takes a nightstick, pushing it up against the hole. He really pushes that stick, until Ivan moans as it probes his ass. Borek, roughly, shoves two fingers into the hole. Then fucks it with one fingers. Borek then pulls Ivan's shoes, socks and pants off his legs, smacking his feet as he does so. He then stands and drops his own pants, revealing his stiff cock. He opens his shirt too, as Peter continues to hold Ivan in place. Borek's cock is ready for action and he shoves it deep into Ivan's ass. As Ivan moans Petr places a hand over his mouth to deaden the sounds. Meanwhile Borek really pounds away at Ivan's ass, going in balls deep. He fucks that ass real good until Petr wants a go too. Petr's dick is throbbing too and he quickly has it deep in Ivan's ass. Borek, meanwhile, has his cock in Ivan's mouth, making him suck it. Petr spanks on Ivan's ass as he continues to fuck it. Then the guard push Ivan to the floor, stripping off his tee shirt. With him re-cuffed they then feed him their cock, taking turns in his mouth. Next they put his back on the table, and Borek fucks him hard and fast, until he is ready to cum. He pulls out and dumps his cum over Ivan's balls. Then Petr fucks that ass again, and unloads inside it. He pulls out and spreads the ass to check out his work. Then they make Ivan kneel before them and wank himself to a very good cumshot. But they still don't let him go, putting him on the table and tormenting him some more. Finally they return his id to him, as the video comes to an end.",
  "directors": [],
  "models": [
    {
      "name": "Borek Sokol",
      "person_id": 60756
    },
    {
      "name": "Ivan Mraz",
      "person_id": 60765
    },
    {
      "name": "Petr Zuska",
      "person_id": 60766
    }
  ],
  "release_date": "2018-08-22",
  "scene_id": 43446,
  "tags": [
    "Anal",
    "Anal Creampie",
    "Athletic",
    "Bareback",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "Bush",
    "Domination",
    "Feet",
    "foreskin",
    "Gay",
    "Hair Pulling",
    "Slapping",
    "Spanking",
    "Spit Roast",
    "Submission",
    "thirdparty",
    "Threesome",
    "Twink",
    "Uncircumcised",
    "white"
  ],
  "title": "Borek, Ivan, and Petr Raw - Airport"
}