{
  "collections": [
    "Str8Hell"
  ],
  "description": "Tomas Decastro is one hot and handsome guy. In this Milking Men shoot his wrists are shackled over his head, wearing a tank top and shorts. The ‘Milker’ arrives and begins to feel Tomas chest, lifting the tank top to show it off. Tomas has a blindfold applied and his shorts are down, revealing his athletic support. As it is untied his cock is gradually exposed as the hand rubs the bulge. The cock is pulled out and wanked has his balls hang down. Petr’s cock gets so hard as it is wank, the heading glistening nicely. Then the cock and balls are tied nice and tight. A vibrating toy is appied to the head of the cock, making it throb. Then the cock is wanked some more and further rope is applied to it. Oil is used to lube the beautiful, hard, cock as the balls are untied. Then Petr is bent over so that his ass is exposed. It gets some oil too and then feels a dildo pushed into the tight hole. Petr moans as his ass is fucked by the dildo and his cock is wanked as well. He says that he is cumin and asks to be wanked again. He dildo keeps working his hole and then he is released to have his throbbing cock wanked until he says again that he is cumming. But the hand cums off the cock and Petr begs to be wanked some more. The hand does return to the cock, this time wanking it until it shoots a big, creamy, load all over Petr’s hot body.",
  "directors": [],
  "models": [
    {
      "name": "Filip Cervenka",
      "person_id": 60792
    },
    {
      "name": "Tomas Decastro",
      "person_id": 61291
    }
  ],
  "release_date": "2020-06-25",
  "scene_id": 43448,
  "tags": [
    "Athletic",
    "black hair",
    "Blindfold",
    "blond",
    "body builder",
    "Bondage",
    "CBT",
    "Dildo",
    "Edging",
    "foreskin",
    "Gay",
    "Handjob",
    "Rope Bondage",
    "Stud",
    "Partner Studio",
    "top",
    "Uncircumcised",
    "Vibrator",
    "white"
  ],
  "title": "Tomas Decastro - Milking Men"
}