{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Working his way through college as a vacuum-cleaner salesman, young Luke Sabre knocks on Michael Brandon's door. Brandon, kneading his crotch, lets him in. Sabre kneels to show Brandon the machine's features but is distracted, and admits, on catching sight of Brandon's cock, that he'd be willing to suck some cock to make the sale. Brandon instructs him how he wants his big hose played with, and praises Sabre's sucking abilities. Brandon asks the boy if he's ever been tied up. Sabre says no and that he doesn't think he'd like it. Nevertheless, he obeys Brandon when told to put his hands behind his back, which pleases Brandon who approves of boys who do what they're told. Brandon instructs Sabre to remove his shirt, which he does, sucking all the while. Brandon assures him that if he proves an obedient boy, he'll make his sale, and then has him strip all his clothes off and lie down on the floor while not letting Brandon's cock out of his mouth. Brandon then has Sabre remove his own underwear, with warnings of punishment for misbehavior. Both naked now, Brandon straddles Sabre and plays with his body, dominating the boy and even sucking Sabre's cock, teasing Sabre with his spoken desire to tie Sabre up. Sabre gets very turned on and tells Brandon he could do anything he wants to him. Fade in to Sabre hogtied on the floor. After lying there and feeling the ropes for a while, he calls for Brandon, and when there's no response begins to panic, Brandon returns to reassure him that he won't leave him, makes him suck his fingers and thumb, enjoys his bound body, turns him over, and sucks his cock",
  "directors": [],
  "models": [
    {
      "name": "Luke Sabre",
      "person_id": 61293
    },
    {
      "name": "Michael Brandon",
      "person_id": 61294
    }
  ],
  "release_date": "2018-07-17",
  "scene_id": 43440,
  "tags": [
    "BDSM",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "domestic",
    "Gay",
    "Muscle",
    "muscular",
    "Role Play",
    "Rope Bondage",
    "Tattoo",
    "thirdparty",
    "Twink",
    "Voyeurism Fantasies",
    "white"
  ],
  "title": "The Salesman: Obedient Boys Make Sales"
}