{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Sabre, blindfolded, collared, bandanna gagged, in a chair in rope bondage. Cock ring. As best he can through the gag, Sabre calls out for Brandon. Brandon appears, handgagging him and ordering him to quiet down. Sabre moans through Brandon's hand, but Brandon with voiced and erotic encouragements soon begins to make him feel good. Brandon strokes Sabre's cock, undoes Sabre's gag. Sabre licks and sucks his proffered nipples. They kiss. Sabre is hungry for him, his tongue seeking Brandon's body. He licks Brandon's armpits as they are offered. Brandon sucks Sabre's dick, sucks Sabre's nipples, goes back to Sabre's dick, as Sabre becomes increasingly responsive. Sabre says he's getting close, but is warned by Brandon not to cum without permission. Brandon gives Sabre his cock to lick, then slaps it loudly on Sabre's chest as they kiss and he strokes Sabre. Sabre thrashes in the chair, mouth open and drooling, as Brandon works both their cocks. Brandon sucks Sabre's cock, is again warned that Sabre's getting close. Sabre sucks Brandon's nipple, his armpit. Brandon fervently sucks Sabre's cock. Sabre begs to cum but is not given permission. Brandon has other plans for him. Brandon slips his dick under Sabre's balls, saying that's where he wants to go. Sabre collared, in a sling, jerks himself off as Brandon sticks his humongous dick in his ass and fucks him. Sabre wants to cum but Brandon warns him not to do so without permission. Finally, with Brandon pounding his ass, Sabre is granted permission and cums in an arc over his belly. Brandon pulls out and shoots a huge fountain of cum. They kiss. Brandon tells Sabre he's made his sale. Cut to Sabre, collared and naked except for a cock ring, happily running the vacuum cleaner over the downstairs dungeon floor.",
  "directors": [],
  "models": [
    {
      "name": "Luke Sabre",
      "person_id": 61293
    },
    {
      "name": "Michael Brandon",
      "person_id": 61294
    }
  ],
  "release_date": "2018-07-31",
  "scene_id": 43442,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Blindfold",
    "blond",
    "Blowjob",
    "Bondage",
    "Collar",
    "dungeon",
    "Edging",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Suspension",
    "the chair",
    "thirdparty",
    "Twink",
    "white"
  ],
  "title": "The Salesman: Blindfolded, Chairbound & Tongue Out.. Successful Sale"
}