{
  "collections": [
    "TS Seduction"
  ],
  "description": "Curvy blonde newcomer Kayleigh Coxx can't wait to get out of her clothes after a long day at the office when she catches peeping tom Lance Hart admiring her lingerie and bare feet from outside her bedroom window. Lance tries to apologize and offers a foot massage. Kayleigh is a working girl and can't pass up a good food rubbing. Lance has a foot fetish and can't help but worship Kayleigh's feet. He licks, sucks, sniffs and kisses her toes and the bottom of her feet. He also removes her high-heel shoes and gets a good whiff of perfumed leather and lady sweat. Kayleigh lets him do a little ass worship. Lance finishes undressing Kayleigh then rims her back door with his pervert tongue. She gets so aroused she soon has his dirty pervert mouth wrapped around her cock, demanding that he get her hard. Now Lance must prove his cock-sucking skills by giving Kayleigh a blow job. When it becomes apparent that Lance is enjoying himself a little too much (I love this cock!), Kayleigh orders Lance to take his clothes off and to bend over for some over-the-knee spanking. A perfect ass for spanking. Perfect for other things too, but first Kayleigh lets Lance experience the joys of face-sitting. Kayleigh can't help but go down on Lance's cock while he buries his face deep in her ass. The dirty pervert's cock tastes good. In a hot sixty-nine, Lance sucks on Kayleigh's cock while she strokes and sucks his massive hard-on. Now that Kayleigh's cock is good and hard she flips her home intruder over. She threatens to call the police and demands an apology for creeping outside her window. He promises to never do it again. Kayleigh sinks her cock into his tight asshole and pounds it deep and hard, doggy-style. She flips him over onto his back and jerks his cock as she again buries her cock into his ass. Lance no longer knows or cares if he is being punished or rewarded. He must taste his own ass on Kayleigh's hot, wet and throbbing cock. Fucked relentlessly, Kayleigh tosses Lance off the bed headfirst where he lands in a piledriver, Kayleigh pounds, not only his ass, but his whole body with her cock, while she throttles his own hard cock until he comes. She then finishes on his chest, rubbing her bare feet in her own cum, smearing it over his pervert mouth and face.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kayleigh Coxx",
      "person_id": 61277
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    }
  ],
  "release_date": "2018-06-26",
  "scene_id": 43457,
  "tags": [
    "Anal",
    "Athletic",
    "Blonde",
    "Blowjob",
    "bottom",
    "brunet",
    "Cock Worship",
    "Curvy",
    "fake boobs",
    "Feet",
    "Fetish",
    "foot fetish",
    "Leather",
    "Lingerie",
    "Male Sub",
    "Role Play",
    "shaved",
    "Spanking",
    "Straight",
    "switch",
    "toned",
    "TS",
    "TS Fucks Male",
    "versatile",
    "Voyeurism Fantasies",
    "white"
  ],
  "title": "Pervert Mouth: Kayleigh Coxx Catches a Peeping Tom with a Foot Fetish."
}