{
  "collections": [
    "Men On Edge"
  ],
  "description": "Corrections Officer Jeremy Spreadums takes great pride in his job. Without him, who knows what inmates Sebastian Keys and Brodie Ramirez might get up to. Jeremy looks forward to another easy day, but when he falls asleep on the job, Sebastian and Brodie take their chance to teach CO Spreadums a lesson. They handcuff him to their bunk, and blindfold him. They pull away his clothing to reveal a cut body and fat uncut cock. Despite Jeremy's protests, Brodie wraps his lips around Jeremy's cock and gets to work. He milks that cock, taking it all the way in his mouth and getting it nice and hard. Meanwhile, Sebastian plays with Jeremy's sensitive nipples, first with his mouth and hands, and then with nipple suckers. Jeremy can't contain himself and almost blows his load all over Brodie's face. But these boys aren't done teasing their CO yet. They gag him and tie him to the top bunk. As Brodie continues to stroke Jeremy's cock, Jeremy can't help but fuck back. He pumps his cock in and out of the sleeve they procure, trying to find release. Every time Jeremey gets close, Brodie and Sebastian back off. As Brodie works Jeremy's dick, Sebastian sniffs and licks his CO's sweaty feet. They tickle Jeremy as he squirms, unable to escape their fingers. Then Sebastian finds his CO's baton, slicks it up, and rams it straight into his CO's hairy asshole. Jeremy jerks up, moaning as his own baton slides in and out of his ass, violating his tight hole. Between the hard stick in his ass and Brodie's clever hands, Jeremy doesn't stand a chance. He blows his load everywhere and is left tied up as Sebastian and Brodie leave to look for more errant COs.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jeremy Spreadums",
      "person_id": 61296
    }
  ],
  "release_date": "2018-06-26",
  "scene_id": 43453,
  "tags": [
    "BDSM",
    "Blindfold",
    "Bondage",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Hairy",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "Tickling",
    "top",
    "Uncircumcised",
    "Uncut"
  ],
  "title": "New CO falls asleep on the job and gets milked by two horny inmates"
}