{
  "collections": [
    "Bound Gods"
  ],
  "description": "With leather gloves, leather pants, and a leather vest, Max Ferro enters the scene dragging his submissive, Tyler Rush into his lair. Max shoves Tyler down to the floor and climbs on top of his back, slapping his ass through his jeans. Tyler pleads, telling Max to let him go but Max just pulls down Tyler's pants and spanks his ass hard with his gloved hands. Max strips all of Tyler's clothes off and reveals the cock cage that Max has fastened to Tyler's cock and balls. Max makes Tyler lick his leather boots and licks all the way up to Max's hard cock pressed against the inside of his leather pants. Max slowly unbuttons his fly, pulls out his fat cock and shoves it in Tyler's mouth and fucks his face. He releases Tyler's imprisoned cock dripping with precum and lets him jerk himself off while Max continues to use his mouth. In the next scene, Max has suspended Tyler upside down by his ankles, his body wrapped up in chains, looking like Houdini. Max gets to his knees and shoves his cock down Tyler's throat. Max reaches for his flogger and flogs Tyler's dick while still inside his mouth, then sucks Tyler's cock in an inverted sixty-nine. After that, Max stands and gets his huge thirty pound flogger and using two hands he swings it like a bat, hitting Tyler hard repeatedly across his back and ass. Next, Max fucks Tyler's ass while Tyler is bound in rope bondage and suspended in a doggie-style position. He fucks Tyler's ass deep and hard. In the final scene, Max has Tyler bound on his back with his legs spread. He fucks him some more and jerks the cum right out of Tyler's cock. After finally blowing his load across Tyler's face, Max puts the cage back on Tyler's dick and walks away.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Tyler Rush",
      "person_id": 54465
    },
    {
      "name": "Max Ferro",
      "person_id": 61300
    }
  ],
  "release_date": "2018-07-19",
  "scene_id": 43451,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Cage",
    "Chains",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "gloves",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Submission",
    "Suspension",
    "top"
  ],
  "title": "Tyler Rush Cowers Before Max Ferro"
}