{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Bella Rossi finds male dom Dozer in her dungeon confined in strict bondage! Electricity pulses through his cock as he kneels with his hands tied above him. Dozer is a typical male dom -- he's arrogant, mouthy, and needs to be put in his place. Nothing that proper training can't fix. So Bella cranks up the electricity and flogs Dozer all over his chest and back. She mercilessly canes Dozer's thighs, chest, butt, and feet as Dozer cries out in pain, unable to escape the Bella's reach. Next, Dozer is tied down with two zippers across his belly. Bella teases him with her glorious pussy and ass before ripping those zippers off. Dozer screams in pain straight into Bella's cunt as the closepins are torn from his flesh. Now that her toy is suffering, Bella puts Dozer's mouth to the test. She makes him lick her sweet cunt and her voluptuous ass as she jerks off on his face. Finally, Bella decides to see how well her new toy can fuck. She has him collared and leashed and orders him pump his pathetic cock in and out of her cunt until she is satisfied. Dozer keeps thrusting, despite the pain in his knees and rising need to cum. This sad man can't keep up with the beautiful Goddess riding his hard cock. He ultimately fails to grant his Mistress the amount of orgasms she wants and deserves. So Bella hops off his cock, jerks it off into her hands, and smears his cum all over his disgusting face. It'll take more than one session to train this one.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Dozer",
      "person_id": 53709
    }
  ],
  "release_date": "2018-06-19",
  "scene_id": 43459,
  "tags": [
    "bdsm",
    "bondage",
    "CBT",
    "Corporal Punishment",
    "dominatrix",
    "dungeon",
    "electricity",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "humiliation",
    "Male Sub",
    "orgasm denial",
    "pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight"
  ],
  "title": "New Male Dom Made to Submit and Take Pain from Goddess Bella Rossi"
}