{
  "collections": [
    "Men On Edge"
  ],
  "description": "Blaze Austin is dreading his doctor's appointment. He waits anxiously until Doctor Sebastian Keys and Nurse Chance Summerlin enter. As they begin to run their tests, Blaze knows something isn't quite right. He struggles to leave, but Doctor Keys sedates him and everything gets fuzzy. When Blaze wakes up, he discovers his whole body has been wrapped tightly in plastic! The doctor and nurse start caressing his body. They cut open the plastic near his crotch and pull his dick out. As Nurse Chance starts teasing it, Blaze gets rock hard. His struggles are fruitless, all he can do is lay there while these medical professionals get to work. They test Blaze's reflexes by tickling and kissing his feet. They pump his cock until it swells to fillup the pump cylinder. Blaze begs to cum as his cock grows more and more sensitive with each pump. Next, Blaze is bound with his limbs immobilized in the air. There is an unforgiving metal gag prying his mouth open. Doctor Keys starts testing his prostrate while Nurse Summerlin teases his cock. After Blaze's ass is prepared, Doctor Keys slips a rectal specula into that tight hole. As the specula opens, so does Blaze's ass, revealing his pink insides. Blaze can't believe this is happening but he loves the feeling of being stretched open. His cock gets harder and harder as the nurse jacks him off. He finally blows a fat load all over himself and screams as Doctor Keys and Nurse Summerlin continue to stimulate his sensitive cock head.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Blaze Austin",
      "person_id": 60689
    }
  ],
  "release_date": "2018-07-10",
  "scene_id": 43454,
  "tags": [
    "BDSM",
    "Bondage",
    "Doctor",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Nurse",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling"
  ],
  "title": "Doctor's Anal Orders: Blaze Austin edged, pumped, and stretched"
}