{
  "collections": [
    "Bound Gods"
  ],
  "description": "Lying on his side in a small metal container, wearing only a leather collar and a chrome cock cock, Chance Summerlin sleeps in his master’s dungeon. In saunters Dominic Pacifico in a black latex body-suit and with his big black leather motorcycle boots he kicks the cage and wakes his submissive. Chance jumps to his hands and knees and approaches his master. Dominic shoves his fingers in Chance’s mouth, slaps his tongue, and calls him a dirty pig. Through the latex suit, Dominic makes Chance lick and huff his rock hard cock, right before he whips it out and shoves his meat down chances throat, fucking his face through the cage. Dominic orders him to turn around and open his ass. Dominic then aggressively finger fucks Chance’s asshole, first with two fingers, then with four. He takes two fingers from each hand and spreads Chance’s asshole wide open, getting it ready for his fat dick. He slides his cock into Chance’s ass through the bars in the cage and pounds his ass deep and hard. In the next scene, with his back on the floor, Chance lies mummified in black medical wrap with only his mouth, his caged cock, and his ass exposed. Dominic takes out his crop and slaps Chance’s exposed balls and works the crop up Chance’s bound body. Dominic lifts one of his big leather boots and crushes Chance’s imprisoned dick and balls like a bug. Next, Dominic hooks ropes from metal hardware in Chance’s mummified suit, to a pulley and lifts Chance up into a full suspension. Dominic spins Chance around and repeatedly hits him hard with the flogger. In the final scene, we find Chance Summerlin on his back, bound with red rope, wrists and ankles tied above his head to a bed frame. His balls are tied with one piece of rope, straight up to a suspension frame that Dominic grasps, using it for leverage as he fucks Chance’s ass. Dominic frees Chances incarcerated cock and makes him cum with his dick buried deep in his ass, then gives Chance a nice even coat of cum across his face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Chance Summerlin",
      "person_id": 60103
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    }
  ],
  "release_date": "2018-06-07",
  "scene_id": 43450,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "Cage",
    "Collar",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Gay",
    "Humiliation",
    "Latex",
    "Latinx",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "unshaved"
  ],
  "title": "Dominic Pacifico and Chance Summerlin: Serve and Submit"
}