{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Wearing black thigh-high latex stiletto boots, Leigh Raven dances for Lance Hart in a private room at the club where she works. She puts Lance in a trance with her striking beauty. She shakes her ass for him and he grabs his hard cock through his pants. Without thinking, Lance reaches out with an open hand and slaps Leigh's ass. Leigh immediately turns around and grabs Lance hard by the shirt, pulls him close and makes him apologize. Lance says he'll do anything to make it up to her, so she ties his arms together behind his back to the brass pole on stage. She sticks a ball-gag in his mouth and explains that she gets to do whatever she wants to him and through the ball gag he agrees. Leigh removes Lance's ball-gag, leans back in a leather chair and lifts one of her legs to his face and tells him to clean her boots. He licks her latex boots and sucks on her stiletto heel. She unzips her boots revealing her thigh-high stockings and shoves her foot into Lance's mouth. She slides her foot down his body to his cock and humiliates him for dripping pre-cum onto her stage. She punishes him by repeatedly kicking him in the balls. She chokes him, slaps his chest, and makes him dance for her while still tied to the pole. She puts him on his knees and lifts a foot onto his shoulder. Leigh then grinds her pussy onto his mouth, using it for her own pleasure. In the next scene, Lance is on all fours with his neck tied to the pole and Leigh is behind him with a strap-on. She fucks his ass and makes him tell her how much he likes it. She flips him over and fucks his ass again with his legs spread. She strokes his cock with her dildo buried in his ass and he begs her to let him cum. Leigh says no way and sits on his face and grinds hard on Lances tongue. Next she uses Lances hard cock to please her pussy and rides his dick until she's had multiple orgasms. She rewards Lance and sucks his cock, licking his dick with her forked tongue until he blows his huge load all over himself.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Leigh Raven",
      "person_id": 59527
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    }
  ],
  "release_date": "2018-09-11",
  "scene_id": 43458,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Latex",
    "Leather",
    "Male Sub",
    "multiple orgasms",
    "Nylons Stockings",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight"
  ],
  "title": "Used and Abused, Leigh Raven Punishes Lance Hart"
}