{
  "collections": [
    "Bound Gods"
  ],
  "description": "Tom Bentley awakes to find himself chained down to a metal table in a bizarre operating room. His calls for help summon mad leather doctor Trenton Ducati, masked and wearing a leather apron. Dr. Ducati has plans for his newest specimen. He can't wait to see how much pain and pleasure young boys like Tom can take. The doctor starts by ripping off Tom's clothes, and opening Tom's mouth for inspection with his leather gloves. He smacks Tom's chest before clamping Tom's nipples and belly with metal forceps. He stretches Tom's balls and smacks Tom's cock around. He opens Tom's mouth and makes Tom suck his hard fat cock. Next, he chains Tom to the ceiling and blindfolds him. Tom yelps as Dr. Ducati's leather flogger hits his perky round ass and back. On his knees and unable to move, Tom takes every stroke, yelling in pain as the doctor begins flogging his chest and cock. Pleased with Tom's endurance, Dr. Ducati takes him down, binding his arms behind him with leather restraints. Tom is stuck with his ass in the air, exposed to the doctor's plans. Dr. Ducati brings out the violet wand and zaps the sensitive skin around Tom's asshole. Tom flinches away from the electricity, but there is no where to run. He follows the doctor's orders and fucks himself on electricity, moaning as the violet wand disappears inside his asshole. Once he's warmed up, Dr. Ducati replaces with violet wand with his rock hard cock. Tom moans as the doctor fills him with every inch. Then Tom is flipped over and fitted with a spider gag to keep his mouth open. He writhes in pleasure as Dr. Ducati continues to fuck him relentlessly, driving his cock into Tom's ass over and over again. Finally, Dr. Ducati blows a fat load all over Tom's face before jacking him off. Day 1 of the experiment is complete, but there are always more tests to run on Day 2...",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Trenton Ducati",
      "person_id": 42630
    },
    {
      "name": "Tom Bentley ",
      "person_id": 61301
    }
  ],
  "release_date": "2018-06-14",
  "scene_id": 43452,
  "tags": [
    "anal",
    "bdsm",
    "Bizarre",
    "blowjob",
    "bondage",
    "chains",
    "Corporal Punishment",
    "doctor",
    "domination",
    "electricity",
    "flogging",
    "gag",
    "gay",
    "gloves",
    "humiliation",
    "leather",
    "leather gloves",
    "Male Sub",
    "master",
    "medical fetish",
    "pain",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "spider gag",
    "submission",
    "violet wand"
  ],
  "title": "New Boy Tom Bentley Fucked by Leather Doctor Trenton Ducati "
}