{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Summer Day is super thrilled to be interning for hot lawyer Bella Rossi. During a late night, Summer spills hot coffee all over her boss and is mortified. Embarrassed, she cleans off her boss’ gorgeous tits and the mess she made on the floor. Unsatisfied with Summer’s performance, Bella takes out her crop and smacks Summer’s cute ass peaking under her skirt. Summer apologies profusely and lets her boss strip her of her clothes and bend her over the desk. Bella spanks and flogs Summer’s ass as Summer struggles to maintain her composure. Summer has never been spanked by her boss before and she admits that her boss dominating her turns her on. She presents her pussy to Bella and begs Bella to make her cunt feel good, promising to be a good girl. Bella puts Summer over her lap and plays with Summer’s hungry cunt until Summer begs to cum. After cumming over and over again, Summer is tied down. One of her tights is stuffed in her mouth and the other is pulled over her head by Bella. Bella then gets a dick on a stick and fucks her apologetic intern turned fuck doll. Summer begs to cum again as Bella fucks her tight cunt, but this slut isn’t allowed to cum again until she’s gotten her boss off. Bella rips open Summer’s mesh hood, freeing her tongue, and then sits on her face. Summer enthusiastically licks her boss’ beautiful cunt as Bella teases her and grinds on her face. After Bella cums hard, she fucks Summer to more hard orgasms. Finally, Bella straps on a cock and fucks Summer’s greedy pussy before turning her attention to Summer’s ass. Summer is only allowed to cum if Bella is fucking her asshole. Luckily, Summer loves feeling her boss’ cock in her tight ass and begs to cum almost immediately. Bella fucks Summer in doggy before flipping her over and fucking her on her back. Summer cums over and over again under her boss’ attention, and promises to be the best intern. Now that Bella’s had her fill, she leaves Summer to clean up the office and prepare for their appointment tomorrow.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Summer Day",
      "person_id": 59412
    }
  ],
  "release_date": "2018-07-05",
  "scene_id": 43462,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Hood",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Intern Summer Day submits to kinky office sex with boss Bella Rossi"
}