{
  "collections": [
    "Families Tied"
  ],
  "description": "Tight bodied teen Isabella Nice is done being managed by her over bearing Step-Mother Penny Barber. Unfortunately for her, she doesn't know Penny has been using her hot body and slut skills to buy Isabella every role she's ever had. When the director send Isabella away for wardrobe, Penny is ready to pay him interest on her daughter's big chance, getting on her knees and groveling for dick, her big nipples chained up with clips while she squirms and whines under the zapper. Tied in a tight strappado and bent over a chair, her big MILF ass is ripe for a hard caning, which she made to beg for. Smart mouthed as always, Penny is covered with red welts and ready to take a deep dicking her her ass and pussy. Unfortunately, Isabella comes back by the room and begins to understand how managed her career really in. Taking matters into her own hands, she offers her nubile little body to the director hoping to make it in the big leagues on her own. Seth puts her on the floor and shows her exactly what her is looking for in her performance. Slapped around, her labia tied to her toes in a painful squat with a vibe pressed to her pussy she starts to learn voice projection as she screams and begs for more cock in her throat, more orgasms, and to have the painful zipper torn off her body. Thrown over the bed and tied up she has her wet swollen clit cropped until she earns the fucking she was begging for. Cumming from the electrical torment and the cock in her tight pussy she really gets into her role. However, Mommy is none to happy, and decides to teach Isabelle about the finer points of acting, throwing her over her knee for a hard spanking, then humiliating Isabella and presenting her daughters reddened ass to the director for further use. Tied up in a painful partial suspension, Isabella is fucked, cattle prodded, and eventually thanking her Step-Mommy for every time she gets her little clit licked. Penny teaches Isabella how to take a cock in her ass with an up close lesson, including cleaning the cock off every time it comes out of Penny. For her biggest role ever, Isabella has her tiny tits clamps and tied and it made to take an athletic ride of the directors dick until her mother is satisfied she has learned her lesson and let's her cum and beg for a big load on her face.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Isabella Nice ",
      "person_id": 61113
    }
  ],
  "release_date": "2018-07-20",
  "scene_id": 43463,
  "tags": [
    "athletic",
    "caning",
    "Family Roleplay",
    "MILF",
    "spanking",
    "straight",
    "suspension",
    "Zapper",
    "zipper"
  ],
  "title": "Tight Bodied Teen Star and Anal Step Mommy Fuck Director's Huge Cock"
}