{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Lily knows most of her dates can't resist her little slave's unique charms. Charlotte gets permission to worship Miss Robin's feet and lick her toes. The sight of her slave's naked ass sticking up in the air is too tempting for Lily. She spanks, slaps, licks, and kisses Charlotte's round ass. Lily tells Miss Robin to spank Charlotte's ass while she lets her slave lick her shoes and suck her feet. Charlotte soon moves up to Lily's hot, wet pussy while Miss Robin flogs Charlotte's ass. Charlotte does a good enough job to get the privilege of tonguing her mistress' asshole. Miss Robin helps by holding slave's head deep in between Lily's ass cheeks. \"She's so fucking lucky she gets to taste my asshole and my pussy.\" Charlotte gets her mouth back on Lily's pussy and brings her to orgasm while Miss Robin continues flogging her ass. As a reward Charlotte gets Lily's foot stuffed in her hungry mouth. Once Lily has been taken care of she's ready to watch Miss Robin have some fun with her slave. Miss Robin turns the zapper on Charlotte, then a few punches from her fisting hand. The women laugh. Charlotte cries and moans, but her pussy is dripping wet. Lily pushes her fingers deep into Charlotte's ass. She begs for more until she has swallowed Lily's entire fist deep into her ass. But one fist isn't enough, Charlotte wants a whole foot in her ass. The women suspend Charlotte and Lily fucks her slave's pussy with a strap-on. Miss Robin strips off her top and soon Charlotte's tongue is deep in Miss Robin's ass. Keep licking it clean. Taste every last drop. Miss Robin repays the slave with more flogging while she is pounded silly by Lily and her strap-on. Charlotte takes it like a champ and begs for more anal pounding. Taken down from the suspension, Charlotte straddles Miss Robin, reverse cowgirl, and has her ass filled with a strap-on dildo. Lily fucks her slave's pussy while Miss Robin fucks Charlotte's ass. Add a hitachi and some breath play and little Charlotte is done for the evening. Good little whore. Miss Robin is impressed with how much of a pounding Charlotte's ass can take. A great first date by any standard.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Miss Robin",
      "person_id": 61370
    }
  ],
  "release_date": "2018-06-21",
  "scene_id": 43461,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Fisting",
    "Flogging",
    "Hitachi",
    "Humiliation",
    "Latin",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "Tattoo",
    "toned",
    "top",
    "white",
    "Zapper"
  ],
  "title": "Lily Lane & Miss Robin Double-Team Charlotte Sartre's Ass & Pussy"
}