{
  "collections": [
    "TS Seduction"
  ],
  "description": "Gorgeous femdom Venus Lux is on the phone with her shipping company, demanding to know why her package is late. Delivery boy Damien Moreau arrives with Venus’s prototype bondage device. He apologizes for the late delivery and offers to help Venus try out her new device. Venus mood has greatly improved. She has a lot of things her submissive delivery boy can help her with, as long as he is an obedient boy. Damien claims that, yes ma’am, he is an obedient boy. Stripped naked, clamps on his nipples and bound to the device, he soon finds himself completely helpless. Venus slowly undresses in front of Damien, down to her sexy black lingerie, showing him what he needs to worship. Soon she is more than showing, as she rubs her ass in Damien’s face. She sucks on his clamped nipples. Slaps his face. Slaps his balls. Slaps, squeezes and pulls his balls. All Damien can say is thank you, ma’am. Venus pulls out her hard cock and strokes it mere inches from Damien’s face. Taunting him with hints that she might put her cock in his ready and willing ass, but not just yet. She stuffs her nylon-covered foot into Damien’s mouth. All 5 toes stuffed deep into his hungry mouth. Damien promises VIP service from now on. Venus is tired of his apologies and stuffs her foot back into his mouth, curious to see his deep-throating skills. She’s having too much fun watching him suffer, pulling on his nipple clamps while she strokes her cock. He’s reduced to a whimpering obedient boy. Venus grants Damien the privilege of sucking her cock, as long as he does it nice and sloppy. She goes balls deep into his nasty little bitch mouth. She fucks his face hard until he is gasping for air. He is here to worship her cock and, when she demands, he hungrily sucks on Venus balls. Venus is she is hot and ready to fuck her obedient boy’s juicy hole. She enters him on the couch, then puts him on the floor on all fours, doggy-style, while she pounds his raw ass with her throbbing cock. Damien cries out thank you, he has never felt it so deep. Now she orders her boy back on the couch, missionary style. She warns Damien he must ask for permission before he even thinks of coming. With Venus’ nylon covered toes in his mouth and her hot cock in his ass, Damien begs to cum. “Shoot that fuckin’ load for me, you fucking little bitch.” Damien gets back on all fours to receive Venus. She buries her cock deep inside his ass and asks him if he’s ready for her load. She gives it to him. pumping every last drop of cum deep into his now extra juicy hole. Thank you ma’am. You’re welcome.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Damien Moreau",
      "person_id": 51956
    },
    {
      "name": "Venus Lux",
      "person_id": 41417
    }
  ],
  "release_date": "2018-07-10",
  "scene_id": 43464,
  "tags": [
    "Anal",
    "Asian",
    "Athletic",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "Cock Worship",
    "fake boobs",
    "Femdom",
    "Lingerie",
    "Male Sub",
    "Nipple Clamps",
    "Redhead",
    "Role Play",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Obedient Boy: Venus Lux Torments & Fucks Her Delivery Boy"
}