{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Helena Locke has high expectations of her subs, especially Syren de Mer, who comes to her ready to submit. The chemistry between them is dripping hot as Helena uses Syren in every way, punishing her when she disobeys, and rewarding her for a job well done. Syren's put in multiple positions, including an inverted full suspension, and on her back in chains, as she's subjected to anal strap-on fucking, flogging, caning and spanking. Syren arrives at Helena's dungeon to find a letter, telling her how to present herself. Helena arrives and immediately corrects Syren for her backtalk and sloppy presentation. She puts her on her knees and flogs her ripe ass, the leather swatting her hungry pussy with each strike. Helena then pulls Syren down on her boot and makes her slide her dripping cunt all over it before licking it clean. Syren is then put in an inverted suspension so Helena can have unrestricted access to her creamy pussy. She flogs Syren and eats her pussy, giving her a little pain and a little pleasure at the same time. She then canes her, swatting her legs and her cunt and her ass, before fucking her with a dick-on-a-stick. Syren can't keep herself from cumming, even as she's made to beg for permission. Finally Syren is chained by the ankles and wrists as Helena fucks her tight ass with a strap-on. She torments her at the same time with a vibrator, and Syren can barely take it. She struggles to ask permission to cum while at the same time trying not to. When Helena finally allows it, Syren cums hard, repeatedly. But she's not done yet...Syren still has to give her domme an orgasm, so Helena sits on her face and rides her tongue until she cums. She leaves Syren a used, abused, fucked mess on her floor, and Syren loves every bit of it!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2018-06-07",
  "scene_id": 43460,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Boot",
    "Brunette",
    "Caning",
    "Chains",
    "Corporal Punishment",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "Redhead",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "Vibrator",
    "white"
  ],
  "title": "Syren de Mer Submits Every Hole to Helena Locke"
}