{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Isabella Nice is having trouble getting groceries out of her car when good samaritan, Zachary Wild offers to carry her bags to her house. Isabella takes him up on the offer and the two enter her apartment building but little does Isabella know that Zachary Wild has just left the door open for his four friends to come in. When Isabella opens her apartment door, they all storm in and throw her groceries onto the floor and start grabbing at her tits and pussy. To their surprise she grabs back at their dicks and immediately drops to her knees and starts sucking all of their big hard cocks. One by one they take turns fucking her mouth while she strokes the others with her hands. They get her on her feet and strip her naked. They then tie up her tits with rope and also tie her hands behind her back. She gets on her knees and the guys continue shoving their huge cocks down her throat. They pull her up and lift one of her legs making her balance on the other and all take turns fucking her pussy while the others fuck her face, waiting for their turn. Next they tie her hair to a rope extending up to the ceiling and bend her over a white padded saw-horse where one of her legs is tied to the top of. They get in line to pound her pussy once again with their massive dicks while she screams with a mouthful of cock. After that they release her hands and take her to a white leather mattress where she gets on her hands and knees and takes all of their big dicks in her tight ass. They pound her ass deep and hard stretching it to its limits. Finally Isabella gets double penetrated, taking all of their cocks in all of her holes at the same time and gets a face full cum.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Isabella Nice",
      "person_id": 61113
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-05-16",
  "scene_id": 43474,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "Feet",
    "foreskin",
    "Gangbang",
    "Latinx",
    "Leather",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Spit Roast",
    "Straight",
    "Stud",
    "top",
    "white"
  ],
  "title": "Isabella Nice Banged by Five Big Dicked Burglars"
}