{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When college student Juliette March accidentally trespasses while on a remote field study, the psychotic property owner Tommy Pistol overpowers the helpless student and carries her off to his cabin wherein a kinky hot mess of BDSM and rough pounding sex ensues. Tied up spread eagle against a stone fireplace Juliette is in quite a bind with a ball-gag stuffed in her mouth, nipple clamps pulling tight on her perky tits, leather ankle cuffs and a spreader bar with a magic wand vibrating her trespassing pussy. Tommy’s psychotic ass hangs tiny little plants from her nipples so she doesn’t forget why she is being punished. She was innocently searching for a particular flower when she stumbled onto Tommy’s property and she got a bit too curious.\nTommy spits in her face and torments her with the zapper and the flogger. He fingers her tight ass until she has a wild screaming orgasm. On her knees Juliette sucks Tommy’s cock deep down her throat and gags on it until she’s a wet sticky wreck and then Tommy fucks her ass good and hard. Next on all fours tied up in doggie Juliette takes a relentless paddling on her tender ass and it turns bright pink and then Tommy crams his big hard cock inside her pussy and pounds her out until she is begging to cum. More hardcore anal and Juliette is losing her mind with pleasure. For the grand finale Juliette is tied up on her back with legs spread wide open. Tommy fucks her slutty holes , makes her suck his dick and then shoots his psychotic load all over her cute face. And this is what you get for trespassing! Watch Juliette get her ass pounded into submission in Anal Trespassing!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Juliette March",
      "person_id": 22072
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2018-05-21",
  "scene_id": 43475,
  "tags": [
    "BDSM",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Humiliation",
    "Kinky",
    "Latinx",
    "Leather",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Paddle",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Anal Trespassing"
}