{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Delirious Hunter crawls naked into bed next to her man, Donny Sins, horny for his big dick. Donny's just not into it. He has a big meeting in the morning and just wants to get to sleep. The disappointed Delirious lays down next to him and masturbates until she cums. She falls asleep and begins dreaming about five different guys having their way with her while she's tied up in rope bondage, unable to move. We enter her dream and we see that she's sitting on the floor, her feet tied to her thighs with rope and her arms tied behind her back. She is immediately surrounded by five guys with five hard dicks, and they all take turns shoving their big cocks in her mouth and down her throat. Next, Delirious gets tied up in a partial suspension with one leg in the air and the other balancing on the floor with both arms tied again behind her back. She gets her pussy fucked by all the guys deep and hard with a mouthful of cock. After that, they lay Delirious on her back, spreading her legs over her head and one by one they shove their fat cocks in and out of her ass. They turn her over and pound her ass in doggy-style while she works her mouth on all of their cocks, keeping them rock hard and ready. After that she gets double-stuffed in reverse cowgirl taking a dick in her ass and her pussy at the same time. They double-penetrate her again in doggie and plug her mouth with their cocks, making her airtight. Finally, they all shoot their loads, covering her face with cum and she rubs it in like lotion with a big smile on her face. She sticks out her tongue and asks for round two.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Delirious Hunter",
      "person_id": 56555
    },
    {
      "name": "Domenic Kane",
      "person_id": 61322
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "James Franko",
      "person_id": 61323
    }
  ],
  "release_date": "2018-06-13",
  "scene_id": 43479,
  "tags": [
    "Airtight",
    "Anal",
    "BDSM",
    "big dick",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Penetration",
    "Feet",
    "Gangbang",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Spit Roast",
    "Straight",
    "Suspension"
  ],
  "title": "Delirious Hunter Dreams of Being Bound and Gangbanged"
}