{
  "collections": [
    "Strapon Squad"
  ],
  "description": "The crew here at Fetish Network have come across a promising submissive slut that loves bondage, BDSM and double penetration. The hot and mean Mistresses Lexy Villa and Brooklyn Daniels want to test her limits. We introduce the sexy and feisty Isa Mendez (formerly known as Abbi Roads). Brooklyn sits her on the sybian fucking machine, pulls her wrists behind her back and ties them to a post. Isa isn't going anywhere, her clit pressed against the flesh pad, fat rubber dick ready to spin against her g-spot. Brooklyn wants to make her orgasm no matter if she wants to. Of course Isa takes every inch of Brooklyn's massive strapon dildo deep down her throat. Brooklyn loves skull fucking slutty bitches. Isa's pussy gets teased with the changing speed and vibration from the sybian. Lexy joins the fun, changing up Isa's position for this lesbian domination threesome. She takes Isa off the fucking machine, shackles her wrist to a post each, keeping Isa bent over, ass and mouth ready for use. Brooklyn teases Isa's pussy with a vibrator and lube, shoving her rubber black dick deep inside Isa's cunt, pounding her in rough, making her take every inch. Lexy works on Isa's mouth, fucking her throat, making her gag up spit, rubbing it all over her face. The Mistresses switch places and keep taking turns, wearing Isa out, drenched in her own spit. They make her cum over and over, making her beg for it. Isa trembles and tenses up between Mistresses wrecking her holes, slapping her face and tits, spanking her ass till it turns bright red. Isa falls to her knees but is pulled up instantly and stuffed again, yelled at for being a useless whore. We're not sure when they actually stopped having sex with their new sex slave. From the looks of it, Isa doesn't mind one bit. She wants to please her Masters.",
  "directors": [],
  "models": [
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Isa Mendez",
      "person_id": 53665
    },
    {
      "name": "Lexy Villa",
      "person_id": 53826
    }
  ],
  "release_date": "2018-05-31",
  "scene_id": 43472,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "Chains",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "drool",
    "Fetish",
    "Gag",
    "gloves",
    "High Heels",
    "Hitachi",
    "Latin",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Slutty Slave Isa Mendez Dominated by Lexy Villa & Brooklyn Daniels"
}