{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When sexy foreign exchange student Moka Mora meets her American host, Tommy Pistol, she is dragged into a perverse sex deal between Tommy and her parents.\nPoor little Moka doesn’t know anything about this sordid Agreement between Tommy and her parents but she soon realizes it can work to her advantage. Tommy ties Moka up with rope for their first sexual escapade. Wearing little pink panties and thigh highs Moka sucks Tommy’s dick to earn her keep. In between the zappings and floggings Tommy throat fucks his house guest until its time to take things further into the feeding and fucking. First meal of the day Moka will eat while she gets fucked down on the floor in doggie position with a rope leash that looks like a chain. Tommy has his way with Moka’s wet pussy. She is already worked up, hot and bothered and ready to be fucked all day. She takes a pounding from Tommy and his big cock until Tommy stretches Moka’s pussy out with his fist! Then onto her back Tommy ties Moka up in predicament bondage with nipple clamps attached to a rope above so if she moves too much its gonna pull real tight on her nipples! He busts out the Hitachi and simultaneously vibes and fists her pussy until she is losing it. Tommy pounds her pussy all the way home and shoots his load all over her stomach and tits. Check out all the hot kinky action in this weeks SAS update The Agreement.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Moka Mora",
      "person_id": 59853
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2018-06-22",
  "scene_id": 43476,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Latinx",
    "natural boobs",
    "Nipple Clamps",
    "Predicament Bondage",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "Vaginal Penetration"
  ],
  "title": "The Agreement"
}