{
  "collections": [
    "TS Seduction"
  ],
  "description": "Tired of being made to feel weak and repulsive, the reclusive and deranged scientist Mike Panic has come up with a brilliant solution to his female troubles. He will use all his skills and training to develop the perfect woman. She will be lovingly submissive and obedient. No longer will Mike be at the mercy of the cruel and vicious creature known as woman. No longer will he be vulnerable to her rejection and humiliation.\nAt first it seems almost too good to be true. The experiment actually works and a living, breathing goddess stands before him. Jessica Fox is the Perfect Creature. The only problem is that Mike is a nice guy, and nice guys finish last. Even Jessica, designed to submit and obey her master's every perverse and unholy whim, finds Mike weak and pathetic. She wastes no time informing him that she is not here for his pleasure.\nSoon Mike is groveling on the floor. Worshipping Jessica's feet. Licking and sucking her toes. Removing her panties. Sucking her hard cock. Jessica comes alive, experiencing a blow job for the first time, finding joy in humiliating this awful excuse for a man. Mike worships her ass. Jessica has him licking her asshole. With each flick of his tongue his dignity is diminished, his manhood reduced to a simple tool for her pleasure.\nMike finds himself on all fours, getting reamed in the ass by his perfect woman. Then on his side. He is helpless as she humiliates and gives him pleasure simultaneously. Jessica drills him incessantly, only caring for her own pleasure. Now on his back, Mike feels the full weight of his submission as Jessica plunges her rock hard cock deep into his ass, pumping him furiously, Mike Panic, once a brilliant but mad scientist, is now reduced to a mere fuck toy for Jessica. Fucked so much he loses control and cums all over himself. Jessica fucks the cum out of Mike.\nShe doesn't stop there. With his legs bent up in the air and ass exposed, Jessica's hard plowing of his ass reduces Mike to a whimpering poodle. He begs and whines for Jessica to cum all over him. All he cares about now is pleasing his creation, unfortunately for him he is too weak and pathetic to ever please a woman. The best he can provide is temporary relief as Jessica cums across his face, chest and stomach. Mike groans with pleasure, bathed in her warm ejaculate, but this tender moment quickly ends. Jessica demands that he create a friend for her to play with. He will obey.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Jessica Fox",
      "person_id": 17013
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2018-07-24",
  "scene_id": 43478,
  "tags": [
    "anal",
    "blowjob",
    "Cock Worship",
    "Feet",
    "humiliation",
    "Male Sub",
    "master",
    "role play",
    "straight",
    "submission",
    "The Perfect Woman",
    "TS",
    "TS Fucks Male"
  ],
  "title": "The Perfect Creation: Jessica Fox Dominates Her Mad Scientist Creator"
}