{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Monica Sage is led through a garden by Zachary Wild. For her first time in bondage on camera, Monica wears a black leather straightjacket with her arms wrapped around her waist and her tits exposed. A bit-gag keeps her mouth open and a pink bejeweled metal butt plug peeks out from her bare ass. They slowly make their way upstairs to the deck of a house where four of Zachary's friends wait for this nineteen year old sexual offering. They grab Monica, place her on her knees and whip out their hard cocks. They completely surround her and all have their turn shoving their dicks down her throat. They fuck her pretty face until she's covered in her own spit. Monica is then placed on her back on top of a couch with her head hanging off of the end and gets her pussy fucked hard by every guy there. The guys that wait there turn fill her mouth with cock. Her screams of pleasure are so loud they move the sex party inside. Inside the house they put Monica on a white couch with her face down in the lap of one guy with his dick in her mouth and her ass in the air with another guy pounding her pussy hard. They switch holes and one by one they pound her ass deep and hard and she screams, cumming hard with a dick in her ass. After that, they flip her over and for the first time ever Monica gets double penetrated. With one fat cock in her pussy and another big dick in her ass, they fuck her hard until she cums multiple times into a convulsing puddle. They ultimately blow their loads across Monica's face and she rubs it around, covering her tits and smiles, ready for round two.",
  "directors": [],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Monica Sage",
      "person_id": 61374
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Nathan Bronson",
      "person_id": 58786
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-07-11",
  "scene_id": 43481,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "buttplug",
    "Corporal Punishment",
    "Double Penetration",
    "Gag",
    "Gangbang",
    "Leather",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Spit Roast",
    "Straight",
    "Straitjacket",
    "switch",
    "top",
    "white"
  ],
  "title": "Monica Sage Gets Fucked Senseless"
}