{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Casey Calvert answers a reply to her ad in which she requests for a man to come over and show her something new...sexually. She gives Prince Yahshua a time and a date and waits for his arrival. Prince Yahshua shows up with four of his friends and they surround her like horny sharks. They pull at her pink dress and it rips apart exposing her perfect perky tits. They lower her to her knees and pull out their hard cocks. Casey does her best to please all of their dicks. After they all take turns face-fucking her, the five guys then hang her upside-down by her ankles with leather foot cuffs. With her tits bound in rope and her arms tied behind her back unable to move, Casey gets her mouth stuffed again by their cocks. One by one they line up and get on their knees and fuck her mouth. Next, Casey gets fully suspended in rope bondage with her legs spread in a full \"splits\". With her pink pussy presented, and her arms tied behind her back, the guys take turns sliding their cocks in her pussy and pound it deep and hard. While getting fucked fully suspended with her legs spread, another guy comes from behind and shoves his dick in her ass making her double stuffed. They all take turns in her ass and Casey cums hard from the double penetration, nearly getting split in half from their huge cocks. They take Casey down from the full suspension bondage and and continue double and triple penetrating her on top of a black leather bench. They stuff her air tight, fucking all of her holes as she moans like a wild animal. They push her to her knees and she begs for cum and they release their massive loads onto Casey's pretty face.",
  "directors": [],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Prince Yahshua",
      "person_id": 38513
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-06-27",
  "scene_id": 43480,
  "tags": [
    "Airtight",
    "Anal",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "Flexible Fucks",
    "Gangbang",
    "Leather",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Suspension",
    "top"
  ],
  "title": "Casey Calvert's Double-Penetration Suspension"
}