{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "Marcelo has come to church to confess his sins and seek forgiveness. When he tells Father Jim that he has been peeping through windows and watching women undress, as well as chronically masturbating, Father Jim is shocked. As his penance, Marcelo is to say 10 Hail Fathers and refrain from masturbation for a week. Marcelo thinks this is a harsh punishment and is none too happy. However, Sister Bettie and Sister Hannah have been eavesdropping on the peeping tom's confession and think that's not nearly enough suffering for such a grievous sin. They grab Marcelo, bend him over a pew and bless his ass with his belt, a paddle and canes. When his screams become too loud, Sister Bettie gags him with a Bible. They beat his ass and cock with the Bible and make him read passages as they hit him. But this still isn't enough for the sadistic Sisters. They make Marcelo bend over the altar and apply whips and floggers to his already red and aching ass. Finally, they anoint him with their \"Jackhammer Jesus\" dildo and their huge strap-on cocks, filling his holes to teach him a proper lesson and set him back on the righteous path! [Behind the scenes post-scene interview follows the feature presentation!]",
  "directors": [],
  "models": [
    {
      "name": "Bettie Bondage",
      "person_id": 52284
    },
    {
      "name": "Hannah Hunt",
      "person_id": 61320
    },
    {
      "name": "Jimmy Broadway",
      "person_id": 19688
    },
    {
      "name": "Marcelo",
      "person_id": 46090
    }
  ],
  "release_date": "2018-05-28",
  "scene_id": 43506,
  "tags": [
    "Anal",
    "BDSM",
    "Big Toy",
    "Bondage",
    "Brunette",
    "Caning",
    "CBT",
    "Corporal Punishment",
    "Corset",
    "Curvy",
    "Deepthroat",
    "Dildo",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Dragon Dildo",
    "Femdom",
    "Fishnets",
    "Flogging",
    "High Heels",
    "Humiliation",
    "Kinky",
    "Male Sub",
    "masturbation",
    "Paddle",
    "Pain",
    "Pegging",
    "Role Play",
    "Sadism",
    "Single Tail",
    "Slave",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "Tattoo",
    "thirdparty",
    "Uncircumcised",
    "Whipping"
  ],
  "title": "Nuns Take Creepy Peeping Tom to Hell!"
}