{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "The gorgeous Bella Rossi is determined to prove her boss, Chelsea Marie, is embezzling from the company. In search of the proof she needs to take her down, Bella breaks into Chelsea’s office in the dead of night. Chelsea catches Bella red handed and takes her to the dark storage room where she awakens frightened, masked and tied to a chair. Chelsea begins interrogating Bella by squeezing and sucking on her big beautiful tits, but Bella fights hard to resist Chelsea’s tempting tactics. Bella slowly gives in to the seduction and Chelsea, in turn, pushes her harder, slowly making her pussy nice and wet. As Bella begins to give in with every moan and rub, Chelsea offers to let her offense slide if she is willing to “take it”. As Bella agrees to the terms, Chelsea pulls her cock out and lets Bella work her way to forgiveness. Bella sucks Chelsea’s cock deep and sloppy. Not satisfied, Chelsea grabs Bella from the hair and shoves her ass in Bella’s face. Bella licks Her booty as Chelsea grinds on her. Then Chelsea pushes Bella to her back where she begins to suck on Bella’s pussy, licking her up and down. Stroking her clit with her tongue, making her wetter and wetter with every lick. Unable to resist Bella’s eager pussy, Chelsea fucks Bella with her rock hard cock and continues to punish her for sneaking around. Bella loves her punishment and wants it harder. Chelsea turns Bella around into doggy and gives her a good punishing, allowing Bella to cum only after taking it hard and deep. Chelsea continues to builds her load and unleashes all over Bella’s big titties. A punishment well served and secret to be kept.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    }
  ],
  "release_date": "2018-07-02",
  "scene_id": 43517,
  "tags": [
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Cock Worship",
    "Curvy",
    "natural boobs",
    "other hair color",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Office Thieves"
}