{
  "collections": [
    "TS Seduction"
  ],
  "description": "Lonely loser D Arclyte is Natalie Mars biggest fan. His studio apartment is a shrine to his favorite goddess. In the middle of masturbating he is startled to see Natalie appear in his dank, cluttered room. He is overjoyed at this surprise visit, but she is grossed out by this crude, creepy excuse for a man. She informs him, \"you are no one to me, you are nothing. You are shit You don't even exist.\" D Arclyte's dream comes true when Natalie sits on his ass, smothering is face. But Natalie has no interest in pleasing this dirty little pervert. She has him suck her dick. Taking it deep into the back of his mouth. Drooling spit. Now he must worship her asshole. He is a lucky boy. A lot of creeps try to talk to Natalie, none of them get this far. D takes off her panties. She puts them on his head before ordering him to suck her cock. He looks even more ridiculous now. Deep throats it like a champ. Now back on Natalie's asshole, getting her cock rock hard with his tongue. More face sitting, ass licking, dick sucking. D is in heaven, pleasing his dream goddess Natalie Mars, but he is aching to really get his hands on her sexy body. He whimpers and begs and pleads to fuck his dream girl. Natalie promises him they will fuck. Then he is ordered to get on all fours and get Natalie's cock nice and wet. This isn't what he dreamt of, but he will do anything to please his dream goddess. D feels her cock expand deep into his tight virginal ass, pounding away. She teases if he is really good he might get the chance to fuck her ass. He is willing to do anything to get that opportunity. Natalie mounts D, plunging deep into his hungry hole. Now he's face down on his stomach, as Natalie rides him down into the mattress. Her gorgeous hands and manicured nails wrapped around his mouth, her beautiful arm squeezing his neck. Natalie asks if he would like to fuck her now. He whimpers approvingly, crying that he has earned it. Unfortunately, D learns that he will be wearing a face-dildo. His creepy, pathetic dick will not be inside Natalie Mars. Natalie takes the dildo all the way in her ass. On all fours, D's face once again pressed against her smooth ass. \"Fuck me harder, don't be a bitch\". He gets to stroke her dick while he fucks her. He is not allowed to touch his own dick. Natalie lays on her back and spreads her legs for D. You say you love me, why don't you prove it! Plunging the dildo in and out of her sweet hole. Nice and deep. Natalie cums on her hands and then wipes it all over D's face. She asks if he wants to cum now, is his dream about to come true? No, Natalie has no intention of touching his creepy dick. D has to stroke himself off, looking at Natalie's beautiful eyes, perky tits, and round ass.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "D. Arclyte",
      "person_id": 59025
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2018-08-07",
  "scene_id": 43510,
  "tags": [
    "Anal",
    "Blowjob",
    "Cock Worship",
    "Corset",
    "Crying",
    "Dildo",
    "Facesitting",
    "High Heels",
    "Latex",
    "Male Sub",
    "Nylons Stockings",
    "Rimming",
    "Role Play",
    "shaved",
    "smooth",
    "Smothering",
    "Straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "The Mars Obsession: Natalie Mars Invades D Arclyte's Dreams"
}