{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Kelli Lox and Mona Wales have just finished a hot webcam session. Countless viewers have cum from their efforts and Mona doesn't want the session to end. She soon has Kelli out of her latex and her mouth on Kelli's tight hole. Mona loves Kelli's high heels, and Kelli is only happy to apply them to Mona's delicate throat. This makes Mona happy, struggling to breathe. She sucks on Kelli's sharp heels, and moans with delight as the heels poke her soft breasts and hard nipples. The whole weight of Kelli's body concentrates at the point of those narrow heels and presses deep into Mona's flesh. Thank you, mistress. At her mistresses' urging, Mona puts Kelli's cock in her mouth. Mona admits she is only pretty with her mistresses' cock in her mouth. Kelli in turn licks Mona's pussy, getting it wet and ready. It's already wet from the damage inflicted by the high heels. Mona declares that her mistress owns her hole. She begs Kelli to fuck her. Mona straddles Kelly. She looks so pretty bouncing up and down on her mistresses' cock. Now Mona is face down, ass up. She loves feeling Kelli's thumb in her asshole. Kelli spreads Mona's ass wide so she can see Mona's pussy lips wrapped are her hard shaft. Mona cums. She cums Â and squirts and cums some more, but when she gets squirt in her mistresses eyes she must be spanked.\nKelli's mouth and tongue feast on Mona's ass and pussy holes. Mona begs Kelli to sit on her face and use her as a throne. Now Mona is in heaven. Here she can stroke her mistresses' cock and tongue her mistresses' asshole.What a great end to a long work day. Kelli's rigid cock finds its way back into Mona's mouth and throat. Mona's face is fucked rough and deep. Mona chokes on Kelli's cock Kelli's cock gets a massage with Mona's latex covered feet while she generously brings Mona to another orgasm with the Hitachi. But the biggest joy for Mona is when Kelli drops a hot steamy load of woman-cum on and in Mona's open, hungry mouth.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kelli Lox",
      "person_id": 37743
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2018-07-16",
  "scene_id": 43518,
  "tags": [
    "Athletic",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Dominatrix",
    "Feet",
    "High Heels",
    "Hitachi",
    "Latex",
    "natural boobs",
    "Role Play",
    "shaped",
    "slim",
    "Straight",
    "switch",
    "toned",
    "TS",
    "TS Fucks Female",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "CamGirls After Hours: Kelli Lox fucks submissive co-worker Mona Wales"
}