{
  "collections": [
    "TS Seduction"
  ],
  "description": "Kip Johnson is kicking back at home drinking a case of cold beer when he should be out shopping for a gift for his anniversary with raven-haired beauty Aspen Brooks. Too late now. Aspen comes home in a happy mood, gift in hand, ready to enjoy a lovely evening with her man. Kip tries to pretend his few remaining unopened beer cans are her anniversary present. Aspen is so mad she is about to faint. Kip offers a massage but she doesn't want him touching her right now. He can grovel for forgiveness and kiss her feet. Kiss them like he fucking means it. He works his way up her shapely thigh, lifting up her skirt with his teeth. Aspen knows he wants her cock. She smothers him with her luscious ass instead. Kip is finally rewarded with Aspen's big girl cock. She fucks his lying face hole and her mood slowly improves. Aspen removes her bra, revealing her supple, large breasts. Kip will have to wait to get his hands on these beauties, as he has more work to do to make up for his shitty present. Aspen directs kip to the bed, bends him over and strips him naked. Aspen spreads Kip's tight man buns and indulges herself with some delicious ass licking, plunging her tongue deep into his gaping hole, getting it wet and juicy for her big girl cock. Kip moans with pleasure, hoping his ass will make up for his inadequate relationship skills. Aspen drives her cock deep into Kip's back door. Aspen fucks him rough and hard and doesn't want to hear him complain, not after his shitty present. Kip welcomes the pounding, wishing his lady a happy anniversary. Aspen demands her cock be sucked clean by Kip. He swallows her cock hungrily and happily. Aspen's mood softens. If Kip had only been bent over on the bed naked when Aspen came home she never would have gotten angry. Aspen flips Kip on his back, and plows his ass. Then puts him in the piledriver position to receive her load of cum. She rams him deep and hard and poor Kip can't help but cum first, his white spunk spraying down on to his face. Aspen then stands tall over her pathetic lover and blasts her massive load over his chest and face and his hungry mouth. She reminds her man that she always gets what she wants.",
  "models": [
    {
      "name": "Kip Johnson",
      "person_id": 51603
    },
    {
      "name": "Aspen Brooks",
      "person_id": 59054
    }
  ],
  "release_date": "2018-10-16",
  "scene_id": 43516,
  "tags": [
    "anal",
    "ass licking",
    "blowjob",
    "Cock Worship",
    "Feet",
    "gaping",
    "Male Sub",
    "role play",
    "straight",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Big Girl Cock: Aspen Brooks Punishes Kip Johnson On Their Anniversary"
}