{
  "collections": [
    "TS Seduction"
  ],
  "description": "Sexy redhead Shiri Allwood is home early from a Halloween party. Her mother and step-father are out and the night is young, but step-brother Sebastian Keys seems to only care about playing video games. He doesn’t notice how good Shiri looks in her Halloween costume. He also is oblivious to the fact that Shiri didn’t come home early to play video games. Shiri isn’t afraid to try the direct approach. She unzips Sebastian’s pants and strokes his cock until he can no longer ignore the amazing sensation in his loins. Shiri fills her mouth with his rock hard erection. Sucking it like candy. Sebastian shuts up and enjoys the blowjob. Now that Shiri has his attention, she orders Sebastian to take his pants off for some over-the-knee spanking. He moans with pleasure as Shiri spanks his bare bare ass, turning his cheeks red. Sebastian is a pain slut so Shiri shoves him to the floor and orders him to lick her leather shoes. Sebastian loves having a woman humiliate him and tell him what to do. He licks clean the leather shoes that just an hour ago were walking along the filthy city sidewalks. Shiri has him worshiping her bare feet. Licking and sucking her toes. Sebastian kisses his way up Shiri’s bare leg to her panties. Sebastian has found a new joystick to play with. He opens wide for Shiri’s cock. She is surprised at how good he is at blowjobs. Sebastian hungrily deep throats her cock, slobbering spit over her balls. Shiri demands Sebastian’s ass and he obediently offers it up for her to use and abuse. She plows and pumps and slams her cock deep into his anal opening. Sebastian is in heaven, all he can say is “fuck yeah”, hoping Shiri won’t stop anytime soon. Sebastian is a real slut. His ass is wide open to Shiri’s hand spanking and cock drilling. Nice ‘n’ Deep. Shiri is not going to let this chance to be home alone with Sebastian go to waste. Sebastian happily lays on his back, legs spread wide, ready for Shiri to blast her load all over him. Or will he be weak and ejaculate first? Either way, Sebastian has been thoroughly dominated and humiliated by Shiri. Maybe he’s found something better to do than to play video games after all!",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Shiri Allwood",
      "person_id": 61393
    }
  ],
  "release_date": "2018-10-30",
  "scene_id": 43515,
  "tags": [
    "Anal",
    "Blowjob",
    "brunet",
    "Cock Worship",
    "Feet",
    "halloween",
    "Leather",
    "Male Sub",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Redhead",
    "Role Play",
    "slim",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Male",
    "versatile",
    "white"
  ],
  "title": "Home Alone: Shiri Allwood fucks step-brother before parents come home!"
}