{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Jessica Fox is a hot Lawyer who just won a big case for her gorgeous client Helena Locke. Sitting in Jessica's office the two beautiful women are excited about the win so they toast to success. Helena can't be grateful enough for Jessica's hard work, but Jessica knows exactly how she can repay her. She reaches in to undo Helena's shirt then pulls her in for a hot steamy kiss. Jessica turns Helena around for a spanking. She pulls Helena's skirt up and pulls her panties aside, revealing Helena's beautiful pink pussy. Jessica puts a few fingers in her, getting it hot and wet so she can take her payment for the win. Jessica then takes her skirt off so Helena can get her tongue deep in her ass. After a getting her ass licked Jessica reveals a hard cock for Helena to suck. Helena licks it up and down, then puts it in her mouth and sucks it hard and deep. Jessica fucks Helena's face, making her drool all over her cock. They move to the ground where Jessica licks Helena's wet pussy up and down. She sucks and stretches Helena's beautiful pussy lips, getting her hotter and wetter with every stretch. Jessica then slides her hard cock in and gives her a good pounding. Jessica then ask her to get a special toy out of the drawer. Helena finds a nice plug to fit Jessica's hot ass. Jessica is now ready to continue collecting her payment. She puts Helena in doggy style and fucks her hard. She goes deep in her pussy pounding away. Jessica then asks Helena to dig in her drawer for another toy, giving Helena a chance to also enjoy in the spoils with few orgasms for herself. Helena vibes her pussy while Jessica fucks her from behind. After a few orgasms, Jessica takes her final payment then dumps her receipt all over Helena's face.",
  "models": [
    {
      "name": "Jessica Fox",
      "person_id": 17013
    },
    {
      "name": "Helena Locke",
      "person_id": 59793
    }
  ],
  "release_date": "2018-08-13",
  "scene_id": 43519,
  "tags": [
    "blowjob",
    "Cock Worship",
    "drool",
    "role play",
    "spanking",
    "straight",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Firm Appreciation: Helena Locke Thanks Jessica Fox with Sexual Favors"
}