{
  "collections": [
    "TS Seduction"
  ],
  "description": "Kayleigh Coxx is a stunning hot celebrity who is being followed by paparazzi after a long night out. She makes her way home where she tries to unwind, but soon realizes her privacy has been compromised. She catches Ruckus, the sneaky paparazzi, taking photos through her window as she undresses. Kayleigh is disgusted by her invasion of privacy and how far these sneaky paparazzi assholes will go. She dashes out and brings Ruckus back to her room where she teaches him a hot steamy lesson he won’t forget. Kayleigh orders him to the floor and stuffs her big hard cock in his mouth. The enthusiastic fanboy takes her cock deep in his throat, enjoying every inch of it as he aims to please her. She makes him lick her ass and suck her cock from behind. She then shoves her beautiful tits in his face and makes him gasp for air. Kayleigh enjoys his mouth so much she decides to try this paparazzi’s other hole. She takes her hard cock and slides it right in his slutty ass and he swallows it right up. Ruckus enjoys being punished with Kayleigh’s cock so much that he can’t help but beg for it as he moans and groans. Kayleigh pounds his hole and strokes his cock until he busts his load all over himself. She takes advantage of her dominating position and takes a few photos of Ruckus covered in his own load. Ruckus begs for the photos as he doesn’t want them to be leaked. Now that Kayleigh has the upper hand, she knows exactly where she wants to unleash her load. Ruckus doesn’t hesitate to comply so he takes every drop of her stardom into his mouth. With Kayleigh’s privacy secured, she kicks the dirt bag out on the street, where he belongs.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Kayleigh Coxx",
      "person_id": 61277
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2018-08-21",
  "scene_id": 43513,
  "tags": [
    "Anal",
    "Athletic",
    "Blonde",
    "Blowjob",
    "brunet",
    "Cock Worship",
    "fake boobs",
    "Male Sub",
    "Role Play",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Paparazzi Down: Kayleigh Coxx Teaches A Hard Lesson To Ruckus"
}