{
  "collections": [
    "TS Seduction"
  ],
  "description": "On this episode of I Dream Of Natassia, Major Pierce Paris, astronaut who finds an ancient bottle with the genie Natassia Dreams trapped inside, is tired of not having his dinner ready or the house cleaned when he comes home from his job at NASA. His Genie, Natassia Dreams, is not about to spend her time cooking, cleaning and washing after having been locked in her bottle for 2,000 years. Major Paris expects his Genie to grant his every wish. Natassia is more than happy to please her Master. She knows deep down her master truly desires a strong, dominant Genie to take him and stretch his hole and fuck his ass deep and hard. With a magical blink of her eyes, Natassia brings Pierce down into her bottle. She tells him she is now going to have his way with him. In a quick blink, Pierce is naked with a ball-gag in his mouth. The Major isn't getting the hint so he finds himself in a small cage and the only way out is to lick and suck and kiss his Genie's gorgeous feet. Natassia then gives Pierce something else to suck on, as she presses her bare breasts against the hard metal cage. Pierce is all too ready to worship her breasts and suck on her tasty nipples. Pierce agrees to do everything Natassia says in order to get out of the cage. Pierce kisses her beautiful feet and up her long, shapely legs. Sucking on her nipples, Natassia is hot and ready. From underneath her dress, she releases her thick, hard cock which has also been out of action for 2,000 years. Pierce dives head first into her lap and hungrily shoves her cock into his mouth. Time for the Genie to get her wish. Natassia fucks Pierce's tender, sweet ass doggy style on her bed. He is reduced to grunts and groans as her amazing cock plunges deep into his ass. He can only nod yes as she pounds away. With a quick blink, Natassia instantly flips Pierce on his back and takes him again. Fucking him furiously. His legs spread far and wide apart, she climbs on top, plunging her cock deep into ass, exploring where no one has dared go before. Natassia feels his ass tighten around her cock as she fucks the cum right out of her master and across his stomach. Then she blows her load. Take that, Mr. Astronaut, 2000 years of cum exploding across her master's face.",
  "directors": [],
  "models": [
    {
      "name": "Natassia Dreams",
      "person_id": 16310
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2018-10-02",
  "scene_id": 43514,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "Black",
    "Blowjob",
    "brunet",
    "Brunette",
    "Cage",
    "Cock Worship",
    "fake boobs",
    "Feet",
    "Gag",
    "Male Sub",
    "master",
    "muscular",
    "Role Play",
    "shaped",
    "shaved",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "I Dream Of Natassia"
}