{
  "collections": [
    "TS Seduction"
  ],
  "description": "The stunning Casey Kisses knows some dirty little secrets about DJ and she has the pictures to prove it. She patiently waits for DJ at the Hush Honey Inn where she plans on taking DJ's hard earned cash in return for the pictures and her silence. After DJ shows up late, she decides money isn't enough to silence her. DJ is all too eager to amend the situation and is willing to do anything to hush Casey and get the pictures. Casey takes advantage of the situation knowing DJ will submit to her every command. She tells him to strip his clothes off and get to his knees. DJ complies with no hesitation as he begs for the pictures. Casey demands him to take her stockings off and rub her feet. DJ complies and begins to worship her beautiful feet, licking them up and down like a little slave boy. Casey then takes her hard cock out out so DJ can earn his privacy. DJ starts licking and sucking her cock deep in his throat, getting Casey hot and excited. Casey then turns around and makes him lick her beautiful ass. He puts his tongue deep in her while he strokes her cock up and down. Casey then puts him in doggy and fucks him in the ass nice and hard for being late. DJ moans and screams as he takes her big cock like a champ. Casey puts DJ on his back where she fucks him deep and hard while they take turns stroking his cock. Casey then puts DJ in pile driver and fucks his ass hard. She tells DJ to stroke his cock until he blast his load all over his face. Casey then makes him beg for her load. She dumps her load on his chest then sends him packing with his pictures.",
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "DJ",
      "person_id": 20225
    }
  ],
  "release_date": "2018-09-18",
  "scene_id": 43512,
  "tags": [
    "anal",
    "blowjob",
    "Cock Worship",
    "Feet",
    "Male Sub",
    "role play",
    "slave",
    "Stockings",
    "straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Hush Honey Inn: Casey Kisses Fucks An Unwittingly Willing DJ"
}