{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Beautiful Natalie Mars is home alone and horny, so she calls up busty Domme Cherry Torn. Cherry invites her over and Natalie quickly finds herself suspended in tight bondage in Cherry's dungeon. As Natalie dangles helpless in the middle of the room, Cherry brutally flogs her, then begins to torment her sensitive nipples and cock. As Natalie's moans grow louder, Cherry can't resist sliding her huge strap-on into Natalie's hungry asshole. Cherry fucks Natalie harder and harder as the ropes press tight into her pale skin. After Cherry finally has her fill and takes Natalie down from her suspension, Natalie decides that its her turn to top. She starts beating Cherry's tits and Cherry, to turned on to resist, moans with pleasure. Natalie pushes Cherry's hungry mouth down on her hard cock, pressing it deep down Cherry's throat, then flips Cherry over and spanks her round ass until it turns bright pink. More and more turned on, Natalie eats Cherry's hungry asshole then slides her hard cock deep into Cherry's pussy. Natalie pounds Cherry's wet hole doggy style while continuing to spank her, then makes Cherry ride her in reverse cowgirl while she torments her ample tits. Finally, flipping Cherry into missionary, Natalie pounds orgasm after orgasm out of Cherry. Still not satisfied, Natalie immediately starts eating out Cherry's throbbing pussy, making her cum again. Cherry begs for more and Natalie obliges by plunging her hard cock into Cherry's waiting ass. Natalie rides Cherry's tight asshole as Cherry cums over and over. She then pulls out her cock, only to slide her whole hand deep into Cherry's gaping asshole. With Natalie's hand buried up to the wrist in her ass, Cherry cums a final time, then Natalie slides her cock into Cherry's mouth, who eagerly sucks it until Natalie covers her face with cum.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Natalie Mars",
      "person_id": 60280
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    }
  ],
  "release_date": "2018-09-24",
  "scene_id": 43522,
  "tags": [
    "Blowjob",
    "Bondage",
    "Cock Worship",
    "dungeon",
    "flip fuck",
    "Gaping",
    "Kinky",
    "Role Play",
    "Straight",
    "Suspension",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Booty Calls Episode 3: Natalie Mars and Cherry Torn's Kinky Flip Fuck"
}