{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "The sexy Natassia Dreams sits on a throne in her gloomy dungeon where she summons her submissive slutty leather kitten at the stroke of a bell. The hot and sexy Ella Nova emerges from the shadows, blinded by her leather kitten mask. She crawls like a sexy kitty, making her way over to her Mistress Natassia. She sniffs her mistress heels, and like a good kitty begins to lick them clean. She gracefully kisses and licks on her mistress toes and feet, working her way up Natassia’s sexy long legs. Natassia grabs Ella from her head and makes her lick her latex dress to a shine. Natassia then unmasks Ella, revealing her beautiful submissive face and demands that she keep worshiping her toes. Ella complies like a good little sub. Natassia takes her cock out so the sexy kitty Ella can have a taste. Ella gobbles on Natassia’s cock, licking it up and down like a good kitty. Natassia then takes her ass and shoves it in Ella’s face. She grinds and jiggles her ass on her face so she can work her tongue in. The slutty Ella gracefully licks her hole while working her cock. The good submissive kitty then takes her mistress cock and sucks it from behind. Natassia keeps grinding her ass on her face until she eventually lets her have a taste of her titties. Now that Natassia is all worked up, she puts her slutty kitty into doggy style and shoves her hard cock in her pussy. She pounds on her kitty, fucking her hard until she cums. Natassia then turns her over and pounds her with her legs wide open. Not pleased enough. Mistress Natassia takes one final go at Ella’s slutty ass. She turns her around and gives her ass a good pounding. She builds her load then gives the slutty kitty her well deserved milky treat all over her face and mouth. Now that’s a good kitty.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Natassia Dreams",
      "person_id": 16310
    }
  ],
  "release_date": "2018-10-22",
  "scene_id": 43523,
  "tags": [
    "Athletic",
    "Black",
    "Blonde",
    "Blowjob",
    "bottom",
    "Brunette",
    "Cock Worship",
    "dungeon",
    "fake boobs",
    "Feet",
    "Latex",
    "Leather",
    "Mask",
    "muscular",
    "natural boobs",
    "Pet Play",
    "Role Play",
    "shaped",
    "shaved",
    "Straight",
    "Sub",
    "Tattoo",
    "tea2020",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Natassia Dreams' Slutty Leather Sex Kitten, Ella Nova"
}