{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Sexy blonde Shiri Allwood talks her friend Alana Cruise into breaking into a creepy abandoned house where a reclusive old pervert once lived. The girls are fascinated when they discover some kinky sex toys. Shiri becomes possessed with an unknown compelling energy that permeates the house. Alana is a little frightened, but trusts Shiri and willingly plays along with her friend's desires. Shiri blindfolds Alana and soon has her friend over her knee, groping and spanking her butt cheeks. Being blindfolded is a turn-on for Alana and she forgets they are in a dark, musty old house. Shiri doesn't stop with the spanking. Her fingers reach underneath Alana's panties, fingering her pussy and playing with her asshole. Alana's moaning gets Shiri even more turned on, and makes her want more. Alana, still blindfolded, can feel Shiri's mouth on her pussy. She can feel Shiri's tongue caressing her clit. When Shiri commands Alana to undress completely, the spirit of the house compels Alana to willingly obey. She happily allows Shiri to attach nipple clamps to her tender breasts. When Alana is ordered to remove Shiri's shoes, she soon finds herself kissing and worshiping Shiri's bare feet and licking her toes. Soon she finds herself worshiping Shiri's now very hard cock. Alana is hungry for her friend's cock. She sucks it hard and deep, driving Shiri wild. Something in this house has made Alana a cock sucking demon. All Shiri can think about now is putting her hard cock in Alana's wet pussy. Alana is all too eager to bend over the couch and let her friend have her way with her. Alana lays on her back and holds her legs open as wide as she can to let Shiri drive her hard cock down deep into Alana's fuck hole. Shiri pounds Alana into ecstasy and oozing onto her friend's stomach. The mysterious sexual energy inside this house has brought these two friends closer than they had ever imagined.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Shiri Allwood",
      "person_id": 61393
    },
    {
      "name": "Alana Cruise",
      "person_id": 60194
    }
  ],
  "release_date": "2018-10-08",
  "scene_id": 43524,
  "tags": [
    "blonde",
    "blowjob",
    "braces",
    "cock sucking",
    "Cock Worship",
    "Feet",
    "Fingering",
    "halloween",
    "kinky",
    "nipple clamps",
    "role play",
    "spanking",
    "straight",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Shiri Allwood Leads Trusting Alana Cruise Into The Haunted Fuck House!"
}