{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Nikki Darling’s shift at the strip club has just ended when she gets a text from her new friend Shiri Allwood. A Booty Call. She rushes over to Shiri’s apartment. “Did Somebody order a stripper gram?” Sexy blonde Shiri can’t wait to get her mouth on Nikki’s hot body. Nikki lets Shiri know that naughty girls need to be punished. Shiri kisses, bites and pinches Nikki’s nipples then puts her over her knee for some tender but hard spanking. Shiri pulls Nikki’s pants off her round sweet booty, leaving only high-heel shoes on her naked body. Shiri bites and licks Nikki’s asshole. Nikki is hot and ready for Shiri’s cock. First though Shiri sits her bare ass on Nikki’s face. A hot sixty-nine as Shiri licks Nikki’s pussy while Nikki sucks on Shiri’s balls, getting right up in there with that dirty slut mouth. Shiri orders Nikki to blow her lady cock. Nikki gets it wet and all lubed up, taking it deep in her throat. Nikki is on all fours. Fucked doggy style. Her hungry pussy needs cock. Shiri slaps and spreads Nikki’s luscious ass cheeks then slides her cock deep into Nikki’s perfect, tight pussy. Fucks her doggy style before flipping her over and making Nikki cum while Shiri has her hand on Nikki’s throat. Nikki is begging for a cock in her tight, ready ass. Spooning, with Shiri’s cock in her ass and a vibrator humming on her pussy. Nikki experiences a flood of squirting orgasms. Now Nikki is on all fours getting drilled from behind. Shiri plunging her cock deep inside her and pounds her tight asshole until Nikki cums again. Then for a little ass-to-mouth as Nikki slobbers over Shiri’s rigid cock, trying to suck out Shiri’s cum. But Shiri has Nikki on her back again and her cock in Nikki’s tight little asshole. Then Doggy style. Nikki grabs the vibrator, she can’t stop the orgasms even if she wanted to. Shiri shoots her sticky load across Nikki’s tight stomach.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Nikki Darling",
      "person_id": 42508
    },
    {
      "name": "Shiri Allwood",
      "person_id": 61393
    }
  ],
  "release_date": "2018-08-27",
  "scene_id": 43520,
  "tags": [
    "Black",
    "black hair",
    "Blonde",
    "Blowjob",
    "braces",
    "Cock Worship",
    "natural boobs",
    "Redhead",
    "Role Play",
    "shaved",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Booty Calls Ep 1: Shiri Allwood Fucks Nikki Darling's Whore Holes!"
}