{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Riley Nixon is looking for a hook-up at a bar when she gets an unexpected booty call from TS Foxxy. Foxxy is back in town, holed up in a dingy motel room, needing to see her honey in a bad way. Riley is a smart girl, and she knows to get her ass on over asap. Foxxy has plenty of questions for Riley. She wonders why Riley is running around late a night, dressed like a slut. She doesn’t believe Riley was sitting alone at the bar. She knows Riley is a little slut and wants to know exactly what she was doing. Foxxy isn’t jealous, well maybe a little, but that’s what turns her on. It gives her a good reason to punish Riley, and punishing Riley is fun. Foxxy lays Riley across her lap for some otk spanking. Foxxy’s hand turns Riley’s luscious big ass nice and red. Foxxy soon has Riley on the floor, on all fours, with her toes in Riley’s mouth. Riley loves the taste. Foxxy loves rubbing her feet against Riley’s large breasts. Toe-sucking really turns on Foxxy. Ass licking also turns Foxxy on and Riley is only happy to run her tongue up and down Foxxy’s sweet ass crack. Riley is eager to have Foxxy’s cock in her mouth. A sloppy deep throat gets Foxxy nice and hard. Suck it clean. Foxxy puts Riley on the bed, doggy style for some pussy licking. Pulls down her thong and puts her tongue to work on Riley’s sweet pussy to get it wet and ready for some flogging. Foxxy has more questions for Riley. “What were you doing at the bar? Were you behaving?” Foxxy flogs Riley’s wet pussy and ass. Riley confesses to flirting with some cute girls and cute boys. This only gets Foxxy more turned on. She fucks Riley doggy style. Then holds Riley’s face firmly in place for some good ol’ throat fucking and breath play. Foxxy then drives her cock in deep into Riley’s tight little asshole. Fucks her ass doggy style, then missionary, on her side on her back. Riley cums so much she loses count of how many orgasms. Foxxy shoots her load right into Riley’s open mouth and tongue.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Riley Nixon",
      "person_id": 59619
    },
    {
      "name": "TS Foxxy",
      "person_id": 20055
    }
  ],
  "release_date": "2018-09-10",
  "scene_id": 43521,
  "tags": [
    "Big Ass",
    "Blowjob",
    "bottom",
    "Brunette",
    "Cock Worship",
    "fake boobs",
    "Feet",
    "Flogging",
    "Latinx",
    "natural boobs",
    "Rimming",
    "Role Play",
    "slim",
    "Spanking",
    "Straight",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Booty Calls Ep2: TS Foxxy's Back To Fuck Riley Nixon's Slutty Ass!"
}