{
  "collections": [
    "Bound Gods"
  ],
  "description": "Standing on a wooden box, shirtless and wearing black leather pants, Buck Wright is bound in red rope. Both of his wrists are tied to the ceiling and both ankles are secured to the wooden platform on which he stands. He waits, smiling in anticipation as Sebastian Keys walks in to have his way with him. Sebastian creeps up from behind him and grabs both Buck's nipples and gives em a hard squeeze which triggers Buck's cock to immediately get rock hard inside his now tight leather pants. Sebastian unleashes his leather crop and goes to work on Buck's ass, stomach, and chest. Sebastian slaps Buck's hard cock and unbuttons Buck's leather pants, setting free his big hard dick, wraps his lips around it and starts sucking. Sebastian then flogs Buck's big dick and then wraps it up with red rope, teasing his bound balls with his tongue. Next we find Buck standing, blindfolded, and bound to the St. Andrew's cross with an array of red rope. Sebastian grabs the crop and makes Buck lick it, wetting the leather tip making each hit on his entire body more painful. Sebastian applies two clamps to each of Bucks nipples and gets his electronic zapper. Sebastian zaps Buck's entire body including his balls and rewards him by sucking his cock. Sebastian removes the nipple clamps and pinches Buck's nipples making him scream in pain. Sebastian then suspends Buck from the St. Andrew's cross with his leg's spread using leather cuffs on his hands and ankles. Sebastian sinks his cock deep into Buck's exposed ass and pounds it hard. After that, Buck is taken down from the cross and sucks Sebastian's cock while he jerks his own until he receives a hot load in his mouth and shoots his own load all over the floor.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Buck Wright",
      "person_id": 61329
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2018-06-21",
  "scene_id": 43534,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Flogging",
    "Gay",
    "Humiliation",
    "Interracial",
    "Leather",
    "Leather Cuffs",
    "Male Sub",
    "master",
    "Nipple Clamps",
    "Nipple Torment",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "switch",
    "Tattoo",
    "the cross",
    "versatile",
    "white",
    "Zapper"
  ],
  "title": "Buck Wright Bound and Beaten"
}