{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Aiden Starr and Sebastian Keys star in this special update of Divine Bitches. When these two long time BDSM practitioners and current partners get going, things get hot fast! Sebastian starts in an inverted ankle suspension with his hands tied behind his back. As the anticipation of being thoroughly used by this Goddess sets in, he begins to sweat. Aiden places four sets of clover clamps on his balls and another set on his nipples. She flogs his ass before getting a crop to work over his ass and thighs, turning them bright red. Sebastian screams gratitude and adoration for Aiden as she relentlessly smacks his sensitive thighs. When he can take no more from the crop, Aiden uses the zapper to shock him all over, paying special attention to his sensitive nipples. Next, Sebastian is collared and cuffed with a spider gag stretching his mouth open. As Sebastian drools all over himself, Aiden flogs his back and ass and canes his thighs. She fucks his face with her fat cock. Sebastian takes as much as he can, gagging on her cock as he stars up at her perfect cunt. Then she takes off his gag and chokes him with her hand before spitting in his mouth. Now that his mouth is all stretched and ready, she begins to stretch his other hole. She bites down on his balls, stretching them as she works open his ass on her fingers. Finally, she gives this hungry buttslut what he desires most -- her big hard strap-on cock. Sebastian moans his ass opens up around Aiden's dick. His groans increase as Aiden plows his ass before flipping him over to fuck him on his knees. Using the handle on his collar to hold him in place, she fucks the shit out of him as his collar chokes him with every powerful thrust. When his slut ass is good and open, she fucks him with her hand, filling his ass with four fingers. As she incessantly milks his prostrate, Sebastian begs to cum. Finally, Sebastian is tied down on Aiden's bed. She edges him mercilessly as he begs to cum. But he doesn't get to cum before her! Aiden uses his cock and sits on his face and lets this lucky slave worship her glorious pussy and ass. She cums hard all over his face as he licks her perfect asshole. Then she continues to edge him until he explodes all over her hands. Delighted, she continues to work his sensitive cock as Sebastian cries out, squirming to escape her touch. Then she gathers up all his cum, rubs it all over his disgusting face, and makes him lick her hands clean. Finally, she shocks him with the cattle prod before leaving this cumslut in his own juices.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2018-07-17",
  "scene_id": 43538,
  "tags": [
    "bdsm",
    "bondage",
    "cattle prod",
    "CBT",
    "clover clamps",
    "collar",
    "Corporal Punishment",
    "crop",
    "dominatrix",
    "Facesitting",
    "femdom",
    "Fingering",
    "gag",
    "humiliation",
    "Male Sub",
    "orgasm denial",
    "pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "Smoking",
    "spider gag",
    "straight",
    "suspension",
    "Zapper"
  ],
  "title": "Lonely for your pain: Aiden Starr dominates partner Sebastian Keys"
}