{
  "collections": [
    "Whipped Ass"
  ],
  "description": "On their hands and knees, face to face, locked together at the mouth with one shared ball-gag, Skylar Snow and Kacie Castle wait for their Mistress Mona Wales with their pussy's pressed against big vibrators. Electricity surges through Skylar's bare thighs and Kacie's ponytail tugs at the metal hook in her ass by the rope that attaches the two. Mistress Mona saunters in and greets her two captive babes and places clover clamps on their nipples, attached to each other. She canes both of their asses and Skylar cums hard and squirts all over herself. Mona zaps Kacie's ass while she twerks her pussy on the vibrator and has an ass-quivering orgasm. Mona removes the ball-gag and makes them kiss and spit into each others mouths. Mona steps in-between these two pain sluts and makes Skylar lick her ass while Kacie licks her pussy until she cums. In the next scene, Skylar is on her back with her legs spread with Mona's big black strap-on dildo buried in her pussy. Kacie squats over Skylar's face and gets her pussy licked while Mona holds the strings that attach to zippers running up both sides of their bodies. Skylar has a big squirting orgasm from getting fucked and Kacie cums all over Skylar's face as she gets her pussy licked they both get their zippers ripped off mid orgasm and they scream in pain and in pleasure. Mona has Kacie get on her hands and knees and plunges her big dildo into her pussy while Skylar sticks her thumb in Kacie's ass. Skylar puts on a strap-on and Kacie sits on the dildo, sliding it into her asshole and Mistress Mona slides her's into Kacie's pussy as they fuck her in a hot double-penetration. Mistress Mona ends her session by spreading her legs for her two submissives to lick her asshole and pussy at the same time until she cums hard on both of their faces.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2018-08-02",
  "scene_id": 43539,
  "tags": [
    "Anal",
    "Ass Hook",
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Clothespins",
    "Clover Clamps",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Double Penetration",
    "Electrical Play",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Lingerie",
    "natural boobs",
    "other hair color",
    "Pain",
    "Pussy Eating",
    "Rimming",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "Vibrator",
    "white",
    "Zipper"
  ],
  "title": "Mona's Pair of Perfectly Perverted Pets"
}