{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "Mistress Aiden Starr has decided to fuck her slaves today, but not with her pussy, or even a strap-on, they haven't come close to earning those privileges. No, she is going to use her fucking machines to penetrate their holes. Lena is being so cute, so she gets to go first. Mistress tells her to lube up the Motor Bunny and then lower her eager pussy onto it. She takes the controls and activates the vibration and the rotation. As she turns up the dials Lena's eyes roll back and she begs to cum. Mistress Aiden teases her before finally ordering her to cum. Rocking the dial back and forth she drives her greedy little slut to a series of orgasms. While Lena is cumming Mistress Aiden has Marcelo lube up \"The Piston\". As Lena begs for an orgasm he stuffs an enormous dildo into his eager hole. Mistress takes the controls and gets the dildo pumping in and out of Marcelo's hole. She has Lena turn up the vibration, but warns her not to cum! After finally letting Lena have one more orgasm, she has Marcelo change the dildo in \"The Piston\" and makes Lena beg to get a big, fat cock in her slutty hole. Marcelo squats on the Motor Bunny, taking it's cock deep in his hole as he strokes his own wiener to an erection. As he gets hard Lena takes \"The Piston\" in her juicy pussy. It pounds her with rhythmic precision as he strokes his growing hard-on. Marcelo stares lustily at Lena and strokes his cock as she cums several more times. Then it's time to switch again. Lena gets back on the Motor Bunny as Marcelo gets to experience the fucksaw! His ass quivers as his hole takes a merciless mechanical pounding! Finally Marcelo is spent and Lena is left on the vibrating Motor Bunny as Mistress Aiden goes on with her day.",
  "directors": [],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Lena Starr",
      "person_id": 61369
    },
    {
      "name": "Marcelo",
      "person_id": 46090
    }
  ],
  "release_date": "2018-06-28",
  "scene_id": 43537,
  "tags": [
    "BDSM",
    "Big Natural Tits",
    "Big Toy",
    "Blonde",
    "Curvy",
    "Dildo",
    "Discipline",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Female Slave",
    "Femdom",
    "fucksaw",
    "Latex",
    "Lesbian",
    "LezDom",
    "Lingerie",
    "Machine Dildo",
    "Male Sub",
    "Nylons Stockings",
    "Small Tits",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Slaves on Fucking Machine Orgasm Overload"
}