{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "Dava Foxx has dragged her fat lazy husband Jimmy Broadway down to the gym, where they’ve run into a trio of personal trainers (Robert Axel, Jovan Jordan and Steve Rodgers). As Jimmy plods along on the treadmill, Dava starts working up a sweat with the guys, exercising the cocks of the three studs right in front of her husband. She rides Robert’s rod while sucking and stroking Jovan and Steve, then Steve bangs her from behind as she sucks on Jovan’s meat monster. Robert shows Jimmy how to do curls, then joins in the action with Dava, taking her from behind as she works out the other two cocks in front of her. The trainers’ cocks are growing faster than Jimmy’s muscles, as he is made to watch his beautiful wife “train” with her three studs as he lifts. Jovan fucks her from behind and she jerks and sucks Robert and Steve, all while working a pilates machine. Then Steve gets his turn in her sweet pussy while she continues to suck and stroke. Jimmy finally gets in the game when Dava has him lie down on the massage table. He gets on her hands and knees above him, so he gets a close-up view of Robert fucking her, then she pulls down his shorts to show her studs why she would rather pump their iron. After a while she turns over, giving Jimmy a face full of her luscious ass as Robert stands over him and pounds her. Dava adds a whole new meaning to cross training as she works up quite a sweat with her three muscular trainers! These rock hard studs with their large and bulging cocks rock her sweet pussy as her pathetic husband can only watch on. When they’ve finally had their way with her, she makes her sad little man come over and lick off their protein shake that they sprayed all over her tight sweet body. Only after he’s had his fill does she let him stick his dick into his wife’s hot pussy.",
  "directors": [],
  "models": [
    {
      "name": "Dava Foxx",
      "person_id": 55853
    },
    {
      "name": "Jimmy Broadway",
      "person_id": 19688
    },
    {
      "name": "Jovan Jordan",
      "person_id": 55165
    },
    {
      "name": "Robert Axel",
      "person_id": 35027
    },
    {
      "name": "Steve Rodgers",
      "person_id": 61368
    }
  ],
  "release_date": "2018-06-14",
  "scene_id": 43536,
  "tags": [
    "Athletic",
    "big dick",
    "Black",
    "black hair",
    "body builder",
    "brunet",
    "Brunette",
    "bukkake",
    "Bush",
    "Cuckolding",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Gangbang",
    "Hand Gagging",
    "Handjob",
    "Humiliation",
    "Interracial",
    "mixed",
    "Muscle",
    "muscular",
    "PIV",
    "Rough Sex",
    "shaped",
    "shaved",
    "slim",
    "Spit Roast",
    "Straight",
    "Swallow",
    "switch",
    "Tattoo",
    "Partner Studio",
    "top",
    "Vaginal Penetration",
    "versatile",
    "white"
  ],
  "title": "Cuckold Watches Wife get Gangbanged"
}