{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Girls like Halle Von are just made for being humiliated? spanked, slapped, gag-balled, spit on, whipped, ravaged by fucking machines? whatever. It’s something in the way they look and the way their body language says violate me in every possible way? Even if she wasn’t one of Master Bruno’s BDSM sex slaves, Halle would be getting humiliated in ANY life situation. This scene starts off with Master Bruno slapping and spitting on Halle’s gag-balled face until she’s glazed like a ham. Then he deepthroat fucks her mouth, making her give him a blowjob far beyond her physical capabilities. She is then tied down and flogged on her thighs, pussy and tits until they’re bright red, and her pussy is nice and raw for Bruno’s dildo-on-a-stick. Now, for the rough sex! Bruno pounds Halle’s sex holes in a half dozen positions before shredding her ass with the flogger again, even harder than before. By the time Bruno dumps his big load of cum on her chin and mouth, Halle is a crying, quivering fucked out slut. Total submission!!!",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Halle Von",
      "person_id": 55338
    }
  ],
  "release_date": "2018-06-14",
  "scene_id": 43533,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "Crying",
    "Deepthroat",
    "Dildo",
    "drool",
    "dungeon",
    "Facefucking",
    "Flogging",
    "Gag",
    "gloves",
    "Hair Pulling",
    "Latinx",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "natural boobs",
    "PIV",
    "Rough Sex",
    "shaved",
    "Slapping",
    "slim",
    "Small Tits",
    "Straight",
    "Sub",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Halle Von Sexual Disgrace Spanked Stupid"
}