{
  "collections": [
    "Bound Gods"
  ],
  "description": "With his face covered by a leather hood, a ball gag in his mouth, and completely bound in rope, Tony Orlando is dragged across the floor by Pierce Paris into his lair. They settle under a bright light and Pierce flips Tony over, takes down his jeans, cuts his underwear off, and spanks his ass hard. He flips Tony back over and pulls hard on his balls. He leans in to Tony's squirming feet and takes a deep sniff. He licks and sucks Tony's toes while stroking Tony's cock. Pierce flips Tony back over onto his stomach, grabs a cane and repeatedly canes Tony's ass and the bottoms of his feet. Next we find Tony trapped inside a vertical hanging leather net, suspended and naked with a horse's bit between his teeth. Pierce gets his crop and slaps Tony's body including his cock. Pierce applies safety pins across Tonys torso with a string attached to them all creating a zipper. After flogging him with a thirty pound leather flogger, Pierce rips off the zipper making Tony scream and shiver in pain. In the third and final scene, Tony is fully suspended by rope with his legs spread. Pierce hunkers down next to Tony's asshole and begins stretching it with his leather gloved fingers getting his hole ready for his big fat cock. He starts with one finger and moves up to two and then three. After that, Pierce shoves his big dick into Tony's asshole and pounds it deep, hard, and fast, giving Tony the biggest cock he's ever felt inside his ass. Pierce makes Tony cum hard while getting pounded and Pierce swings Tony around to blow his load all over his face. After glazing Tony's face with his cum, Pierce shoves his dick all the way down Tony's throat and tells him to clean it off.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Pierce Paris",
      "person_id": 56974
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2018-07-05",
  "scene_id": 43541,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "domination",
    "Feet",
    "flogging",
    "gag",
    "gay",
    "Hood",
    "humiliation",
    "leather",
    "Male Sub",
    "master",
    "pain",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "submission",
    "zipper"
  ],
  "title": "Pierce Paris Manhandles Tony Orlando "
}