{
  "collections": [
    "Bound Gods"
  ],
  "description": "New to KinkMen, Nick Fitt is a cute blond fucktoy, ready for whatever heavy hitting that KinkMen and Dallas Steele can dish out. First, Nick is bound with his hands behind his back, as Dallas uses and abuses his body however he pleases. He inspects his toy, front and back, peeling him out of his rubber shorts, sucking his hard cock, and eating and slapping his sweet ass. Nick's puckered hole is so hungry for cock that even a mess of hot wax all over his ass can't stop Nick from begging for it. But before he can get cock inside him he has to prove he's ready for it. He's blindfolded and bound to a web of rope while Dallas flogs him, then plugs him into a fucking machine that opens up that hungry hole. Dallas climbs up on the web of rope and slides his huge hard cock into Nick's throat, making sure he knows what he's getting himself into, and what his ass is in for. Finally, Nick is put into a makeshift rope-sling with his wrists bound above his head and his legs spread wide, so Dallas has easy access to that round, fuckable ass. Dallas pushes into Nick easily as Nick opens wide to take that huge cock. Nick can't contain himself with this big muscled stud on top of him, fucking his ass deep and hard, so he blows his load all over himself. But Dallas isn't done with him yet. He keeps fucking him, slamming his hole again and again until he finally cums. He shoots his load all over Nick, then feeds it to him.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dallas Steele",
      "person_id": 61115
    },
    {
      "name": "Nick Fitt",
      "person_id": 61381
    }
  ],
  "release_date": "2018-07-12",
  "scene_id": 43543,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "domination",
    "gay",
    "hot wax",
    "humiliation",
    "Male Sub",
    "master",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "Stud",
    "submission",
    "Wax Play"
  ],
  "title": "New To KinkMen Nick Fitt Gets Dominated and Fucked by Dallas Steele"
}