{
  "collections": [
    "Men On Edge"
  ],
  "description": "Wesley Woods is gagged and tied up tight against the wall in a dark dungeon. Sebastian Keys and Chance Summerlin mozy in and start teasing him. First they cut his shirt off to reveal his furry sexy chest and wrapped up inside his jeans is an already rock hard cock awaiting the pleasure and torment he is about to receive. They peel off his tight jeans and lick him up and down arousing him more and more. Finally they cut his underwear off and slowly reveal his big dick so ready to be sucked. Chance traces his tongue all over him and finds Wesley is already seeping out pre-cum. Sebastian and Chance jack Wesley's cock and bring him to the edge and he begs to cum. Not yet...They pull away and caress his hot body some more and he is out of his mind shaking and moaning with pleasure. Sebastian slides a tight flesh light onto Wesley's dick up and down expertly teasing him with every move and then Chance sucks his cock and takes him to the edge again. A vibrating head sleeve makes Wesley start shaking, his balls seize up, his eyes roll back in his head and he leaks more pre-cum. He wants to cum so bad but they continue to deny him the satisfaction. Next in Chance's first full suspension his legs are spread wide with his hard dick ready for the taking and Chance and Sebastian continue their kinky tease. Chance sucks him off while and Sebastian licks his sensitive toes and feet. They both caress, suck and lick his cock while Sebastian plays with Wesley's tight asshole and stretches it out. How much of this can he take?! Chance deep-throats his dick while Sebastian slides a but-plug and dildo in and out of Wesley's ass and when its out he begs to put it back in. Chance relentlessly jerks Wesley's cock until he finally slips over the edge and shoots his hot load everywhere.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Wesley Woods",
      "person_id": 59211
    }
  ],
  "release_date": "2018-08-07",
  "scene_id": 43546,
  "tags": [
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "buttplug",
    "Dildo",
    "directorspicks",
    "dungeon",
    "Edging",
    "Feet",
    "Gay",
    "Kinky",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Stud",
    "Suspension",
    "switch",
    "Tattoo",
    "the wall",
    "Tickling",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Wesley Woods gets plugged and edged in full suspension"
}