{
  "collections": [
    "Bound Gods"
  ],
  "description": "BOUND PRISON Part 1: It’s a quiet day on the cell block and bad boy Cliff Jensen is bored. He starts stroking his cock and is rudely interrupted by new guard Michael DelRay. Officer DelRay is fresh out of the academy, ready to throw his weight around, and put Cliff in his place. As they talk, Cliff steals Officer DelRay’s handcuffs, handcuffs him to the cell door, and wrestles his baton away from him. Now Michael is at the mercy of the inmate he’s heard so much about. Cliff grabs some gear from around the prison, ties Michael’s legs open, and puts him in metal stocks. He rips off the officer’s shirt and punches his sensitive stomach. He uses Michael’s belt to beat his thighs and makes Michael sniff his cock before shoving it deep in Michael’s throat. Michael fights to get away, but there’s no where he can go. He takes Cliff’s cock deep, drool leaks from his lips as he chokes on it. Cliff senses Michael’s reluctance and brings out the zapper for some encouragement. Michael yelps around Cliff’s dick as Cliff zaps him all over his torso and arms. Next, Michael is tied on his hands and knees, with rope and a spreader bar holding his legs open. Cliff flogs, spanks, and grabs Michael’s ass. Michael curses Cliff out, struggling as each hit makes his ass redder and redder. Cliff smiles as he breaks out the violet wand touch plate. This tool makes Cliff one big electrode, capable of shocking whatever he touches. Cliff runs his hands over Michael’s backside, causing Michael to twitch in his bonds. Every touch sends a spark of electricity to Michael’s exposed skin. Finally, Michael is gagged and tied on his back with his legs open. Helpless and exposed, he cries out as Cliff pushes his fat cock into Officer Del Ray’s tight ass. Cliff fucks Michael’s ass, stretching it open, as he jerks Michael off. Michael cums hard, shooting cum all over his own face. Then Cliff jacks off on Michael’s face, glazing it with his hot cum. He takes off Michael’s gag and makes him suck his cock clean. Cliff leaves Officer DelRay covered in cum as he goes to look for other implements to use on his new toy. To Be Continued on Men on Edge.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cliff Jensen",
      "person_id": 29792
    },
    {
      "name": "Michael DelRay",
      "person_id": 61138
    }
  ],
  "release_date": "2018-06-28",
  "scene_id": 43540,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Bound Prison",
    "brunet",
    "Choking",
    "Corporal Punishment",
    "Domination",
    "drool",
    "Electrical Play",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Stocks",
    "Submission",
    "top",
    "Violet Wand",
    "white",
    "Zapper"
  ],
  "title": "BOUND PRISON: Bad boy inmate Cliff Jensen breaks in new guard DelRay"
}