{
  "collections": [
    "Men On Edge"
  ],
  "description": "Buck Wright is blindfolded, bondaged, and trapped in a hanging leather cage. His thick cock strains to bust loose from his leather jock strap as he tests his bonds. Soon Dominic Pacifico and Sebastian Keys arrive to torment their leather slave. They kiss and flick his sensitive nipples, and smack his cock and balls. Buck responds to every touch, moaning for more, hypersensitive with his eye sight hindered. Sebastian and Dominic place a vibrating head sleeve on his cock and watch as Buck shakes in his bondage and begs to cum. But every time Buck gets close, they pull away, laughing. Then they put a ball parachute around Buck's balls and hang a leather boot from it. The boot pulls on Buck's balls as Sebastian teases Buck's cock with a cock sleeve. The different sensations on his cock and balls drive Buck crazy and his hips piston in and out of the sleeve as he strives to cum. Next, Buck is on his back with his legs up and hands tied down. A spider gag stretches his perfect mouth open and two closepins pinch his nipples. Dominic runs his tongue along Buck's beautiful feet as Sebastian jerks Buck off and pushes a finger in and out of his tight ass. Once Buck's ass is prepped, Sebastian pushes a vibrating prostate plug in his ass. Buck moans as the plug stimulates his insides and Dominic fucks his mouth. Finally Buck blows his load all over his belly as he chokes on Dominic's monster cock. But Dominic and Sebastian aren't done yet! They continue jerking his sensitive post-orgasmic cock and tickle his feet and armpits as Buck laughs and squirms in his bonds.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Buck Wright",
      "person_id": 61329
    }
  ],
  "release_date": "2018-07-24",
  "scene_id": 43545,
  "tags": [
    "BDSM",
    "Bondage",
    "Boot",
    "Cage",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "jock",
    "Leather",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Slave",
    "spider gag",
    "Tickling"
  ],
  "title": "Buck Wright Quivers on Edge!"
}