{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Victoria Voxxx is desperate to stay with her boyfriend, Donny Sins. But Donny's done with her. She can't fuck or suck, and she'd need some serious training to get her sexual skills up to par. But she begs him not to dump her, so he gives in... on one condition: she's gotta actually have some fun during sex, and get fucked by Donny and all his friends. Victoria dreads being alone on the street so she agrees, and finds herself tied up and used by five dudes at once. She's gotta wrangle five hard cocks, each of them pumping and slamming in her throat, all while her legs are tied up and her arms are bound behind her head. She's tossed onto an ottoman where her legs are pushed open and each of the guys takes turns plowing into her dripping, hungry cunt. Victoria loves every overwhelming moment as she's used like a fuck doll and pounded hard by these huge hard dicks. She's eventually put on her knees, face-down, and fucked from behind in her ass. She begs to cum many times, losing control on one cock after another. Then the dudes slide into both holes at once, giving Victoria her first DP ever! She takes them all like a pro, riding one cock in her slutty pussy while another slams her ass. She cums repeatedly, even pushing cocks out of her she cums so hard. Ultimately she gets her reward. Five hot loads all over her face, shooting in her mouth, and running down her throat. She's left there, used and abused, and soaked in cum!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-08-08",
  "scene_id": 43553,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "First DP",
    "foreskin",
    "Gangbang",
    "Latin",
    "mixed",
    "muscular",
    "natural boobs",
    "Pierced Nipples",
    "Role Play",
    "Rough Sex",
    "Straight",
    "Stud",
    "toned",
    "top",
    "white"
  ],
  "title": "Second Chances: Victoria Voxxx Gets Every Hole Slammed In Her First DP"
}