{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "How awesome would it be to come home and find a beautiful, naked girl upside down on your couch with her wrists strapped to her ankles and wearing nothing but a chain harness, clothespins on her beef curtains and clit, and a big funnel in her mouth? It would be totally fucking awesome! Sabrina Banks is the sex slave in training on the couch, and she's going to be pushed to her limits (and quite a bit further) by the master until a state of total submission is achieved. A rough four finger pussy penetration gets Sabrina squirting like a garden hose in no time, and the cum sprays right into the funnel stuck in her dirty mouth! She gags to swallow it all down, but knows she better, or she?ll pay dearly. The merciless master takes a massive footlong dildo on a stick and penetrates Sabrina?s pussy all the way to the wood. He fucks her fast and furiously with the toy. It looks like he's churning butter in her beaver. Sabrina keeps the orgasms cumming as Bruno switches it up and whips her pussy with a leather riding crop. He then pounds her out good and proper with a big dicked fucking machine. A vibrating wand on her clit sends Sabrina into orbit, so Bruno unleashes his massive load into her hungry whore mouth and calls it a wrap.",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Sabrina Banks",
      "person_id": 55325
    }
  ],
  "release_date": "2018-06-21",
  "scene_id": 43551,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "Breast Abuse",
    "Brunette",
    "Chains",
    "Choking",
    "Clothespins",
    "Crop",
    "Dildo",
    "Facial",
    "Female Slave",
    "Fingering",
    "gloves",
    "Hair Pulling",
    "Latin",
    "Leather",
    "Leather Belt",
    "Leather Cuffs",
    "Machine Dildo",
    "Male Handler",
    "master",
    "natural boobs",
    "PIV",
    "harness",
    "shaved",
    "Slave",
    "Small Tits",
    "Squirting",
    "Straight",
    "Sub",
    "Submission",
    "Swallow",
    "Tattoo",
    "thirdparty",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Sabrina Banks #2 Sexual Disgrace Drowned in Cum"
}