{
  "collections": [
    "CFNMEU"
  ],
  "description": "Mate More is visiting the doctor’s clinic, on crutches. His left ankle is bandaged and he climbs onto the table to have it examined. The female doctor removes the bandage and checks Mate’s ankle, feeling and manipulating it. She has mates stand and undress, to his underwear. His ankle seems to be in reasonable condition as he climbs back onto the table. His leg and ankle are massaged, to increase the bloodflow. As she massages the ankle the girl feels Mate’s hand on her back, which she removes, telling him not to do that. Mate seems very interested in her and chats a little. The girl seems to respond, rubbing his chest, as his crotch seems to swell in his underwear. Her hands dip into Mate’s underwear and then she strips in off. She rubs Mate’s balls and takes hold of his cock. As she wanks the cock it grows in her hand and soon she is sucking it. Mate enjoys the feeling of her hot, wet mouth on his dick. Coming off the cock the girl wanks it hard and then starts to slap it. She reaches and tweaks one of Mate’s nipples too and then starts sucking his cock again. Then she turns her attention to Mate’s ass, making him lift his legs in the air. She spanks that ass as he tries to grope her. Mate’s tight hole is exposed as the girl keeps spanking him, making those butts cheeks red. She hits on his balls too. Then she turns Mate over and shackles him to the table by the wrists and ankles. She also gags him and starts to whip his hot ass. Then she decides that hole needs some action and slips a finger into it. Having loosened it up a little she the pushes a butt plug into Mate’s hole. She fucks that tight hole with the plug, really stretching the lips. pushing hard until it is all the way in. Then she spanks and whips the ass some more while it is still plugged and stretched. Having stretched the hole she removes the plug and uses her fingers, fucking the ass very hard. Next she moves Mate onto his knees, on the floor and, having put on her strap on, makes him suck her rubber dick. It is fucked into Mate’s mouth, as the girl holds him by the hair. Then she fucks Mate’s ass with her rubber cock, slamming it in and out of his hole. Mate takes it well, feeling his ass stretched nicely. Then to finish things off Mate sits on the table as the girl wanks him to a very nice climax.",
  "directors": [],
  "models": [
    {
      "name": "Mate More",
      "person_id": 61361
    },
    {
      "name": "Seksual'nyy Likar",
      "person_id": 61362
    }
  ],
  "release_date": "2018-06-18",
  "scene_id": 43555,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "bit gag",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "buttplug",
    "CBT",
    "Doctor",
    "Femdom",
    "Flogging",
    "foreskin",
    "Hair Pulling",
    "Leather Cuffs",
    "Lingerie",
    "Male Sub",
    "Medical Fetish",
    "natural boobs",
    "Pegging",
    "Role Play",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Partner Studio",
    "Uncircumcised",
    "white"
  ],
  "title": "ER Accident"
}