{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Krissy Lynn is horny at home. As her boyfriend comes down the staircase on his way to work, she stops him, takes his pants down, and starts sucking his cock. Afraid of being late to work, he tells her to stop and puts his dick away. He apologizes and suggests for her to masturbate. When she’s finally alone, Krissy grabs her laptop, gets on the internet and searches for four hung studs to come to her house to fuck her while she’s tied up in rope bondage. Later on, four guys walk in and find Krissy on her knees with her arms and legs tied to the railing, and with a clothespin attached to each nipple. They whip out their hard cocks and close in on her mouth and with a smile on her face she pleases all of their cocks. They fuck her face sending slobber dripping down onto her big perfect tits. Her boyfriend comes home unexpectedly to find her getting face-fucked by four random guys and doesn’t get upset but instead joins in. Next, they get her up to her feet and tie her up in a different position with her standing bent over with her arms behind her back and a rope around her neck. They take turns pounding her pussy from behind while the other guys fill her mouth with cock. Krissy then begs for her ass to be fucked and so they switch holes and fuck her asshole deep and hard. After that, they move Krissy to a white leather couch to fill up all of her holes. In cowgirl, she slides a cock into her pussy while they all line up and fuck her ass and mouth. She can’t believe how good it feels and cums hard while being fucked air tight. They flip her over into reverse cowgirl and double-stuff her again with her legs spread. With five dicks pounding her holes, the insatiable Krissy Lynn begs for more. They all stick their fingers in her pussy and rip out several orgasms and she squirts all over herself just before they all squirt their loads onto her big perky tits.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Krissy Lynn",
      "person_id": 19730
    },
    {
      "name": "Mark Zane",
      "person_id": 55651
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-07-25",
  "scene_id": 43554,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "blond",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Double Penetration",
    "fake boobs",
    "Feet",
    "foreskin",
    "Gangbang",
    "Leather",
    "mixed",
    "muscular",
    "Nipple Torment",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "slim",
    "Spit Roast",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Krissy Lynn Horny at Home Gets Tied Up and Gangbanged"
}