{
  "collections": [
    "CFNMEU"
  ],
  "description": "Martin Porter is such a sexy stud. With his handsome face and manly body he is the epitome of sexy on legs. In this CFNM shoot we find him reading a book as he is joined by a very sexy girl. She wants him to put down his book and have some fun but Martin doesn’t seem so inclined. But eventually he agrees to a massage. He takes off his shirt and jeans and lays, face down on the sofa. The girl straddles him as she takes some oil and begins to massage Martin’s back. She works down the back to Martin’s sexy ass, pulling the underwear down to reveal it. Having massages the ass some, slipping her hands between the thick thighs and touching his balls, she turns Martin over, onto his back. Martin covers his cock as she straddles him again, but she tells him not to be so shy. He moves his hand and his swelling cock is on show as the girl massages his chest. Then she takes hold of the cock and rubs the ever swelling head. That soon has Martin’s cock rock hard as the girl massages his chest some more. Then she moves down his legs so she can lean over and take the cock in her mouth. Her head bobs up and down on Martin’s stiff cock, making his balls nice and tight. Then the girl produces some dildos and tells Martin that she wants to use them on him. She starts by pushing on into his mouth and making him suck it. As he sucks on the dildo Martin wanks his cock. Then the girl has another idea and has Martin turn over, onto his knees. His beautiful hairy ass is then on show, with the cheeks spread to show off the hole. The girl rubs her hands all over that sexy ass and then lubes a dildo and rubs it up and down the ass crack, all over Martin’s hole. More oil is applied to the dildo and Martin’s hole and then the girl begins to push to toy against the hole. The dildo slips past the tight lips and into the ass and begins to gently fuck Martin. It goes in nice and deep, really stretching his tight hole. The girl speeds up the fucking pushing deeper and deeper into Martin’s ass. Then the withdraws the dildo and inspects that hole. She turns Martin over, onto his back, and proceeds to fuck him more, this time with a strap on. Martin wanks his cock as he takes the rubber dick deep in his hole. They move again, with Martin bent over and the girl behind him fucking that ass still. The girl then sits on the sofa so that Martin can ride the rubber cock. He wanks himself hard and fast as he rides up and down. With his cock rock hard it doesn’t take long before his shoots his hot cum as he continues to ride the strap on. His cum flies everywhere. Then he slides off the rubber cock and tells the girl that it was all much more fun than studying.",
  "directors": [],
  "models": [
    {
      "name": "Iris",
      "person_id": 60565
    },
    {
      "name": "Martin Porter",
      "person_id": 61060
    }
  ],
  "release_date": "2018-07-25",
  "scene_id": 43569,
  "tags": [
    "Anal",
    "body builder",
    "brunet",
    "CFNM",
    "Dildo",
    "domestic",
    "Femdom",
    "foreskin",
    "Hairy",
    "Kinky",
    "Male Sub",
    "Muscle",
    "natural boobs",
    "Nylons Stockings",
    "Pegging",
    "Redhead",
    "slim",
    "Straight",
    "Strap On",
    "Stud",
    "Tattoo",
    "Partner Studio",
    "Uncircumcised",
    "white"
  ],
  "title": "Anal Therapy"
}