{
  "collections": [
    "CFNMEU"
  ],
  "description": "Viktor Burek has to attend for his army check up. He walks into the room where the female doctor is waiting to examine him. She tells him to remove his shirt, which Viktor does, showing off his sexy chest. The doctor examines Viktor's chest and then he has to remove his boots and pants. He stands in just his underwear as the doctor continues her examination. Viktor reports a problem with his knee so the doctor takes a look at that. Next she has to examine his cock and balls, so Viktor removes his underwear. He relieves himself into a glass, just a little, which will be sent away to be tested. The the doctor starts to examine Viktor's cock, which gets very hard as she handles it. She takes his termperature through the cock and then has to do the same through his ass. Viktor lays on the table, lifting his legs and the doctor slips a finger into his tight ass. Then two fingers go in, opening it up nicely. She has Viktor turn over onto his knees, and continues to finger his tight hole. With the hole stretched she then takes a dildo and slides that deep inside. It fucks Viktor's ass as the doctor rubs his balls too. She wanks on Viktor's cock between his legs as she continues to play with his hot hole. Viktor tries to caress her hand but she pushes him away. Then he stands up and wants to get close to her, but again she stops him, pushing him away and wanking his cock. Dropping to her knees the doctor then starts sucking on Viktor's throbbing cock. After enjoying his cock she bends him over again and fucks his ass with his strapon. Vitkor moans as he ass gets the rubber dick deep inside, fucking hard. Next he lays on the table, still taking that rubber dick in his hole. He wanks his cock as the doctor fucks him, and then shoots his big creamy load all over himself. Having passed his physical examination Viktor is allowed to leave.",
  "directors": [],
  "models": [
    {
      "name": "Viktor Burek",
      "person_id": 60791
    },
    {
      "name": "Vojenska Pani",
      "person_id": 61366
    }
  ],
  "release_date": "2018-06-20",
  "scene_id": 43565,
  "tags": [
    "Anal",
    "Anal Fingering",
    "black hair",
    "Blowjob",
    "brunet",
    "buttplug",
    "CFNM",
    "Dildo",
    "Doctor",
    "Femdom",
    "foreskin",
    "gloves",
    "Male Sub",
    "Medical Fetish",
    "muscular",
    "natural boobs",
    "Pegging",
    "Piss Play",
    "Piss Play",
    "Role Play",
    "slim",
    "Sounding",
    "Straight",
    "Strap On",
    "thirdparty",
    "Uncircumcised",
    "white"
  ],
  "title": "Army Games"
}