{
  "collections": [
    "CFNMEU"
  ],
  "description": "In Radan Flex's CFNM shoot we find the girl walking through the dungeon, looking to see what is happening. She comes across a hole in the wall, with a hard cock poking through it. She kneels down in front of the cock and starts to stroke it and then she takes it in her mouth as well. Leaning over she licks the tight balls as her multi-coloured fingers are wrapped around the shaft. Suddenly the cock is withdrawn and replaced by a hot ass hole. The girl giggles as she asks if the owner of that sexy ass wants to play. She rubs her fingers over the as and then walks around to find out who it belongs too. She finds Radan Flex, naked and still hard. She takes him to the wooden bench, hanging by chains and lays him on it. The girl feels all over that hot body and then turns Radan over. She takes a whip and starts to whip his back and ass. Then Radan turns over again and the girl sucks on his cock again. But she has other things in mind and shackles his wrists and ankles, with the legs in the air. His hot hole is fully exposed as the girl continue to whip Radan. She then finds a toy and shoves it into his hole, spanking and whipping his ass at the same time. Radan manages to push the toy out of his ass, and is whipped again as a result. Moving him so that he is shackled and bent over the bench the girl then puts on a strapon dick and fucks it deep into Radan's tight hole. He moans as he feels the rubber cock fucking him hard. She works that hole real well with the rubber dick, turning Radan over onto his back. Then she pulls out and makes raning wank himself until he shoots his hot cum for her. To end his humiliation stands over him and releases her fluids on his hot body.",
  "directors": [],
  "models": [
    {
      "name": "Pidzemellya Hospodynya",
      "person_id": 61363
    },
    {
      "name": "Radan Flex",
      "person_id": 61364
    }
  ],
  "release_date": "2018-06-14",
  "scene_id": 43562,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "buttplug",
    "CFNM",
    "Chains",
    "dungeon",
    "Femdom",
    "Flogging",
    "glory hole",
    "Handjob",
    "Humiliation",
    "Leather Cuffs",
    "Lingerie",
    "Male Sub",
    "Mouth Spreader",
    "Nipple Clamps",
    "Pegging",
    "Piss Play",
    "Fluids",
    "Spanking",
    "Straight",
    "Strap On",
    "Stud",
    "Suspension",
    "Tattoo",
    "the wall",
    "thirdparty",
    "Whipping"
  ],
  "title": "Love in Chains"
}