{
  "collections": [
    "CFNMEU"
  ],
  "description": "Alan Carly is one very hot guy, and just perfect to be turned into a personal slave. That is exactly what his girl has in mind as he has him blindfolded, with his wrists shackled over his head. He wears only some see-thru underwear and some more shacles on his ankles. The girl approaches Alan who insists that he wants to be released, but his request is denied. The girl starts to torment him, trying to make him scream, but Alan resists, even when the whip is used on him. She whips his body and tries to make him scream, but still he resists. The girl then takes some clips and applies them to Alan’s nipples. He certainly feels the pain from the clamps and the girl goes further, putting a collar around his neck. Then she pulls down Alan’s underwear and start to slap at his cock and balls, before taking the whip to him again. She pulls the pubic hair too, making Alan squirm and wriggle. Then she has another idea, using clothes pins to attach to his cock and his valls. After that she puts a gag into his mouth as well. As she removes the clothes pins Alan feel the pain with each one. The wrist shackles are removed and Alan is pushed to the ground, where he is made to beg, like a dog. It seems that he is beginning to learn what he will have to do to please his mistress. A dog bowl is presented next with Alan made to drink from it. Then he is told to lay down and he goes down on his elbows, presenting his hot ass. The girl whips the ass and then inspects it closely, rubbing a toy against the hole. After whipping some more she turns the whip round, and shoves the toy end into that hot ass. With his ass full Alan is led around on his leash. He then gets some relief as he is allowed to stand, but is shackled again as the girl starts to suck on his cock. That dick quickly gets very hard indeed as she works on it. But she wont let him cum yet. First she wants to fuck his ass with her strapon and Alan lays on his back as she plows his ass. The rubber cock rams into his hole, working it good before changing position. Alan wanks his cock hard and fast as the dick continues to fuck his hole. He keeps wanking until his shoots his creamy load, with the girl still fucking him.",
  "directors": [],
  "models": [
    {
      "name": "Alan Carly",
      "person_id": 60753
    },
    {
      "name": "Isabella Chrystin",
      "person_id": 60292
    }
  ],
  "release_date": "2018-06-19",
  "scene_id": 43564,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "bit gag",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "CBT",
    "Clothespins",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Femdom",
    "Flogging",
    "foreskin",
    "Gag",
    "High Heels",
    "Leather Cuffs",
    "Male Sub",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pegging",
    "Pet Play",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Partner Studio",
    "Whipping",
    "white"
  ],
  "title": "Personal Slave"
}