{
  "collections": [
    "CFNMEU"
  ],
  "description": "Petr Zuska is a handyman who responds to a call from a hapless young lady with a problem with the faucet in her kitchen. He doesn't seem to be the best of handymen, as he looks under the sink to see how to solve a faulty washer in the faucet. As he works the girl continues with making her breakfast. Petr doesn't work long before stopping for a cigarette break. As he smokes he starts to put the make on the young lady, who appears to rebuff him. But she soon changes her mind and has Petr's tee shirt up, pulling on his nipples. Then his coveralls are down and his cock is on view. The girl fingernails leave red marks on his sexy body and she begins to play with Petr's cock, getting it quite hard. She licks his nipples too and then turns him around so that she can see his ass. She spanks the ass and bends him over, spreading his cheeks to check out his hot hole. She then goes back to playing with his cock before taking a wooden spoon to Petr's ass. He moans as the spoon hits on that sexy ass. Then he stands and turns around so the girl can work on his cock some more. Peter begins to open the girl's blouse, hoping to get her naked too. They trade playful spanks, him on her ass and her on his cock. She then has Petr on his knees, and sits on his back so that she can insert her wooden spoon into his ass. When she has loosened the ass she inserts a vibrator into it, with Petr moaning. She fucks his hot ass with the vibrator before allowing him to stand. Then as he stands she drops to her knees and starts sucking on his cock. She sucks it, getting it good and hard, and she bites on the head too. She puts Petr onto his knees again and then puts on a strapon dildo, which she makes him suck. He gags somewhat on the rubber cock and knows where it is going next. He is bent over and the girl proceeds to fuck him deep with her rubber cock. She moves him to lay across her washing machine and fucks that hot ass some more. Petr moans as he takes it in his ass. When she has enjoyed his ass enough see stands him up and sucks and wanks his cock again. She lets Petr wank it some too. He keeps wanking until he shooots his cum for her, into her mouth.",
  "directors": [],
  "models": [
    {
      "name": "Petr Zuska",
      "person_id": 60766
    },
    {
      "name": "Seksual'nyy Likar",
      "person_id": 61362
    }
  ],
  "release_date": "2018-06-27",
  "scene_id": 43567,
  "tags": [
    "Anal",
    "Blonde",
    "Blowjob",
    "CBT",
    "Deepthroat",
    "Dildo",
    "domestic",
    "Domination",
    "drool",
    "Femdom",
    "Hair Pulling",
    "Male Sub",
    "Paddle",
    "Pegging",
    "Smoking",
    "Spanking",
    "Straight",
    "Strap On",
    "thirdparty",
    "Vibrator"
  ],
  "title": "Handyman"
}