{
  "collections": [
    "CFNMEU"
  ],
  "description": "Paul Belonek is one very hot guy with a really massive cock and a very hot ass. We find him and his girlfriend out, enjoying the weather and walking over Charles Bridge. When they get home Paul flops down on the bed to relax with his tablet. With his girlfriend outside Paul watches some porn, and starts wanking himself. But the girl returns and finds him watching gay porn as he wanks. She decides to find out if he is gay, and does this by wanking on Paul's cock and then licking his balls before starting to suck him. It seems that she cant get him hard and makes him turn over, slapping him until he does. The girl spanks Paul's ass and gets him naked, apart from his socks. She is going to show him, she says, and makes him get onto his knees so she can spread his ass and check his hole. She fingers Paul's hole and plays with his heavy balls. The she takes a dildo and pushes that into Paul's ass, fucking it in nice and deep. When she turns him over she finds that his huge cock in nice and hard. She wanks on that cock and sucks it. Then Paul's legs are pulled into the air to expose his hole again and the girl shoves her fingers inside, stretching it wide. The dildo goes in again and fucks that hot ass. She sucks Paul some more and then puts on a strap-on cock, making Paul suck it. Then he is on his knees once more and the girl shoves her rubber cock deep into his ass fucking him deep. Paul moans as he takes it but the girl keeps fucking. She turns him into missionary position and makes him wank himself as she fucks. He soon shoots his hot cream all over himself as the girl keeps working the rubber cock deep into his hole. Then she pulls out and tells Paul he will see more of the strapon later.",
  "directors": [],
  "models": [
    {
      "name": "Paul Belonek",
      "person_id": 61059
    },
    {
      "name": "Pomstychtiva Pritelkyne",
      "person_id": 61365
    }
  ],
  "release_date": "2018-06-15",
  "scene_id": 43563,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "Blowjob",
    "brunet",
    "Brunette",
    "Dildo",
    "Femdom",
    "foreskin",
    "High Heels",
    "Male Sub",
    "natural boobs",
    "Pegging",
    "Slapping",
    "slim",
    "Straight",
    "Strap On",
    "Tattoo",
    "thirdparty",
    "white"
  ],
  "title": "Embarrassing Situation"
}