{
  "collections": [
    "Everything Butt"
  ],
  "description": "AJ Applegate and Kristina Rose are two stepsisters now living under one roof. As they pass each other in their kitchen, AJ can't help but grab Kristina's big beautiful ass that sticks halfway out of her white denim booty shorts. Kristina likes it but isn't sure if she should be hooking up with her new stepsister. They both decide that it wont be weird and go at it. AJ pulls off Kristina's shorts and buries her face deep inside Kristina's ass and licks her hole. AJ tells her to get onto the metal countertop. Kristina gets on her hands and knees with her ass in the air and AJ sticks four fingers in Kristina's asshole. AJ tongues her ass again and has Kristina get on her back and spreads her legs. AJ slides a big purple butt-plug in and out of Kristina's asshole. After that, AJ shoves a giant black dildo into Kristina's ass and fucks her with it as Kristina smashes a vibrator against her pussy and has a screaming orgasm. In the next scene, AJ is wearing a strap-on with a huge dildo attached. AJ bends Kristina over a leather chair and slowly slides her massive dildo into Kristina's asshole and fucks it slowly and sensually making Kristina scream in pleasure. Kristina sits on the dildo in reverse cowgirl and bounces up and down on it, fucking herself with it deep and hard. Its AJ's turn and so she strips off the strap on and climbs onto the chair and Kristina licks AJ's asshole. Kristina grabs a metal toy and pops it in and out of AJ's asshole. After that, Kristina fucks AJ's ass with a glass butt-plug while AJ uses the vibrator on her own pussy and cums hard. In the final scene, Kristina squats over a large, ribbed, cone-shaped butt-plug. She takes it up her ass, bouncing up and down on it while AJ keeps the vibrator on Kristina's clit and dirty-talks her to an intense anal orgasm.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "AJ Applegate",
      "person_id": 45997
    },
    {
      "name": "Kristina Rose",
      "person_id": 20560
    }
  ],
  "release_date": "2018-08-10",
  "scene_id": 43575,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Ass",
    "Blonde",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Hitachi",
    "Latin",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Tattoo",
    "the chair",
    "Vibrator",
    "white"
  ],
  "title": "Anal Stepsisters: Kristina Rose and AJ Applegate"
}