{
  "collections": [
    "Everything Butt"
  ],
  "description": "The stunning and fierce Sovereign Syre just wants to have a relaxing afternoon by her luxurious pool. However, the new help, natural busty college coed Penny Pax just did not get the memo on proper service attire. Dressed in her hippy thrift store clothes, the red headed Penny just doesn't get it. Sovereign demands Penny to strip down to her proper uniform. A tight string bikini. Sovereign knows she will need to train this new house servant and knows just the way to do it. Dragging Penny by the hair into the house, Sovereign begins to teach Penny some respect. First with her beautiful feet. Syre presents Penny her feet in black high heels. Penny Pax removes the shoes to reveal the perfect arches of Syre's bare feet. Penny licks and worships Sovereign's feet and toes. Licking between each one pleases her mistress. Next Penny must learn to worship her Mistress's asshole. Syre turns over and reveals a jeweled butt plug. Penny licks around this toy and pulls it out, then begins to lick and smell and worship Syre's perfect tight hole. Tongue fucking is just the beginning before Sovereign pulls out a glass dildo for Penny to use on her ass. With the dildo fully inserted Penny begins to service Sovereign's other hole with lesbian pussy licking. This gets Syre to scream with orgasm. Now it's time to torment Penny's ass. Flipped over, Sovereign begins to slap Penny's white ass RED. Then shoves her fingers in Penny's asshole to stretch it out. Fully stretched she starts with a pink cock and rams it in and out of Penny's gaping asshole. Then Sovereign straps on her cock and has Penny deep throat gag on it while fingering her own asshole. Ready for a deep anal fucking, Penny takes Sovereign's huge cock all the way. This gets Penny to scream with orgasms. To finish off the training Penny is taken to the shower for a full anal enema. Filled fully and begging to stop, Sovereign pulls out the enema and receives an anal water foot cleansing. This fully pleases her Mistress.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Sovereign Syre",
      "person_id": 44486
    }
  ],
  "release_date": "2018-08-24",
  "scene_id": 43576,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Blonde",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Enema",
    "Feet",
    "Fingering",
    "Gag",
    "Gaping",
    "High Heels",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaved",
    "Straight",
    "Strap On",
    "switch",
    "white"
  ],
  "title": "Lesbian Anal Pool Service: Sovereign Syre Trains Penny Pax's Ass"
}