{
  "collections": [
    "Everything Butt"
  ],
  "description": "Blonde pool babe crush Zoey Monroe is your perfect anal wet dream. In her tight skimpy pink and black bikini she just lounges around the pool in the hot sun working on her golden tan. Who is she dreaming about behind those reflective heart glasses. Could it be her roommate Mandy Muse. This perky brunette anal slut has been crushing hard on her roommate for years. All she can ever think about is Zoey's round butt. But will this pale beauty ever catch her roommate's attention? Luckily Zoey gets the party started and strips Mandy out of her pathetic sweat pants and puts her in a cute bikini before diving in on a makeout sesh by the pool. This gets hot and heavy fast and the makeout goes right to anal rimming. Mandy has a cute tight butthole that Zoey fucks hard and deep with her tongue. The two stunners go inside where Zoey has her anal toys ready. First up Zoey shoves a glass dildo right up Mandy's butthole which gets her screaming with orgasms. Her butthole is getting stretched out nicely by a metal dildo which makes room for the next big toy for her to ride. Now it's Zoey's turn. Her perfect puffy pink butthole is ready for anal stretching and Mandy knows just how to get her roommate gaping wide. Her perfect pink butthole is ready and hungry for the next big dildo she sits on and fucks. Both girls take turns fucking each other's loose and hungry assholes. Zoey wants a closer look and she pulls out her speculum and opens Mandy's ass wide open for her to see. This get's both girls wild and ready for hitachi orgasms. Finally they two go upstairs and put on giant cock strapons. Both girls take turns deep throating and gagging on each other's strap on cocks. Mandy gets rammed first and this gets her gaping wide open. Next Zoey gets fucked deep and hard anally which gets her squirting and soaking Mandy. Zoey squirts and gapes and prolapses over and over and over again on Mandy's big strap-on cock!",
  "directors": [],
  "models": [
    {
      "name": "Mandy Muse",
      "person_id": 54180
    },
    {
      "name": "Zoey Monroe",
      "person_id": 46520
    }
  ],
  "release_date": "2018-07-27",
  "scene_id": 43573,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Big Toy",
    "Blonde",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "Rimming",
    "Speculum",
    "Squirting",
    "Straight",
    "Strap On"
  ],
  "title": "Anal Roommates: Mandy Muse Has A Deep Anal Crush On Zoey Monroe"
}