{
  "collections": [
    "Everything Butt"
  ],
  "description": "Whitney Wright is late on her rent again. Laying around the pool is her two roommates, fully nude and caressing each other. The stunning and dominant Casey Calvert is having her way with the cute and perky young Miranda Miller. What excuse does Whitney have this time for not having the money. Casey offers up an all anal alternative to this dilemma. Will Whitney give up her cute perky bubble butt to make rent? Inside the house Casey shows her two girls the huge collection of butt toys. After some deep lesbian rimming, the glass dildo comes out to start stretching open Whitney's tight asshole. Miranda wants her turn too and gets her ass filled and gaping with toys. Next the two girls have a turn stretching and gaping Casey Calvert with a butt plug. Finally with the hitachi out all the girls have deep anal orgasms. Miranda really wants to prove her worth to the household and takes a speculum in her ass for the first time. This stretches her cute butt wide open and gapes for all the girls. Whitney bounces her big booty on a huge dildo and rides it right to orgasm. Finally Casey shows both girls who is the boss anal bitch and takes a fist up her ass followed by two huge metal balls. Rent is paid in full this month!",
  "directors": [],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Miranda Miller",
      "person_id": 58770
    },
    {
      "name": "Whitney Wright",
      "person_id": 61018
    }
  ],
  "release_date": "2018-09-21",
  "scene_id": 43578,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "black hair",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Rimming",
    "shaved",
    "slim",
    "Speculum",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Casey Calvert Demands Anal Payment From Submissive Roommates"
}