{
  "collections": [
    "Everything Butt"
  ],
  "description": "Dana DeArmond is a fierce boss bitch and she runs a strict anal modeling agency. Dressed in a tight black dress and high heels, she demands loyalty and respect from her obedient employees. Her ASSistant, the curvy natural beauty Maddy O'Reilly know exactly how to serve her boss. She will do anything to kiss Dana's perfect ass. The new girl, petite anal newbie Vienna Black, is looking to work in the industry and needs to land this job. Her showing up late to the interview gets Dana worked up and ready to deliver a brutal punishment to her new intern. Starting with rimming, Vienna is made to use her long tongue to fuck Dana's asshole wet. Maddy then brings out the metal dildo to pop Dana's asshole right gaping open. Eager to please, Maddy is next inline for the metal dildo to show Vienna how it's done. Maddy cums hard right away from the anal fucking and it's now time for Vienna to get to work. Stuffed with a butt plug, Vienna's face is bound with a strap on dildo to fuck her new boss. Vienna has a front row view of her bosses perfect gaping asshole as she is made to fuck Dana deep. Maddy is again eager to show off and cum for her boss and she takes the first fist before both girls are stacked ass to ass ready for the bosses huge strap on cock. Both the girls get their asses rammed which causes Maddy to scream with body shaking orgasms. Looks like Dana found the perfect assistant for Maddy.",
  "directors": [],
  "models": [
    {
      "name": "Vienna Black ",
      "person_id": 60681
    },
    {
      "name": "Maddy O'Reilly",
      "person_id": 41042
    },
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    }
  ],
  "release_date": "2018-07-13",
  "scene_id": 43574,
  "tags": [
    "anal",
    "anal fingering",
    "Anal Fisting",
    "anal stretching",
    "Brutal Punishment",
    "buttplug",
    "curvy",
    "dildo",
    "dominatrix",
    "gaping",
    "high heels",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Petite",
    "rimming",
    "straight",
    "strap on"
  ],
  "title": "Dana DeArmond's Anal Agency: Boss Bitch Trains Anal Newbie"
}