{
  "collections": [
    "CFNMEU"
  ],
  "description": "Laco Meido has attended the doctor’s office for a check up. He answers a few questions, reporting that he has a sore throat. The pretty doctor begins to examine him, telling him to remove his tee shirt. Having listened to his chest, through the stethoscope she tells Laco that he has some back issues. Following instructions Laco stands and bends over, for his back to be checked. Then the doctor tells him to strip so that she can massage him. He lays on the table, wearing just his underwear and the doctor gets to work on his back. As she works on the back she lowers Laco’s underwear to massage his sexy ass too. Then she massages his legs and tells him to turn over. Laco’s cock seems to be growing in his underwear, but the doctor ignores that, at least for the moment. She massages his chest and arms. Then after working on the legs she starts to massage Laco’s groin, her hands slipping into the underwear. She releases his cock, which is rock hard, and continues to work on his groijn. She also rubs his cock, coating it with oil. Then the underwear is fully removed and the doctor wanks on Laco’s rock hard cock. Laco stands and moves to the examination chair, with his cock pointing skywards. He sits on the chair with his legs in the stirrups which exposes his sexy ass. The doctor inserts a vibrator into Laco’s ass and wanks on his cock. Telling him that she has another surprise for him she hands Laco a different vibrator. Then as he wanks his throbbing cock the doctor slides the vibrator in and out of his tight ass. She then takes a big, thick, dildo and pushes it into Laco’s mouth as he wanks his cock. She makes him suck and lick the dildo before she works it into his ass. Laco moans as the thick toy stretches his ass, but he keeps wanking on his hard cock. Turning over onto his knees he keeps wanking his dick as the doctor plunges the dildo deep into his ass. Then she changes it for a different one. Laco keeps moaning as his hole is invaded, and he keeps up his wanking too. The doctor has more surprises and she dons a strap on cock and starts to fuck Laco’s hole with it. She moves him into missionary position and keeps fucking his ass as he wanks hard and fast. With the rubber cock deep in his ass Laco wanks even harder and shoots his hot cum right up his chest. The doctor then instructs Laco to return the next day, for a further check up.",
  "directors": [],
  "models": [
    {
      "name": "Doktora Bolestiapoteseni",
      "person_id": 61377
    },
    {
      "name": "Laco Meido",
      "person_id": 61376
    }
  ],
  "release_date": "2018-08-08",
  "scene_id": 43570,
  "tags": [
    "Anal",
    "Athletic",
    "black hair",
    "brunet",
    "Dildo",
    "Doctor",
    "Edging",
    "Femdom",
    "Fetish",
    "foreskin",
    "Handjob",
    "Male Sub",
    "masturbation",
    "Medical Fetish",
    "natural boobs",
    "Pegging",
    "Role Play",
    "slim",
    "slink",
    "Straight",
    "Strap On",
    "the chair",
    "Partner Studio",
    "Uncircumcised",
    "Vibrator",
    "white"
  ],
  "title": "Broken Back"
}