{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The House once again finds itself packed wall to wall with beautiful kinky swingers, but this time instead of a senior submissive to train the new meat, we have two pieces of untrained, but enthusiastic ass. Interviewed about their skills and how they plan to get their training, one claims to be a blond electro slut with a wet mouth for fucking, and the other an out and out anal whore, willing to give up all her holes for the chance to train and learn The Upper Floor Rules.\nLucky for both girls, previous servants of the house are in attendance, and unfortunately for them they only want to humiliate the girls and make them lick their high heels. It becomes clear after some goveling and oral shoe shining, the new girls will have to battle for the right to the training collar with a show of submissive fucking, bondage, and a sadistic gauntlet in their areas of speciality.\nThe first scene finds Kendra Spade with her big round ass tied up in the air, her cunt clipped shut, and her submissive sister in the hardwood stocks. Riley Reyes has claimed to be a real servant of electrical torment, so Aiden Starr threw her right into the stocks, stuffed a huge electro plug in her cunt and tied it there for good measure. As Ramon sets in on Kendra's gorgeous ass, gaping her hole and denying her pleads to cum, Aiden slowly stalks Riley, turning the electro plug up more and more and Stefanos stuffs a hitachi against her trapped clit, causing her to squirt all over herself and scream around the hard cock in her mouth. Riley's gorgeous pale nipples are clamped heavily, but not as heavily as Kendra is getting her ass pounded out. The crowd of horny swingers urge them to with cheers, and head off into the darkness to make their own mischief. Partner swapping, blow bangs, tight rope suspensions, floggings, spankings, and fucking on the floor is just some of the extra action du jour.\nAiden Starr finds Riley amidst all the sexual madness and promises her the collar if she will just perform Aiden a few small favors. One of those not so small favors is Aiden's fist in Riley's pretty pink pussy, which she presents willingly to Aiden. Aiden teaches her to beg and what to scream when she cumming uncontrollably. She is made to shock herself on command, take a beating on her milky white tits, and finally lick her mistresses perfect pussy until she cums all over Riley's face. Alas, Riley is tricked into disobeying a small rule, denying her the collar and leaving her to pout with the Governess' taste still on her lips.\nBella Rossi has come back as a guest for the night and brought her handsome date Dozer, who is quick to lay Bella down and flog, spank, and command her to shake her beautiful ass. Next order of business it those celestial tits we all worship, being used for a long and submissive titty fucking. Bella is all worked up, and gags and drools on Dozer's cock until she given permission to slip his hard cock into her wet pussy, working him with all of her moves until her rewards her with a hot load all over her pretty face and glistening tits. Welcome back Ms. Rossi, we missed you!",
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Kendra Spade",
      "person_id": 60694
    },
    {
      "name": "Riley Reyes",
      "person_id": 55057
    }
  ],
  "release_date": "2018-06-15",
  "scene_id": 43571,
  "tags": [
    "bdsm",
    "bondage",
    "collar",
    "Corporal Punishment",
    "discipline",
    "electro plug",
    "female slave",
    "gaping",
    "high heels",
    "Hitachi",
    "humiliation",
    "kinky",
    "master",
    "oral sex",
    "orgy",
    "role play",
    "rope bondage",
    "Rough Sex",
    "stocks",
    "straight",
    "swingers",
    "threesome",
    "titty fucking"
  ],
  "title": "Drooling Electro Slut & The Anal Whore Serve a BDSM Orgy"
}