{
  "collections": [
    "Everything Butt"
  ],
  "description": "Everyone knows California neighbors do anal! Everyone except for Christie Stevens. Fresh from middle of the country, Christie is shocked to find her neighbor Chloe Cherry stripping in her backyard. Christie rushes over to let Chloe know that everyone walking by can see her, but Chloe isn’t bothered. She’s a California girl through and through, and she’s excited to show her hot new neighbor how they do it in California. She helps Christie out of her dress and leads her inside for an introduction to California anal! Inside, Christie wiggles out of her panties and spreads her legs, revealing her perfect pink pussy. Chloe can’t wait to get her mouth on a fresh pussy. As she licks Christie’s pussy, she slowly slides her fingers into Christie’s tight asshole. Christie moans as Chloe’s tongue and fingers work their magic. Chloe pushes a plug in Christie’s ass and then it’s Christie’s turn to return the favor. She tastes her first California pussy and teases her new neighbor’s ass with a plug. All this foreplay has Christie hooked. Seeing all Chloe’s toys, she asks if they can try other toys and Chloe is more than happy to share. She spreads Christie’s cheeks and watches as her neighbor’s ass swallows a fat glass plug. Once the plug is in, Chloe licks the opening of Christie’s tight hole as it clenches down around the plug. These two hot babes take turns cumming on a variety of plugs as they tease each other. Next, Christie sets her sights on bigger toys. She pushes a fat black dildo into Chloe’s ass and fucks her to orgasm. Chloe moans as her neighbor fucks her tight ass. She then puts another anal toy on the floor and bounces on it as Christie tells her what an anal whore she is for splitting her asshole open for her new neighbor. Then it’s Christie’s turn to get fucked. Chloe fucks Christie’s ass with a fat cock. Christie cums hard as Chloe fucks her relentlessly. Finally, Chloe gets Christie to fill her ass with as much of her hand as she can fit. Christie gets most of her fist in and works it in and out of Chloe’s tight ass as Chloe cums over and over again.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Christie Stevens",
      "person_id": 44270
    }
  ],
  "release_date": "2018-09-07",
  "scene_id": 43577,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "Blonde",
    "bottom",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaved",
    "slim",
    "Straight",
    "toned",
    "white"
  ],
  "title": "California Neighbors Do Anal!"
}