{
  "collections": [
    "The Upper Floor"
  ],
  "description": "In part two of our untrained submissive slut gauntlet, Riley Reyes is tied tightly with her perfect round ass straining against rope, her pussy ready to be fucked and her pale body vulnerable to the cattle prod held by Governess Aiden Starr. Kendra Spade has her 19 year old body latched down to a sybian, her feet raised up so she can't get her sensitive young clit away from the machine, her perfect tits swinging with 3 pairs of tight metal clamps. The crowd of BDSM swinger has gathered to see what will happen when Riley is given one rule, and Kendra tasked to learn three. The catch is that Riley is taught the first rule, no cumming without permission, and will have the cattle prod raked over her creamy skin every time Kendra steals an orgasm. With Stefanos teaching her the rules and pushing her nubile body down on the sybian, causing her to cum uncontrollably and Riley to be shocked over and over again by Aiden while Ramon delivers a savage fucking. By the end both girls are spent, but know the Rules Of The House.\nRamon finds Kendra resting in a perfect submissive stance and decides to play with her using the much sought after collar as leverage. Placing the leather on his hard cock, he teases Kendra into crawling after him into the dark recesses of the party, where she degrades herself sucking dick, licking up drool, and begging party goers to cum while being fucked in the ass. When offered the chance to win the collar if she can just hold her orgasms, 19 year old Kendra shows her age, unable to hold it and anal orgasming without restraint. Humiliated, she is made to hold her cheeks open and show her gaping asshole to everyone as the party.\nMeanwhile, the entire party has begun to go off, with special guests Sahara Rain and her boy toy switching and fucking all over the place. Swingers exchange partners, enjoy bisexual blow bangs, and spankings. A femme fatale rope top spins her sub in an inverted suspension, and the fucking machines get quite the workout.\nThe final scene is a showdown for the collar. Both submissive sluts have learned the rules, been thoroughly fucked, humiliated, beaten, shocked, clamped, and held their positions. It will have to come down to an orgasm off, where a no holds bar race to use up their pussies and objectify them as little cum machines in tight rope and leather bondage. Everyone gathers to laugh and cheer as Stefanos, Ramon, and Aiden beat their clits with crops, gape their pussies, fist, sit on faces, and eventually drop hot cum on their gorgeous faces. Once the final cum count is tallied, who shall receive the collar?",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Kendra Spade",
      "person_id": 60694
    },
    {
      "name": "Riley Reyes",
      "person_id": 55057
    },
    {
      "name": "Aiden Starr",
      "person_id": 11489
    }
  ],
  "release_date": "2018-07-13",
  "scene_id": 43572,
  "tags": [
    "19 year old",
    "bdsm",
    "Bisexual",
    "bondage",
    "cattle prod",
    "collar",
    "Corporal Punishment",
    "discipline",
    "drool",
    "Feet",
    "female slave",
    "gape",
    "Gaping",
    "humiliation",
    "leather",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "suspension",
    "swingers",
    "sybian",
    "threesome"
  ],
  "title": "Uncollared Anal Cum Sluts Serve Swingers Ball "
}