{
  "collections": [
    "Everything Butt"
  ],
  "description": "Lisey Sweet has a stunning body. From her blonde hair down to her thick juicy ass and thighs. This girl is banging and her boyfriend knows it, but she has a little problem. Her man is going to dump her if she can't get bigger toys in her tight ass. So she does what any good partner will do and finds a professional to train her butthole. Showing up in a creepy dark alley wearing the highest booty shorts she meets her new mistress. Kira Noir is dressed in tight latex and ready to anally train her new pet. First she gets handfuls of Lisey's perfect ass and spanks it red. Next she puts Lisey in a head cage fully nude with her ass exposed and ready for torment. She takes a hard beating with the flogger all while wearing a jeweled butt plug. Finally her ass is ready for more. Next up is a giant black dildo. This thing is huge and gets Lisey screaming with orgasm. After gaping over and over, Lisey floods the room with a huge squirting orgasm! Welcome to Lake Lisey! Next the real training begins and Kira brings out the speculum. After cranking it wide open she gets a full view of everything inside Lisey's perfect pink asshole. Now it's time for Lisey to return the favor and learn how to appreciate a tight hole. Kira gets fully naked and rides Lisey's strap on. She gets fucked deep and hard in her ass over and over again. Finally she takes orgasm after orgasm from her little anal slut pet. Who needs a loser boyfriend anyway!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Lisey Sweet",
      "person_id": 60674
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    }
  ],
  "release_date": "2018-10-05",
  "scene_id": 43579,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Ass",
    "Blonde",
    "buttplug",
    "Cage",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Gaping",
    "Latex",
    "Lesbian",
    "LezDom",
    "Speculum",
    "Squirting",
    "Straight",
    "Strap On"
  ],
  "title": "Anal Dungeon: Lisey Sweet's Big Ass Gets Worked by Mistress Kira Noir"
}