{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Left naked and alone at home with her tits in rope bondage, the beautiful blonde Zoey Monroe is having trouble cleaning her house with her wrists tied to her hips. She has to get everything tidied before her man gets home. As she struggles to take the dishes out of the dishwasher her boyfriend comes home with four of his friends, dissatisfied and embarrassed. To make it up to him, Zoey gets on her knees and offers to services his and his friend's cocks. She eagerly sucks all their dicks and they fuck the back of her throat until she's drooling with spit. Next, Zoey is placed on her back on a black leather pad with her legs spread wide, exposing her pussy and ass. Her arms are bound to her legs with rope as she waits to get her pussy fucked by five different cocks. They come in the room and one at a time, they take turns fucking her pretty pussy while she sucks the other guy's cocks. They pound her pussy deep and hard and she squirts all over the guys and squirts on herself. Zoey then wants to get her ass fucked and so the guys oblige and slide their cocks in her ass and pound it deep and hard. Next, she wants to be fucked by two dicks at once and so they double-penetrate her in doggie-style, fucking her pussy and ass simultaneously. She moans in pleasure with a mouthful of cocks as she's fucked in all of her holes, air tight. They flip her over and double penetrate Zoey's pink pussy and stretched ass once again in reverse cowgirl. They fuck her even harder until they all empty their loads across Zoeys pretty tits and smiling face, leaving her glazed in their cum.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Cyrus King",
      "person_id": 60686
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Mark Zane",
      "person_id": 55651
    },
    {
      "name": "Zoey Monroe",
      "person_id": 46520
    }
  ],
  "release_date": "2018-08-22",
  "scene_id": 43582,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Handjob",
    "Leather",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Spit Roast",
    "Squirting",
    "Straight",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "Zoey Monroe, Wrapped in Rope and Fucked by Five Cocks"
}