{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "The night before Chloe Cherry gets married to the man of her dreams, as she drifts off to sleep, her anxiety brings forth a dream. She wakes up already in her wedding dress, lying on her back, on top of a bed that’s not hers. Suddenly she’s surrounded by five of her fiance’s best friends in semi-formal clothing. They reach out to her and start grabbing and groping her body. They pull her little perky tits out of her dress and slap them with their hard dicks while the others lift up her skirt, pulling aside her pink panties. With a big dick to the left and to the right of her face, Chloe goes back and forth deep throating their dicks as they face fuck her, leaving her covered in her own drool. In the next part of the dream, Chloe finds herself suddenly on her knees, trapped in rope bondage tied on top of her wedding dress. A torn piece of white tulle from her dress wraps around her eyes as a blindfold. All five guys surround her once more with their big dicks and take turns inside her mouth. She blindly jerks and sucks their cocks, giving them all deep throated sloppy blowjobs. After that they take the blindfold off and set her back on the bed with one leg frog-tied with rope. They spread her legs and one by one fuck her pussy deep and hard. While her pussy gets pounded , she sucks the other’s cocks and they switch to fucking her ass. They stretch out her ass with their big dicks and go back and forth from her pussy to her ass. After that Chloe is completely naked, riding reverse cowgirl with a giant cock in her ass. Another giant cock approaches her pussy and slowly slides inside. Chloe gets double stuffed with two big cocks and fucked hard until she cums. They turn Chloe around to double penetrate her in a different position and fuck her air tight with a dick in her pussy, ass, and mouth ultimately resulting in a climax where her face gets covered in everyones’s huge loads.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Apollo Knight",
      "person_id": 61564
    },
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Dillon Cox",
      "person_id": 61545
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Mark Zane",
      "person_id": 55651
    }
  ],
  "release_date": "2018-10-31",
  "scene_id": 43586,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blindfold",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Double Penetration",
    "drool",
    "foreskin",
    "Gangbang",
    "Latinx",
    "mixed",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "slim",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Wedding Nightmare: Chloe Cherry Gets Fucked by Fiance's Five Friends"
}