{
  "collections": [
    "Everything Butt"
  ],
  "description": "Dana DeArmond knows her young stepmom Marica Hase is cheating on her dad and no way is she going to let Marica get away with it! She confronts Marica and threatens to show her dad evidence of Marica's cock hungry ways unless Marica does everything she says. Marica is scared at first, but she can't help but get wet at the way Dana is treating her. Dana womanhandles her over a desk, pulls her skirt down, and spanks her ass! She makes Marica strip before smelling her asshole and stretching it open with her fingers. Marica moans as Dana pushes a clear dildo in and out of her asshole. After an intense warm-up, Dana uses a clear plug to look inside Marica's perfectly pink ass. She fucks Marica with another plug as Marica pushes back on it, motioning Dana to fuck her harder. Dana is beginning to see why so many people want to fuck her step-mom! She's a huge anal whore. Dana slips four of her fingers into Marica's asshole and fucks Marica to orgasm after orgasm. Next, she straps on a super fat strap-on cock and plows Marica open. Marica is humiliated, she loves being Dana's anal bitch. She sucks Dana's cock clean before Dana sticks it her in ass again! Seeing Marica's ass open up gets Dana hot. She pushes Marica's hand into her ass and tells Marica to make her cum! Marica fistfucks Dana's asshole until Dana cums all over Marica's hand. Both ladies lick Marica's hand clean, agreeing not to tell Dana's dad.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Marica Hase",
      "person_id": 44408
    }
  ],
  "release_date": "2018-10-19",
  "scene_id": 43580,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Asian",
    "black hair",
    "bottom",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Petite",
    "shaved",
    "slim",
    "Straight",
    "toned",
    "white"
  ],
  "title": "Dana DeArmond blackmails her Stepmom Marica Hase!"
}