{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Juan Lucho and his boys next door take time out of their summer bbq to check on their neighbor the adorable and petite Kacie Castle. This tiny little anal slut is fully naked and showering when they arrive to run her through every bound position. The gang circles her as she takes on all their hard and hung cocks. Deep throat gagging and sloppy cock sucking gets this wild girl ready for more. They have to tie her up and bound her hands on their cocks but she still manages to swallow all their meat swords. Eddie Jaye suggests that why don't they just fuck this bitch and that gets the party started even harder. They each take turns spit roasting this tiny brunette before she screams to stick it in her ass. This girl knows what she wants and she wants hard hung thick cocks in her asshole. Juan Lucho slaps her face and ass which gets her squirting with orgasm. This girl needs more and the gang obliges with double penetration and deep throat cock sucking. She is filled in every hole and her screams are muffled with cock and gagging with spit. Finally she begs for cum in her slutty pussy and all over her face. The boys fill up her loose pussy with cum creampie and then cover and drench her face with their hot thick loads before returning to their leisurely summer bbq.",
  "directors": [],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "Mark Zane",
      "person_id": 55651
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-10-03",
  "scene_id": 43584,
  "tags": [
    "Anal",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Creampie",
    "Double Penetration",
    "Gangbang",
    "Petite",
    "Role Play",
    "Rough Sex",
    "Squirting",
    "Straight",
    "Swallow"
  ],
  "title": "Anal Slut Kacie Castle Gang Fucked & Bound by Voracious Neighbors"
}