{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Cute girl next door Jay Taylor is chilling at home when she hears a loud knock at the door. She opens the door to find a flustered Zachary Wild who needs help reaching his friends and their tow truck. She invites him in to use her phone and wait for his buddies. When his friends arrive, they are immediately distracted by Jay's gorgeous tits. They pull up her top to kiss, lick, and smack her full breasts. Soon, Jay finds herself on her knees with cock in her mouth! This slut couldn't be happier as she licks, sucks, and strokes the five fat cocks surrounding her. These boys strip her, put her in metal bondage, bend her over the table start plowing her pussy. Jay moans as each cock stretches open her hungry horny cunt open. They spank her perfect ass as she moans around the cock in her mouth. She loves getting filled and fucked by dick so much, she cums over and over again while getting fucked. Next, Jay is bound in rope. She gets stuffed full of more cock as these boys manhandle her into all sorts of positions. Jay continues cumming all over their cocks as her ass gets plowed open. Once both her holes are stretched, the boys hold her legs open as they DP her tight holes. Jay's eyes roll back in her head as she gets fucked by two cocks at the same time. Finally, this slut gets 5 fat loads of cum all over her face and in her mouth.",
  "directors": [],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Jay Taylor",
      "person_id": 37128
    },
    {
      "name": "Mark Zane",
      "person_id": 55651
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-09-19",
  "scene_id": 43583,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "First Gangbang",
    "foreskin",
    "Gangbang",
    "Metal Bondage",
    "mixed",
    "natural boobs",
    "Role Play",
    "Rough Sex",
    "shaped",
    "slim",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Jay Taylor gets DP'd in First Gangbang Ever!"
}