{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Lauren Phillips puts on her new skimpy pink cocktail dress. She's ready to go out to dinner with her man Ramon Nomar for their anniversary. When she shows the dress off to him she is surprised by Ramon standing with five other guys. He humiliates her and says she looks like a whore. He makes her lift up her dress and show the other guys her ass. Then he tells Lauren that he brought the other guys as presents, and they're all there to fuck her for their anniversary. Ramon tells Lauren to get naked. Embarrassed, Lauren fully undresses while they all watch. Ramon tells her to have a seat on their staircase. She sits, spreads her legs and masturbates while all six guys take turns spitting on her pussy. They get her to the floor on her knees and tie Lauren up in rope bondage. With her hands tied behind her back, and her legs in a frog tie, Lauren gets face-fucked by all six cocks. They squeeze her big beautiful natural tits and play with her pussy as they all take turns shoving their meat down her throat. Next, they tie up Lauren with one of her legs in the air, exposing her pussy as the other leg balances by itself on the floor. Her arms are bound behind her back. One by one, all six guys take turns fucking her pussy. She sucks their dicks while she gets fucked and begs for more. Lauren wants it in her ass next and with out hesitation they shove their big dicks in her ass and fuck it deep and hard. Ramon lifts her up with his cock still anchored in her ass. Another dick goes in her pussy and she gets fucked in a standing double penetration. In the next scene, Lauren is bound again but this time with a ball-gag in her mouth. She kneels on a padded platform while Ramon scares her with the electronic zapper. While getting zapped, they double-stuff her again. She rides one cock in her pussy while a variety of big cocks fuck her in the ass. After her holes are destroyed, Lauren gets a face full of their cum and a smile on her face.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Mark Zane",
      "person_id": 55651
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    },
    {
      "name": "Mr. Blaccwood",
      "person_id": 61400
    }
  ],
  "release_date": "2018-09-05",
  "scene_id": 43581,
  "tags": [
    "Anal",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Penetration",
    "Gag",
    "Gangbang",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Zapper"
  ],
  "title": "Lauren Phillips Takes Six Dicks in Brutal Gangbang!"
}