{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Miranda Miller stands completely naked in the middle of a well lit dilapidated warehouse. Her wrists are shackled together and her head is stuck in a suspended metal cage. Her Master enters the room with four of his friends. He tells her to let them do as they please and she replies with, \"Yes Master\". They surround her slowly like predators circling their prey, groping and grabbing at her naked body. She jerks their cocks with her shackled hands as they spit in her face and smash a vibrator against her pussy until she cums hard. The guys release her head from the metal cage and Miranda gets on her knees to suck all of their cocks. Miranda does her best to please all of their big hard cocks. She shoves them down her throat and gets covered in her own spit. Next, they place her on a padded table on her back with her ankles and wrists both trapped in a metal spreader bar. One by one they take turns fucking her pussy and then her ass back and forth. They stretch out both of her holes, pounding her deep and hard until she cums multiple times on their cocks. After that, they place Miranda in a leather straightjacket and turn her over face down with her ass stuck in the air. They once again take turns fucking her hard, jackhammering her tight pussy, doggie style with her face pressed against the leather. In the final scene, Miranda gets double-stuffed by all of their huge cocks multiple ways. They fuck her pussy and ass at the same time while she sucks cock and Miranda screams in pleasure as she cums over and over. Miranda ultimately gets her holes stretched and ruined and gets a smiling face full of cum.",
  "models": [
    {
      "name": "Miranda Miller",
      "person_id": 58770
    },
    {
      "name": "Dillon Cox ",
      "person_id": 61545
    },
    {
      "name": "Sam Shock ",
      "person_id": 61546
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    }
  ],
  "release_date": "2018-10-17",
  "scene_id": 43585,
  "tags": [
    "anal",
    "bdsm",
    "Blowbang",
    "blowjob",
    "bondage",
    "cage",
    "Corporal Punishment",
    "Double Penetration",
    "gangbang",
    "leather",
    "master",
    "role play",
    "Rough Sex",
    "slave",
    "straight",
    "vibrator"
  ],
  "title": "Horny Lil' Sex Slave: Miranda Miller Gets Fucked By Five Friends "
}