{
  "collections": [
    "Families Tied"
  ],
  "description": "This perfect suburban housewife has a secret D/S life with her Dominant husband Ramon. She happily has her creamy ass spanked and beaten in chains and metal bondage, trying to keep a big steel hook in her ass, all while licking his shoes, and apologizing for not taking care of the cooking. She sticks her slutty tongue out from behind her ball gag to lick his leg, from his shoe all the way up, begging for cock. She definitely knows how to please her master. Ramon is still not convinced he should let her \"off the hook\", and flogs her while she screams and begs around his cock. After a very enthusiastic and wet blow job, she is allowed into doggy on the floor, handcuffs still securing her wrists behind her back, and she's fed the metal toy from her ass. She then gets railed with her ass in the air like a pure whore, begging to cum and squirting all over her suburban living room. Ramon has no mercy, lifting her to remove her painful nipple clamps, tormenting those tender tits and making her rub her swollen clit on the head of his cock until she is exploding with desire. She's finally allowed to ride it and cum fountains on the floor. But Veronica's perfect submissive world is turned upside down when her bratty little step-sister, Victoria arrives. Victoria has run out of money on the road and has come to visit, to restock her wallet and get a bite to eat. Ramon wants to throw her out, but Veronica's good nature and nostalgia get the best of her, and she vouches for her. But she soon learns that no good deed goes unpunished. As soon as Victoria's alone in the house she proceeds to steal Veronica's jewelry and use all her sex toys. Victoria is caught by Ramon, who senses she's up to no good. He ties the little brat up once he finds all the jewelry in her purse, and proceeds to teach her a little discipline with a strict over-the-knee spanking that turns Victoria's ass a deep red. In a choke out tie with her arms jacked way up behind her back Victoria is helpless and begs for dick like an obedient little cunt. Paddled and clamped, slapped and made to cum she gets a big cock in her and learns something about why she shouldn't steal from family. When Veronica returns home she finds her sis bound tightly on the floor with a vibrator bound to her pink pussy. When it's revealed that she has returned to her thieving and lying ways, Veronica decides it's time for some sexual discipline. Grinding out orgasms on her trapped teen sister's face while her husband fucks her deep in the ass, she finally gets a sense of justice and pleasure. The beast is released and Veronica goes wild on Victoria, pushing the vibrator against her cunt and snarling that she better learn to suck cock like a good slut. The rest of the day with a boundless adventure is anal fisting, double penetration, squirting, bondage, ass to mouth blow jobs, and the victorious return of Veronica Avluv to Kink.com. Enjoy!",
  "models": [
    {
      "name": "Veronica Avluv",
      "person_id": 22663
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2018-08-31",
  "scene_id": 43589,
  "tags": [
    "Anal Fisting",
    "Ass to Mouth",
    "ball gag",
    "bondage",
    "chains",
    "discipline",
    "Double Penetration",
    "Family Roleplay",
    "fisting",
    "gag",
    "Hitachi",
    "master",
    "metal bondage",
    "nipple clamps",
    "spanking",
    "squirting",
    "straight",
    "vibrator"
  ],
  "title": "The Nymphomaniac's Lil Sister: Veronica Avluv Returns"
}