{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Part two of our BDSM summer soiree finds Arabelle Raphael tied down to a fuck table in tight bondage with her big nipples adorned with brutal metal clover clamps. She is faced with her teenage trainee Chloe Cherry gripping a huge dildo gag in her mouth. The governess Aiden Starr is determined to teach this little blond slut how to be a sex object rather than a selfish whore, and will start by using her as a toy for Arabelle's pleasure. Made to fuck her superior's cunt in front a crowd of cheering partygoers, Chloe begins to take pleasure in her work, then a big dildo in her tight pink pussy from the Governess. Meanwhile, the Guest of Honor enjoys liberties with Arabelle's ass and pussy. In the midst of her sexual debasement, Chloe tries her best hold her orgasms back until granted permission and starts to understand the role of a sexual submissive through rigorous fuck training.\nThe BDSM swinger crowd is horny and wild by this time. There are scenes of lesbian fucking machine orgies, one sexually submissive woman takes an anal hook and many beatings from her Masters, while rope bondage and corporal scenes continue throughout the room. One very beautiful guest worships another women's ass and feet, while lesbian pussy licking adds a touch of eroticism to a savage corporal scene. Swingers fuck on all the couches, and there are blowjobs in all corners of the party.\nTeen anal dream Chloe has been taught all the rules of the House and is eager to be used for the pleasure of the House. Chloe attempts to recite the rules in a composed manner until Aiden Starr is quickly fist deep in her perfect ass. Trying to show off comportment in a depraved anal scene is quite difficult, leaving Chloe screaming in pleasure and shock instead of impressing her teacher. Arabelle has a vibrator tied to her slutty pussy and gets railed by the Guest of Honor while doing her very best to comfort Chloe with some pussy licking. It's no use, Chloe cums like a little slut without permission, and has her breath taken away by Aiden who promptly sits on her silly teen face. The Governess is finally satisfied with Chloe's recitation of the rules and proper begging into her cunt, and allows her to take cock in her ass. Arabelle's face begging for cum tips our Guest of Honor over the edge, spraying both sluts' beautiful faces with a load of cum. Well done!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    }
  ],
  "release_date": "2018-11-02",
  "scene_id": 43597,
  "tags": [
    "Athletic",
    "BDSM",
    "Big Tits",
    "black hair",
    "blond",
    "Blonde",
    "Bondage",
    "brunet",
    "Clover Clamps",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Discipline",
    "fake boobs",
    "Feet",
    "Female Slave",
    "Gag",
    "Humiliation",
    "Lesbian",
    "master",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Swingers",
    "switch",
    "Tattoo",
    "Teacher",
    "Threesome",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Anal Sluts Tied Down for Service at BDSM Swinger Party"
}