{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Part Two of our Upper Floor summer soiree finds our busty, all-natural teen Amilia Onyx trying to give a good disciplined fuck. But she isn't used to working for her orgasms. She falls off the cock, begging forgiveness as she can't remember a single one of the house rules! Her MILF sister in service saves the day. She helps her make it up to our guest of honor by giving his cock the ride of a lifetime, while cumming from a hard cropping on her swollen pink clit. The Governess kindly places Amilia on restorative ball duty, having her clean up the cock from balls to shaft. At the same time, London continues in an athletic reverse cowgirl display, her gorgeous tits bouncing. The Governess decides she is owed some gratitude from both of these little cock-whores and has them lap and lick at her pussy and ass until she cums. Stefanos tries to keep the place in order, making the submissives focus on protocol, all while flogging them. But the room is in sexual chaos. One of our beautiful guests is placed in a complex shibari tie and transformed into a little sex piggy with a curly tail butt plug. Humiliated and turned on, she is made to look at herself in the mirror with a pig nose and fuck herself with a dildo while her Master has her suck his cock. She is rewarded for her degradation with a orgasms in full suspension, twisting and oinking while the crowd cheers. Guests have a wild finale, exchanging sexual partners, finding corners for blow jobs, hardcore lesbian wrestling, and a very special birthday girl gets a very intense beating instead of the classic birthday spanking. She is given applause and aftercare, followed by her Master's hard dick. The finale to the night places London in an inverted bondage pile driver with a hard dick in her ass and Aiden's fist in her cunt. Screaming like a banshee, London still manages to wait for permission to cum, while licking Stefanos' shoes as she's getting double fisted. Amilia is placed back on cock duty, and gets her face covered with cum and sweat, as she bounces her 19 year old ass. London and Amilia are both cropped and made to fuck until they can't fuck anymore. At the end of the night, when they both look like sweaty, fucked out little sluts, Stefanos and Aiden congratulate themselves. Finally, some proper servants for our sexually depraved House! Both whores are rewarded with a hot load of cum and collared for good service.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Amilia Onyx",
      "person_id": 61275
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2018-09-07",
  "scene_id": 43595,
  "tags": [
    "19-Year-Old",
    "Athletic",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Flogging",
    "Humiliation",
    "Lesbian",
    "master",
    "MILF",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Suspension",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "white",
    "Wrestling"
  ],
  "title": "Anal MILF And Busty Teen Service The BDSM Swinger Orgy"
}