{
  "collections": [
    "Families Tied"
  ],
  "description": "Busty slut Step-Mother Dana DeArmond is pacing around the house in a panic. Her Step-Daughter's claim to the property and trust fund is being challenged by a distant relative from Spain. Juan Lucho is rich, arrogant, and handsome: a very dangerous foe to a starry-eyed teenage girl like Abella. Dana stuffs her luscious tits in a tight dress and tries to prepare Abella for war, but her tight-bodied teen only wants a ride on Juan's hard dick and her Step-Mother out of her hair. Abella rifles through Juan's bag and finds rope, ball gags, floggers, and clamps, all of which she invites him to use on her nubile body. Tied up in a tight spread eagle on her pastel day bed, Abella drools on her gag and takes a torrent of hits to her face, cunt, and clamped tits. Juan keeps taking her tight young pussy to the brink of cumming, and then slaps the orgasm away. Thrusting his cock into her mouth, he chokes her with hard dick, letting her breath long enough to beg to get fucked. Cumming like an undisciplined slut, Abella is having a ball until Juan decides he wants her asshole. Screaming and begging, she squirms away, but Juan informs her that this is his house, and he always gets what he wants. Dana is spying on them, and understands how to keep her home.\nWaiting until Abella has left for school, Dana seduces Juan, teaching him sometimes it takes a woman to please a man. She uses her round MILF tits and perfect ass to subdue his sadism. Hardcore anal sex, ATM, and dirty talk keep Juan distracted for a time, but he once again demands Abella's anal service in exchange for their home, leaving Dana no choice but to train her precious step-daughter to be the ultimate anal whore. After waiting for Abella to come home from school, Dana gives her a lecture about biting off more dick than she can chew and gives her bouncy ass a good hard spanking. Thrown onto the kitchen table, Abella has a perky young nipples tormented with clover clamps and clothespins, her pink pussy shut with more clamping, and her hungry little asshole filled with hard metal training toys. Slapped around and commanded to cum by her hot Step-Mommy, Abella starts to get into her new role just in time for Dana to ruin it all by pulling all her clamps off at once plunging her into a world of pain. Rewarded for her anal training with a nice pussy licking and the chance to give Dana an orgasm, Abella is ready to take on Juan's cock in a rope suspension. Dana won't make it easy, using a cane, crop, and vibrator to keep it sexy for their sadistic new landlord Juan. Our teenage slut prevails in her duties, cumming like a little anal whore and serving her Mommy well.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Abella Danger",
      "person_id": 56157
    },
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    }
  ],
  "release_date": "2018-09-28",
  "scene_id": 43593,
  "tags": [
    "Anal",
    "bestof2018",
    "bottom",
    "brunet",
    "Brunette",
    "Clothespins",
    "Clover Clamps",
    "Crop",
    "Family Roleplay",
    "foreskin",
    "Gag",
    "Latin",
    "MILF",
    "natural boobs",
    "other hair color",
    "Pain",
    "Sadism",
    "shaved",
    "Spanking",
    "Straight",
    "Stud",
    "Suspension",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Devious Dana DeArmond Trains Her Step-Daughter For Anal Whore Service"
}