{
  "collections": [
    "The Upper Floor"
  ],
  "description": "In part two of our legendary Folsom BDSM ball Nikki Darling and Dee Williams serve up sexual mayhem and perfect submissive service amidst an incredible orgy of kinky swinger sex. Nikki is allowed to take her revenge upon Dee's gorgeous new tits which are trapped in a painful back bend tie. The shibari keeps Dee's slutty cunt exposed for a relentless vibrator and her boobs are swollen and covered in clamps. Nikki canes Dee's engorged pink clit and rips the clamps off as Nikki herself enjoys a nice thick dick in her wet submissive pussy.\nMeanwhile Ashley Lane is getting a brutal single tailing. Helena Locke has found a perfect pair of punk lesbian sluts and takes turns spanking them and watching them pleasure each other. Another couple joins them on the table creating quite the sex pile. To top it all off, Mickey Mod is in attendance with date Andre Shakti who delight the crowd with passionate wrestling, impact play, and hot fucking. Foot torment, spanking, swinger blow jobs and sex breakout throughout the party. In the final service scene of the night Nikki and Dee are told the last girl fucking in a strict reverse cowgirl will get a double penetration ride on two hard cocks. Nikki provides an entertaining and athletic performance, but Dee loses her male top in the party and is sent in a chaotic chase through the room searching for him with Stefano's hot on her tail with a flogger. She is made to serve drinks and take a beating until her cock to please finds her again. Exhausted from her punishment she loses the fuck competition and finds herself licking up the cocks from Nikki's ass as Nikki cums again and again from a rough ride on two huge dicks. Not to be outdone, Dee squirts all over the place and earns her own turns on the two cock fuck ride. Covered in sweat and thoroughly used up, both sluts drop to their knees and beg for hot loads on their perfect submissive faces. Happy Folsom Everyone!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    }
  ],
  "release_date": "2019-03-08",
  "scene_id": 43599,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Couple",
    "Creampie",
    "Discipline",
    "Double Penetration",
    "Electrical Play",
    "Female Slave",
    "Flogging",
    "Folsom",
    "Foot Torment",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "master",
    "Nipple Clamps",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Single Tail",
    "Spanking",
    "Squirting",
    "Straight",
    "Threesome",
    "top",
    "Vibrator",
    "Whipping",
    "Wrestling",
    "Zapper"
  ],
  "title": "Squirting DP Anal Sluts Serve the Folsom Orgy"
}