{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Stefanos and Aiden are running a test to determine the best raw material for an Upper Floor servant. Is it an experienced pervy anal MILF, who’s a hardcore bottom with years of BDSM experience? Or is it an eager know-nothing teen with huge tits, a can do attitude, and dick sucking skills to spare? London River is the pervy MILF, tied to a vibrator, with clamps all over her body. Amilia Onyx is the horny teen. The rules are explained to both of them, and the guests roar with laughter as all hell breaks loose. London’s made to hold the trays while Amilia’s set loose on a gigantic cock. Trays are dropped, the teen trainee tries desperately to pick up the slack and hold them, while drooling all over a massive dick. And London is shocked with the zapper and the cattle prod repeatedly. All the pain gets London’s tight pussy wet with anticipation, and Aiden can’t help but slip her fist in there and make her beg to cum. Stefanos ups-the-ante by placing heavy chains all over her exhausted outstretched arms and tells her to cum, but only with her arms extended like a well-disciplined slut. She is rewarded with dick in her hungry, freshly fisted hole, while Amilia is made to lick her pussy and take a spanking. The crowd goes wild, fucking on all the couches and caning their subs, and the room is alight with blow jobs and swinging couples. Sebastian Keys and Rain DeGrey have a long overdue first play date. They start by wrestling to determine who’s on top. Sebastian is victorious, leaving a slutty Rain begging for her pussy to be flogged. She sucks his cock and crawls around the floor licking his boots. She does such a good job Sebastian rewards her with a fat load of cum on her pretty face, leaving her panting on the floor. Aiden has decided it’s time for Amilia to take some dick and ties her her legs spread with tight rope. Stefanos interrogates her while she gets slammed with the biggest hard dick she’s ever seen. That milky jiggly ass bouncing on cock impresses the guests and they come over to cheer her on while River gets a test of her own. All she has to do is beg for permission to cum and hold her orgasms, but it’s a bit difficult for this hot MILF babe when she’s tied up on sybian with Stefanos stepping on her worn, red pussy. Aiden tries everything, flogging, cock sucking, humiliation, but the thing that finally gets London to behave is the promise of licking Aiden’s pussy. Screaming and sweating on the machine, she is rewarded with her Governess’ perfect cunt on her face. Amilia finally gets the picture herself, and delivers a perfect recitation of the House Rules, after facing the cattle prod and the cheers of several instructive house members. Her wild orgasm with London swallowing all her toes like a foot whore is worth all the suffering. Stay tuned for Part Two of this evening, coming soon.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Amilia Onyx",
      "person_id": 61275
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2018-08-10",
  "scene_id": 43594,
  "tags": [
    "19-Year-Old",
    "Athletic",
    "BDSM",
    "bestof2018",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Caning",
    "Cattle Prod",
    "Chains",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Flogging",
    "Humiliation",
    "master",
    "MILF",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Sybian",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "Vibrator",
    "white",
    "Wrestling",
    "Zapper"
  ],
  "title": "The Anal Submissive MILF And The Big-Titted 19 Year Old"
}