{
  "collections": [
    "Families Tied"
  ],
  "description": "Lauren Phillips sweeps into her new McMansion with her giant suitcase and her hourglass figure, ready to charm her new step-daughter with a day out on the town. But her petulant teenage charge, Maya Kendrick, has already worked her way through seven step-mothers. She's also already fought her step-brother Seth over who will have to deal with Mommy number 8, her or him. Maya and Seth are a twisted duo that spend their time playing power games and fucking when their parents aren't looking. Maya has just had her ass beaten red and fucked on the living room couch in belt bondage when Lauren shows up for some wholesome family fun. The way Maya's eyes roll back in her head as she slobbers and moans with Seth's cock in her mouth make the whole premise of a chore trade seem a farce. Maya screams and begs as her nipple clamps are pulled on her tiny little tits and she is flogged, but it's only to beg for his cock in her slutty pussy and ass. Maya is surprised when she gives Lauren lip and Lauren changes tack, grabbing Maya by the ear and locking her in her room. Satisfied by her take-charge attitude, Lauren gets cocky when the maintenance man comes by. She invites him in for some afternoon delight, only to find him filming her while she's giving him a blowjob. Upon demanding he erase the video, Seth introduces himself as her new step-son and the fun really begins! Locking Lauren's arms behind her back in metal handcuffs, Seth flogs her huge tits, degrades her with her new name \"8\" written on her chest with lipstick, and electrifies her, then makes her squeal like a little piggy and crawl around the living room. Releasing his little sis and outfitting her with a huge strap-on, the two siblings take Lauren down with a double fucking, each taking turns with her ass and mouth while they continue with a litany of humiliation and corporal. Lauren is placed in a pile driver with clamps all over her tits, with cuffs locking her in place. A dildo is placed in her mouth for her to hold while Maya uses it to get herself off, and Seth fucks his new Mommy's ass. Lauren squeals and begs to cum, but to no avail, the twin sadists just continue to enjoy her body until they decide it's time to cane her stretched-out calves. Lauren can only watch helplessly and her sore muscles have 8 red stripes placed upon them with a heavy bamboo cane. Tied on her stomach and ball-gagged, Lauren serves as fuck furniture, getting railed in the ass and pussy until Maya wants to have another orgasm and her brother switches to her holes. She teases and spits on Lauren until she reaches climax and her pretty eyes roll back in her head. Having been properly trained in her maternal duties, Lauren is released and allowed to service her step-daughters clit. Seth fucks Maya and steps on her vibrator mercilessly until Maya begins to wonder if her orgasms are punishment or reward. Both new mother and daughter team look perfect on their backs, taking a hot load of cum together. Perfect bonding day!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2018-08-17",
  "scene_id": 43592,
  "tags": [
    "bdsm",
    "blowjob",
    "bondage",
    "dildo",
    "Double Anal",
    "Family Roleplay",
    "humiliation",
    "nipple clamps",
    "straight",
    "vibrator"
  ],
  "title": "Gold-Digging Step-Mother Served Double Anal Trouble"
}