{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Chloe Cherry shows up for service with a slutty disposition and lack of regard for protocol. During her introduction to The Upper Floor's esteemed attendees, she is already rubbing her cunt and grinning like mad, certain her undisciplined teenage pussy is about to be full of dick. Our long standing submissive servant Arabella Raphael sighs with displeasure, realizing how hard her job is going to be, getting this know-nothing little millennial into shape for serving the horny BDSM swingers already beginning to laugh at Chloe's obvious lack of training. To make matters harder, the Governess takes sadistic pleasure in Chloe's bad behavior, and encourages her to continue to rub her pussy, steal orgasms, jump on hard dick without permission, and cause sexual havoc. Drooling and rolling her big blue eyes back as she chokes on a massive cock, Chloe starts to understand the kind of mess she is in and attempts to follow orders, tending to the Guest of Honor--seems simple enough. Five attempts later, there is ice and liquid all over the floor, trays thrown, and Chloe's ass in the air, beaten red and shocked heavily as Arabelle looks on, bouncing her huge natural tits and sucking cock, completely ignoring her underling's plight.\nWith a pink ass and tits from a strict flogging, Chloe tries to be good and starts to beg for dick like a proper whore. However, Arabelle's gorgeous boobs have already been covered in wooden clamps for all of Chloe's misdeeds and she is hardly in a generous mood. As Chloe gets her first fucking of the night Arabelle smothers her face, hardly allowing her enough breath to beg for an orgasm. The crowd and Heads of House are delighted, and laugh with glee as Arabelle has her tits tormented by the Governess and Chloe struggles to hold her orgasms back. Eventually she cums out of turn, getting thrown on the floor and made to\nsuck cock straight out of Arabelle's cunt as she gets her first reward fuck of the evening. Chloe receives more beatings and is taught a few House Rules for testing later.\nThe crowd is in a raucous mood, with plenty of rope suspensions, spankings, blowjobs, sadistic pain play scenes, and gorgeous women in service. One such slut, Barbary Rose shows up with her thick bouncy ass, fiery red hair, and perfect tits--she is definitely looking for trouble. That trouble comes in the form of Stefanos, a Sybian, and a single tail. The resulting scene of whipping, pain play, rope bondage, and multiple, hard-won orgasms is a lovely exhibit of a true pain slut at work.\nThe next time we see Chloe Cherry, her teen body is trapped in tight rope bondage, doggy style, with a huge cock in her ass. Her mouth forms a perfect O around a red ball gag. She's not the one in trouble this time, she just needs to take her anal fucking like a good submissive whore. It is Arabelle who will be the focus of The Goveness' displeasure. Feeling Arabelle has a man focused view on service, Aiden wonders why no slut has offered to service her. Too little, too late, she no longer wants her cunt licked, but is out for pain. Arabelle's ass is cropped, paddled, shocked, and spanked pink while Chloe screams in pleasure and shock at the size of the cock in her ass. Arabelle, after completing her punishment, is sent over to get her teenage charge off and teach her to beg and receive orgasms like a good whore. Thus concludes Part One of this summer soiree. Please join us for Part Two in a forthcoming update.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    }
  ],
  "release_date": "2018-10-05",
  "scene_id": 43596,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Flogging",
    "Gag",
    "Humiliation",
    "master",
    "Oral Sex",
    "Pain",
    "Pain Slut",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Single Tail",
    "Straight",
    "Swingers",
    "Sybian",
    "Threesome",
    "Whipping"
  ],
  "title": "Teen Anal Slut Turned Out For Service at BDSM Swinger Soiree"
}