{
  "collections": [
    "Families Tied"
  ],
  "description": "Curvy pop star Ivy LeBelle has fallen for scam artist Ramon's new-age spirituality and dominant cock. She refuses to do interviews and publicity events, and instead stays home to do yoga and submit to Ramon's sadistic games. Her uptight step sister and manager, Krissy Lynn, worries that her bratty little sister Ivy will throw away her career. Fed up, Krissy yells at her for falling for Ramon's manipulations. Ramon, realizing that Krissy is on to him, decides to bring both sisters under his control. First, he disciplines busty Ivy, putting her in tight bondage and flogging her huge tits while making her agree to treat her sister nicely. He hits her with a zapper over and over again as she gags on his huge cock, then fastens tight clamps on her pussy and compels her to pull them off herself. Finally he gives anal slut Ivy what she really wants and fucks her hungry pussy and ass, moving indiscriminately between both her holes until she cums over and over again on his thick cock.\nRamon leaves Ivy tied to the table and goes off in search of Krissy, who he finds getting ready to take a bath. At first she confronts him, telling him to get out of their house, but she soon breaks down crying, confessing that she is exhausted from running her ungrateful sister's life. Ramon suggests that she might feel better if she does something for herself for once. She agrees and Ramon soon has her handcuffed and blindfolded with her big creamy tits exposed. Ramon lets the repressed good girl Krissy take his cock deep down her throat while beating her tight pussy with a crop until she erupts in fountains of squirt. He bends her over his knee and brutally spanks and flogs her until her round ass is bright red. But just when he has finally given Krissy what she wants and filled her pussy with his big cock, Ivy bursts in, having freed herself from her bondage. Even though she is outraged to find Ramon fucking her sister, she submits to him as he holds her mouth against her sister's clit and commands her to lick. Humiliated, Ivy licks her sister's pussy and touches herself, all while he pounds Krissy doggy style until she cums all over her slutty sister's face.\nHaving brought both sisters under his control, Ramon ties Ivy to the bed and makes her watch as he turns uptight Krissy into as slutty anal whore. He fucks Krissy's tight ass while she is bound in a straightjacket, then makes Ivy suck his cock fresh out of her sister's ass. He plays sadistic games with the sisters; punishing one with the zapper when the other cums, turning them against each other as they submit to orgasm after orgasm. After another hard flogging and spanking the sisters are finally ready to share nicely. Putting their swollen pink asses in the air they give Ramon a sloppy double blow job, then let him take turns riding their assholes until he is ready to cover their eager faces with cum.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Ivy LeBelle",
      "person_id": 60683
    },
    {
      "name": "Krissy Lynn",
      "person_id": 19730
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2018-09-14",
  "scene_id": 43591,
  "tags": [
    "bestof2018",
    "Bondage",
    "Crop",
    "Crying",
    "Curvy",
    "Family Roleplay",
    "Flogging",
    "Spanking",
    "Straight",
    "Zapper"
  ],
  "title": "Step Sisters Ivy and Krissy Fall For Ramon's Manipulative Whims"
}