{
  "collections": [
    "Families Tied"
  ],
  "description": "Dolly Leigh is a good suburban girl, obsessed with her new youth minister's cock and his sadistic interpretations of The Lord's will. After school, personal scripture readings lead to twisted games, with Dolly having her sweet pussy beaten pink while praying for salvation, and that hard cock shoved down her whore throat. She confesses her fantasies as she's thrown on the floor and zapped. She begs and grins with pleasure with each crop and flogger landing on her ass. Worked up by his disciple's creamy nubile body and perky tits, Seth gives in and lets her suck his cock like the good Christian girl she is. She drools, swallows, and chokes while hoping he'll finish the job. After a strict spanking with the Good Book, Dolly gets her wish, and she's thrown on the floor for a violent and intense doggy fucking, cumming like a little heathen. She writhes and orgasms like an obedient whore in training. Meanwhile, her slutty, liberal step-mother Dee Williams is only interested in getting Dolly back on track for ivy league. She's noticed the rug burns on her step-daughter's knees, just as her grades started to slide. This curvy and athletic MILF is a believer in good schooling and getting her ass filled with dick, so she decides to kill two birds with one stone. She offers Seth deal: she'll teach him how to fuck if he leaves her sweet Dolly alone to study. Seth agrees, on the condition that he gets the chance to advocate for his faith, which involves rope bondage and orgasm control play with his dick in her ass. Tied to the family dining room table with no where to hide, Dee is fucked into many squirting orgasmic confessions, paying for each fountain of squirt with a zapper and crop. Clothes pins tightly clamped to her nipples and clit are not enough to stop her from cumming over and over again, while Seth rails her ass, so he decides she needs some lessons from her sweet little daughter. Dolly comes home to find her step-mother tied up with an electrified butt plug in her ass and her youth minister's cock in her slutty cunt. Seth invites her to convert her mother to their little game, and Dolly takes to it immediately, pressing her wet pussy on her mother's face and electro-tormenting her mother's asshole every time she cums without permission. Dolly licks the cock clean, fresh out her mother's ass and chokes on it, drooling and thanking her mommy each time. The rest of the day is spent in sinful pleasure, with Dolly riding reverse cowgirl and deep throating cock while Dee is made to lick her cunt like a new, true believer.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Dolly Leigh",
      "person_id": 55868
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2018-08-03",
  "scene_id": 43590,
  "tags": [
    "Ass To Mouth",
    "Athletic",
    "bestof2018",
    "Bondage",
    "buttplug",
    "Clothespins",
    "Crop",
    "Curvy",
    "Electro Plug",
    "Family Roleplay",
    "Gag",
    "MILF",
    "Nylons And Stockings",
    "Older/Younger",
    "Rope Bondage",
    "Spanking",
    "Squirting",
    "Straight",
    "Threesome",
    "Zapper"
  ],
  "title": "Teen Religious Fanatic Punishes Liberal Anal Step-Mommy"
}