{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Finally the Upper Floor has two well-trained, long standing anal whores in service for the night. Penny Pax and Kira Noir, in addition to being the most salacious, dick-hungry sluts, are also well versed in the Rules of The House and all necessary protocol. Their Governess Aiden Starr takes the evening to work on the finer points of their submission. Pax is at her best slobbering and begging with a huge cock in her ass. She is a servant to her own cunt, making her a perfect selfish slave. Meanwhile petite pain slut Kira Noir is a perfect picture of submission, wishing to crawl on the floor beneath everyone and take orders like a good girl. She is a perfect Selfless servant slut.\n\nTo best highlight their superlative qualities, the party opens with Penny tied tightly with rope, three vibrators on full blast tied tightly to her trapped snatch. After her last night of service, she was audacious enough to mentioned she had not had enough of the vibrator applied to her slutty pink pussy. Always one for irony, Aiden Starr grabs the bouquet of vibrators and hold them right against Penny’s swollen clit, making sure she doesn’t cum until selfless Kira has assisted in giving orgasms to several gorgeous female guests while she deep throats cock and rubs her own cunt. The crowd is very amused and turned on as all the women cum together, leaving Kira without an orgasm. She is further tested by being thrown on Ramon’s hard cock and made to ride him hard, waiting for permission to cum while having her clit cropped by Stefanos. Edged and allowed to cum a couple times, Stefanos waits for Kira’s biggest orgasm, and then commands her to hold her orgasm and dismount. Trembling with frustration she politely gives the cock duty back to Penny who smiles wickedly and takes her anal fucking with relish. Licking her submissive sister’s clit and taking a hard flogging, Kira grins with the content smile of a true masochistic submissive.\n\nThe crowd goes off in a flurry of hot BDSM swinger action. Hot women give their Masters blowjobs, take anal hooks and floggings, and get tied up in shibari. There is lesbian cunt licking and plenty of asses spanked red. One of our regular BDSM couples enjoys a special scene of tit torment with very painful clips, a flogging, and some hardcore fucking while their friends cheer them on.\n\nWe next find Kira on her back, trapped in tight metal stocks. She is ready to serve her Mistress, taking many many electro implements on her exposed feet. Cattle-prodded and begging for relief, Aiden offers her some pussy to eat that is electrified, causing Kira to scream in pain overtime her tongue touches Aiden’s clit. Satisfied Kira has displayed her true talents, Aiden allows Kira to finally take some dick in her slutty ass like a good girl. Pounded into oblivious, she screams happily into Aiden’s cunt.\n\nThus concludes Update One. Please Join us for the second half of this evening in a future\nupdate.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2018-12-14",
  "scene_id": 43600,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "BDSM",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Couple",
    "Discipline",
    "Electrical Play",
    "fake boobs",
    "Feet",
    "Female Slave",
    "Flogging",
    "Humiliation",
    "Lesbian",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Pain Slut",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Stocks",
    "Straight",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "The Selfish Anal Slut and The Selfless Electro Servant"
}