{
  "collections": [
    "The Upper Floor"
  ],
  "description": "In part two of this wildest of All Hallows Eve BDSM orgies, Avi Love has earned her way into some tight bondage with a huge, hard cock in her slutty teen ass. MILF whore Krissy Lynn isn’t so lucky, having stirred the ire of Aiden Starr for neglecting her duties in training Avi. Avi handles that huge dick like a good girl, moaning in the tight shibari while watching\nAiden degrade and flog Krissy’s swollen pussy and red ass. Locked in a cuff bondage position, Krissy can only wriggle around, begging for forgiveness, as she’s given just a little bit of dick. Her huge bouncy tits jiggle pleasingly as she struggles over to lick Avi’s ass off of Rob’s cock like a sex-starved slut. Tonight is historically significant as Iona Grace has come back for a service session with Stefanos. These two are old playmates from many years ago on the Upper Floor, and they waste no time marking up Iona’s gorgeous curvy body and huge, milky titties with a hardcore spanking and flogging. Once her ass is a bright crimson and the crowd is cheering, Iona begs to serve the house once more with her orgasms. She waits for permission, then lets loose with a deluge of passionate sexual release that has the horny crowd of BDSM swingers howling and clapping. Two other babes come over to drop their tits in her mouth and join in on the fun. Another hot young lady in a leather strait jackets fucks and sucks her Master, while others enjoy partner swapping, rough sex, single tails, rope bondage, flogging, and light up canes like nothing we have seen before. The party really comes together when both Avi and Krissy are strapped down to a fuck table and prove that they are able to recite the House Rules in unison like good submissive sluts. Their reward is an all-out assault on both of their holes, care of Aiden’s sadistic handy work and Rob Piper’s big fat cock. Both women display excellent manners, lapping at whatever is put in their mouths, and thanking Rob for every stroke in their greedy assholes. The crowd can’t get enough of their hot screaming orgasms and urge them on and on until both whores are spent and completely covered in a thick load of cum. Well done ladies!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Krissy Lynn",
      "person_id": 19730
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2019-05-03",
  "scene_id": 43603,
  "tags": [
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Flogging",
    "halloween",
    "Humiliation",
    "Leather",
    "master",
    "MILF",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Swingers",
    "Tattoo",
    "Threesome",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Teen Anal Slut Taught The Ropes at Halloween Swingers Ball"
}