{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Avi Luv is a tight-bodied beauty, but does she have what it takes to get down and dirty at the BDSM swingers Halloween Ball? We brought in one of our finest busty MILF whores, Krissy Lynn, to train her in the ways of sexual service and submissive anal sex. Krissy is all smiles and promises, but the moment she gets a thick cock in her slutty ass and pussy she leaves Avi flailing with a set of silver trays and no guidance. The costumed kinky guests take time out of their play party to laugh at Avi attempting to hold it together and learn the house rules as she is made to keep the cock and pussy wet, hold an athletic position of service, and get zapped, spanked, and degraded. Avi gives us her best, but eventually has her sweet little teen face pressed into the sex scene and her wet pussy vibed as she is deemed unable to properly fetch drinks and answer basic questions about the nature of submission. The party takes off at full tilt with a local lifestyle lesbian couple getting deep into a bondage wax scene. This hot lesbian bottom is not to be bested and fights her way out of bondage to throw her top on her back, fisting her into a frenzy of orgasms. Davey begs her athletic lover Fox Acecaria to strap on a huge cock and fuck her until her eyes roll back in her head and the crowd cheers. She gives as good as she gets, flipping her partner and fisting her until she squirts all over the floor. Couples spank each others asses red, swap partners for hot raw sex, group scenes, rope suspensions, single tailing, and submissive BDSM play. At one point there are so many couples fucking we ran out of furniture to play on! The next scene Krissy is made to pay for her lack of leadership in training Avi with a clamp zipper and orgasm denial. Tied down to a sybian she is made to scream and sweat and hold her\norgasms until Avi learns the house rules. The problem for her is that Avi is suspended for the first time ever in a difficult shibari tie and has a guest of honor balls deep in her tight teenage cunt. Avi is a good girl and tries her hardest to both fuck like a champion and absorb the rules so her hot MILF supervisor can cum like a slut. This is the kind of initiative Aiden Starr and Stefanos are looking for, so they allow her to ask hot houseguests for hints. The scene ends with Avi reciting the rules and both ladies cumming in unison like gorgeous fuck dolls much to the delight of the party. Join us for part two of this magical evening of BDSM play and sexual service in an upcoming update.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Krissy Lynn",
      "person_id": 19730
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2019-04-05",
  "scene_id": 43602,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Champion",
    "Corporal Punishment",
    "Couple",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Fisting",
    "halloween",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "master",
    "MILF",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Orgasm Denial",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Swingers",
    "Sybian",
    "Tattoo",
    "Threesome",
    "top",
    "unshaved",
    "white",
    "Zipper"
  ],
  "title": "Teen Whore Trained in Anal Bondage By MILF Sex Servant"
}