{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Fetish Network presents our infamous bondage slut hottie Isa Mendez. She knows the dungeon well with our Strapon Squad. Her submission to lesbian domination is quite impressive, enduring hardcore BDSM sessions with brutal Mistresses and their huge rubber dicks. Isa loves a challenge and we have the perfect one: Disgrace. She will now be dedicated to worshiping Master Bruno Dickemz huge cock. She's brought in and used immediately, wrists cuffed together, bent over and penetrated deeply. It seems she's excited and horny. She's dripping wet. Great! She has proven to possess incomparable deep throat and pussy swallowing talents. When the long dick appears in her face, she's one happy camper. She's deep throat-ed within seconds, skull fucked the way he likes: rough, deep, fast with face slapping and slobber. He slaps her tits and wants to hear her say what a dirty whore she is, his nasty sex slave. It takes a few slaps and more throat pounding to get it out of her. He pulls her over to the couch. Do you think her pussy can withstand more of his huge dick? It will be wrecked no matter what. He fucks her in the doggy position, using her mouth and face to pull her back on his dick deeper and harder. He sits down and makes her ride him in the cowgirl position. She hops on it like a good horny girl and works her Master's boner. He spanks her bubbly ass more to go faster, yanking on her wrists, penetrating her deep. Isa Mendez was made for rough sex. She's taken this session as more slave training. She is the dream submissive for domination.",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Isa Mendez",
      "person_id": 53665
    }
  ],
  "release_date": "2018-07-05",
  "scene_id": 43614,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Bondage",
    "Domination",
    "dungeon",
    "Facefucking",
    "Female Slave",
    "Fetish",
    "Hair Pulling",
    "Hand Gagging",
    "Latin",
    "Leather Cuffs",
    "Lesbian",
    "Male Handler",
    "master",
    "natural boobs",
    "PIV",
    "Rough Sex",
    "Slapping",
    "Slave",
    "slim",
    "Small Tits",
    "Straight",
    "Sub",
    "Submission",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration"
  ],
  "title": "Horny Slut Isa Mendez Earns First Slave Training with Rough Sex & Bondage"
}