{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "All new teen bondage whore Kendra Spade has no idea what she's in for. She tells the rough stud Eddie Jaye that she will do absolutely anything in order to please him. She lives to do whatever she is told to do. The sadistic dom knows exactly to do with a hungry whore like Kendra. He quickly tears off her tiny skirt and binds her wrists and ankles with thick leather belts and chains. He makes her stand at attention and teaches her the nuances of the language of submission and discipline. With a giant red ball gag crammed into her mouth and a vibrator jammed onto her tiny pussy, the male handler begins to beat her perfect perky tits with a heavy leather flogger and a riding crop. Kendra whimpers with delight as sweat begins to pool across the small of her back and her skin turns a bruised shade of pink. She grinds her cunt on the head of the vibrator and begs to cum. Eddie only laughs and indulges his twisted fantasy of orgasm denial. Soon after Kendra is tossed to the floor like a rag doll. Her legs and arms are bound with tight and severe rope bondage. She crouches low to floor and finds her sight eclipsed by shadow of massive cock. She has tunnel vision and her entire gaze is captivated by the dick. She begs to have it crammed down her throat and be made to gag on a rough blow job. Eddie is only too happy to oblige and shoves his big black dick deep down her throat until it bulges just above her collar bone. She drools never ending puddles of sloppy desire as she chokes on the dick. Eddie scoops up her mess and uses it to lube her teeny pink pussy, causing her to cum the first of many multiple orgasms. Eddies dick is engorged and his hunger turns towards her unwilling fuck holes. He makes her kneel in doggie style and shoves his wang deep into her pussy. Her firm ass shakes and vibrates as he violently fucks her like a jack rabbit in heat. Kendra can hardly breath as he chokes her fragile neck and pulls on her cute ponytail. He then flips her onto her back and takes possession of Kendra's vulnerable and exposed asshole. His dick barely fits and she begs for him to stop. But this only sends the cruel taskmaster into a frenzy and he slams her tight asshole into submission until she can't stop cumming. As Kendra eyes roll back into her head, Eddie blows a massive load of cum all over her round ass. As she cleans the jizz off of his cock she smiles and says thank you.",
  "models": [
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Kendra Spade",
      "person_id": 60694
    }
  ],
  "release_date": "2018-08-15",
  "scene_id": 43627,
  "tags": [
    "anal",
    "ball gag",
    "bondage",
    "chains",
    "collar",
    "crop",
    "discipline",
    "gag",
    "Handler",
    "leather",
    "Male Handler",
    "multiple orgasms",
    "orgasm denial",
    "rope bondage",
    "straight",
    "Stud",
    "submission",
    "vibrator"
  ],
  "title": "New Slut Kendra Spade Bound in Rope, Anally Fucked With Enormous Cock!"
}