{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When hard ass parole officer Krissy Lynn informs Mr Pete his parole is revoked and detention is in his future Mr Pete turns the table and takes matters into his own hands. He doesn't just take matters into his own hands he takes Krissy's ass tits and pussy too! Before taking a bath Krissy is admiring her hot body in the mirror when Pete sneaks in and drags her away in handcuffs and chains. Bent over in a chair with ass up high Mr Pete plunges his cock into Krissy's ass for some hardcore anal. She warns him he is making a big mistake but that doesn't stop him from driving his huge hard cock deep into her ass as she quivers and moans. Then with Krissy on her knees, wrists tied to ankles and nipple clamps tight on her tits Mr Pete stuffs his dick down Krissy's throat for a wet and sloppy throat fuckin'. Her big tits bounce around as he flogs her and she can't get enough. On her back in tight bondage Krissy's legs are spread wide for easy access to her slutty pussy and ass. She may be a hard ass but she loves a hard cock in her ass too! First Mr Pete pounds her pussy and slaps her clit making Krissy scream in pleasure. His thick cock stretches her ass while he fingers her wet pussy and she comes hard. Finally on top of Pete in cowgirl position Krissy slides up and down on Petes dick grinding and pounding her pussy with his rod. Her big perfect tits bounce around as she fucks and gets her pussy off until Pete blows his load all over her tits. Nobody will be going to detention today!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Krissy Lynn",
      "person_id": 19730
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2018-08-24",
  "scene_id": 43625,
  "tags": [
    "BDSM",
    "big dick",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "Chains",
    "Corporal Punishment",
    "Domination",
    "fake boobs",
    "foreskin",
    "Humiliation",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Stud",
    "Submission",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Anal Officer"
}