{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Derrick Pierce sets out to cure himself of his big tits porn addiction, Double-A Avi Love becomes the target for his obsession.\nWhile Avi is admiring her tits in the mirror Mr Pierce pays a visit and convinces her to check out a great opportunity on a new technology for breast augmentation. She likes her little titties and doesn't want to make them bigger but agrees to go and at least listen to the presentation because maybe one day she might want to get a boob job. Oh but sweet and pretty Avi Love has no idea what Derrick has in store for her and her Double A's! Avi finds herself in a predicament--she is tied up in a dark dungeony room with a ball-gag in her mouth, spreader bar holding her legs open and tens unit pads stuck above and below her tits. She screams for help but she will not be let free for quite some time because Derrick has a problem he needs to solve. He is going to appreciate the fuck out of her little tits because he has been neglecting a whole portion of the female population up until now. Derrick caresses her small tits and perky nipples and prepares her for what is to come...He turns the dial up on that tens unit and Avi begs for mercy, her tits are so sensitive and the electricity drives her crazy. He fastens clamps on her big pillowy nipples to go along with the electrical pulses and to top it off he vibes her clit with the Hitachi until her long lean sexy body is wiggling and squirming around in pleasure.\nDerrick sets Avi on her knees and teases her with the zapper. Her tiny little tits poke out from the tight rope around them while Derrick shoves his hard cock down her throat. Avi's big eyes stare up at Derrick as she swallows his dick over and over only wanting to please her captor. Now tied up on her back with legs up high and open with a spreader bar Derrick bites and sucks on her tits, fingers her pussy and ass and then fucks Avi's wet pussy. Derricks thick cock stretches her out and makes Avi coo and moan and then he squeezes his dick into her tight ass and fucks her good. Even though they are small her itty bitty titties shake and jiggle while her slutty holes get fucked and used. Flipped over on her knees in doggie Derrick slaps her ass making bright red hand prints emerge and then he crops her delicate skin making the pleasure from fucking even more intense. He chokes her and pulls her hips into him while he fucks both her holes. After anal sex Derrick stuffs his dick in Avi's mouth and she sucks it clean. Derrick pounds her out plowing his wonderful little tit whores holes until he blows his white hot load all over her sweet teeny weeny Double A's!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    }
  ],
  "release_date": "2018-08-17",
  "scene_id": 43624,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Big Tits",
    "Blowjob",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Gag",
    "Hitachi",
    "Humiliation",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Small Tits",
    "Straight",
    "Submission",
    "Tattoo",
    "Tens Unit",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "I Love My Double A's!"
}