{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Tattoo alt porn goddess Lily Lane is always hungry to be tied up in brutal rope bondage and fucked senseless by a sadistic male dom. She starts her day perched on one leg dangling by her big tits in the middle of the room. Her male handler wastes no time and quickly begins to work her toned body over brutal impact play and a heavy leather flogger. Lily lets out passionate cries of pain as the most sensitive parts of her body are abused and tormented with masochistic delight. After her skin has been turned pink from the sadistic abuse, the male dom jams a vibrator onto her tiny pink pussy and she immediately begs to cum. She is a pain slut that loves to suffer and serve her master. As her swollen clit continues to be stimulated by the vibrator, her pussy squirts never ending streams of female ejaculation juices. Next Lily is tossed to the ground like a useless rag doll and a massive cock is jammed down her mouth. She is made to squat and choke herself out as she vainly tries to drag herself across the room to gobble her master's cock. Pleased with her submissive devotion to the dick, the sadist allows his female sex slave to consume his cock like a hungry whore desperate for her next meal. He then ties her to a bed with her divine ass exposed for his wanton intentions. He dives right in and begins to abuse her ass with a mean leather riding crop. She begs for mercy, but her pleas fall on deaf ears. Pleased with her slutty devotion, he jams his cock into her hungry pussy until she begs to cum. But the dom denies her orgasm and laughs as Lily withers from the pain of denial. To finish off her day, Lily is tied on her back with her legs spread wide open. As her whore hole gets pounded she squirts again and again until she is sweating and lost in subspace. When her pussy can't possibly orgasm again, the dom blows a massive load of jizz all over her tits and face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2018-09-12",
  "scene_id": 43622,
  "tags": [
    "Big Tits",
    "Blowjob",
    "Bondage",
    "Collar",
    "Crop",
    "Handler",
    "Leather",
    "Male Handler",
    "master",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "Slave",
    "Squirting",
    "Straight",
    "Sub",
    "Submission",
    "Tattoo",
    "toned",
    "Vibrator"
  ],
  "title": "Squirting Submission: Lily Lane Squirt Fucked In Inescapable Bondage"
}