{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Summer Day tries to buy out Tommy Pistol's home lease he makes her a counter-offer she cant refuse. Sexy Summer Day submits to hard domination, bondage and anal sex! Tommy takes matters into his own hands and writes up a contract that says Summer will swallow his cock to the best of her ability! He teases her with the zapper to make sure she reads the fine print. First he puts her on her knees and ties her up to a table to punish her with the flogger. He whips her big tits and thighs to make sure she understands their agreement. Soon Tommy's big cock is deep inside Summer's wet mouth slamming the back of her throat making her choke and drool all over. Wearing only rope on all fours with her butt high up in the air Summer gets disciplined with the flogger stinging her ass with every blow. Tommy slides his hard dick inside Summer's tight pussy and gives her a hardcore fucking to set her straight. He fucks her deep and hard making her scream and moan and then crams his cock down her throat again. Summer can suck dick like a champ and cleans it up real good! Now Tommy fucks Summers ass stretching out all her slutty holes making her beg to cum. On her back with a ball-gag Summer is drooling away as she vibes her pussy with the Hitachi. She is close to cumming when Tommy starts fucking her and takes her over the edge going back and forth between her tight ass and pussy until Tommy covers her with his hot sticky load. Thats the best contract Summer has ever signed!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Summer Day",
      "person_id": 59412
    }
  ],
  "release_date": "2018-08-10",
  "scene_id": 43628,
  "tags": [
    "bdsm",
    "big tits",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "domination",
    "drool",
    "gag",
    "Hitachi",
    "humiliation",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "The Eviction"
}