{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When red head beauty Tana Lea marries her ideal all American dad type, the reality of Charles' eccentric behaviors lands Tana in chains, living under the cellar stairs. Desperate to work things out, Tana agrees to undergo Charles' bizarre housewife training program in order to move their relationship to the next level. Let the training begin! Gagged and on a leash Tana refuses to go back to her spot in the cellar and offers to do anything Charles wants to stay out of that dark cold dungeon. First instruction is to kneel down, hands on pussy eyes up and suck my cock! With love and gusto Tana takes Charles hard dick deep down into her throat sucking and slurping and drooling all over it. Tight nipple clamps swing from her big tits as she diligently performs her wifely duties. Then later that day while cleaning the silverware Charles tells Tana to present so she cleans all the sex toys, floggers and zappers off the living room table and climbs onto all fours to display her sexy, voluptuous body for her husband. He ties her up and disciplines her with the flogger and slaps her ass around until it turns red. Charles slides his cock into Tana's mouth again and she gets it all wet and ready for her slutty pussy. With back arched and high heels on Tana takes Charles big dick into her tight pussy and gets a hot ride that makes her cunt sing! He vibes her clit with the Hitachi and she moans with pleasure but its really Tana who wants to please her husband so she takes a good hard pounding in her little pussy until Charles is satisfied. He flips his willing wife over and ties her wrists to her ankles so her legs are spread wide, pussy exposed and crops her sensitive thighs and it gets her excited. Charles drives his cock deep inside Tana's wet cunt and fucks her good until she is screaming with delight and he shoots his hot sticky load all over his wife's pussy. Tantalizing Tana Lea is well on her way to being the kinkiest American Housewife she can be.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Tana Lea",
      "person_id": 61416
    }
  ],
  "release_date": "2018-08-03",
  "scene_id": 43621,
  "tags": [
    "Ball Gag",
    "BDSM",
    "bestof2018",
    "big dick",
    "Big Tits",
    "Bizarre",
    "Blowjob",
    "Chains",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Flogging",
    "High Heels",
    "Hitachi",
    "housewives",
    "Humiliation",
    "Nipple Clamps",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "American Housewife"
}