{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Sophia gets busted skimming cash off the boss' action, Derrick pays the wayward grifter a home visit. Sophia is interrogated but denies stealing from the boss--until some hardcore anal action makes Sophia's truth come out. Caught redhanded trying to leave the house with a briefcase full o' cash Sophia tries to convince Derrick she was really just going to see him to give him his money but Derek knows a Liar so he takes matters into his own hands to teach Sophia a lesson about stealing from the boss! Tied standing up with a spreader bar and ball-gag Derrick busts out the flogger on Sophia's firm ass and turns it bright red. He spanks her, zaps her, slaps and squeezes her small tits, maybe this will teach her a lesson and she will come out with the truth. He crops her sensitive pussy and then stuffs his hard cock in her mouth and gives her a good deep throat fuck. She gives herself over to Derrick to have his way, she just wants to please him. In doggie position Derrick fucks Sophia's pussy wide open until she is begging to cum and then she asks for it in her ass. Hardcore anal sex drives her wild and she pleads for more. Then Derrick zaps her pussy and vibes her clit with the Hitachi until she almost falls off the couch cuz its so intense! Finally Derrick puts Sophia on her back and he fucks this Liar's pussy and ass into sweet submission and makes her an honest woman. Well not really that honest but he does pound her out until she cums hard and shoots his white hot load all over her and its awesome!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Sophia Grace",
      "person_id": 58792
    }
  ],
  "release_date": "2018-07-27",
  "scene_id": 43620,
  "tags": [
    "BDSM",
    "Blowjob",
    "Corporal Punishment",
    "Domination",
    "Facefucking",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Small Tits",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Liar"
}