{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "All natural, girl next door, blonde bombshell Lisey Sweet is a sex-crazed whore who is always hungry for BDSM sex. A wanton slut like Lisey only feels complete when she is tied up with inescapable rope bondage is coerced into gagging on massive cocks. She starts her day in a full suspension that leaves the front of her body vulnerable and exposed to the torment of a sadistic male-dom. As her male handler abuses her perky titties with nasty clover clamps she begs to cum as only a filthy pain slut will. As she pleads to cum the dom shoves his cock into her gaping mouth and stifles her pleas for mercy and pleasure. As she chokes and gags from the deep throat face fucking, her tits and pussy get abused with a leather riding crop and full speed vibrator. Next she gets bent over a bar with her beautiful round ass presented wide open ready to be objectified and anally probed. Her cruel taskmaster wastes little time and begins to make her ass glow as he beats it repeatedly with heavy leather flogger. After her whole body is shaking from the pain of the impact play, the male dom shoves his dick in her tight little asshole and she cums right away. He plows her and she cums repeatedly. As sweat pools all over her body, she never stops stuttering platitudes of unending gratitude for her brutal ass fucking. Impressed with her devotion, the sex master allows her to sit on his lap and worship his cock. Eventually he lets his little slut ride his cock and her ass shakes with perfect sexual gyration. To finish her day, Lisey lays on her back with her legs tied wide open with her teeny pink pussy exposed for torment. Immediately, her cunt gets filled with a massive cock and her swollen and sensitive clit gets stimulated a vibrator. This begins a never-ending wave of repeated and earth shattering orgasms. As her thin neck gets choked and her asshole gets fucked she begs to gobble a massive load of man jizz. And, her male handler is only too happy to oblige and blows a massive load of man goo all over her tits and face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Lisey Sweet",
      "person_id": 60674
    }
  ],
  "release_date": "2018-09-26",
  "scene_id": 43623,
  "tags": [
    "anal",
    "bdsm",
    "blonde",
    "bondage",
    "clover clamps",
    "crop",
    "Gaping",
    "Handler",
    "leather",
    "Male Handler",
    "master",
    "pain",
    "pain slut",
    "rope bondage",
    "straight",
    "suspension",
    "vibrator"
  ],
  "title": "Anal Attack: All Natural Blonde Lisey Sweet Ass Fucked in Rope Bondage"
}