{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Alexa Grace is an all natural girl next door with a tight body and little titties. She is the kind of pretty young thing that was born to suffer at the hands of sadistic male handler. This kind of girl looks devastatingly beautiful when tied up in inescapable rope bondage but looks even better while gagging on a massive cock. She starts her day tied standing with her arms and legs spread wide. As she learns the rules of her master's dungeon, she is brutally tormented with a cruel electro-shock device strapped to inner thighs. Her lean legs twitch and tremble as she begs repeatedly to cum as her clit is stimulated with an industrial strength vibrator. But this female sex slave doesn't get to cum yet and the male dom relishes in the pain of her orgasm denial. He then tosses Alexa to the floor and begins to hit her teeny titties with a cruel leather riding crop. She squirms and fidgets to escape the whacks from the impact play, but in this dungeon there is no avoiding pain. As she breathes heavily from the searing agony, her cruel taskmaster then jams his massive cock down her throat. She gags, coughs, and then plunges in deep and gets her face fucked with reckless abandon. Pleased with her devotion, the dom then jams the hitachi back on her clit and coerces the first of many multiple orgasm out of her unwilling pussy. Next, Alexa finds herself tied to a leather couch with her perfect round ass perched high up in the air. She then proceeds to take a dick in her tight pink pussy that stretches her and fills her completely. The couch skids across the room from the unbelievable force of the power fucking that she is made to endure. To finish her day of sexual depravity Alexa lays on her back with her legs tied apart. At this point she is so used and abused that she can barely remember to thank her master for all of the sexual pleasure he is showering her with. As her swollen clit is relentlessly stimulated with a vibrator her cunt gets plowed over and over by the massive cock. She begs for the dom's cum and he is only too happy to oblige. Alexa is left in a pool of sweat and covered by a giant load of jizz.",
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Alexa Grace ",
      "person_id": 59622
    }
  ],
  "release_date": "2018-10-10",
  "scene_id": 43626,
  "tags": [
    "blonde",
    "bondage",
    "crop",
    "dungeon",
    "Handler",
    "Hitachi",
    "leather",
    "Male Handler",
    "master",
    "orgasm denial",
    "pain",
    "rope bondage",
    "slave",
    "straight",
    "vibrator"
  ],
  "title": "Skinny Blonde Slut Alexa Grace in Sadistic Rope Bondage Pussy Fucking!"
}