{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When blonde cutie and actress wanna be Astrid Star is invited to Hollywood agent Ramon Nomar's home for a talent review she becomes ensnared in a world of BDSM and kinky sex in order to make it to the top! Astrid will do whatever it takes to make it in Hollywood so she agrees to do whatever Ramon asks of her. First he straps a leather collar and a leash on her neck and walks her around in circles in all fours. She must learn some discipline and to follow instructions, commands and say yes sir and thank you sir. He checks out her firm petite body, squeezes her big tits and notices her pussy is already wet. With a butt-plug in her ass and nipple clamps tight on her nipples Astrid gets a good deep throat fucking from this Hollywood agent. Ramon crops her thighs and butt while his big hard cock fills Astrids mouth and thrusts way down her throat making a slobbery sticky mess. More cock sucking as he whips her back with the flogger. All this punishment is getting Astrid worked up and ready for more. On all fours in doggie Ramon finally fills Astrid's pussy with his dick and fucks her until she is begging for more. Astrid isn't called the Anal Star for nothing. She can take an ass fucking like a champ and she is so tiny and Ramon cock is so big it stretches her slutty holes to new dimensions. Ramon punishes Astrid with the cane and leaves red marks all over her delicate thighs and back. She wiggles around on Ramon's dick until she comes hard. Then in reverse cowgirl Astrid gets the ride of her life on his monster cock. Astrid can't get enough anal so on her back with wrists and ankles tied together Ramon teases her with the zapper and uses clothespins to open Astrids little pink pussy wide open and pounds her tight ass into another galaxy until she has over the top multiple orgasms. Astrid Star: Anal Star of Hollywood!",
  "models": [
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Astrid Star",
      "person_id": 60587
    }
  ],
  "release_date": "2018-07-20",
  "scene_id": 43629,
  "tags": [
    "anal",
    "bdsm",
    "Best of Anal",
    "big tits",
    "blonde",
    "blowjob",
    "clothespins",
    "cock sucking",
    "collar",
    "Corporal Punishment",
    "discipline",
    "domination",
    "humiliation",
    "kinky",
    "leather",
    "multiple orgasms",
    "nipple clamps",
    "Petite",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Anal Star"
}