{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Lounging on the couch, talking on the phone, Mistress Arabelle Raphael rests her feet up on the back of her piece of human furniture, DJ. Through his leather mask, he tries to slyly lick the tips of Arabelle's high heels and she notices. She digs her heels into his back and scolds him for being so bold. Arabelle takes her heels off and shoves her foot in DJ's mouth and calls him pathetic. She puts her feet on the ground and spanks DJ's ass as he's bent over worshiping her feet. She makes him stand up and teases his cock that's been locked in a see-through plexiglass ball smasher that holds his nuts prisoner. First she bites his dick and then she zaps his cock with an electronic zapper. She presses her ass against his cock and the cage gets tighter. She zaps his whole body and tells him to dance and he dances around in pain trying to please his Mistress. Next Mistress Arabelle has DJ get on his hands and knees. As she sits on the leather couch, she tugs at a rope tied to DJ's cock and balls and fucks DJ's ass with a dildo attached to her high heel shoe. She turns him around and makes him suck the cock attached to the strap-on she wears. She commands DJ to get on the couch and bend over and he obeys. She fucks him with a strap-on deep and hard and commands him not to look at her. In the final scene, Arabelle has DJ completely immobilized on the floor. She's wrapped his whole body in black electrical tape like a mummy. She gets his dick hard to use it for her pleasure. She uses his dick like a human dildo and fucks it until she cums. She climbs up his body and sits on his face with her pussy. She smashes his face with her big beautiful tits while she fucks him some more. Mistress Arabelle's pussy is too amazing and DJ can't hold in his cum anymore and shoots his pathetic load all over himself.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "DJ",
      "person_id": 20225
    }
  ],
  "release_date": "2018-08-28",
  "scene_id": 43638,
  "tags": [
    "bdsm",
    "bondage",
    "cage",
    "CBT",
    "Corporal Punishment",
    "dildo",
    "dominatrix",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "high heels",
    "humiliation",
    "leather",
    "Male Sub",
    "mask",
    "orgasm denial",
    "pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight",
    "Zapper"
  ],
  "title": "Bad Boy Toy"
}