{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Hired for a photoshoot, Helena Locke and Tony Orlando are both dressed in tight shiny latex. The photographer snaps pictures as they portray the roles of Dominatrix and Submissive. Tony, head-to-toe in all black latex has his hands tied to a St. Andrew's Cross. Helena Locke, dressed in a sexy blue and black latex outfit, holds a thick chain attached to Tony's neck. When the photographer takes a long break, Helena takes advantage of Tony's predicament and indulges in a little play session for real. She teases his cock and rubs it through his latex pants. Helena heads over to the table full of toys and grabs the leather flogger. She flogs his body and sticks her hand down his throat. She pulls down Tony's latex pants, grabs his balls and tells him that it looks like his tiny male brain. Helena slaps his dick with her hand and then with the flogger. She teases his cock with her mouth then bites down hard. After that, Helena goes to the table again and returns to Tony with a leather \"balls gag\". Instead of attaching the belt around someones head who is then supposed to be gagged by the balls, Helena adds weights to it and turns it into a ball stretcher. She kicks the weights with her latex boots and they swing like a pendulum. Helena rubs her bare ass on Tony's pathetic cock and gets it dripping with precum. In the next scene, Tony is stripped naked and tied face down with rope, to a leather stool. A spreader-bar keeps his legs apart and a ball gag keeps his mouth quiet. Helena enters his ass with her huge strap on and fucks it well. She grabs the Fucksall and with a big lubed up dildo at the end of it, she slides it in his ass and pulls the trigger. Tony's eyes get big as he gets his ass rammed harder and faster than he ever has before. Then Helena gets a glove and shoves her whole fist in Tony's ass. In the final scene, Helena lounges on a leather bench while she makes Tony watch her get fucked by a fucking-machine. She tells him to get on the floor and lick her feet while she gets fucked. Tony deep throats her foot and licks all her toes while he watches her climax from getting machine-fucked. Tony cums on her feet and she makes him lick it off.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2018-09-25",
  "scene_id": 43639,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Latex",
    "Leather",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight",
    "Strap On",
    "Weights"
  ],
  "title": "Helena Locke and Tony Orlando: Fucked and Cucked "
}