{
  "collections": [
    "Bound Gods"
  ],
  "description": "Muscle-stud Teddy Bryce stands blindfolded with his hands bound in leather cuffs, tied to the ceiling. He wriggles around, anxiously waiting for Kink's hot new muscular dom, Arad Winwin to have his way with him. Arad enters the scene confidant and shirtless, wearing black leather pants and boots, his big muscles bulging out of his leather harness. Arad quietly walks behind Teddy and surprises him with an aggressive bearhug from behind. He squeezes and slaps Teddy's muscles then cuts off his t-shirt, exposing Teddy's ripped tattooed body. Arad manhandles Teddy, spits in his mouth, then grabs the crop and slaps Teddy's bare skin hard. He crops his nipples and stomach hard then cuts Teddy's underwear off to crops his balls. Arad bends Teddy over and presses his leather crotch against Teddy's face and rubs it around. He unbuttons his pants, puts a spider-gag in Teddy's mouth and face-fucks his submissive with his arms still bound to the ceiling. In the next scene, Teddy is kneeling on a suspended metal table, his body bound with rope, arms outstretched. Arad delivers hard blows to Teddy's ass, back, and stomach with a leather flogger. After that Arad gets on his knees and attaches many clover clamps to Teddy's ball sack, sucks his cock, then flogs him some more. In the final scene, Teddy is on his back with his legs spread on a steel table and Arad's cock is deep in Teddy's ass, pounding away. Arad gets an electrical cock stimulator and uses it on Teddy while he fucks him, sending jolts of electricity through Teddy's hard cock. After Arad fucks the cum out of Teddys cock, Arad feeds him his own fresh load. Arad fucks him hard one more time and blasts his load across Teddy's face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Teddy Bryce",
      "person_id": 59874
    },
    {
      "name": "Arad Winwin",
      "person_id": 61417
    }
  ],
  "release_date": "2018-08-16",
  "scene_id": 43630,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "clover clamps",
    "Corporal Punishment",
    "crop",
    "domination",
    "dungeon",
    "electricity",
    "gag",
    "gay",
    "humiliation",
    "leather",
    "leather cuffs",
    "Male Sub",
    "master",
    "muscle",
    "muscular",
    "harness",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "Stud",
    "submission"
  ],
  "title": "Arad, The Manhandler "
}