{
  "collections": [
    "Men On Edge"
  ],
  "description": "BOUND PRISON Part 2. Previously rookie Correctional Officer Michael DelRay was bound, fucked and broken in by inmates on BOUND GODS. This time this straight stud muscle officer thinks he can have it his way with the inmates, but these guys have a different idea in mind. Sebastian Keys witnesses DelRay taking advantage of Tony Orlando and knocks him out. The two inmates decide to teach this crooked officer a lesson and tie him up tight in rope bondage and shut him up with duct tape. When Michael comes to, these inmates begin the fun. They torment DelRay and get his rock hard monster cock right up to the edge of cumming over and over again. Michael screams in pain as his cock can barely take anymore. It somehow gets even bigger as they blow him and use toys that barely fit. Tony Orlando torments DelRay's Veiny monster cock and big his giant balls get stretched out and bitten. Sebastian takes clothespins and torments Michael's sensitive nipples. The two then find out DelRay is intensely ticklish and the torment turns to extreme endurance tickling. Finally after DelRay just cant take anymore, the inmates steal his camera and record his huge massive thick load cumshot. Well this isn't the end of Officer DelRay's story just yet. Check out BOUND PRISON part 3 coming soon to Kink.com BOUND GODS.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Michael DelRay",
      "person_id": 61138
    }
  ],
  "release_date": "2018-08-21",
  "scene_id": 43634,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "Bound Prison",
    "brunet",
    "Clothespins",
    "directorspicks",
    "Edging",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Pain",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "Straight Stud",
    "Stud",
    "Tickling",
    "white"
  ],
  "title": "BOUND PRISON Part 2: Officer DelRay has his Prisoners on Edge"
}