{
  "collections": [
    "Bound Gods"
  ],
  "description": "Dane Stewart arrives home from work ready to play with his slave bitch Alex Hawk. Alex, collared and chained to the wall, tries to avoid his captor but there's only so far he can go. Dane yanks him over, pushes him to his knees, and slaps his face until Alex submits, opening his mouth to suck on Dane's cock and balls. Dane fucks Alex's wet open mouth, holding his head in place as he squirms to get away. Tired of his bitch trying to run, Dane decides Alex could use some punishment. He manhandles Alex across his lap, pulls down his briefs, and smacks Alex's ass red with a leather paddle. Alex screams with each hit, struggling unsuccessfully to get away. Dane uses his brute strength to lock Alex in place as he pushes Alex's head down on his cock. All Alex can do is take Dane's fat cock as far down his throat as it will go. Next, Alex is tied down to a mattress as a leather clad Dane flogs his chest, belly, and cock. Alex yells as the flogger makes contact and Dane plays with his cock. Dane slaps and chokes his bitch into submission. Alex acquiesces to Dane's desires, telling him he loves his cock, but Dane doesn't let up. He shoves his cock down Alex's throat and continues to flog his bitch and tug on his sensitive nipples. Finally, Alex is suspended with clamps on his tender nipples and a fuck ton of close pins on his balls. Dane brings out a fuck saw and shoves it in Alex's tight asshole. Alex screams as Dane's tool relentlessly fucks his ass. Once Alex's hole is stretched open, Dane replaces his power tool with his thick cock. He pounds this bitch's tight whore hole and then blows his fat load all over Alex's face. Alex sucks his cock clean and is then put back in his collar and chained up. He is made to jerk off on his Master's boot and then cleans off his mess before licking and sucking Dane's feet.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alex Hawk",
      "person_id": 59999
    },
    {
      "name": "Dane Stewart",
      "person_id": 61114
    }
  ],
  "release_date": "2018-07-26",
  "scene_id": 43631,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot",
    "brunet",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Paddle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Submission",
    "the wall",
    "white"
  ],
  "title": "Captive slave Alex Hawk submits to Daddy Dane Stewart"
}