{
  "collections": [
    "Men On Edge"
  ],
  "description": "When their TV is on the fritz, Sebastian Keys and Dominic Pacifico turn their attention to tied up slut boy Max Adonis. Max is fit and youthful, his cock hard before Sebastian and Dominic even touch him. Bound to a wheelchair and gagged, he can barely move or speak to protest. His captors circle him and smell his armpits, cut off his boxers, and start begin to play with his leaking cock. First they use their hands before bringing out a toy their slut will absolutely love. Max moans as a stroker envelopes his rock hard dick. His hips rock, trying to fuck it, but every time he gets close to cumming, his captors slip it off his dick and place it just out of reach. Max strains in bondage as his hips jerk up, desperately reaching for release. Laughing at Max's predicament, Sebastian and Dominic decide Max needs a break from all the pleasure so they tickle him relentlessly! His laughs as they tickle his feet, armpits, and sides. But his laughs turn into moans as Sebastian licks between his toes and sucks on his feet and Dominic teases his erect nipples. Before he can blow his load, Sebastian and Dominic back off and tie him spread eagle. Now that his asshole is accessible, Sebastian teases it with his tongue before slipping different vibes into his tight hole. Max moans and almost cums immediately as Sebastian fucks him hard and Dominic jerks him off. His cock leaks with more and more pre-cum as he gets closer and closer to cumming. Finally, he is allowed to blow all over himself like the slut he is.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Max Adonis",
      "person_id": 61395
    }
  ],
  "release_date": "2018-09-04",
  "scene_id": 43635,
  "tags": [
    "BDSM",
    "Bondage",
    "Edging",
    "Feet",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling"
  ],
  "title": "In Home Entertainment: Captive Slut Max Adonis Edged, Fucked, Tickled"
}