{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The beautiful blonde MILF Cherie DeVille is a very hard worker. In fact this strong woman has worked soo hard on this last assignment for her boss, she did all the damn work. She has devoted all her important and valuable time to his company but patriarchy strikes again. Her boss, the devilishly handsome Mike Panic has just been promoted. Corner Office, view of the park, and nice big bottle of rye whiskey. This sleaze ball is riding high in his office, enjoying the perks and privileges of his gender, he is all that is man. And this asshole is about to get what he deserves. Cherie storms into his office, with a little secret. She is dressed in gorgeous lingerie and stockings under her work attire. She very easily seduces seduces this man with his stupid cock and stupid male hormones. As he strips down naked she handcuffs him and starts working on beating his ass. This man still thinks it's a game, but Cherie shows him her true reason for this beating. She has sent a link out to all Mike's employees over the company surveillance cam. And they are all watching and will know the truth. This feminist will never let this stupid misogynistic man be the boss of her. After a brutal beating in rope bondage, Cherie straps on a huge cock. Mike will learn how desperately his power clings to his privilege as he takes a hard anal fucking. This asshole needs to learn a few lessons and be taught how to of service to a woman. What value does this undeserving man flash have to offer? Can Mike offer up his mouth to her wet pussy and bring her to orgasm. Can Mike hold is cum in long enough to be fucked by Cherie. This man pussy has no control over his cock and begs to cum and is denied. Mike is edged until his throbbing cock is rock hard in pain. His hands are bound and he is at the whim of his new FemDomme. Cherie shatters Mike with brutal humiliation as she breaks through this glass ceiling. Finally Cherie is bored of this nasty man meat and offers the true humiliation of a ruined orgasm. This is truly a career retribution.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2018-08-14",
  "scene_id": 43637,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Discipline",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lingerie",
    "Male Sub",
    "MILF",
    "Nylons And Stockings",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight"
  ],
  "title": "Executive Discipline: Cherie DeVille Humiliates Her Boss Mike Panic"
}