{
  "collections": [
    "Bound Gods"
  ],
  "description": "Built slave Brian Bonds returns to serve the House, and Master Sebastian Keys is ready to put this tough slave to the test. Brian is put in chains and told to hold two buckets in his outstretched arms. Sebastian adorns Brian's nipples with weighted clamps and then adds additional weights to Brian's buckets. As Brian's arms waiver, Sebastian fixes a line of clover clamps along Brian's upper arms to help hold his arms up. Sebastian knows a slave like Brian won't crumble easily, so he breaks out the zapper. He zaps Brian everywhere until Brian is trembling. His whole body shakes as he struggles to hold his buckets up. Next, Brian is chained, blindfolded, and on all fours as he serves the house gimp. Drool leaks from his mouth as he deep throats the gimp's fat cock. The gimp fucks his face relentlessly as Sebastian uses a cat of nine tails on his exposed ass. Finally Brian is put on his back so the gimp can use his ass. As he gets pummeled by gimp cock, Sebastian puts closepins in between his toes on his feet. Then Sebastian brings out the zapper again to zap Brian's sensitive feet. Finally, Brian is brought to his knees and commanded to cum on Sebastian's boot. As he jerks his cock, the gimp stands above him, ready to cum on his face. Brian blows his load all over Sebastian's boot and then gimp cums all over his face. Brian cleans the gimp's cock off and then bends down to lap up his mess on Sebastian's boot like a good slave.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 33737
    },
    {
      "name": "Mason Lear",
      "person_id": 60275
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2018-08-09",
  "scene_id": 43633,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "Boot",
    "brunet",
    "Chains",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "drool",
    "Feet",
    "Gay",
    "Gimp",
    "Hairy",
    "Humiliation",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "Weights",
    "white",
    "Zapper"
  ],
  "title": "The Good Slave: Tough built boy Brian Bonds returns"
}