{
  "collections": [
    "Bound Gods"
  ],
  "description": "Max Adonis doesn't know how he's going to survive in prison. He narrowly escapes his first shower with his holes untouched. Luckily Max's bunkmate, Dominic Pacifico, is a man no one will mess with. Dominic offers Max protection for a price -- exclusive use of all his body and all holes. Max figures one cock has got to be easier to please than all those shower dicks. He drops to his knees to take Dominic's rock hard cock in his mouth. Dominic is horny as fuck and Max's sloppy wet mouth around his dick really gets him going. He holds Max in place as he fucks Max's pretty bitch mouth. Max chokes as Dominic rams him mouth and squirms as Dominic pulls up his underwear to spank his ass cheeks. Next, Max is ziptied to the bars in his cell. Dominic punches Max's chest, spits in his mouth, and slaps his cock around. He breaks out a rod to hit Max's cock and thighs. Max screams in pain and pleasure. Each hit makes him harder and harder. Once Max's front is tenderized, Dominic strings Max up by his wrists and has him dangle from the ceiling, defenseless and exposed. He spanks, flogs, and crops Max's cute little ass and decorates his belly and upper arms with unforgiving close pins. Max flails in bondage as he takes all the pain Dominic gives him. Finally Max tied in rope bondage with his asshole exposed. Dominic uses a violent wand to shock his cock, his asshole, and his feet. Max yelps as the wand is trailed around all his sensitive bits. After an electric warmup, Dominic sinks his monster cock into his bitch's asshole. Dominic pounds Max's ass over and over again until it's wide open. Max's ass gapes around the absence of Dominic's cock, hungry for more. Dominic then shoots his load all over Max's face before having Max cum on his feet and clean up his filthy mess.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Max Adonis",
      "person_id": 61395
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    }
  ],
  "release_date": "2018-08-02",
  "scene_id": 43632,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission"
  ],
  "title": "Hard Up Hole: Max Adonis gives up holes for protection"
}