{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Kink.com is proud to present the beautiful Aaliyah Love in her first Kink feature! As a manipulative bank robber, this seductress takes down Corbin Dallas, her hapless accomplice. After their heist, they sneak off to their hotel room where she breaks the bad news to him: all that money they just stole…is hers. Corbin begs her to let him stay by her side, but she’s made up her mind. He’s served his purpose. Still, using this guy could be amusing at the very least, so she puts him in his place with some humiliating spanking, fucking with a huge strap-on, fisting, clothes pins, and some biting, humiliating verbal. She starts by putting him in his place, so he knows she’s in charge. She berates him repeatedly, mocks his dick, spanks him and torments him. She shoves her beautiful ass into his face, smothering him just the way she likes it, then lays him on the bed, teasing his hard cock with her perfect pussy but refusing to let him have it. She then decorates him with clothes pins and slams the hugest strap on into his pathetic ass, but accommodating ass. Aaliyah pops those clothespins off one-by-one as she drives that strap-on into her witless sidekick. When he’s good and stretched, she props him up and fists his ass, turning him into her adorable little fuck puppet! Finally she rides his face, making him eat her perfect pussy until she cums. She lays her feet on his stomach and tells him he can now cum, and after he blows his load all over them, she makes him lick it up and clean them off. Aaliyah has now completely used Corbin up, and he has indeed served his purpose. She kicks him out, leaving her alone with the money she robbed from the bank and the pride she stole from Corbin.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aaliyah Love",
      "person_id": 61396
    },
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    }
  ],
  "release_date": "2018-07-31",
  "scene_id": 43636,
  "tags": [
    "Athletic",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Fisting",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Smothering",
    "Spanking",
    "Straight",
    "Strap On",
    "unshaved",
    "white"
  ],
  "title": "Aaliyah Love Takes Corbin Dallas to the Bank and Breaks Him"
}