{
  "collections": [
    "Whipped Ass"
  ],
  "description": "There's no mistaking that Ana Foxxx is one badass slut and in this update, her ass is on the line! Domina Helena emerges from the shadows clad in shiny latex, eager to see how much this little girl can take. Ana is gagged and on her knees, with her legs are tied open and her arms tied behind her. Helena flogs Ana's front and back to warm her up and puts clover clamps on Ana's nipples and labia. Ana giggles with anticipation as Helena brings out the cane. Her giggles turn to cries as Helena gives her a good firm caning on her thighs. Her legs tremble and she breaks out in a sweat. Helena moves to cane her perfect ass and Ana takes every stroke. She yells around the gag, spit trailing over her lips and down her chest. After Helena removes Ana's clamps, Ana cums hard. Next, Ana is suspended from one leg as Helena threatens her with the zapper. Once Ana has her instructions, Helena brings her down and puts her to work. Eager to avoid the sting of the zapper, Ana buries her face in Helena's cunt, using her tongue to pleasure her Domina. Ana's face gets sloppy wet as Helena rides her face and cums hard. Then, Ana is put on her hands and knees in thumb cuffs. Helena gives her a long hard spanking on her ass, paying extra attention to her shy asshole. She pushes her strap-on cock into Ana's pretty pussy and fucks it until Ana cums. After her orgasm, Ana works Helena's cock into her ass. Every thrust opens her ass up more, making her moan like crazy. Helena fucks Ana hard, before flipping her over on her back and fucking her some more! Ana cums hard with Helena's dick in her ass like the good slut she is.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    },
    {
      "name": "Helena Locke",
      "person_id": 59793
    }
  ],
  "release_date": "2018-09-27",
  "scene_id": 43649,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Caning",
    "Clover Clamps",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Latex",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Zapper"
  ],
  "title": "One Tough Slut: Helena Locke pushes Ana Foxxx to the edge!"
}