{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The lithe, sultry Mona Wales is giving a talk about her years of experience as a professional dominatrix. For full impact, she requires a volunteer, a man who will allow himself to be used in a demonstration of how all men have hidden submissive desires. Buck Wright is chosen to help Mona with her presentation, but he doesn't know exactly what he's in for. Immediately Mona put him in his place, urging him to the floor to massage her feet. He complies, almost without realizing he's doing it. Before long Mona has him naked on stage, obeying her every command as he sucks a huge dildo while taking a flogging in front of everyone. Next Mona puts her unsuspecting volunteer in a cage, and zaps his naked ass with a zapper, finger-fucks his hole, and continues to make him worship her feet. She eventually lets him out of the cage, then puts him on top of it, on his back, so she can get at his ass with her strap-on. She slides her cock into him, fucking him and humiliating him, taking his pride and resistance, and making him her little fuck toy. She then turns him around and makes him eat her pussy until she cums. She climbs up on the cage and straddles his face, then canes him as he makes her cum again. Finally, Buck is fully used, and Mona's point is made. All men have hidden submissive desires. it just takes a little effort to draw it out of them.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Buck Wright",
      "person_id": 61329
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2018-10-09",
  "scene_id": 43640,
  "tags": [
    "BDSM",
    "Bondage",
    "Cage",
    "CBT",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Kinky",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight",
    "top",
    "Zapper"
  ],
  "title": "TEDxxx: Kinky Ideas Worth Spreading"
}