{
  "collections": [
    "Whipped Ass"
  ],
  "description": "New to Kink.com, Noemie Bilas is a deceptively sweet, ebony beauty. But behind that cute smile is a hungry slut, desperate to be taken and used by an experienced, dominant woman. Cherry Torn works both of Noemie's insatiable holes, with anal strap-on fucking, dick on a stick, flogging, cropping, and spanking. Noemie takes it all, and begs for more! Cherry starts by inspecting Noemie, and she's pleased she looks like her profile pictures. She strips her, pinches her petite tits, then puts her over her knees to spank her perfect, round ass. Cherry spreads Noemie's pussy open, teasing her with promises of working her and fucking her if she behaves. She keeps slapping that beautiful ass, priming Noemie for all that's to come. She puts nipple clamps on Noemie, then pushes her pussy into her face, allowing Noemie the privilege to lick and eat it, building Cherry up to an explosive orgasm. Cherry puts Noemie back on the floor and crops her and finger fucks her while Noemie cums hard and squirts on the rug beneath her. Cherry then puts Noemie in a partial suspension with her ass out and legs spread, so Cherry can flog her beautiful body and slam a dick on a stick into her wet, squirting cunt. Noemie screams on it, loving it, wanting more, so Cherry lets her down and puts her back on the floor, where she can fuck her desperate ass with a huge strap on. Noemie can't get enough, and starts fucking herself on that dick, even in bondage. Noemie cums repeatedly as Cherry rolls her into multiple positions and fucks her ass, finally getting one last orgasm out of her by finger fucking her. Cherry leaves Noemie utterly spent, and soaked in her own squirt.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Noemie Bilas",
      "person_id": 61398
    }
  ],
  "release_date": "2018-07-19",
  "scene_id": 43643,
  "tags": [
    "Anal",
    "BDSM",
    "Black",
    "black hair",
    "Bondage",
    "Corporal Punishment",
    "Dominatrix",
    "Ebony",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Petite",
    "Pussy Eating",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Deceptively Sweet Noemie Bilas Utterly Surrenders To Cherry Torn"
}