{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Cherie DeVille already has one little kitten--the sexy, submissive Lydia Black--but she wants another. She places an order and receives Ryan Keely, a busty, buxom bombshell. Now she has two kitties to play with, and who will play with each other at her orders. First, Cherie wants to inspect her new plaything, so she lets Lydia out of her cage and puts a candle in her mouth, to add light to her inspection. Ryan has huge, ripe tits and a big hungry ass. Cherie pinches her huge tits and lets Lydia lick up the milk. So far the two new kitties are getting along beautifully! But Lydia begins misbehavin', so some punishment is in order. Cherie flogs Ryan's huge, beautiful ass, then stacks Lydia on top of her so she can get at both of their butts at the same time. Ryan proves to be even more willing and resilient than expected, enduring a pussy flogging and and intense finger fucking from Cherie. Cherie continuously reminds her kitty Lydia that THIS is exactly how she's expected to behave. But Cherie is temperamental. She puts her two kitties back in their cage the moment they begin to bore her. Then she climbs up on the cage and makes Ryan eat her perfect cunt, giving her orgasms multiple times. Ryan is then put in a full suspension, ass-up and face down, so Cherie can get as her wet, delicious pussy. She flogs Ryan, crops her feet, then pulls Lydia out of her cage to eat Ryan's beaten cunt. Cherie keeps the pressure on, flogging Lydia, finger fucking her and then eating her pussy. The two women explode into madness and orgasms, both of them wailing as they cum. Finally, Cherie wants to see her two kitties fuck. She puts a strap-on on Ryan, and commands Lydia to ride it and cum. Cherie eventually gets in on the action with her own strap-on, fucking Lydia's wet pussy while Ryan fucks Lydia's ass. Lydia goes wild on the DP, cumming like crazy. It seems Cherie finally has what she's always wanted, two willing, submissive pets who know their place.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ryan Keely",
      "person_id": 15370
    },
    {
      "name": "Lydia Black ",
      "person_id": 60714
    },
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    }
  ],
  "release_date": "2018-08-30",
  "scene_id": 43645,
  "tags": [
    "bdsm",
    "bondage",
    "cage",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "flogging",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "slave",
    "straight",
    "strap on",
    "suspension",
    "top"
  ],
  "title": "Playthings: Ryan Keely & Lydia Black Are Cherie DeVille's Willing Toys"
}