{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Kendra Spade has a fantasy she can't shake...to be controlled and handled by the indomitable Lea Lexis! Lea is a gorgeous brunette, and an absolute pro. She knows how to humiliate, dominate, and fuck until her sub utterly surrenders. And Kendra is ready for the challenge! The sweet submissive calls on Lea to take her down in an abandoned warehouse, and she happily obliges. Lea insults Kendra's clothing and demeanor, calling her \"little miss goodie two-shoes\" while slapping her naked ass and tormenting her slutty, hairy pussy. She puts a hood over Kendra's head, then takes her to a hotel room where she can further woman-handle her. She flogs her with the hood on, teasing and spitting in her pussy, then shoves a dick on a stick in her dripping cunt and fucks her. Kendra immediately surrenders to Lea, cumming repeatedly with spreader bars bound to her wrists and ankles. Lea continues to flog her, then sits on her face while sliding a vibrator on her pussy, making her cum even harder. As if this weren't enough, Lea pounds a strap-on in to Kendra's worn out pussy, slamming the orgasms out of her again and again. When Kendra's good and ready, Lea then shoves the strap-on into her ass, fucking her tight hole, and pounding the screams out of Kendra. Kendra continues to cum in rapid-fire, squealing and writhing on the bed, a complete slave to Lea's unwavering touch, until she's utterly spent!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kendra Spade",
      "person_id": 60694
    },
    {
      "name": "Lea Lexis",
      "person_id": 17836
    }
  ],
  "release_date": "2018-08-16",
  "scene_id": 43644,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Hairy",
    "Hood",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Slapping",
    "Slave",
    "Straight",
    "Strap On",
    "Sub",
    "Vibrator"
  ],
  "title": "Prime Punishment: Kendra Spade Opens Up To Lea Lexis' Intense Handling"
}