{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The adorable Isabella Nice is a cute young perky virgin and is in desperate need for a magic spell. Her boyfriend left her because she wouldn't sleep with him yet but now she is ready. She wanders into the lesbian witch store Mystic Hearts and is confronted by the devilishly dominating Chanel Preston. This boss witch is in charge and has her own plans for this cute virgin. Agreeing to do anything for the potion, Chanel snaps her fingers and casts her spells which tie up Isabella Nice in tight rope bondage suspension. She is stripped of her clothes and is revealed to have tight red underwear. Chanel wants to harness all of Isabella's virginity and knows it's best to get the virgin in a heightened state of fear and arousal. Stripped fully naked Isabella is whipped and caned, then caressed and fondled. Back and forth with pain then pleasure. Nipple clamps with the magic hitachi. This gets Isabella's tight young pussy dripping wet and plump. Perfect for harnessing all the virginity out of her. Isabella must also learn how to please her new Mistress witch and is made to suck and worship her feet, toes, and perfect stocking arches. Then Chanel sits on Isabella's face and makes her eat her delicious pussy. Of course Isabella does best when properly tormented, so Chanel brings out the electric zapper and zaps Isabella's body and pussy. Finally it is time to take Isabella's Virginity and Chanel straps on a huge black dildo and pounds the virginity out of Isabella. Every drop of this whore is fucked and bottled up. Of course Isabella still has one more virgin hole. Her sweet tight ass. Chanel delivers a deep and satisfying anal punishment and finally takes all this virgin has to offer.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Isabella Nice",
      "person_id": 61113
    }
  ],
  "release_date": "2018-10-25",
  "scene_id": 43648,
  "tags": [
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "dildo",
    "dominatrix",
    "Facesitting",
    "Feet",
    "femdom",
    "Fingering",
    "halloween",
    "Hitachi",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "nipple clamps",
    "pain",
    "Pussy Eating",
    "harness",
    "rope bondage",
    "slave",
    "straight",
    "strap on",
    "suspension",
    "Zapper"
  ],
  "title": "Virgin Lesbian Witchcraft: Chanel Preston Enchants Isabella Nice"
}