{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Pierce Paris works tirelessly on the taxes of his and his wife's, Dee Williams. Dee comes home happy to see her hubby. She tells him that she cant wait to have some alone time with him but Pierce pays her no attention. She exposes her big beautiful tits and strips down to her underwear to catch his eyes but he types away on his laptop. Now angry and horny, Dee texts her tennis instructor, Kip Johnson. She sends Kip a sexy photo and writes to him that she needs some dick. Kip comes over right away and Dee gets right to it. She pulls Kip's pants off and sucks his cock in front of her husband. Her husband Pierce finally looks up and notices his wife sucking some strangers cock. He gets mad but Dee explains that its his fault for not paying better attention to her and her needs. She tells Pierce that if he wants to make it up to her, he'd better suck Kips cock. Reluctantly, Pierce wraps his lips around Kip's cock and sucks it. Dee orders her husband to get undressed as she bends over their couch to let Kip lick her pussy from behind. She makes Pierce do pushups while she crops his ass. Next Dee applies clothespins to Pierce's ballsack and rips them off with her teeth. In the next scene, we find Pierce lying naked on his stomach with a ball gag in his mouth. Dee whacks him with a leather flogger while Kip jerks off in the background. She climbs on top of him and shoves her huge dildo in his ass and fucks him hard with her strap-on. She invites Kip to come fuck her pussy while her dildo is still buried in her husbands ass. After that, Dee puts her husband on his back and shoves both of his nuts up his ass. She enters his ass with her fist with his two balls and makes Pierce watch her get fucked. She comes hard from Kip fucking her and tells Pierce to flip around so that he can get a better view from underneath of her getting fucked. Dee asks for Kip to cum inside her and he blows his fat load up her pussy. Dee tells Kip to scram and pushes all of his cum onto Pierce's face hoping he's learned his lesson.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Kip Johnson",
      "person_id": 51603
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2018-11-06",
  "scene_id": 43642,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Bisexual",
    "Blonde",
    "Bondage",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Couple",
    "Crop",
    "Cuckolding",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "Humiliation",
    "Leather",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight",
    "Threesome",
    "top"
  ],
  "title": "Couple's Cuckold Conundrum"
}