{
  "collections": [
    "Whipped Ass"
  ],
  "description": "In this brutal and intense session between the relentless Aiden Starr and her eagerly willing sub London River, boundaries are met head-on, and the line between pleasure and pain blurs. London River can endure all sorts of punishment, particularly when trust is well established, and her trust in Aiden Starr is immense. Aiden takes London through a screaming session of pussy punishment, flogging, caning, cropping, spanking, pussy licking, anal strap-on fucking and anal fisting, all while London is bound and tied, unable to resist or get away. Aiden delights in overlapping pain with pleasure for London, leading her to the edge and then back from it, in the ultimate sexual tease. We open with London chained to a pipe device, while Aiden punishes her pussy with clover clamps, a vicious crop, and a punishing vibrator. London begs to cum, but she's not allowed to get off so easily. The tension builds as Aiden demands obedience and patience. Later, London is bound on her back, with her legs bent over her head as Aiden torments that pussy further, slapping it and masturbating it, then shoving a dick on a stick deep inside and making London lick it clean. London is flogged and caned, as her screams drown out Aiden's already powerful voice. Finally, London is anally fucked with a strap-on. Her ass gapes, her voice cracks. She's the epitome of used and abused, and loves every single stinging moment of it. Aiden shoves her fist in London's ass, and pounds her with it, slamming the crazy intense orgasms out of her in ways she never imagined she could cum. This is a session between a domme and sub that know each other well, that know their own desires and limits, and test them again and again.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2018-09-13",
  "scene_id": 43646,
  "tags": [
    "Anal Fisting",
    "bdsm",
    "bondage",
    "caning",
    "clover clamps",
    "Corporal Punishment",
    "crop",
    "dominatrix",
    "Facesitting",
    "femdom",
    "Fingering",
    "fisting",
    "flogging",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "pain",
    "Pussy Eating",
    "slapping",
    "slave",
    "spanking",
    "straight",
    "strap on",
    "vibrator"
  ],
  "title": "Screamer: The Intimate Torment of London River"
}