{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Frustrated and uptight in her day to day life, Julia Ann makes an appointment with hypnotherapist India Summer to get to the bottom of her issues. India guides Julia to a meditative state and is surprised to find that Julia's dominant side comes out to play! Julia takes India over her knee, lifts her skirt, and starts spanking her perfect ass. India is unsure what to make of these new developments but she soon gets hot under Julia's spell! Julia places binder clips on India's nipples and slips her fingers into India's pink wet pussy. India gasps as Julia licks her clit while ruthlessly fingering her cunt, ripping orgasm after orgasm out of her. Next, India is tied in doggy with a metal anal hook in her tight little asshole. Julia flogs India's back and ass, before toying with India's sensitive feet. India loves the feeling of the flogger on her ass and soon gets to pleasure her client. She licks and sucks Julia's pussy and ass as Julia cums all over her slutty therapist's face. Finally, India is in metal bondage and Julia straps on a thick fat cock to plow Julia's pussy. Julia whimpers behind her ball gag, as Julia fucks her cunt and threatens her with the zapper. Each thrust pushes Julia's cock deeper and deeper into India. After India cums hard, Julia turns her sights to her therapist's ass. India groans as her ass swallows Julia's thick strap-on. She begs to cum as her ass gets plowed first in missionary and then in doggy. Julia grabs India's ponytail, holding her slut in place while she gives her a deep hard fucking. India can't stop cumming and Julia doesn't want her to. She pulls her cock out and maneuvers them into scissoring, and they both cum hard all over each other.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Julia Ann",
      "person_id": 32896
    },
    {
      "name": "India Summer",
      "person_id": 16909
    }
  ],
  "release_date": "2018-10-11",
  "scene_id": 43647,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "bottom",
    "Corporal Punishment",
    "dominatrix",
    "Facesitting",
    "Feet",
    "femdom",
    "Fingering",
    "gag",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "metal bondage",
    "Pussy Eating",
    "Scissoring",
    "slave",
    "spanking",
    "straight",
    "strap on",
    "Zapper"
  ],
  "title": "Hot Under Her Spell: Julia Ann dominates hypnotherapist India Summer"
}