{
  "collections": [
    "Divine Bitches"
  ],
  "description": "At Joanna's boutique you can find a that special gift to spice up your love life. It is owned and operated by latex clad Joanna Angel who is always ready to give a great recommendation. Her charm and patience are tested when cheapskate Ruckus comes in looking for a gift for his girlfriend. Joanna shows him a few latex garments but soon realizes she will have to show him a piece that matches his budget. She recommends a latex thong and demands he put it on. Ruckus is hesitant but compiles. Joanna is immediately not pleased with the dull look of the latex thong so she shows Ruckus how to shine the latex with lube. She rubs the latex thong around his cock, but soon notices his cock is getting hard. Joanna didn't give him permission to get hard. So she makes him go to the ground and lick her boots for being cheap and for getting hard without permission. He licks her boots clean, then licks her latex to a shine as Joanna grinds her ass on his face. She then makes him lick her pussy and suck her clit as he begs for it. She puts him on the ground and rides his face until she cums hard. Joanna gets her way with him then suspends him and gives him a good pegging. Ruckus has no choice but to just take it. After giving it to him hard for being cheap, she gets her way with his cock. She uses him like a fuck toy and rides his cock until she cums over and over. Then she strokes his cock and gives him permission to unload on her boots. Joanna then makes Ruckus clean his big load off her boots with his tongue.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ruckus",
      "person_id": 48209
    },
    {
      "name": "Joanna Angel",
      "person_id": 61458
    }
  ],
  "release_date": "2018-10-23",
  "scene_id": 43641,
  "tags": [
    "bdsm",
    "bondage",
    "CBT",
    "Corporal Punishment",
    "dominatrix",
    "Facesitting",
    "femdom",
    "Fingering",
    "humiliation",
    "latex",
    "Male Sub",
    "orgasm denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight"
  ],
  "title": "Joanna's Boutique: Joanna Angel Takes It Out On Her Cheap Customer"
}