{
  "collections": [
    "Device Bondage"
  ],
  "description": "There are a lot of beautiful women in this world, and The Pope is one lucky SOB to be able to work with so many of them. This, however, is the first time that he's able to walk up to one of them and they can look him directly in the eye. At a towering six feet three inches this bitch is tall, and he can't wait until she suffers for him. She begins standing in heels, which now makes her taller than him. She is restrained by leather cuffs and chains that keep her tethered to the wall, and the battle of submission begins. She grins as soon as he puts his hands on her. She welcomes the suffering and is willing to fully submit to The Pope. She wants all of the feels, and will do anything to get them. After a brutal flogging, her nipples are clamped and then she is made to cum. Next she is in a predicament stress position. Steel traps hold her in place as a zipper is applied to her flesh. One is removed quickly and the other slowly for maximum torment. After that there is some extreme electric play that build up to raking her body with the cattle prod. In the final scene she is in a doggy position with her ass up high atop her long legs. Bastinado with a crop and cane, among the other usual suspects, instantly have Rocky on the brink of tapping out. Her legs are striped with cane marks before her pussy is filled and fucked. She has suffered in so many ways today, but the final will be non stop orgasms against her will until she can no longer take it.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Rocky Emerson",
      "person_id": 61399
    }
  ],
  "release_date": "2018-09-20",
  "scene_id": 43654,
  "tags": [
    "BDSM",
    "Bondage",
    "Cattle Prod",
    "Chains",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Feet",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Leather",
    "Leather Cuffs",
    "master",
    "Metal Bondage",
    "Pain",
    "Straight",
    "Submission",
    "The Pope",
    "the wall",
    "Zipper"
  ],
  "title": "She Smiles When The Pain Comes"
}