{
  "collections": [
    "Hogtied"
  ],
  "description": "Olive has a body that is the closest to perfection that we can think of. Her perfect perky tits and firm round ass, along with the face of an angel, makes for the perfect slut. The Pope incorporates some cold steel for him to use as way of tying her in brutal predicaments. She is held in a extreme squatting position with her legs spread wide. She squirms and struggles, but the ropes are tight and she is not going anywhere. Pins are added to her perky tits and then a blindfold to deprive her of her sight. The gag has her drooling, which makes her body glisten. Her mind and body have been overwhelmed with torment and now her pussy will submit as well as orgasms are drained from her pussy. The steel frame stays put and The Pope manipulates her body into another predicament that has her on her knees and her arms in a strappado. Her neck is covered in rope as well to pull her forward to ensure proper suffering. Clover clamps are added to her nipples and then weight. Again her face is leaking with drool that covers the ropes and floor. Her feet are subjected to brutal foot torment and caning. Again we see her reaching her limit as he brings her pussy to more orgasms. The day is closing, and instead of easing up, The Pope puts her in a grueling side suspension. She is tormented more until she is starting to come unraveled and then he makes her cum once more to finish her off.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Olive Glass",
      "person_id": 60453
    }
  ],
  "release_date": "2018-10-25",
  "scene_id": 43650,
  "tags": [
    "ball gag",
    "bdsm",
    "blindfold",
    "bondage",
    "caning",
    "clover clamps",
    "Corporal Punishment",
    "domination",
    "drool",
    "Feet",
    "Fingering",
    "gag",
    "Handler",
    "humiliation",
    "rope bondage",
    "straight",
    "submission",
    "suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Hot Bodied, All Natural Rope Slut Submits to Torment and Orgasms"
}