{
  "collections": [
    "Hogtied"
  ],
  "description": "We book Juliette for her Hogtied shoot, and within a few days she sends her ideas for the shoot to The Pope. This is not the usual way things happen, but she knows she has a special place under his boot. He decides that she is enough of a loyal slut, that he will accommodate her request. She has been allowed to choose what positions she will be tied in while he torments her. We begin with Juliette in an inverted hogtie suspension. He torments her nipples by pinching and then pulling her around. She is pulled and then all of her wight pulls against them which fills the dungeon with her screams of agony. Her pussy is flogged, then vibed, and then flogged again. This game continues for a sadistic game of tease and denial. We move into the next position which is a brutal predicament doggy. Her knees are pulled forward and her ankles pulled back. Her arms are spread out wide and her body is exposed to whatever The Pope wants to do to this slut. She is subjected to a brutal flogging on her ass and back, before she is allowed to orgasm again. In the final scene she is in a spread eagle on the floor. She is punished in multiple ways such as a severe caning, and extreme breath play while denying her orgasms. All she wants is for him to touch her and that alone is enough to make her cum, but for him to impose his will is why she is here, and why she keeps coming back.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Juliette March",
      "person_id": 22072
    }
  ],
  "release_date": "2018-11-08",
  "scene_id": 43651,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "caning",
    "Corporal Punishment",
    "domination",
    "dungeon",
    "Fingering",
    "flogging",
    "Handler",
    "humiliation",
    "pain",
    "pain slut",
    "predicament bondage",
    "rope bondage",
    "straight",
    "submission",
    "suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Pain Slut Juliette March In Predicament Bondage And Suffering"
}