{
  "collections": [
    "Device Bondage"
  ],
  "description": "We begin with our little goth girl in a stress position with her arms supporting her upper body weight and her legs are spread and in charge of supporting the rest. Remember as younger people, we were told that it was better to be seen and not heard? Well that rings truest with our sweet Rose, as she only emotes when it's necessary. Clothes pins are applied to her flesh, a blindfold is added to prevent sight, and then we begin the fun. She is flogged and then we add a crotch rope with a 12 pound bowling ball to assure her helplessness. We finish the first scene with some zaps of electricity before allowing this silent slut orgasms. Next we put her ass up in the air and go to town on inflicting pain and suffering. Her feet are caned and then bands are applied to inflict constant pain as needed by The Pope. Once he feels that she has suffered enough he administers more orgasms to make our goth slut sing in orgasmic bliss. In the final scene, she is shackled to our wooden table where The Pope attends to her flesh like a doctor to his patient. Every inch of her is taken into consideration and then the choice is made to make this slut scream. A full assault is made against her pussy with his fingers and a vibe to rip non stop orgasms from her pussy. She may have started as a timid goth chic, but she ends being a loud slut just like the rest of them.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Rose Darling",
      "person_id": 58632
    }
  ],
  "release_date": "2018-10-18",
  "scene_id": 43655,
  "tags": [
    "bdsm",
    "blindfold",
    "bondage",
    "clothespins",
    "Corporal Punishment",
    "crotch rope",
    "doctor",
    "domination",
    "electricity",
    "Feet",
    "Fingering",
    "Handler",
    "humiliation",
    "metal bondage",
    "pain",
    "straight",
    "submission",
    "The Pope"
  ],
  "title": "A Quiet Riot:Goth Slut Submits!"
}