{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When girl next door Pristine Edge rents out her spare room on Air B & B, she unknowingly allows sexual deviant Bill Bailey into her home. Bill offers to open the door to her desires, and introduces her to the sensual world of bondage, discipline, and submissive anal sex.\nBut before she takes to Bill's kinky deviant ways she is fully freaked out by what seems to be going on behind closed doors. She tells Bill his payment did not go through so they must try again with a different credit card. But Bill ushers her out of the room so he can settle in before taking care of business. Pristine reluctantly allows it but soon there are sounds of slapping, hitting, screaming in agony, moaning, what the hell is going on in there!? Ms Edge goes to find out and is surprised and then seduced by a room full of scary naughty toys and bondage videos playing on Bills laptop. Pristine's curiosity is brimming over and she admits it gets her hot to have a strange man in her house about to tie her up and fuck her! So Bill gives her the royal treatment by tying her to the bed arms spread tits bound up with rope with a ballgag and some tight nipple clamps. Introducing Bills new shiny Fuck Toy! First he stuffs her mouth with his rock hard cock slamming the back of her little throat making her slobber all over the place. She sucks his balls and deep throats his dick for a good long time until Bill pulls out the cropper and crops her thighs and tits and then gets her off with his hand and the Hitachi and makes her cum.\nThen on all fours in doggie tied up tight and going nowhere Bill shows her the ropes with the flogger and she likes it! She asks for more of an ass whipping and then Bill takes her to the edge with the vibrator again and gets her ready for his cock. He slides his long thick cock deep inside her little pussy and immediately loves it! Her pussy is so wet from all Bill's man handling she can't get enough. Then he preps her ass with a pretty dildo and vibes her clit getting her all worked up for a good ass fucking! First he fucks her pussy while plunging her ass with the dildo and then he stretches her ass out good with his hard cock. She is a good submissive anal sex slut and takes it nice and deep. Then stretched out spread eagle tied up on a table Bill teases Pristine with pleasure with the Hitachi vibrator . She wiggles and moans and arches her back and fucks the vibrator back cuz it feels so good. It drives her so crazy she begs for Bills cock again, I need you to please fuck me! So in tight rope bondage on her back with legs spread far and wide Bill pounds her tight little ass out until she is loosing her mind and Bill shoots his hot load all over her pretty face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Bill Bailey",
      "person_id": 46601
    },
    {
      "name": "Pristine Edge",
      "person_id": 58422
    }
  ],
  "release_date": "2018-09-07",
  "scene_id": 43666,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "dildo",
    "discipline",
    "domination",
    "Hitachi",
    "humiliation",
    "kinky",
    "nipple clamps",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slapping",
    "straight",
    "submission",
    "Vaginal Penetration",
    "vibrator",
    "whipping"
  ],
  "title": "Air B & B Fuck Toy"
}