{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Some sluts hate to be out of control, yet hunger to be treated like a piece of sexual meat. Therein lies the paradox of young, all-natural whore Jade Nile. She is used to being in charge and is coerced into being restrained in inescapable rope bondage and to worship a sadistic male dominant. She is brutally tied in a standing position with her arms pulled straight-up into the air in strappado. Her perfect firm ass is then abused with corporal impact play that leaves her defenseless butt throbbing red with pain from the severe hits of a leather flogger and giant man-hand spanking. But this only makes her tiny tight pussy creamy with delight. As her cunt is stimulated with a relentless vibrator, she is made to gag on a huge cock. Spit and drool chokes her throat as her mouth is face-fucked into gasping submission. She is then tossed like a fuck toy onto her back with her arms and legs bound together with coarse and nasty rope. She is utterly helpless as the male dom jams his massive cock deep into teeny pink pussy. She squirms in his grip but this only makes the taskmaster incensed and he shoves his long dick into the deep crevices of her hungry cunt. He pounds her relentlessly and as his huge dicks mashes, Jades pussy grows creamier and creamier from the delight of the painful fucking. She is then tied on her hands and knees, perched with her young ass presented in the air. Without any warm up the dom continues his pussy plowing onslaught and he fucks her over and over again until she is glistening with sweat and depraved sexual hunger. A hunger like hers can only be filled by jamming a cock deep down her throat until her she can barely breath. Jamming her whore hole repeatedly, her male dom works himself into a frenzy and then blows a massive load of jizz all over her face. Jade gobbles it all up like a greedy whore and whispers ceaseless thank-you's for the protein packed nourishment of his cum.",
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Jade Nile",
      "person_id": 57942
    }
  ],
  "release_date": "2018-11-21",
  "scene_id": 43660,
  "tags": [
    "bondage",
    "drool",
    "gag",
    "leather",
    "pain",
    "Petite",
    "rope bondage",
    "spanking",
    "straight",
    "submission",
    "vibrator"
  ],
  "title": "Jade Nile's Creamy, Tight Pussy Rope-Tied and Fucked Hard"
}