{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Some girls are simply starved and hungry for rough sex while being restrained in inescapable rope bondage. Megan Winters is just that sort of girl. She starts her day by laying flat on a table with her arms and legs pulled taut to the sides. Her perky natural tits are vulnerable and exposed to the brutal torment of severe nipple clamps. Her male dom abuses her fair skin with an evil electric zapper and then sets upon her with a heavy leather flogger. All the while a vibrator relentlessly stimulates her wet pussy. She grinds on the vibrator and begs to cum as the sadistic dom works the front of her body over. He jams his massive cock down Megan's throat while she squirts the first of her multiple orgasms. Her whole body quivers and shakes as her mouth gets faced fucked and gagged. Next she is tied standing in the middle of the room while perched on one leg. Her cruel taskmaster dives in and continues to torment her with impact play that utilizes a leather riding crop and bamboo cane. When her endorphins are running hot, the dom takes his huge rod and starts to fuck her pussy. She trembles and squirts all over herself and his big dick. Without missing a beat her handler throws her onto a couch and restrains her in doggy style with her round and firm ass perched in the air. He then continues to fuck her tiny pink pussy over and over again while spanking her ass until it grows red with delight. As the pain and pleasure intensifies she starts to have an orgasm that doesn't seem to end. And to finish her day, Megan gets tied to a table with her legs yanked tight up into the air, leaving her swollen and sensitive pussy exposed for further examination by a giant cock. As she gets fucked senseless, the dom chokes her thin neck and slaps her whimpering and innocent face. She begs to be fucked harder and harder until a massive load of cum is shot all over face. She licks every last drop up and whispers never ending words of gratitude for the attention that has been showered upon her.",
  "models": [
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Megan Winters",
      "person_id": 61468
    }
  ],
  "release_date": "2018-10-24",
  "scene_id": 43661,
  "tags": [
    "big dick",
    "bondage",
    "crop",
    "Handler",
    "leather",
    "multiple orgasms",
    "nipple clamps",
    "pain",
    "rope bondage",
    "Rough Sex",
    "spanking",
    "straight",
    "vibrator",
    "Zapper"
  ],
  "title": "Redheaded Girl Next Store Megan Winters Fucked in Brutal Rope Bondage!"
}