{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "In her own words, Vienna Black's sex life is plain and kind of boring. She is new to porn and has never been abused and objectified by a real male dom and tied in brutal and inescapable bondage. She is unsure about exactly what she wants, but she knows that there seems to be a deep and depraved void that lurks in the pit of her stomach. She is hungry, and her hunger is the kind that can only be satiated by rough impact play and coerced anal pounding by a big black cock. She starts her days tied to a Saint Andrew's Cross to learn the devotion needed to serve the desires of a depraved dom. Her taskmaster works her flawless and fragile body over with a heavy leather flogger and electric zapper. She whimpers and begs for mercy as the sting of electrical torment ravages her body. But she knows that her unwavering devotion will lead her to her promised reward so she endures like all greedy whores will in order to get what she wants. And a young pain slut like Vienna Black wants one thing and one thing only: gigantic throbbing cocks. Her dom flips her backwards and has her perch in a squatting position at just the right height so he can ram is massive dick into her tiny pink pussy. He has to use some effort to make it fit in her tight whore whole but once it slides in Vienna cums immediately. Her whole body quivers and shakes as the male dom relentlessly spanks and pounds her perfect ass. The bondage is tight and severe and holds her in place so he can do whatever he wants to his female sex slave. Out of breath and glistening with sweat, Vienna is then tied with her ass in the air and her face shoved to the floor. She begs to be fucked in the ass as she gags and chokes on the massive dick. And the dom is only too happy to stretch her inexperienced asshole. He brutally shoves his dick in and Vienna's body tenses and winces from the pain. \"It's too big,\" she wines, but the dom doesn't care and mashes his huge dick deeper into her painful asshole. He begins to slam her and she slowly slides across the room from the brutal anal fucking. To finish her day, Vienna is then tied to a table with her legs spread wide open. The anal torment continues and she cums again and again. Her multiple female orgasms make her shake with delight. She can only beg to eat her male task masters cum. And when she can't take another thrust of the massive cock the dom shoots a big load of jizz right into her face and eyes.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Vienna Black",
      "person_id": 60681
    }
  ],
  "release_date": "2018-11-07",
  "scene_id": 43662,
  "tags": [
    "Bondage",
    "Leather",
    "Pain",
    "Pain Slut",
    "Petite",
    "Rope Bondage",
    "Slave",
    "Straight",
    "Sub",
    "the pit",
    "Zapper"
  ],
  "title": "Petite Anal Whore Vienna Black Abused and Butt Fucked in Rope Bondage"
}