{
  "collections": [
    "The Training Of O"
  ],
  "description": "Applicant Profile\n\nAge:\n21\nSign:\nCancer\nHeight:\n5’5”\n\nFears / Current Limits:\nClaims to have ‘no real limits’ with the exception of no anal due to a very tight ass.\n\nStrengths:\nMulti orgasmic - after the first one, they continue to come in waves. Capable of orgasm from penetration alone. Very tough and determined girl.\n\nWeaknesses:\nSuperficial understanding of submission, channeling pain. Uses disobedience to get what she wants. Has trust issues. Cannot deep throat.\n\nExperience:\nHas worked with some BDSM web sites, no lifestyle experience\n\nCurrent Status:\nunowned\n\nInitial Observations:\nApplicant is in the first year of exploring BDSM. She is engaging and energetic. Primary coping mechanism is a tough physical and mental attitude approaching petulance. Fond of the phrase, ‘ Everyone know that the submissive is really in control’. Biggest challenge will be to break her bratty attitude yet foster her spirit.\n\nRecommendations:\nAssign filthy and demeaning tasks that directly challenge her expectations. Give her plenty of latitude to act out, inflame her anger, draw that brat out into the open. Cane and whip her to determine her reaction to corporal punishment. Test her ability to orgasm through penetration, tightness of her cunt, cock sucking ability with an eye toward improving her deep throat skills",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tawni Ryden",
      "person_id": 12435
    }
  ],
  "release_date": "2007-06-24",
  "scene_id": 4366,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Cop",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gag",
    "Gimp",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Slave",
    "Straight",
    "Submission",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "The Training of Tawni Ryden, Day One"
}