{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Penny Pax is confronted by her employer's security officer for suspected embezzlement of funds, she denies any wrong till she is cuffed, frisked and fucked by Stirling Cooper. Includes tight bondage, gags, nipple clamps, beautiful anal, deep throat fucking, zappers, vibes and all of Penny's favorite things.\nAfter tearing Penny's clothes off and frisking her big tits and sexy ass Stirling offers her a choice between going to prison or coming to a special agreement. Well Penny can't deny she is curious about what's going on inside Stirling's trousers so maybe just a quick blow job to find out. With hands cuffed behind her back and drool dripping down her tits Penny gets a deep sloppy throat fucking with Stirling's big hard shaft and Penny can suck cock like a champ. Wearing sexy fishnet stockings Penny is gagged and tied up perched on a stool with ass spread high in the air for easy access. He teaches her a lesson about stealing first with the flogger, then the crop and then his big dick! Stirling fucks Penny's puffy pussy and then slides it inside her tight ass for a deep pounding which she loves. Finally tied up on her back with legs spread wide open and clothes pins on her nipples Stirling zaps Penny's tits, sensitive pussy and thighs and gets her to admit she is a thieving slut! But the pain turns to pleasure when Stirling hammers both Penny's slutty holes one after the other with his grade A prime man meat until she is begging to cum. With the vibrator on her pussy and his dick pounding her ass she is loosing it but Stirling makes her wait which makes it all the sweeter when she can let it rip and Stirling shoots his white hot load all over Penny's pussy. Pleasure doing business with you Mr Stirling!",
  "models": [
    {
      "name": "Stirling Cooper ",
      "person_id": 61419
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2018-09-21",
  "scene_id": 43664,
  "tags": [
    "bdsm",
    "big dick",
    "big tits",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "domination",
    "drool",
    "humiliation",
    "nipple clamps",
    "pain",
    "role play",
    "rope bondage",
    "Rough Sex",
    "Stockings",
    "straight",
    "submission",
    "Vaginal Penetration",
    "vibrator",
    "white"
  ],
  "title": "Penny's Anal Embezzlement"
}