{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Stirling’s trophy wife becomes increasingly demanding, she learns the hard way how to ask properly for the things she wants. Includes orgasm inducing heavy flogging, bondage, hardcore sex, zappers, gags and table turning. Beautiful Ryan Keely wants some hot action but she doesn’t know how to ask her husband to fulfill her kinky needs. She pulls a sassy attitude on her handsome, sexy man Stirling Cooper which triggers him to turn the tables and give her what she really truly wants: Her husbands big hard cock stuffed in her slutty holes and lots of tight rope bondage, flogging, cropping and over the top orgasms. Stirling finds some porn videos on her laptop of the things she wants done to her so first things first – gagged and bound in spread eagle on the floor Stirling clamps his horny wife’s nipples and teases her with the zapper to get her warmed up. Meanwhile hot husband Stirling’s cock is getting nice and hard underneath his tight trousers. Ryan wants to suck his cock but he makes her work for it by keeping it just out of her tongues reach. She tries and tries and begs to have it and finally he slides his dick deep inside her mouth and gives her a good throat fucking while he pulls her hair and makes her choke and slobber in all the best ways.\nNow on all fours in hot doggie Stirling administers the motherlode of sensations to Ryan with the cropper, flogger and zapper on her sensitive feet, tender thighs and sexy ass. She can’t get enough of this corporeal punishment so she asks for more and more until she is so turned on she cums from the impact. Finally Stirling slides his cock inside Ryan’s wet and ready pussy, she is dripping and looses it when he starts pounding her cunt. On her back tied up with legs spread wide exposing her sexy pussy Mr Cooper torments her with the zapper until she is trembling and ready for more fucking. Sexy ass Stirling fucks the Nightmare out of his trophy wife and into a dreamy, steamy, screaming stupor until he shoots his massive load all over her tits.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Ryan Keely",
      "person_id": 15370
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2018-08-31",
  "scene_id": 43665,
  "tags": [
    "Athletic",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Flogging",
    "foreskin",
    "Humiliation",
    "Kinky",
    "Latinx",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Straight",
    "Submission",
    "top",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "Trophy Wife Nightmare"
}