{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\nProgress Review:\nPreviously in Day One, the trainee was pushed to defy her expectations and inflame her anger. She was given plenty of latitude to act out, and her hostility and resentment boiled over into viscous retorts, an inability to process pain, and a failed rope suspension scene.\nOn the positive side, she is extremely sexy. She does indeed orgasm from penetration and her cunt is so strong that it actually pushes a dildo out when contracting in orgasm. She is an excellent cock sucker and she actually becomes more pliable and submissive when being sexually used.\nTraining Goals:\nExpose the trainee to some degree of actual submission\nImpose a very basic protocol\nInstill a sense of respect\nImprove comfort with sensory deprivation\nImprove pain management\nRecommendations:\nThe challenge with this project is to retain / nurture her spirit while instilling a sense of discipline and respect.\nThe trainee suffers from a classic case of topping from the bottom and it affects her ability to fully immerse herself in submission.\nPut her into an interrogation setting and confront her on her attitude toward submission. Take away her ability to top from the bottom and 'tough it out'. Beware. While the consequences of stripping away one's lifelong defense mechanism is unpredictable, one thing that can be counted on is pain. Courage is required to survive such a test and she has it, but she needs to let go and allow herself to take a step towards trust.\nGive her a light sensory dep experience and flogging, followed up by a hard fuck in her tight pussy to evaluate the feel of that cunt tightening down around the cock when she is orgasming.",
  "models": [
    {
      "name": "Tawni Ryden",
      "person_id": 12435
    }
  ],
  "release_date": "2007-07-20",
  "scene_id": 4367,
  "tags": [
    "pain",
    "suspension",
    "flogging",
    "deprivation"
  ],
  "title": "The Training of Tawni Ryden, Day Two"
}