{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report, Final Day\n\nGoals Summary\n\n\nSubmission:\nOur trainee has come a long way from those first bratty, tentative days of training, and it’s fair to say that our trainee has learned what a good dose of submission feels like.\n\nProtocol:\nShe has an ingrained difficulty with authority, but she responds well to being placed under strict rules.\n\nSensory Deprivation:\nStill tentative but she has been exposed to full deprivation scenes.\n\nPain Management\nTrainee is not a pain slut but she does do well under the whip, responding with moans, whimpers, a wet pussy and a willing mouth.\n\n\nReview:\nTrainee is caged and fucked with a dildo on a stick to near orgasm, only to be met with a single tail whip scene that leaves her trembling, scared and totally turned on.\n\nShe is taken back to where she started, the filthy third floor bathroom, where we see a sexy, willing submissive performing in stark contrast to the bratty, unmannered little bitch from her first day of application. Topped off with a cock worship and cum eating scene, this trainee graduates from the curriculum having actually learned something about who she really is and what she is capable of.\n\nCongratulations Miss Ryden, you are a Good Girl.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tawni Ryden",
      "person_id": 12435
    }
  ],
  "release_date": "2007-09-21",
  "scene_id": 4369,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "Cage",
    "Cock Worship",
    "Corporal Punishment",
    "Deprivation",
    "Dildo",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Pain Slut",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Single Tail",
    "Slave",
    "Straight",
    "Submission",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "The Training of Tawni Ryden, Day Four"
}