{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Guess whose back? Our favorite sexy Latina Milf Becca Diamond. She is a staple here at Fetish Network and we doing everything we can to lure her back in the dungeon. She’s definitely one sex slave fun to dominate and challenge with new goodies. She’s introduced to our sybian fucking machine, a massive surprise for someone new to it. This time around, we have an interesting bondage device: a long piece of bamboo. It ends up pairing beautifully with rope. Becca is kept on the sybian with rope around her waist and legs. The bamboo is tied to her arms, keeping them up and spread, ties around her muscles and wrists. Our shiny Diamond is also treated with our first black Master and his big black cock. Becca struggles immediately to contain herself from all the orgasms it’s causing. She does squirt. Her Master pushes her hips down onto the sybian, clit pulsed with intense vibrations, making her ride it. He opens her mouth and makes her gag on his dick, making her give him a deepthroat blowjob. She loves big black cocks and worships it like a good sex slave should. Let’s see if she can take it up pass her meaty clit into her tight cougar cunt. Her Master keeps her attached to the bamboo, stands her up and ties the rope to the wall. He inspect his sex slave’s pussy and asshole, pleased to see pretty pink. Diamond gladly takes every inch of cock, rough and deep, begging for forgiveness for being a dirty whore. Her Master goes back and forth from mouth to pussy, pussy to mouth, using her spit as lube and making her clean his dick off her cum. He shoves his dick deep down her holes, making her moan and scream like a good slut should, pounding her in. Becca Diamond delivers another great performance. Stick around for more!",
  "directors": [],
  "models": [
    {
      "name": "Becca Diamond",
      "person_id": 55119
    },
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Steve Dash",
      "person_id": 61418
    }
  ],
  "release_date": "2018-07-26",
  "scene_id": 43698,
  "tags": [
    "BDSM",
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Deepthroat",
    "dungeon",
    "Fetish",
    "Gag",
    "Latinx",
    "master",
    "MILF",
    "muscular",
    "natural boobs",
    "Rope Bondage",
    "shaved",
    "Slave",
    "Straight",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "the wall",
    "Partner Studio",
    "versatile"
  ],
  "title": "Becca Diamond Returns for More Rope Bondage and BDSM Fucking"
}