{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Mean and sultry BDSM Mistresses Isa Mendez and Makinlee Marks have brought back sub slut Layla Price. She was such a obedient and strong sex slave, gladly taking everything she was given. Isa and Makinlee want more. That's all it takes around here for a lesbian domination threesome. Layla Price ends up on a crate, frozen in bondage, hands tied down by her side, legs kept open for the fucking machine Isa and Makinlee brought for their slut. They attached a thick long dildo to open her up. Makinlee enters the dungeon and flips on the machine while Isa introduces Layla to her big black strapon dildo again, deep down her throat, fucking her brain in! Makinlee raises the speed and joins Isa in feeding layla another 10\" big black rubber dick. The Mistresses take turns turning the nob up, distracting Layla from taking strapon cock face fucking. The machine is taken away, yet Layla is kept in place. Isa and Makinlee inspect their sex slave's pussy and asshole, pleased to see pretty pink. Their black rubber dicks bust her pink pussy wide open. Double penetration pushes her limits. She orgasms constantly. This curious girl, with her Mistresses training, is becoming a sex slave to keep around, following every order, taking every inch of cock, rough and deep. Layla's one problem is she didn't ask permission to cum, squirting all over herself. If she wants to cum, she'll cum over and over, one after another.",
  "directors": [],
  "models": [
    {
      "name": "Layla Price",
      "person_id": 48143
    },
    {
      "name": "Isa Mendez",
      "person_id": 53665
    },
    {
      "name": "Makinlee Marks",
      "person_id": 54405
    }
  ],
  "release_date": "2018-07-26",
  "scene_id": 43699,
  "tags": [
    "BDSM",
    "Bondage",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Lesbian",
    "Slave",
    "Squirting",
    "Straight",
    "Sub",
    "thirdparty",
    "Threesome"
  ],
  "title": "Fucking Machine Lesbian Domination for Layla Price with Isa Mendez & Makinlee Marks"
}