{
  "collections": [
    "Bound Gods"
  ],
  "description": "Leather men Pierce Paris and Blake Hunter stumble into the dungeon in a heavy make out session. Their muscles ripple and flex as they wrestle for dominance. Finally, Pierce gets the upper hand and slams Blake into the wall. Hand around his throat, Blake chooses to submit and opens his body to Pierce. Pierce dons leather gloves and feels Blake up, roughly grabbing him to feel all that hard muscle under skin. Today Pierce will find out how much Blake can take. He locks Blake into cuffs and crops his cock, belly, and chest. Then he tosses Blake to his knees, and makes him worship his cock through his leather pants. Blake eagerly licks Pierces leather, his rock hard abs, and triceps. Next, Blake is gagged and bound in rope with his arms suspended and his right leg elevated. Pierce flogs Blake hard on his chest, back, butt, and cock. Blake cries out in pain, drool leaking from around his gag. After Pierce is done tenderizing all that meat, he pulls Blake down to suck his cock. Blake takes all of it, choking, as Pierce fucks his face. Finally, Blake is blindfolded and tied down, giving Pierce deep access to his ass. Blake moans as Pierce fucks his tight hole and cries out as Pierce uses the zapper on his ass and back. Once Pierce has had his fill, he jerks off all over Blake's face and hoses him down.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Blake Hunter",
      "person_id": 61421
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2018-08-30",
  "scene_id": 43708,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "body builder",
    "Bondage",
    "Boot",
    "brunet",
    "Choking",
    "Corporal Punishment",
    "Domination",
    "drool",
    "dungeon",
    "Gag",
    "Gay",
    "gloves",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Submission",
    "switch",
    "the wall",
    "white",
    "Zapper"
  ],
  "title": "Beefcakes Pierce Paris and Blake Hunter Battle for Dominance!"
}