{
  "collections": [
    "Men On Edge"
  ],
  "description": "Brian Bonds is built for it! Brian's been putting in some time at the gym and it shows! He's bulked up and Sebastian puts all 205lbs of him in strict rope bondage. Brian is bound in a stress position, with his legs spread, knees bent, arms back, head down, and cock hanging. This stance leaves him completely open to Chance Summerlin, who gets down on his knees to swallow Brian's beautiful cock. He teases Brian's dick with his tongue before swallowing it whole. Brian gets hard in no time, fucking Chance's mouth with as much force as he can. Sebastian uses a fuck sleeve on Brian's length as Chance works the head. Next, Brian is gagged and bound to a St. Andrew's cross. Chance spanks his ass and pushes him back on a huge thick dildo. Inch by inch, Brian sinks back as his ass is slowly stretched open. As Chance jerks him off, Brian enthusiastically fucks the fat cock in his ass. He takes it all the way down to the knot at the base. Nothing makes Brian want to cum more than getting fucked with big dicks. But Sebastian and Chance aren't done with him yet. They clamp his nipples, and use a vibrating sleeve on his cock. Brian's rock hard cock gets even harder when Sebastian slips a fucking machine in his stretched hole. As Sebastian dials it up, Brian get more and more desperate to cum. Finally, he blows a fat load all over Chance's face. After he cums, Sebastian and Chance tease his sensitive cock and tickle him all over!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 33737
    }
  ],
  "release_date": "2018-09-18",
  "scene_id": 43705,
  "tags": [
    "BDSM",
    "Bondage",
    "Dildo",
    "Edging",
    "fucksaw",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Swallow",
    "Tickling"
  ],
  "title": "Built Boy Brian Bonds in Bondage takes Fat Toys, Tickling, Fucksaw"
}