{
  "collections": [
    "Bound Gods"
  ],
  "description": "Bound by metal, Zak Bishop waits for leather daddy Colby Jansen in darkness. Colby enters, ready to play with his new boy. He kisses Zak savagely, spits in his mouth, and licks his face, tasting his anticipation. Quivering and blindfolded, all Zak can do is take what is given to him. Colby rips off Zak's shirt, revealing toned muscle and flesh. He crops Zak all over chest, paying special attention to his nipples. Zak worships his daddy's crop, licking the warm leather responsible for turning his skin a bright red. Colby exposes Zak's big cock, and slaps it around as Zak shakes in bondage, unable to shield his sensitive meat. He attaches a ball parachute to Zak's balls and hooks it up to a rigged pulley system. At the other end of the pulley is a bucket that Colby adds weights to. With each additional weight, Zak's balls are stretched more and more. Zak's whole body quivers with tension as he struggles to relieve the pressure. But Colby doesn't make it easy. He tastes his boy's delicious cock and then flogs Colby's chest. Next, Zak is restrained on his knees. Colby uses the cane on Zak's tender ass, leaving nice red stripes across his bottom. As Zak's starts to react, Colby uses his dick to shut Zak up. He pushes Zak's head up and down on his cock, as he continues to cane Zak. Trapped between a rock hard daddy dick and a cane, Zak is hopelessly turned on. His drool coats Colby's dick. Colby grabs a flogger and continues to tenderize Zak's flesh, beating his back and his delicate feet. Finally, Zak is put and restrained on his back. Colby drips hot wax all over Zak's chest, arms, belly, feet, cock, and tongue. Zak sucks Colby's cock as Colby alternates between dripping wax and beating it off. Then Colby finally gives his boy what he's been craving -- a good hard fuck from daddy. He pummels Zak's asshole as Zak cries out in pleasure. Zak's been such a good boy all day, Colby rewards him by cumming all over his cock and ass.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Colby Jansen",
      "person_id": 34457
    },
    {
      "name": "Zak Bishop",
      "person_id": 61162
    }
  ],
  "release_date": "2018-08-23",
  "scene_id": 43707,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "drool",
    "Feet",
    "Gay",
    "Hairy",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "toned",
    "top",
    "unshaved",
    "Weights",
    "white"
  ],
  "title": "Daddy's Boy: Leather Daddy Colby Jansen dominates Zak Bishop"
}