{
  "collections": [
    "Bound Gods"
  ],
  "description": "Officer Michael DelRay waits impatiently in an open, empty jail cell. Officer Jeremy Spreadums is late for their meet-up to split the money that Officer Spreadums has collected. When Officer DelRay suspects that Spreadums is holding out on him, DelRay overpowers Spreadums and gets him into handcuffs. He tells Spreadums that he’s going to get his payment one way or the other. He unbuttons Spreadums’ shirt and punches his muscular chest. DelRay puts one hand over Spreadums’ mouth and with his other hand takes Spreadums’ pants down, grabbing and pulling at his cock and balls. DelRay cuts Spreadums’ underwear off, puts on leather gloves and slaps Spreadums’ hard cock. He slaps Spreadums’ thighs, gets on his knees and sucks his cock. In the next scene, Spreadums’ is completely naked, tied up and suspended horizontally to the jail cell bars. DelRay looms over Spreadums’ now with his shirt off, stroking his hard cock through his leather pants. He pulls out his hog and shoves it in Spreadums’ mouth and fucks his face while Spreadum’s dick drips with precum. Officer DelRay attaches electrified clamps to Spreadums’ nipples and turns up the voltage. He sits back on the bottom bunk mattress and strokes his big cock to the sounds of Spreadums in pain. In the final scene, Officer Spreadums is bent over in the cell with his head on the mattress of the bottom bunk with his arms tied with rope to the top bunk. Officer DelRay flogs his ass hard and Spreadums screams through the gag in his mouth. He stretches Spreadums’ ass out with his nightstick and then fucks him deep with his big cock. Officer DelRay then cuffs Spreadums to the bottom bunk and fucks his mouth till he shoots a huge load all over Spreadums’ face. He jerks Spreadums’ dick until he shoots his load, covering Officer DelRay’s leather glove in cum. Del Ray slaps him in the face with his cummy glove and reminds him to never come up short again.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jeremy Spreadums",
      "person_id": 61296
    },
    {
      "name": "Michael DelRay",
      "person_id": 61138
    }
  ],
  "release_date": "2018-09-20",
  "scene_id": 43706,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "Bound Prison",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "foreskin",
    "Gag",
    "Gay",
    "gloves",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "muscular",
    "Nipple Clamps",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Suspension",
    "top",
    "white"
  ],
  "title": "BOUND PRISON Part 3: Paying The Piper"
}