{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\nProgress Review: Previously, trainee was nervous and unable to maintain simple positions. She did endure a severe cane scene that will leave marks for the entire week and probably beyond, but needed to be tied down because she cannot hold position.\nOrgasm control was good when the vibrator was applied, and she begged very nicely to come. Coupled with the intense zipper scene, this opening took her to the edge of her endurance, providing clear access to the depths of her masochism.\nHooded and led through the halls to the shower room, her reactions were heightened considerably. Through near panic and disorientation, she was still able to beg to orgasm with a rubber cock filling her cunt and a hose beating down on her clit.\nCock sucking ability is good, but she needs to show more initiative and enthusiasm. Recommend applying electrics.\nTraining Goals:\nControl her orgasms\nImprove pain tolerance\nImprove her self control in being still\nExplore sensory deprivation\nInstill basic protocol\nRecommendations: Put her head in a box immediately. Restrain her with painful clips and cane her to break her of fidgeting / pulling away from her punishment. She must learn to stand still and present herself to the cane.\nTrain her to present her ass and fill her cunt with four fingers. Generously apply the vibrator and order her to stay still through an orgasm. Clip her labia to the platform if needed.\nOrder her to crawl on and off a leash to instill the senses of submission and burning humiliation. Apply electrodes to her ass and order her to suck cock between reciting filthy phrases. Send her back to crawl on all fours with her face covered in come before dismissing her to quarters for the evening to do her journal.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lorelei Lee",
      "person_id": 758
    }
  ],
  "release_date": "2007-06-26",
  "scene_id": 4371,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Deprivation",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Straight",
    "Submission",
    "top",
    "Vibrator",
    "white",
    "Zipper"
  ],
  "title": "The Training of Lorelei Lee, Day Two"
}