{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Matt and Rick in their different workplaces, Rick at his bar, Matt at his office. Slave Jeff works for Matt, in a middle-level position. He is asserting his authority over a cute new employee, Bill, a little more harshly than Matt likes. Once Bill leaves the office, Matt shows Jeff who's boss, making him strip and, at the snap of the fingers, crawl over, and suck Matt's dick. When satisfied, Matt removes a shoe and with a smack that leaves an imprint on Jeff's ass, sends him back to work. Rick has meanwhile had a phone chat with his housekeeping slave Gabriel, and calls Matt while Jeff is blowing him, to make plans for the evening.\nNight. At the Westchester house, Gabriel and Jeff, naked except for collars, boots and chastity devices, are doing the dinner dishes when Rick calls with instructions. The call over, the slaves gag each other. Later, when an alarm goes off as they're watching TV, Gabriel gives Jeff an enema, cuffs him and leads him by a leash to the dungeon where he locks him into standing stocks. Gabriel returns to the bathroom, gives himself an enema, and on his way back to the dungeon removes his gag long enough to put on a hood and regag himself. In the dungeon, where Jeff stands helpless, Gabriel chains an ankle to the stocks, cuffs his hands behind his back and lies down. Cut to Rick and Matt having a bite to eat in a New York City diner and enjoying themselves at the movies before returning to the house where, stripped down to chest harnesses and boots, they find Jeff in the stocks and Gabriel asleep at Jeff's feet.",
  "directors": [],
  "models": [
    {
      "name": "Jason Branch",
      "person_id": 61117
    },
    {
      "name": "Steve Ross",
      "person_id": 61118
    },
    {
      "name": "Aaron Tanner",
      "person_id": 268
    },
    {
      "name": "Jay Ross",
      "person_id": 61116
    }
  ],
  "release_date": "2018-08-07",
  "scene_id": 43719,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "buttplug",
    "Chains",
    "Chastity Play",
    "Domination",
    "dungeon",
    "Enema",
    "Feet",
    "Gag",
    "Gay",
    "Gimp",
    "Hood",
    "Leather",
    "Male Handler",
    "master",
    "Muscle",
    "Slave",
    "Stocks",
    "Submission",
    "Tattoo",
    "thirdparty",
    "Twink"
  ],
  "title": "Masters & Slaves 2- Playtime Part 1: A Day in the Life"
}