{
  "collections": [
    "Men On Edge"
  ],
  "description": "Muscle Stud Blake Hunter gets his body tied to the wall with rope wrapped around his biceps, wrists, and ankles. Wearing black leather gloves, a leather jock, a harness and a full-face leather mask, Blake struggles and grunts, looking like a captive muscle bound monster. Sebastian Keys And Chance Summerlin slowly enter the room and begin teasing Blake’s cock. Chance gets to his knees and huffs and licks Blake’s cock through the leather jock while Sebastian plays with Blake’s rock hard nipples. They rip off the leather cod piece, releasing Blake’s hard cock and place a strong vibrator up to the sensitive head of his dick. They apply clamps to Blake’s nipples and jerk his hard cock till he begs to cum. Chance lubes up a see-thru stroker and jerks Blake’s cock with it. Next they place Blake on his back, completely naked on a metal bed frame with a black ball gag in his mouth and his legs spread-eagle. Blake’s whole body is tied up with rope. Chance sinks a finger into Blake’s tight hole and presses it against his prostate while getting jerked off. Sebastian grabs more black rope and ties Blake’s balls to his toes and tickles his foot, making Blake tug on his own balls each time he kicks. Sebastian deep throats Blake’s foot and licks all of his toes while Chance jerks Blake’s cock. Sebastian gets a dick-on-a-stick and plunges it into Blake’s asshole while Chance works on his cock. Next they tie Blake down completely on the metal bed frame, his cock and balls wrapped up in rope, also tied to the bed frame. Chance jerks Blake’s hard dick and sucks his nipples until Blake blows a huge load leaving cum dripping out of his cock’s piercing hole.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Blake Hunter",
      "person_id": 61421
    }
  ],
  "release_date": "2018-10-02",
  "scene_id": 43711,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "body builder",
    "Bondage",
    "Edging",
    "Feet",
    "Foot Worship",
    "Gag",
    "Gay",
    "gloves",
    "jock",
    "Leather",
    "Leather Gloves",
    "Male Handler",
    "Male Sub",
    "Mask",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "harness",
    "Rope Bondage",
    "Stud",
    "the wall",
    "Tickling",
    "Vibrator",
    "white"
  ],
  "title": "Blake Hunter: Trapped on the Edge"
}