{
  "collections": [
    "Hogtied"
  ],
  "description": "Liv is a sexy little slut with an ass to die for. Everything about her is sexy as fuck, but her booty is insane. We begin with her standing and her arms above her head. The Pope enters and starts manhandling her, and she is completely turned on by his sadistic touch. She hasn’t shot with him in a few years and has been counting the days until she was reunited with her master. The torment begins and she embraces every strike she receives. Her nipples are clamped and then tormented before her legs are pulled away and she is now suffering in a suspension. Her pussy is fucked and she screams through her first of many orgasms. Next she is hoisted into the air in an inverted suspension that has all of her weight hanging from her hips. Her ass is accentuated by design with this intense suspension that makes her curves shine. Her ass is the main target of The Pope as he rains down a full blown assault on her perfect ass. Her screams change to a tone that he knows all to well, which means it’s time to switch to orgasm so he doesn’t break his toy. In the final scene she is on her side with one leg tied to a column and her hands over her head. Her feet are subjected to a brutal bastinado session and then her mouth and pussy are fucked into submission. She is one of his toys/bitches, and she wouldn’t have it any other way.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Liv Revamped",
      "person_id": 61457
    }
  ],
  "release_date": "2018-12-06",
  "scene_id": 43728,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "master",
    "mixed",
    "natural boobs",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "switch",
    "The Pope",
    "toned",
    "Vaginal Penetration"
  ],
  "title": "Sexy Latina Liv Revamped Captured and Tormented in Grueling Bondage"
}