{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\nGoals Progress:\nOrgasm control is very good, always asks permission\nPain tolerance - she reacts beautifully to being hit and her tolerance is good\nSelf control is improved but she still fidgets quite a bit.\nSensory deprivation is difficult and we may have to abort this goal\nProtocol - very sexy when she says 'thank you, sir' and seems to get off on restricted eye contact.\nProgress Review: The head box in Day Two freaked her out. It was clear right away from her responses, respiration and body language that she was having a hard time with it. There was a battle going on inside the box that we simply were not privy to. Once out, she was in a light state of shock, but after some downtime we resumed training to good effect.\nShe was determined to succeed in the BJ scene and once permission was given she worked the cock and balls like a sex starved slut. She was very enthusiastic and effective - an excellent cock sucker.\nRecommendations: Invade her quarters and run her through a primal bondage fuck scene that leaves her begging to cum.\nTurn her loose with another dominant to see how she performs. Capitalize on her sexy and charming demeanor by putting her in [REDACTED] girl setting and make her read erotic fiction for us while she gets fucked in the pussy, ass and mouth. Keep it light and amusing.\nGive her another test in sensory deprivation by bagging her and hanging her in the basement. Beat her with whips and fuck her face till she spasms in convulsing orgasms at the end of the magic wand.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lorelei Lee",
      "person_id": 758
    },
    {
      "name": "Steven St. Croix",
      "person_id": 12188
    }
  ],
  "release_date": "2007-07-27",
  "scene_id": 4372,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "deprivation",
    "discipline",
    "female slave",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "straight"
  ],
  "title": "The Training of Lorelei Lee, Day Three"
}