{
  "collections": [
    "Hogtied"
  ],
  "description": "This is exactly why Kink.com's Hogtied is the premiere place to find the best bondage, domination, and torment on the internet. Kissa Sins is one of the most sought after models right now, and she has petitioned to be dominated and tormented by The Pope on Hogtied. This is not gong to be an easy day for our newcomer, but she didn't sign up for snuggling; she wants to suffer for him. We begin in a standard standing position, but it quickly turns into a brutal predicament as her neck is tied one way and her body is pulled the opposite way. One of her legs have been pulled up as well to expose her dripping wet pussy to The Pope. It is very obvious that she is the real deal, and is here to suffer like a pro. From the domination to the orgasms this slut is going to give it her all. Next she is pulled up into a brutal single knee suspension. Kissa matches all of The Pope's energy with her own intensity. Everything that happens on this shoot has one of the highest levels of intensity in Hogtied history. The torment is brutal and Kissa begs for more as she is put through her paces by her new found master. The day is wrapped up with her on her back and legs spread wide. Her pretty face is covered up to make her suffer through sensory deprivation. Her feet are destroyed with brutal bastinado, and her mind is warped from the sadistic torment from him. The day is over and Kissa now knows why she came to The pope and will crave his touch from now on.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kissa Sins",
      "person_id": 61456
    }
  ],
  "release_date": "2018-11-22",
  "scene_id": 43727,
  "tags": [
    "ball gag",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "deprivation",
    "domination",
    "Feet",
    "Fingering",
    "Handler",
    "humiliation",
    "master",
    "rope bondage",
    "straight",
    "submission",
    "suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Kissa Sins is Dominated in Grueling Bondage"
}