{
  "collections": [
    "Device Bondage"
  ],
  "description": "Every day is new beginning and today is the one the begins Kristen’s first time on Device Bondage. She has proven herself on Hogtied in recent months, but this is a different dance that she has to do. The devices are rigid and unforgiving and the sense of total helplessness is immediate. She is standing with her body weaved into the first device that sticks her ass out and makes her arch her back. Even her pretty face is in bondage with a leather head harness gag. The Pope towers over his prey as the torment begins with a vicious flogging to her flesh. He has his way with her until she has earned her first orgasms. The second scene opens up with Kristen atop a wooden tale and restrained in a steel scavenger’s daughter. Her neck, wrists, and ankles are all secured in cold steel keeping her in a fixed sitting position. A blindfold is applied to take away her sight so that the game can begin. The Pope quietly moves around the dungeon and shocks her with an electric zapper. Some fear play thrown in for good measure before he assaults her pussy with a vibe for more orgasms. We can’t finish the day without seeing her perky ass, so she is bound in a doggy position. Her flesh is striped with a cane before she is stuffed with a large metal hook. She endures more orgasms against her will until he has had his fill of this little slut.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kristen Scott",
      "person_id": 60734
    }
  ],
  "release_date": "2018-11-29",
  "scene_id": 43726,
  "tags": [
    "BDSM",
    "Blindfold",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Fear Play",
    "Fingering",
    "Flogging",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "harness",
    "slim",
    "Straight",
    "Submission",
    "The Pope",
    "white",
    "Zapper"
  ],
  "title": "Beauty and The Beast: Kristen Scott vs The Pope"
}