{
  "collections": [
    "Device Bondage"
  ],
  "description": "Lisey is a sexy slut that loves to have massive things shoved in her slutty ass. She is also a big fan of being helpless in strict bondage. The day is going to be a day filled with inescapable bondage, brutal torment, anal fucking, and squirting orgasms. The way it unfolds in in the hands of the most twisted fucker we know, The Pope. He unleashes his diabolical sadism on her and she quickly sees that things are going to go his way, and not hers. This self proclaimed whore in a standing position with her arms pulled high above her head and held there with leather medical restraints. The Pope enters and begins to toy with his new pet. After some pinching and probing, he decides that it's time to flip this whore over and get her ass in the air. She claims to be able to take massive toys in her accommodating ass, so he puts her to the test. Now that her ass is up the test begins and after moments of pounding her slutty ass with a large toy, he ups the ante and goes even bigger. She seems to be capable of what she says, so the only viable next step is putting his massive fist up her ass. After some intense attempts, her ass couldn't take it, so we move on to the next position. Now she is on her back and her legs pulled down and out to expose her holes for more penetration. She suffers through brutal bastinado before her ass becomes the center of The Pope's attention. He launches one final attempt to fist her ass, and although he didn't get his entire fist inside her slutty ass, he did manage to make her have squirting orgasms. We'll take that all day!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lisey Sweet",
      "person_id": 60674
    }
  ],
  "release_date": "2018-11-01",
  "scene_id": 43725,
  "tags": [
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "Sadism",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope"
  ],
  "title": "Squirting Slut is Anally Violated"
}