{
  "collections": [
    "Strapon Squad"
  ],
  "description": "The hot and horny pain slut Aryah May told us she wanted another go with her BDSM Mistresses Brooklyn Daniels and Mila Blaze. This lesbian domination threesome is definitely one of hottest on Strapon Squad. Aryah left with a gaping pussy, completely drained of any vaginal fluids, squirting constantly thanks to Brooklyn. If she wants another round, no problem! Aryah May is pulled into the dungeon and tied to a crate, bent over and ass up. Oh, and neck up. Her throat will be fucked deep throughout with the infamous black strapon dildos. They seem to get bigger every session. They warm her pussy up with a vibrator, rubbing it hard against her pretty little slit. It's tightened back up, yet it won't last for long. Brooklyn grabs a dick on a stick and lubes it up to slide in and out of Aryah, giving it to her rough, pounding in fast. A handle for a dick is quite the sex toy. Of course big black rubber dick driven on the hips of our Mistresses is the real challenge, one down her throat, the other up her pussy. Aryah definitely feels them, slobber pouring out of her mouth, squirting constantly. She loves it, especially when they flip her around and continue the double penetration, taking turns on her holes and using the sex toys. They even zap her with the electro wand, tensing her up for more pounding. Pussy juice streams out of this pain whore every time she's in bondage. That's what we want!",
  "directors": [],
  "models": [
    {
      "name": "Aryah May",
      "person_id": 56681
    },
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    }
  ],
  "release_date": "2018-08-09",
  "scene_id": 43737,
  "tags": [
    "BDSM",
    "Big Ass",
    "Blindfold",
    "Bondage",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Electrical Play",
    "Female Slave",
    "Femdom",
    "Fingering",
    "Gaping",
    "gloves",
    "Hitachi",
    "Leather Belt",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Pain",
    "Pain Slut",
    "Piss Play",
    "Fluids",
    "Slave",
    "Speculum",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration",
    "Vibrator",
    "Zapper"
  ],
  "title": "Sex Slave Aryah May is Used & Wrecked by Mila Blaze & Brooklyn Daniels"
}