{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Daisy Stone dumps her live-in boyfriend Tommy Pistol, Tommy breaks into the house to save their troubled relationship with BDSM and hardcore anal sex! The only way Daisy wants her anal sex is if someone takes her ass! She likes it rough and she thinks Tommy is just too nice to get the job done. Before breaking up with him Daisy is having a good ole' time pleasuring herself in her bedroom with a glass ass dildo until Tommy barges in on her and wants to get in on the action. He is so happy to see her interest in ass play but Daisy bursts his bubble pretty quick and tells him it's over. Poor guy Tommy is kicked the fuck out and Daisy finishes herself off with the vibrator. When she goes to shower Mr Pistol breaks back into the house to show Daisy what a nice guy he really is. Taken by complete surprise Daisy tries to escape the hands of her captor but she ends up in tight rope bondage in doggie position with a ballgag stuffed in her mouth begging to be set free. Tommy spits on her, punishes her with the flogger, zapper and spanks her little butt until its bright red. His dick goes way down into Daisy's throat for some deep throat cock sucking. She is getting his hot rod nice and wet for the ass fucking that is to come. Now that his dick is hard and wet and ready he slides it in Daisy's tight ass and fucks her good and she fucks him back stretching her butthole out with every thrust. She arches her back and offers her ass up to Tommy, Mr. Not So Nice after all, but that is exactly what she wants and she wants it even harder! She cleans her ass off his cock and then he fucks her pussy and drives her crazy then back in her ass. On her back with wrists tied to ankles Daisy is wide open for business. Tommy pounds both her slutty holes making her ooze with creamy cum and then Mr Nice Guy shoots his steamy load all over her pretty face. Nice!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Daisy Stone",
      "person_id": 61519
    }
  ],
  "release_date": "2018-10-12",
  "scene_id": 43732,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Humiliation",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Vibrator",
    "Zapper"
  ],
  "title": "Breaking Up Is Never Easy"
}