{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Carmen gets busted for smoking weed in a private park by a fake cop, she finds herself in a jail cell tied, whipped and fucked by the long dick of the law. Carmen Caliente's hot ass is busting out of her shorts as she saunters through the park smoking her vape pen when \"Park Enforcement Agent\" Charles Dera spots her and decides to investigate. And he does quite the thorough examination of his suspect when he bends her over a picnic table and inspects every part of her sexy body for weapons. After threatening to call her Dad and tell him about what she is up to she begs him not to make the call and goes along with his plan. Back at his private dungeon Carmen is tied up and chained to the bars of a jail cell. Charles puts tight nipple clamps on her firm natural tits and stuffs his cock down her throat to start his rehabilitation process with this derelict member of society. Carmen can suck cock like a champ and starts enjoying herself with some deep throat sloppy slobbery dick sucking. She jacks his cock with her bound hands and her long sexy fingernails look hot stroking him off. Then in tight rope bondage on all fours with back arched Charles whips her with the flogger and licks her tight little pussy getting her ready for his hard dick. He fills her slutty pussy up with his long dick of the law and pounds her out real good until she cums hard and leaves her wanting more more more! Tied up on her back with legs spread open her pussy is front and center and ready to be fucked. But first Mr Dera gives her a thrill with the zapper and the hitachi until she is on the brink of cumming but no not yet, he denies her the pleasure and then stuffs her cunt full of his massive cock and fucks her out until he covers her with his white hot man jizz.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Carmen Caliente",
      "person_id": 54927
    },
    {
      "name": "Charles Dera",
      "person_id": 59597
    }
  ],
  "release_date": "2018-09-28",
  "scene_id": 43730,
  "tags": [
    "BDSM",
    "bestof2018",
    "Blowjob",
    "Bondage",
    "Cop",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Hitachi",
    "Humiliation",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Smoking",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "Bad Girl Detention"
}