{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Dr. Pistol has problems getting his wife Alana Cruise to agree to anal sex, he ties her up and holds her captive in the closet while he concocts an Anal Love Potion for his reluctant love. Alana's loving husband is merely trying to unlock her deepest darkest desires, desires she doesn't fully realize that are lurking just beneath the surface. If the magic potion works she will soon discover she wants her ass filled with Tommy's hard cock and fucked good, so good in fact it will change her life forever. Tied up and gagged in the attic sexy brunette Alana twists and wiggles against the rope binding a vibrator to her pussy. A pretty blue butt-plug prepares her ass for Tommy's ass treat. After the anal love potion is administered her body must be highly stimulated so Tommy whips her with the flogger and spanks her firm ass until it turns pink. Once the love potion kicks in Alana is begging Tommy to please fuck her in the ass!! First a deep throat cock sucking is in order, Alana takes his dick deep into her throat, her cute tits with big puffy nipples are framed in rope and bounce around as she swallows his cock. Alana and her hot ass can't wait any longer, so tied up tight on her knees Tommy slides that dick right inside his wanton wife's ass and gives her a taste of the good life! She loves it immediately and wants more more more! He stretches her ass out so its gaping and she begs for him to put it back in. Some flogging on her sensitive skin makes the new sensations so much better and then the Hitachi is added to the mix and it's blowing Alana's mind. This is her new favorite thing. Still bound up tight but on her back Alana's legs are spread wide open featuring both her slutty holes wet and ready for pounding. Tommy teases her with the zapper and then fucks her pussy. He attaches little clamps from her clit to her tongue and gets her off real nice but she wants it back in her ass for more of that good butt-lovin'. Tommy is happy to please his wife and her new interest in anal sex so he hands her the vibrator, stuffs her ass full of his cock and drives her home to Pistol pound town! As the vibrator is vibing her pussy he chokes her while he fucks her ass and Alana cums deep and hard over and over again until Tommy can't hold his load and shoots it all over his wife's anal sex loving face! That crazy Anal Love Potion really did the trick!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Alana Cruise",
      "person_id": 60194
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2018-11-02",
  "scene_id": 43735,
  "tags": [
    "BDSM",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gaping",
    "Hitachi",
    "Humiliation",
    "Latin",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "Anal Love Potion"
}