{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Fetish Network presents one of our favorite hot porn sluts, Asian beauty Mena Li. She tries to be modest, yet she loves worshiping every dick she comes across. Here on Sexual Disgrace, she knows she will. A beautiful and sexy woman like this deserves a rope bondage session with multiple orgasms. Li is left on the floor, arms tied behind her back with tight rope. It seems she's nervous. Great! She swears she has incomparable deep throat and pussy swallowing talents. When she sees the huge dick her Master pulls out his pants, she's ready to endure her slave training. She's deep throat-ed within seconds, skull fucking her the way he likes: rough, deep, fast with face slapping. He throws her around, climbs on top of her and shoves his pole for more spit. He slaps her tits and wants to hear her say what a dirty whore she is and beg for more. It takes a few slaps and throat pounding to get it out of her. He finally pulls her on the the couch and slips in a few fingers inside her wet pussy. Do you think her pink can withstand his cock? She must. He fucks her in the missionary position, legs on his shoulders and blindfolds her so she can't see his dick go deeper and grower harder in her cum hole. He flips her over and continues fucking her doggy style. He spanks her bubbly ass, yanking on the rope, making her cum over and over. Mena Li was made for rough sex. She's endured this session professionally. With more work she can be the dream submissive for domination.",
  "directors": [],
  "models": [
    {
      "name": "Joey",
      "person_id": 61472
    },
    {
      "name": "Mena Mason",
      "person_id": 53759
    }
  ],
  "release_date": "2018-08-10",
  "scene_id": 43736,
  "tags": [
    "Asian",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Deepthroat",
    "Domination",
    "drool",
    "dungeon",
    "Facefucking",
    "Female Slave",
    "Fetish",
    "Hitachi",
    "Male Handler",
    "master",
    "multiple orgasms",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Slave",
    "Straight",
    "Sub",
    "Tattoo",
    "thirdparty",
    "top",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Mena Li Keeps Coming Back for Rope Bondage & Rough Sex"
}