{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When 18-year old April Aniston finds herself behind bars, she clings to Seth Gamble to get out. But Seth takes April to his own twisted halfway house where breaking the rules ends in April's strict Anal Punishment! Seth takes April into his custody and makes her strip down in the jail cell so he can stuff a blue gem butt-plug in her ass to prepare her for anal rehabilitation! First she pulls off her top to reveal her cute natural tits and then her super short cut offs and her pink panties to show Seth her firm round of age teenage ass. She spreads her ass cheeks up against the jail cell bars and in goes the butt plug. When he takes her back to \"Choices Rehab\" facility (his house) April gets tied up, gagged and the rehabilitation begins! Punishment and discipline with the flogger moves into vibrational therapy on April's wanton 18 year old pussy with the Hitachi. Seth tightens on nipple clamps and then fucks her good with his hard dick. Then Seth stuffs his cock in April's mouth for some deep throat sucking and gagging. After this preliminary treatment he is ready to introduce his famous anal therapy in the form of some hardcore ass fucking. Back and forth between her mouth and her ass April likes it and begs to come. Onto the next position April is on her back with legs tied to her wrists and spread open for more rehab. From ass to pussy and back to her tight ass Seth pounds Aprils holes nice and deep with the conviction of a good therapist. Cock plus vibrator takes April to the edge again and again until she is finally allowed to cum and Seth blows his hot wad all over her pretty, rehabilitated face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "April Aniston",
      "person_id": 61520
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2018-10-26",
  "scene_id": 43733,
  "tags": [
    "18-Year-Old",
    "April",
    "BDSM",
    "bestof2018",
    "big dick",
    "Blonde",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Hitachi",
    "Humiliation",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Stud",
    "Submission",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "18 Year Old Anal Rehab"
}