{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Stirling is chased by immigration cops, he resorts to a home invasion to hide out and coerce Lola Fae to become his new wife of convenience. Petite red head cutie Lola is resistant at first but soon realizes being the \"wife\" of Stirling definitely has benefits i.e.; big hard cock fills tight slutty holes right up and takes her to heavenly poundtown all day long. Tiny, slim and trim Lola wears a little pair of black panties and sexy red high heel shoes while she is gagged, clamped and all strung up in rope while Stirling informs her of the marriage papers she will soon sign. She is not sure yet if she likes this proposal so she twists and gyrates with unease trying to escape the bondage. A bit of choking, spanking and a lot of flogging will whip Lola into shape and the strong vibrations from the Hitachi on her pussy take her to the edge of cumming and make her more agreeable to Stirling's demands. Now on all fours still wearing her sexy heels Lola is in doggie tied up to a chaise lounge. Her lean body is lithe, back arched and a glass butt-plug prepares her ass for what is to come. This slut is hot and horny and before she even touches Stirling's cock she squirts all over the place just anticipating what he is going to do to her. Mr Cooper makes her beg for his cock as he uses the zapper to tease and shock his soon to be little wifey into submission. Finally he slides his hard dick deep inside her small mouth and gives her a proper throat fucking sucking slobbering gag fest. He can't wait any longer to get inside Lola's tight wet pussy. His thick cock barely fits inside her little cunt but he breaks her in, stretches her little hole and some hardcore fucking ensues. Lola loves it and can't get enough, she begs him to fuck her ass. And oh does he! Lola is on her back with wrists tied to ankles and spread wide open and still wearing those red hot stilettos. Stirling puts the vibrator on her clit and crams her ass full of his man meat again for some hardcore anal action. He pounds her little asshole out until she is begging to cum. \"Stirling make me your wife and cover me with your hot jizz!\" and Stirling shoots his load far and wide all over his new wifey!",
  "models": [
    {
      "name": "Stirling Cooper ",
      "person_id": 61419
    },
    {
      "name": "Lola Fae",
      "person_id": 61466
    }
  ],
  "release_date": "2018-10-05",
  "scene_id": 43731,
  "tags": [
    "bdsm",
    "blowjob",
    "bondage",
    "choking",
    "Corporal Punishment",
    "domination",
    "flogging",
    "gag",
    "Hitachi",
    "humiliation",
    "Petite",
    "role play",
    "rope bondage",
    "Rough Sex",
    "slim",
    "spanking",
    "straight",
    "submission",
    "Vaginal Penetration",
    "vibrator",
    "Zapper"
  ],
  "title": "The Convenient Wife"
}