{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Rick rope-hogties and tape-gags Gabriel; if Gabriel can free himself while they’re working on Jeff, it will diminish the severity of an upcoming punishment. Rick and Matt then flog Jeff in back and paddle him in front for his behavior at work that day. They free him from the stocks and lace him to a post. Matt puts Gabriel over his lap and spanks him. Rick applies clothespins to Jeff, and Matt, after spanking Gabriel, joins him to flick at the clothespins, while Gabriel crawls over to suck first Rick’s cock, then Matt’s. Matt and Rick kiss each other, then suck Jeff’s cock. They smack Jeff’s chest once the clothespins are removed, straitjacket Gabriel, release Jeff from the post, then put the slaves in two cages, one atop the other, to have some time to themselves. A moment later the Murphy Bondage Bed is down and the two masters have rough sex, sucking, punching and finally fucking each other, first Matt pounding Rick’s ass, then Rick pounding Matt’s. With Matt on his back on the bed, both jerk off and cum on his chest. They release the slaves from the cages and watch the slaves make love to each other. Gabriel sucks Jeff, clearly the more dominant of the two. Jeff eats Gabriel’s ass, then fucks it, while the Masters comment on their performance. Rick, Matt and Jeff jerk off over Gabriel on the floor. Rick, Matt and Gabriel cum.",
  "directors": [],
  "models": [
    {
      "name": "Aaron Tanner",
      "person_id": 268
    },
    {
      "name": "Jason Branch",
      "person_id": 61117
    },
    {
      "name": "Jay Ross",
      "person_id": 61116
    },
    {
      "name": "Steve Ross",
      "person_id": 61118
    }
  ],
  "release_date": "2018-08-14",
  "scene_id": 43741,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Belly Punching",
    "big dick",
    "black hair",
    "blond",
    "Blowjob",
    "body builder",
    "Bondage",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Deepthroat",
    "dungeon",
    "Facefucking",
    "Facial",
    "Flogging",
    "Gag",
    "Gay",
    "Leather Cuffs",
    "Male Handler",
    "Male Sub",
    "master",
    "masturbation",
    "Muscle",
    "Paddle",
    "Punching",
    "harness",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Spanking",
    "Stocks",
    "Tag Team",
    "Tattoo",
    "Partner Studio",
    "Twink",
    "white"
  ],
  "title": "Masters & Slaves 2- Playtime Part 2: An Evening in the Life"
}