{
  "collections": [
    "Bound Gods"
  ],
  "description": "Welcome back to Master Keys Dungeon. Today on the menu we have two submissive pain sluts ready for torment. Draven Navarro is 200 pounds of thick muscle meat suspended in fully restrictive rope bondage. Every muscle bulge makes the bondage tighter. And Mason Lear is shackled in metal chains and leg spreader is bound with his ass in the air and ready to serve his leather master. Sebastian Keys starts with his brand new thick leather crop and puts a beating on Draven and Navarro. Both sluts scream in pain. Draven has a complete fear of electricity and is tormented with the electric zapper on his feet, body and nipples. His fear of electricity gets him screaming when the zapper gets near his testicles. As a reward Mason's always rock hard cock is used to fuck Draven's mouth as Sebastian brings out leather floggers to beat these two with. Next the two pain sluts are bound to crosses and gagged with ball gags as Sebastian leaves deep marks on their body with the crop. As Mason's reward Draven is strapped with a mouth dildo and fucks Mason's hairy ass deep as Sebastian crops him. For the final ice challenge, both sluts are bound with their asses in the air to see which one can take an ice cold dildo in their ass for the longest. To add to the challenge both men have hard clamps clipped on to their sensitive balls. The winner of the challenge gets to fuck the loser. The thick hard cock is rammed deep into the losers tight ass as they scream. Both men are then made to shoot thick cum loads for their master and eat up every last drop.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Mason Lear",
      "person_id": 60275
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2018-09-13",
  "scene_id": 43751,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "Chains",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Feet",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "mixed",
    "Muscle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "switch",
    "Tattoo",
    "versatile",
    "white",
    "Zapper"
  ],
  "title": "Dungeon Muscle Challenge: Two Pain Sluts Pushed To Their Limits"
}