{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Matt at his office desk, dressed in T-shirt, shorts and sneakers. Jeff in business dress comes in and with a few snaps of the fingers Matt has Jeff kissing his sneakers. Then he gives Jeff instructions for when he and Rick are away. The goal: to bring the new boy, Billy, into the family. Matt ties Jeff's hands and has him suck his cock and continue doing it unseen by Billy when he calls Billy into his office.\n\nLater that day: Jeff in his office in business clothes edges himself to the idea of controlling Billy. He asks Billy, who clearly worships him, to stay late, and when everybody has left, uses a pretext to get Billy into his office where he starts fondling Billy's ass, which Billy happily lets him do. Jeff opens Billy's pants and pulls out Billy's reassuringly hard dick, gives Billy his thumb to suck and while Billy is sucking, orders the boy to undress, pushes him to his knees, and, having dropped his own pants, has him nuzzle and sniff his crotch and then his asshole, \"like a dog.\" He gets Billy on his back on the desk and with Billy's head hanging over the edge feeds him his cock before making Billy turn over, whereupon he uses both their neckties to bind Billy's wrists and ankles and his own belt to attach wrists and ankles in a hogtie. Throughout all this Billy is letting Jeff know, both by words and actions, that Jeff can do anything to him, he'll gladly be Jeff's slave, Jeff's dog. Jeff tells Billy to make himself available for the weekend.\n\nThe weekend: Billy is pushed into the dungeon where Gabriel, naked, collared and plug-gagged, is tied to the standing frame of the Murphy Bed. Jeff wears a harness, leather shorts, boots. Billy wears a T-shirt, jeans and sneakers. Jeff barks orders at Billy and keeps count of Billy's performance on a whiteboard. When Billy is naked except for kneepads, socks and sneakers, Jeff locks a collar around his neck, locks bondage mitts on his hands, removes the clothespin he'd put on Billy's tongue for talking without permission, and begins Billy's pup training, teaching him to walk on a leash, fetch, roll over, beg, play dead. He walks Billy over to bound Gabriel whom he identifies as his lover and Billy's other Master, and orders the pup to kiss Gabriel's feet and then lick up his legs to his cock, which he is then allowed to suck. Jeff looks on, jerking his cock. Jeff has Billy lick his boots, then skullfucks the boy before having him bend over for a paddling for the punishment points he scored. When the boy's ass is bright red, Jeff gives him a dog bone. \"Chew that,\" he says.\n\nA week later: Jeff and Gabriel are eating breakfast at the kitchen table and Billy is eating out of a bowl on the floor when Rick and Matt return from vacation. After being asked why they are eating at the table without permission, the scene cuts to the dungeon, where Billy is caged and barking, and Jeff and Gabriel are tied together in a standing position, getting flogged by their Masters. Billy's barking and whining gets on Rick's nerves, but Billy is Jeff's dog, so Jeff has to explain to the boy that while the boy belongs to him and Gabriel, he and Gabriel belong to Rick and Matt, so the boy belongs to them as well, and if he wants to be part of the family that's the way it is going to be. Billy stops barking and the flogging continues.",
  "directors": [],
  "models": [
    {
      "name": "Jason Branch",
      "person_id": 61117
    },
    {
      "name": "Steve Ross",
      "person_id": 61118
    },
    {
      "name": "Jay Ross",
      "person_id": 61116
    },
    {
      "name": "Aaron Tanner",
      "person_id": 268
    },
    {
      "name": "Tony Ferrari",
      "person_id": 61432
    }
  ],
  "release_date": "2018-08-21",
  "scene_id": 43754,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Bush",
    "Chains",
    "Clothespins",
    "Collar",
    "Discipline",
    "dungeon",
    "Feet",
    "Fetish",
    "Flogging",
    "Gag",
    "Gay",
    "Leather",
    "Leather Belt",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "Paddle",
    "Pet Play",
    "Puppy Play",
    "harness",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "Slave",
    "Spanking",
    "Tattoo",
    "thirdparty",
    "Twink",
    "Voyeur"
  ],
  "title": "Masters & Slaves 2: When the Cat's Away"
}