{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Susi Star - Never Fucked Like This Before Our scene with millennially-aged Susi was one of the craziest P and I have ever done here on PSS. She arrived here with her older successful businessman bf from Holland and seemed to be a bit out of sorts when he was in the room. One other more interesting detail is that she barely knows a smattering of English. Dr. P was kind enough to translate for me and found out Susi is from Holland by way of South America. When her guy left she immediately perked up and happily confessed that she'd been in the swinging scene for the last 2-3 years (at her urging), now frequenting 2x/week. She even claims to have done 50-60 guys in one night at the swingers' club! When she fucks outside the club she usually fucks her pals and her cuck bf loves to watch her get ravaged by other guys. She says she still goes to the club because she gets excited in experiencing fucking new partners. Could there have been some that her guy doesn't even know about??? We'll let you be the judge and see what you think. Susi's fuck-it rundown is as follows: Vaginal fucking Domination & verbal abuse Multiple orgasms Toy fuck action Face-fucking & Deep Throat Spanking Face-slapping Choking Hair-Pulling Masturbation CIM Swallow The chemistry and electricity between Susi and P is evident throughout the scene. She was already getting massively turned on and even wet during the photo shoot just thinking of what P was going to dehumanize and completely dominate her. She admitted early on that she'd really wanted to fuck P which led to her obvious excitement. The message you get LOUD and CLEAR from watching them fuck is that she is a VERY SEXUAL woman who's never been fucked like this either from her guy or the swingers. Pay close attention when she's riding P in cowgirl because you can just tell this doesn't happen to her every day. Dr. P and I guarantee you will enjoy this to the utmost! Cheers! A",
  "directors": [],
  "models": [
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Susi Starr",
      "person_id": 61915
    }
  ],
  "release_date": "2019-03-27",
  "scene_id": 43757,
  "tags": [
    "Blowjob",
    "Brunette",
    "Choking",
    "Deepthroat",
    "Domination",
    "drool",
    "Facefucking",
    "Hair Pulling",
    "masturbation",
    "multiple orgasms",
    "PIV",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Straight",
    "Sub",
    "Swallow",
    "Swingers",
    "thirdparty",
    "Uncircumcised",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Susi Star: Never Fucked Like This Before"
}