{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Ava Kelly and Brooklyn Daniels are still training their current sex slave Mena Li. Mena is a prideful submissive slut wih an attitude that needs to learn her place. Dicks on sticks has turned many sluts out, leaving them sore and moaning in a puddle of their own juices. That's where Ava and Brooklyn start Mena off for her next lesbian domination threesome. This time around the hot and mean Mistresses chain Mena to the wall by her neck and wrists, posts nearby to lift and bind her feet on. She won't being going anywhere, having to balance on the beams while taking rubber cock in her holes deep. She begs to cum within minutes. Ava and Brooklyn seem to not hear her, ramming their dicks rough in her pussy and down her throat. It's hard to figure what Mena is saying with her Mistresses dildos sliding in and out of her mouth. They love to deep throat their dirty whores. Skull fuck, actually. They can see Mena struggling to focus on both sensations, Ava slapping her tits and smacking her face, driving Mena to orgasm a few more times. Brooklyn and Ava want to see how well Mena's pussy can endure a rough pussy pounding after cumming so much. The BDSM fun moves off the wall, onto the floor. The double penetration starts with their trusty and massive strapons. Both her holes are stuffed with the rubber dicks. Guess what else is still in the room: the dicks on a stick, which means more rubber cocks stuffing poor Mena. Mena actually yells at her Mistresses, questioning their lezdom taste in rough sex. After more dominaton and pounding her holes in, she apologizes over and over for being a slut that talks back. Good girl!",
  "directors": [],
  "models": [
    {
      "name": "Ava Kelly",
      "person_id": 53978
    },
    {
      "name": "Brooklyn Daniels",
      "person_id": 53927
    },
    {
      "name": "Mena Mason",
      "person_id": 53759
    }
  ],
  "release_date": "2018-08-23",
  "scene_id": 43760,
  "tags": [
    "Asian",
    "BDSM",
    "Big Tits",
    "black hair",
    "Bondage",
    "Breast Abuse",
    "Brunette",
    "Chains",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "fake boobs",
    "Feet",
    "Female Slave",
    "Femdom",
    "gloves",
    "Hitachi",
    "Latin",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "Mouth Spreader",
    "natural boobs",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "the wall",
    "thirdparty",
    "Threesome",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Brooklyn Daniels & Ava Kelly Give Smart Mouth Sex Slave Mena Li More Training"
}