{
  "collections": [
    "Bound Gods"
  ],
  "description": "Joseph Banks is new to KinkMen, so Max Ferro uses him for all he's worth. He locks him in a body cage, crops him and flogs him, then fucks his smooth ass with his big cock. We start with Joseph in the cage on the floor, face-up, completely vulnerable and unable to move. Max tears him out of his shirt, crops him through the cage, makes him lick his filthy boots, then torments his cock with CBT while also sucking him off. He shoves his thick cock into his mouth and commands that he suck him. Joseph is confused by the combination of pain and pleasure, and the excitement of restraint while also wanting to escape. Next, Joseph is released from the cage, but he's locked in chastity with his arms chained above himself. Max unleashes a strenuous and relentless flogging session on Joseph, who's also tied up and gagged, so his screams are muffled by the ball gag and his own spit. Finally Max puts Joseph back in his cage completely naked, face down, so he can get at his sweet, fuckable hole. He teases the fucker, sliding his fingers into his ass, tickling his prostate, threatening to fuck him deep and hard. And of course, Max follows through on his threat. He straddles the cage and shoves his big dick deep inside Joseph's hole, fucking him through the cage, so he still can't get away. By now Joseph has stopped struggling and takes that thick cock and loves it. Max shoots his load all over Joseph's face, then makes him lick it off and clean his big spent cock. Joseph gets no such release or relief, and is left there, fucked, used and caged.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Joseph Banks",
      "person_id": 61511
    },
    {
      "name": "Max Ferro",
      "person_id": 61300
    }
  ],
  "release_date": "2018-09-27",
  "scene_id": 43768,
  "tags": [
    "Anal",
    "aprilfools-fooled-ya-bitch",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Cage",
    "CBT",
    "Chastity Play",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "smooth",
    "Submission",
    "Tickling"
  ],
  "title": "Caged: Max Ferro Locks Up And Abuses Joseph Banks"
}