{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "When the party kicks off with a brutal fucking machine penetration and hard spanking session, it’s only going to get harder for Kylie from there.. and kinkier. Kylie has an itch that needs to be scratched, and Master Bruno has just the thing..or ten things! Some breath play via a gas mask and hose gets Kylie extra freaky fetish girl points, but it takes even stricter domination to tame this wild child. A hot deep throat blowjob and throat fucking as well as some serious cock and ball worship gives her a break from the fucking machine for a few minutes, but the master decides Kylie needs more time on the fucking machine. Tied down and spread open with ropes and leather straps so her holes are open for business, her pussy is totally trashed by the powerful and merciless fucking machine. Time for some cock after that, and Kylie gets plowed by Master Bruno like a Colorado mountain pass after a blizzard until she’s completely fucked out like a good little pig. A glorious cumshot fully coats slutty Kylie’s mouth, tongue and face, and runs down her cheeks and neck! Pahpow!",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Kylie Rogue",
      "person_id": 54990
    }
  ],
  "release_date": "2018-08-30",
  "scene_id": 43773,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "black hair",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "Brunette",
    "Choking",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Facefucking",
    "Facial",
    "fake boobs",
    "Female Slave",
    "Fetish",
    "Hair Pulling",
    "Latinx",
    "Leather",
    "Machine Dildo",
    "Male Handler",
    "Mask",
    "master",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "slim",
    "Spanking",
    "Straight",
    "Sub",
    "Swallow",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration"
  ],
  "title": "Kylie Rogue #2 Sexual Disgrace Facialized"
}