{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Fetish Network presents the incredibly hot porn slut Alby Rydes. She's dedicated to worshiping every dick she comes across. Here on Sexual Disgrace, she definitely will. A beautiful and sexy woman like this deserves a rope bondage session with multiple orgasms. Ready to meet her? She is left on the sybian fucking machine, kept in place with tight rope. It seems she's excited and horny. Great! She swears she has incomparable deep throat and pussy swallowing talents. When she sees the huge dick her Master was born with, she's one happy camper. She's deep throat-ed within seconds, skull fucking her the way he likes: rough, deep, fast with face slapping. The vibration and speed is turned up and down, tormenting her clit, making her cum one after another. He slaps her tits and wants to hear her what a dirty whore she is, his nasty bitch. It takes a few slaps and throat pounding to get it out of her. He finally unties her of the sybian and brings her over to the couch. Do you think her pussy can withstand his huge dick? She must. He fucks her in the doggy position, using her mouth and face to pull her back on his dick deeper and harder. He sits down and makes her ride him in the cowgirl position. She hops on it like a good sex slave and works her Master's boner. He spanks her bubbly ass more to go faster, yanking on the rope, penetrating her deep. Alby Rydes was made for rough sex. She's taken this session as slave training. With more work she can be the dream submissive for domination.",
  "directors": [],
  "models": [
    {
      "name": "Alby Rydes",
      "person_id": 52316
    },
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    }
  ],
  "release_date": "2018-09-06",
  "scene_id": 43779,
  "tags": [
    "Ball Gag",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "Deepthroat",
    "Domination",
    "drool",
    "Facefucking",
    "Female Slave",
    "Fetish",
    "Fingering",
    "gloves",
    "Hand Gagging",
    "Male Handler",
    "master",
    "multiple orgasms",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Slave",
    "Spanking",
    "Straight",
    "Sub",
    "Sybian",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Alby Rydes Becomes the Perfect Sex Slave for Rough Sex in Rope Bondage"
}