{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When antique dealer Isabella Nice is confronted with an angry customer, she delivers the best customer service possible. Derrick is rightly ticked off that Isabella's shop ripped him off, but when Isabella offers up kinky sex in exchange for Derrick's complaint, he takes her up on her offer. Derrick shows interest in a special bench and asks Isabella what it is. Well it happens to be a spanking bench for the submissive so she demonstrates how it works and climbs up on top of it. She straddles the bench and pulls her mini skirt up over her cute ass to reveal some sexy red panties. Derrick looks mesmerized by Isabella's display and offer. $15,000 is a lot of dough to compensate for and Isabella provides only the best customer service so she starts by taking off her clothes. With ball-gag, nipple clamps, hitachi and lots of tight bondage Derrick ties her to a wooden cross and begins the Fair Trade. He swats her sensitive thighs, tits and smooth round ass with the crop until her skin turns bright red. He teases her with the zapper and she gets so excited by the threat and anticipation of the electrical spark she can't help but scream. All the cropping and zapping and vibrating from the hitachi has gotten Isabella's pussy wet, Derrick pulls on the nipple clamps and she wants to come but he makes her wait and it drives her crazy. After an intense orgasm Derrick sets Isabella on her knees to worship his cock. She takes it deep down her throat and sucks his dick providing top notch customer service. Isabella straddles the spanking bench in predicament bondage. A silver ass hook fills her up getting her ready for the hardcore fucking that is to come. Derrick starts with Isabella's already wet pussy. His hard dick fills her slutty hole and he spanks and fucks her and she thanks him for making her feel so good. Then he whips her with a dragon's tail stinging her ass with every strike. Red and sensitive she is ready to get some good butt fuckin' Derrick removes the hook and replaces it with his big cock and Isabella is on the verge of cumming. Finally Isabella is tied up on her back with legs spread wide open. Derrick plays with her pussy, flogging and fingering her and takes her to the edge until he stuffs her full of his dick again. Choking and slapping her Derrick fucks her pussy and tight ass. Isabella is in heaven and she begs him to cum and ohh does she. Derrick finishes her off like a champ and pounds her out making her moan with pleasure until he shoots his load all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Isabella Nice",
      "person_id": 61113
    }
  ],
  "release_date": "2018-11-09",
  "scene_id": 43780,
  "tags": [
    "Ass Hook",
    "Athletic",
    "BDSM",
    "bestof2018",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Choking",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Fingering",
    "Flogging",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Latin",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Predicament Bondage",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "slim",
    "smooth",
    "Spanking",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "Fair Trade"
}