{
  "collections": [
    "Sex And Submission"
  ],
  "description": "A visit from Tommy's former babysitter \"Auntie\" Dee triggers memories of Dee and Tommy's father's affair and the broken manhood he has suffered since. When presented with the opportunity to make things right, Tommy pushes the boundaries of normal behavior and waterboards his former nasty babysitter on the path to healing their broken past. He wants his slutty babysitter to suffer the way he did when she tore their family apart years ago. So Tommy ties Dee up on a board on the kitchen counter--the site where she made all his lunches and dinners while she was secretly fucking his Dad! Lying slanted on the board Dee is tied with rope around her ankles, knees, thighs, wrists, tits everything strapped down so tight she can barely move. A vibrator is crammed between her legs, her mouth is covered with a bandana and her massive tits bulge from the rope binding them, Tommy wants her to admit she is a Homewrecking slut so how about a little waterboarding to get her to confess! He pours water on her mouth and she gurgles and gags and tries to convince Tommy she is sorry and never meant to hurt anyone. Dee is desperate and begging him to stop, this is just what Tommy had in mind for the first phase of his twisted revenge. He whips her plenty with the flogger stinging her tender flesh and turning her pale skin bright pink. With the flogger, crop, vibrator he takes her to the edge and then further eliciting orgasms from all the wild stimulation. Even though Dee admits she is a homewreckin' whore she still wants some dick cuz she can't ever get enough. Nipple clamps dangling and pulling on her huge tits Dee sucks Tommy's cock like the tart she is choking and slobbering all over the place while Tommy slaps, zaps and does some throat fuck wreckin' of his own.\nOn all fours with mouth gag Dee's ass is way up in the air ready to be fucked. First the flogger turns her butt red and leaves little marks all over her sensitive skin. Finally Tommy fucks her pussy making Dee moan and groan and quiver and cum. Then he takes her over the top when he fucks her tight ass. Dee says he fucks better than his dad ever did!\nNow tied up on the couch with her big tits piled high and both her hungry holes ready to be fucked Tommy pounds her out with all his kinky vengeance. Back and forth between her wet, wanton pussy and horny ass until she is cumming hard Tommy blows his hot load all over her homewreckin' face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2018-11-16",
  "scene_id": 43781,
  "tags": [
    "bdsm",
    "big tits",
    "blowjob",
    "choking",
    "Corporal Punishment",
    "crop",
    "domination",
    "gag",
    "humiliation",
    "kinky",
    "nipple clamps",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "throat fuck",
    "top",
    "Vaginal Penetration",
    "vibrator"
  ],
  "title": "Homewrecker Revenge"
}