{
  "collections": [
    "Device Bondage"
  ],
  "description": "Lilly showed up super bubbly and \"ready to try anything once\". The\nPope spends some time letting her know how things go on bondage shoots, safety\nprotocols, and what to expect during the shoot. What no one of saw coming was this little\npixie being into bondage and torment as much as she was, especially her. She couldn't\nwrap her head around the idea of what was happening to her and why her body\nresponded the way that it did. She starts mounted to the wall in a brutal device\nsuspension with her feet well off of the ground. The Pope wanted this little thing up to\nhis eye level to keep an eye on her since it's her first bondage shoot. Lilly's face begins to\nsmile more and more as the torment continues and her pussy begins to drip. The next\nposition has her bent over in a doggy position to show off her magnificent ass. She is\nheld in place with wooden stocks and steel to ensure proper suffering. Nipple clamps are\nadded and then lots of weight, to which Lilly just smiles more. The Pope then adds three\nclothes pins to this whore's tongue and again we get a big smile. After some torment, he\nbegins to fuck her pussy and she explodes with one squirting orgasm after the next. In\nthe final scene she is on her back with her legs spread as wide as they can possibly go.\nHer feet are tormented with extreme bastinado before she is made to have squirting\norgasms until her slutty pussy is drained of all of its juices.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lilly Ford ",
      "person_id": 61378
    }
  ],
  "release_date": "2018-11-15",
  "scene_id": 43784,
  "tags": [
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "domination",
    "Feet",
    "Fingering",
    "Handler",
    "humiliation",
    "metal bondage",
    "nipple clamps",
    "squirting",
    "stocks",
    "straight",
    "submission",
    "suspension",
    "The Pope",
    "the wall"
  ],
  "title": "Tiny Squirting Slut Lilly Ford"
}