{
  "collections": [
    "Bound Gods"
  ],
  "description": "Marcus Rivers is brand new to Kink.com. Today he will learn the basics of servitude. He's here to serve his Dom, Dominic Pacifico. He must obey his every command and take all the punishment given to him. The first scene starts with Marcus on his knees in the corner of a dark dungeon. He waits to be summoned over to his Master, Dominic Pacifico who stands silent gripping a leather paddle in his leather gloves. Dominic calls Marcus over and begins his training. Dominic tells Marcus to take off all his clothes and inspects his wiry naked body. Dominic slaps Marcus' ass with the leather paddle until it turns bright pink. Dominic makes Marcus lay down on the floor and tells him to use his tongue and clean his leather boot. Marcus licks Dominic's boot and works his tongue all the way up Dominic's leather pants all while getting smacked in his ass with the paddle. Dominic unzips his leather, pulls out his hard cock and shoves it in Marcus' mouth. Dominic fish-hooks Marcus with his gloved finger and fucks his face. In the next scene, Marcus stands with his hands tied behind his back with both ankles shackled to chains keeping his legs spread. Dominic grabs his flogger and begins hitting Marcus' body. He starts out light then turns it up, making Marcus scream and yell. In the final scene, Marcus is on his hands and knees, bound by his wrists and ankles to a wooden platform. Dominic is behind him jerking his own hard cock while licking Marcus' asshole. Marcus grabs a nearby candle and begins slowly dripping it onto Marcus' back and ass making him squirm and struggle with no where to go. When Dominic decides that he's had enough, he takes his hard cock and shoves it in Marcus' tight ass and begins pounding. Marcus' toes curl and he bites down hard on the ball-gag as his ass gets a hard fucking from a man twice his size.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Marcus Rivers",
      "person_id": 61559
    }
  ],
  "release_date": "2018-10-11",
  "scene_id": 43785,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "chains",
    "Corporal Punishment",
    "domination",
    "dungeon",
    "gag",
    "gay",
    "gloves",
    "humiliation",
    "leather",
    "leather gloves",
    "Male Sub",
    "master",
    "Paddle",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "slave",
    "submission"
  ],
  "title": "Obedient Slave, Marcus Rivers Serves Dominic Pacifico"
}