{
  "collections": [
    "Bound Gods"
  ],
  "description": "Kelly Evans is a hot new Dom dressed head to toe in leather. Scott DeMarco stands on a platform in a leather jock, blindfolded. His wrists, thighs, and ankles are wrapped in red rope, tied to two flanking chains. Kelly walks up to Scott and runs his hands up and down Scott's body. He slaps and punches his skin and grabs Scott's balls and pulls. He slaps his ass and pinches his nipples. Kelly grabs his leather flogger and flogs Scott's body until his skin turns red. Kelly leans his face into Scott's ass and licks his hole. Kelly rips the leather cod piece from Scott's jock and wraps his lips around Scott's hard cock. He Deep throats his dick then returns with more flogging. Kelly comes up from behind Scott and grabs him by the throat. He spits in his mouth and kisses him deep. Kelly pulls out his hard cock and sinks it deep into Scott's ass and fucks it deep and hard. He walks to the front of Scott and shoves his hard cock in his mouth and makes him taste his ass. In the next scene, Scott has a ball gag in his mouth and is on his back tied up to the chains with his legs spread. Kelly licks Scott's spread hole while he jerks himself off. He puts clothespins on Scott's nipples and shoves his cock once again back into Scott's ass and fucks it hard. In the final scene, Scott is suspended horizontally with his legs separated by a spreader-bar. His arms are confined in a leather straightjacket. Kelly looms over Scott's body and fucks his mouth with his hard cock. Kelly grabs Scott's hard dick and jerks him off until Scott sprays his load all over the leather straightjacket. Kelly answers back with a load of his own and arcs milky ropes into Scott's face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Scott DeMarco",
      "person_id": 59206
    },
    {
      "name": "Kelly Evans ",
      "person_id": 61522
    }
  ],
  "release_date": "2018-10-04",
  "scene_id": 43786,
  "tags": [
    "anal",
    "ball gag",
    "bdsm",
    "blowjob",
    "bondage",
    "chains",
    "clothespins",
    "Corporal Punishment",
    "domination",
    "flogging",
    "gag",
    "gay",
    "humiliation",
    "Jock",
    "leather",
    "Male Sub",
    "master",
    "rimming",
    "rope bondage",
    "Rough Sex",
    "submission"
  ],
  "title": "Kelly Evans Helps Himself to Scott DeMarco"
}