{
  "collections": [
    "TS Seduction"
  ],
  "description": "In the 3rd episode of the Slag Angels, Queen Sheeva (Natassia Dreams) returns to the clubhouse to warn Phoenix (Lena Kelly) and Paloma (Natalie Mars) that the Feds are hot on their trail. Paloma informs the group about Tom (Pierce Paris), an undercover FBI agent asking too many questions. Tom claims he wants to become an honorary fuckboy of the Slag Angels. Dolly (Shiri Allwood) is a new recruit who must prove herself by how she handles Tom. She gasps when she lays her eyes on Tom’s massive cock. Paloma joins Dolly, taking turns sucking Tom’s cock. Phoenix and Queen Sheeva rub their titties in Tom’s face. He’s about to come, and that’s time for Queen Sheeva to call a halt to the action. Tom isn’t cumming, at least not yet. Down on his knees, Tom is surrounded by Slag Angel cock. Sheeva orders him from one cock to the next. The Angels jam their cocks in Tom’s face hole. Sheeva then demands he worship their asses. She shoves Tom’s face into Dolly’s ass, then Paloma, then Phoenix, and back again. Lick her ass! His head is yanked to and fro–he can’t keep track of which hole his tongue is rimming. Unaware that his cover is blown, Tom allows himself to be tied up. Helpless on his back, Queen Sheeva wants Dolly to take notes while Paloma rides Tom’s rock hard cock. Soon it’s Dolly’s turn to take Tom’s big cock and she takes it like a pro, while Sheeva smothers Tom’s face with her big ass and fills his mouth with her cock. Phoenix and Paloma also take their turn face sitting and fucking Tom’s face. After Dolly has proven herself it’s time for Tom to be brought to justice. Queen Sheeva turns him over doggy style and face fucks him while Dolly fucks his ass. Now Paloma takes her turn, her big cock pounding Tom’s virgin hole. Phoenix gets her turn, fucking the little fuck bitch while Paloma’s big ass smothers his face. “How does that little ass taste?” the Queen asks. His initiation has only begun. On his back, head between his legs, ass up in the air, Paloma fucks Tom while Sheeva double teams him with a dick-on-a-stick. Dolly’s final test is to fist poor Tom’s abused hole. Stretching that virgin ass beyond anything poor Tom could imagine. The only respite is when he feels the sting of Phoenix’s crop against his tender thigh. Thoroughly fucked and humiliated, it’s time for Queen Sheeva to fuck Tom’s plundered ass. Tom gets drilled hard and deep by his Queen. Now the girls are ready. Tom must kneel before the Angels while they glaze his face with their majestic loads of cum. But it’s not over for Tom. He knows too much. The Slag Angels will keep him as their fuckboy. It will be a lonely and brutal life. He will learn to be grateful whenever his holes are used for the Queen’s pleasure.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Lena Kelly",
      "person_id": 61007
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    },
    {
      "name": "Natassia Dreams",
      "person_id": 16310
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    },
    {
      "name": "Shiri Allwood",
      "person_id": 61393
    }
  ],
  "release_date": "2018-12-25",
  "scene_id": 43793,
  "tags": [
    "Anal",
    "Athletic",
    "Big Ass",
    "big dick",
    "Black",
    "Blonde",
    "Blowjob",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Crop",
    "directorspicks",
    "Facesitting",
    "fake boobs",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Redhead",
    "Rimming",
    "Role Play",
    "shaped",
    "shaved",
    "slag angels",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "tea2020",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Slag Angels on Wheels: Episode 3"
}