{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Charlie Ten is 22 and a piece of a damn fine posh totty. She's also got the coolest porn name ever. She's a longstanding fan of PSS (read lady diddler) and as such was extremely happy to film the following sexy naughtiness with us. Now to the elephant in the room. Except that actually there's no avoiding it because this is a porn site and as soon as you see Charlie's body you'll see it for yourself. Charlie used to be self harmer. Her legs and her left arm are criss-crossed with scars. I'd had a look through her Twitter pics before we booked her and spotted them then, but it didn't put me off. She's a beautiful woman and it was clear from my chat with her on the phone that she'd make a perfect SubSlut. When we met up in Bristol I talked about them with her. She was very open and, as you'll see in her interview, also keen to discuss them on camera. So rather than try to ignore them during the scene I decided to kick it off by actually making a feature of them and running the camera over them. Charlie liked this idea a lot. The scars come from pain, yes, from an unhappy place. But they are also, in the opinion of myself and Pascal, powerfully erotic. I hope you enjoy Charlie's uploads, and thank you, as always, for watching.",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Charlie Ten",
      "person_id": 61518
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2018-09-12",
  "scene_id": 43792,
  "tags": [
    "Blowjob",
    "Breast Abuse",
    "Choking",
    "Clothespins",
    "Deepthroat",
    "Discipline",
    "domestic",
    "Domination",
    "Facefucking",
    "Facial",
    "Fingering",
    "Hair Pulling",
    "Hood",
    "Pain",
    "PIV",
    "Redhead",
    "Rough Sex",
    "Small Tits",
    "Spanking",
    "Straight",
    "Sub",
    "Submission",
    "Swallow",
    "thirdparty",
    "Vaginal Penetration"
  ],
  "title": "Charlie Ten: \"I Want To Be Scared\""
}