{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Kayleigh Coxx has pulled off another job, but now she has to lay low for a few days. She picks an old motel by the lake, it's the last place anyone would look. Lauren Phillips is the night manager, a lonely and boring job. The fact that Lauren is a horny sex fiend who is always ready to fuck doesn't make the job any easier. She can barely contain her excitement when Kayleigh arrives in the middle of the night. This new guest isn't interested in chatting, but that doesn't matter to Lauren. There are secret peep holes in every room. Lauren can't wait to see the new guest stripped down to her underwear, and then of course, naked. Lauren has a fetish for panties, and seeing Kayleigh's big, firm cock only adds to her desire to inhale the scent of those beautiful bloomers. It's a long way from anywhere to this motel so Kayleigh's likely been wearing those panties for many hours. Lauren is so close to Lauren's underwear she can almost taste them. She needs to sniff those panties, even if it means getting caught in the act. Lauren creeps into the room while Kayleigh is asleep and inhales the arousing aroma of Kayleigh's sweat-soaked cotton undies. The intoxicating scent drives Lauren wild and her moans of delight wake Kayleigh. Kayleigh quickly realizes Lauren doesn't know about the money. Lauren also has a foot fetish and Kayleigh lets her suck her toes. Kayleigh stuffs her panties in Lauren's mouth. Lauren is heaven. Kayleigh is also in heaven when she gets her hands on Lauren's big ass. It's an ass that demands some good lovin'. Kayleigh fucks Lauren's mouth hole. Fucks Lauren doggy style on the bed. Pounds her deep in her pussy. Flips Lauren on her back, fucks her hard. Stuffs her panties in Lauren's mouth. Kayleigh fucks Lauren in the ass before flipping her over for some doggystyle anal with a vibrator on her pussy. Lauren won't be talking anytime soon about what she may or may not have seen in Kayleigh's motel room. Kayleigh cums on Lauren's face to guarantee her silence. Not a bad deal for a motel room on such short notice.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Kayleigh Coxx",
      "person_id": 61277
    }
  ],
  "release_date": "2019-01-14",
  "scene_id": 43799,
  "tags": [
    "Big Ass",
    "Blowjob",
    "Cock Worship",
    "Fetish",
    "foot fetish",
    "Role Play",
    "Straight",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Kayleigh Coxx Punishes Peeping Motel Manager Lauren Phillips"
}