{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Deep in the shadows of the underworld there's a rusty decrepit dungeon where the super hot madam Chelsea Marie Keeps her sex slaves tucked in cages. Her new slave is the lusty Violet Monroe who is about to get punished for being a bad slave. Chelsea makes an entrance and immediately makes it known she's unhappy with her little slave Violet, so she must have her way with her and teach her a lesson. She begins her punishment by making Violet worship her feet as she is locked helplessly in a cage. She instructs Violet to rip her stockings off and lick every inch of her feet. Chelsea then continues her punishment so she takes her cock out and puts it through the cage so Violet can get a taste of it. Violet redeems herself and sucks her hard dick like a good sex slave should. Chelsea then allows Violet out of the cage so she can ram her cock down her throat some more and show her what she does to bad slaves that misbehave. Chelsea has enough punishment to dish out to this bad little slave so she turns around and gives her a taste of her ass. She tells Violet to lick her hole up and down and lick it clean. Chelsea then treats her slave to her fingers and tongue. She fingers and licks Violets pussy so she can make good use of her wet pussy. Chelsea then shoves her hard cock in and fucks her deep and hard. Violet takes it in her tight little pussy, showing her master how she loves her Hard cock and proving to her master she's a good little sex slave. Chelsea allows her to cum so she can make way for her load. Chelsea pounds her until she fills her hole with her creamy punishment.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    },
    {
      "name": "Violet Monroe",
      "person_id": 20284
    }
  ],
  "release_date": "2018-11-19",
  "scene_id": 43795,
  "tags": [
    "Blowjob",
    "Cage",
    "Cock Worship",
    "dungeon",
    "Feet",
    "master",
    "Nylons Stockings",
    "Pussy Eating",
    "Rimming",
    "Role Play",
    "Slave",
    "Straight",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Caged Heat: Chelsea Marie Uses Up Her Caged Sex Slave Violet Monroe"
}