{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Amilia Onyx is a busty beauty who is in dire need of Nurse Kayleigh Coxx's help. She can't stop rubbing her horny pussy while she sleeps. She'll wake up fucking whoever is laying next to her. She has no control over her crazy nocturnal sexcapades. To get to the bottom of this, Amilia participates in an eight-hour sleep study under the close observation of Nurse Kayleigh Coxx. The minute Amilia slips into sleep she wakes up in the same old familiar fuck fest dreams she visits every night. Amilia is bossed around by the big titted, latex clad nurse. What starts as sweet deep kissing and slow seductive breast licking quickly escalates to a sloppy spitty cock sucking. As she gets roughly throat fucked Amilia gets incredibly turned on. Kaleigh licks her wet, pretty hole before fingering her while holding a vibrator on her eager clit, pulling multiple orgasms out of her. Amilia's eyes roll back in her head as she moans and cums over and over again. Kayleigh bends her over and fucks her deep in doggy style, filling her entirely with her throbbing cock. Kayleigh flips her over and watches while her rock hard dick is ridden by Amilia's dripping wet cunt. She continues to drill the sweet pussy as the soft pink pussy lips wrap around her shaft. Amilia's huge natural tits shake as she's fucked relentlessly. After falling to her knees she takes the nurse's sweet lady cum on her tongue. Amilia jolts awake, out of breath, sweaty and with her panties drenched. She is more freaked out then ever. Could the hot nurse have seen what goes on in her filthy mind? Her desperate pleas for answers are met with the nurse's mischievous smile and coy denial.",
  "models": [
    {
      "name": "Kayleigh Coxx",
      "person_id": 61277
    },
    {
      "name": "Amilia Onyx",
      "person_id": 61275
    }
  ],
  "release_date": "2018-11-05",
  "scene_id": 43794,
  "tags": [
    "blowjob",
    "bottom",
    "cock sucking",
    "Cock Worship",
    "Fingering",
    "latex",
    "lesbian",
    "multiple orgasms",
    "nurse",
    "role play",
    "spanking",
    "straight",
    "trans",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "vibrator"
  ],
  "title": "Sexsomnia: Amilia Onyx Dreams of Hot Trans Lesbian Nurse Kayleigh Coxx"
}