{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Mercy West and Allysa Etain find themselves alone in a fallout shelter. News on the radio is vague, reports of hostile aircraft. Nobody is sure what is happening. Is it an alien invasion? The start of World War III? Mercy is frightened but Allysa has no intention of wasting a golden opportunity. The only incoming missile Mercy needs to worry about is the one between Allysa's legs. Mercy is upset. Allysa gets her to take off her shirt and bra, to be more comfortable. But Mercy is still scared. Allysa puts her over her knee, spanks her ass. Soon Mercy's pants and underwear are off as Allysa slaps Mercy's naked ass. Mercy welcomes the distraction. Her tight pussy is good and wet, with Allysa's fingers probing her hungry hole, stretching it open. Mercy begs to be fucked. All she is thinking about now is Allysa's big hard cock. Allysa wants a blowjob and Mercy happily obeys. Such a good little shelter slut. Mercy forgets everything while slurpin' and suckin' on Allysa's cock. Allysa lays Mercy on top of the rough wool blanket of an army surplus cot, fucks her pussy. She flips Mercy over and fucks her doggy style. The two survivors are not lacking all technology, Mercy has a Hitachi and cums while Allysa pounds her pussy. This feels so good Allysa wants to fuck Mercy's ass. Mercy worries her cock is too big, but we soon see that it fits just fine. Allysa's cock dives deep into Mercy's ass, filling her up and pounding out orgasm after orgasm. Allysa can't resist some pussy licking and pussy eating. In order to save humanity, Mercy realizes they will have to fuck all the time, every day. She is on her back with Allysa's cock pounding out more orgasms. Mercy begs Allysa to come in her, to repopulate the Earth. This is not the end, my friends, but the beginning. Mercy has been fucked nice and loose. Soon there will be more coming and Mercy will need to be their shelter slut, too.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Allysa Etain",
      "person_id": 61050
    },
    {
      "name": "Mercy West",
      "person_id": 56853
    }
  ],
  "release_date": "2018-12-03",
  "scene_id": 43796,
  "tags": [
    "Anal",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "fake boobs",
    "Hitachi",
    "natural boobs",
    "Pussy Eating",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Shelter Slut: Mercy West and Allysa Etain Fuck to save humanity!"
}