{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "It's hot, noisy and crowded inside a trendy nightclub on new year's eve. Kacie Castle escapes to a back alley for some fresh air and meets a sexy stranger, TS Foxxy. They share a cigarette and decide to start their own party. Before the cigarette can be smoked they are swapping spit and swallowing each other's tongues. Kacie's see-through fishnet dress perfectly shows off her round ass and hard nipples, and Foxxy ties her up on top of some old boxes to flog her ass. Foxxy spanks Kacie's ass till it's red, plump and ready to pump. First she sticks her tongue in Kacie's sweet pussy, licking her pussy lips and ass crack. Getting it wet and ready. Foxxy flips Kacie over on her back, the perfect position to sit on her face. Foxxy's big ass controls when Kacie can breathe. Kacie hungrily licks Foxxy's asshole in return to for oxygen. Now Foxxy has something else for Kacie to suck on. Foxxy's cock slides right into Kacie's mouth. Kacie can't go anywhere. Foxxy climbs on top of her new friend, fucking her face. Kacie loves sucking cock, balls, ass, while getting her pussy licked. Foxxy spreads Kacie's legs and fucks her pussy. Tied up on her back, unable to move, Kacie gets a deep, hard pounding from this friendly stranger. Foxxy unties Kacie so she can suck on Foxxy's cock and get a taste of her own pussy juice. Now Kacie is back on the box, on all fours, getting it doggystyle. Foxxy gives Kacie a hitachi to really make her cum. As the clock ticks towards midnight it's time for Foxxy to really get busy. She flips Kacie over on her back so she can look her in they eyes while sliding her hard cock into Kacie's tight bunghole. Then Kacie is back on her knees with Foxxy's cock firmly planted in her ass while Foxxy pulls on Kacie's long brown hair. Foxxy pushes deep inside Kacie's ass. She climbs on top of Kacie, thrusting her rod into her, over and over. Kacie takes it all. Foxxy blows her load in Kacie's ass as the clock strikes midnight. Nothing says \"Happy New Year\" like a fresh anal cream pie.\nNow to get back to the party and celebrate with some champagne. Kacie will rejoin her friends but she will be the only one with cum dripping out of her ass on the ride home.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "TS Foxxy",
      "person_id": 20055
    }
  ],
  "release_date": "2018-12-31",
  "scene_id": 43798,
  "tags": [
    "Big Ass",
    "Blowjob",
    "bottom",
    "Brunette",
    "christmas",
    "Cock Worship",
    "fake boobs",
    "Farts",
    "Hitachi",
    "Latin",
    "natural boobs",
    "Role Play",
    "shaved",
    "Straight",
    "Tattoo",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "TS Foxxy And Kacie Castle's Back-Alley Butt Fuck"
}