{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Horny, voluptuous damsel in distress, Dee Williams is laying tied up on the floor of Natassia Dreams' dungeon. Her dress can barely contain her round juicy ass and heaving bosom. As she whimpers and moans through her ball gag, Natassia Dreams walks in taunting her with the threat of what her day offers. She pulls her tits and ass out and proceeds to suck and bite her nipples while she smacks her perfect ass. Natassia takes devilish delight in licking her ass and cunt while she also doles out the pain, spanking her ass red. Dee is in heaven! She takes everything Natassia does to her and begs for more. The insatiable slut is then brought to her knees to worship Natassia's huge ass and cock. After the frantic, spitty blowjob Dee is laid out on the floor and fucked deep in her cunt. She screams in pleasure as Natassia pounds away. Eventually Dee is put face-down, pleading to be railed in her hungry asshole. To her delight Natassia puts her hard cock deep in her tight hole while rubbing her swollen clit. Dee is allowed use of a vibrator as she writhes in orgasmic ecstasy while Natassia drills her ass, then pulls out to cum all over her pretty pink pussy. With her hands clenched around Dee's throat, Natassia tells her she will have to wait right there on her dungeon floor, dripping with cum until she returns to play with her little fuck toy again.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Natassia Dreams",
      "person_id": 16310
    }
  ],
  "release_date": "2018-12-17",
  "scene_id": 43797,
  "tags": [
    "Athletic",
    "Ball Gag",
    "Big Tits",
    "Black",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "dungeon",
    "fake boobs",
    "Gag",
    "muscular",
    "natural boobs",
    "Pain",
    "Role Play",
    "shaped",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Tattoo",
    "tea2020",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Exquisite Anguish: Dee Williams Opens Up For Natassia Dreams"
}