{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Stunning redhead Aspen Brooks meets with attorney Lilith Luxe to discuss her legal problems. The list of charges against Aspen is long and serious, so Lilith initially turns her down. But Aspen is desperate and declares she's just too pretty to go to jail. She suspects Lilith is a lonely woman, so she decides to give her what she needs in order to convince her to help. Aspen stands over the smaller Lilith, demanding she get on her knees and suck her cock. Aspen pulls up her skirt and shoves her fat dick in Lilith's face. Lilith protests, worried someone in the office might come in, but Aspen assures her they're alone. Soon enough Lilith is slobbering on Aspen's hard cock and sucking her balls. \"You can't be a good girl all the time,\" she informs her, giving her permission to release the naughty slut inside her. Naked on the floor, Lilith worships Aspen's cock. Aspen lets Lilith play with her big tits and smothers Lilith's face between her two tits. Lilith removes Aspen's high heels. She worships Aspen's feet. Sucks her toes. Aspen goes down on Lilith's now soaking-wet pussy. \"With all this pleasure comes a little pain,\" she informs Lilith before attaching clamps to her nipples and skin. Intense pain helps a lady forget her troubles. A vibrator helps too. Aspen fucks Lilith in the pussy as the previously hesitant lawyer now begs to be used. She ends up on her back, legs spread high and wide, with Aspen's cock drilling deep into her ass. Our lawyer cums hard. She is so glad Aspen walked into her office today. Lilith hungrily stuffs Aspen's cock in her mouth, cleaning it off. Aspen blasts a load of hot cum across Lilith's face and in her mouth. So much delicious cum for Lilith to swallow. Fully satisfied, Lilith relents, and she's now ready to fight to keep Aspen out of jail... if only so she can get fucked in the ass by this redheaded beauty again and again.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Aspen Brooks",
      "person_id": 59054
    },
    {
      "name": "Lilith Luxe",
      "person_id": 55114
    }
  ],
  "release_date": "2019-01-28",
  "scene_id": 43800,
  "tags": [
    "Anal",
    "Big Tits",
    "Blowjob",
    "Cock Worship",
    "Feet",
    "Foot Worship",
    "High Heels",
    "Nipple Clamps",
    "Pain",
    "Pussy Eating",
    "Redhead",
    "Role Play",
    "Straight",
    "Swallow",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Aspen Brooks Is Too Pretty For Jail!"
}