{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Crazed, hot Mona Wales finds sexy trash-baby Rocky Emerson smoking in the back alley of a club, just looking for trouble. And trouble she finds. Mona gets right to it; taking Rocky's last cigarette for herself while inspecting her tight little body. She quickly brings her to her knees and sits on her like a pony. Mona humiliates her by using her mouth as an ashtray while slapping her perfect ass. Rocky begs for more as Mona flogs her relentlessly. She is then flipped over and instructed to rub her pussy while her tits and thighs are flogged. The second scene opens up on Rocky suspended in bondage hanging upside down with a dildo gag ready and waiting. Mona lays on the filthy alley floor getting deeply fucked by Rocky's dildo'ed face. Once she comes she rips the dildo gag off so that Rocky can lick her cunt and asshole clean. Mona crops Rocky's belly, breasts, ass and thighs before she licks and fingers her hungry hole, making her come over and over again, upside down while pressing the hitachi on her engorged little clit. Mona's strap on dick then impales Rocky's wet pussy as Mona rubs her clit with one hand and tugs on the string of a zipper with the other. Rocky is writhing between pain and pleasure, completely under Mona's spell. Right as she screams out that she is coming Mona pulls the clothes pins off all at once. She is then flipped over and made to lick the dirty alley floor as she is ass fucked with a vengeance. Once Mona is through, Rocky is thrown in the trash can where she belongs, given only a vibrator to help endure the brutal foot caning Mona doles out. Rocky is made to proclaim her love for being trash and left out in the alley, as Mona struts back inside, satisfied, to resume her night of clubbing.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Rocky Emerson",
      "person_id": 61399
    }
  ],
  "release_date": "2018-12-06",
  "scene_id": 43803,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pain",
    "Pussy Eating",
    "Slapping",
    "Slave",
    "Smoking",
    "Straight",
    "Strap On",
    "Sub",
    "Vibrator",
    "Zipper"
  ],
  "title": "The Trash Baby"
}