{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The gorgeous Penny Pax and Chanel Preston are looking for a naughty girl's night out, but their adorably incompetent waitress, Kimber Woods, keeps fucking up the drink order. Obviously in need of a lesson in service, Penny and Chanel demand that Kimber meet them at the end of her shift. Immediately stripping down their new service slut, Penny and Chanel give Kimber the spanking she deserves! Bent over Chanel's knee, the two goddesses make Kimber's juicy, round ass bright pink before stringing her up to the ceiling and riding her face. As Penny crops her tender thighs, Chanel rubs her dripping wet cunt across Kimber's eager tongue, making sure she finally gets her money's worth from this slutty waitress! One hole down and two to go, Chanel and Penny lower Kimber to the ground, stuffing her tight pussy in missionary and doggie while spanking, slapping, and flogging her clit and ass until her body convulses from intense multiple orgasms. But there's one hole left to train! Chanel and Penny give Kimber the hard, deep anal fucking she needs before serving up a double penetration that their little toy won't soon forget! Sliding in and out of both of Kimber's gripping, pink holes, Chanel and Penny's cocks rub against each other inside of their little whore. As Kimber cums over and over again, she thanks these goddesses for training her to be a proper service slut! Before sending Kimber back to work, Chanel and Penny have one last orgasm each, rubbing their delicious juices all over their newly trained servant and flogging her until she screams in the ultimate pleasure and pain of devoted service.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    }
  ],
  "release_date": "2019-01-17",
  "scene_id": 43806,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Dominatrix",
    "Double Penetration",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "Pain",
    "Pussy Eating",
    "Slapping",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub"
  ],
  "title": "Service Slut Training: Bad Waitress Strap-On DP'd"
}