{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Incredibly hot hacker, Ryan Keely, has been monitoring the illicit activities of the equally stunning international hacker Kira Noir. She has a special bone to pick with her as Kira's new hacking endeavors have crossed into Ryan's own activities. Now Ryan finally has enough dirt to blackmail Kira into submission, and give her a taste of her own medicine. She calls her down to her den where she lays it all out on the table for her. At that moment Kira knows she has no choice but to submit to Ryan's wild sexual demands. Ryan starts her joyful revenge by making Kira worship her feet. She then proceeds to spank her and get her hot tight booty red and plump. Ryan pulls her latex dress up to reveal her nice wet pussy, and makes Kira lick her and pleasure her with her fingers. She then bends Kira over and plays with her tight little pussy until she cums. Kira then appears suspended upside down, helpless and at Ryan's mercy. Ryan teases her by shocking her senses. She runs the wand from her tongue up to her pussy, then licks her pussy and makes her cum with the vibrator while she shocks her body. Ryan takes advantage of her upside down position so she backs her ass on to Kira's face for a nice big orgasm. Then she takes Kira to the floor where she paddles her feet and big juicy ass. She gets her pussy nice and wet with a few licks then slides her big black cock into Kira's tight little pussy. She gives her a few shocks as she gives her a good pounding. She then makes Kira get on top and ride her cock until she cums all over it. A few shocks more, and Kira knows exactly who's been hacked.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ryan Keely",
      "person_id": 15370
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    }
  ],
  "release_date": "2018-11-22",
  "scene_id": 43802,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Kinky",
    "Latex",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Slave",
    "Straight",
    "Strap On",
    "Sub",
    "Submission",
    "top",
    "Vibrator"
  ],
  "title": "Hacked Assets: Ryan Keely Blackmails Kira Noir For Kinky Lesbian Sex"
}