{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Pretty little Dresden finds herself in quite a predicament, deep in the depths of Cherry Torn's dungeon. Chest harness, nipple clamps, a spreader bar to keep her legs apart. Cherry commands Dresden to hold her arms out while a heavy metal bucket hangs from each wrist. Rope runs from her wrists through the ceiling to the nipple clamps. If Dresden chooses to disrespect Cherry and drop her arms, the rope will yank the tight clamps from her delicate pink nipples. This would be extremely painful and something Dresden desperately hopes to avoid. Cherry flogs Dresden's ass. Dresden takes the pain and holds her arms up. Cherry spanks her naked ass, then flogs her bare, exposed pussy. Dresden fights through the pain, she does not wish to disappoint. Cherry places a tight grip on Dresden's pussy. Some rough pussy spanking and Dresden's arms fail...she is exhausted but the day has just begun. Cherry ties a vibrator to a pussy hook and inserts it inside Dresden. Poor Dresden still must hold the buckets perpendicular to her side. Cherry whips her bare ass. Dresden struggles to keep her arms straight. So much pain from the whip, but the pleasure from the vibrator is even more unbearable. Dresden's knees buckle, she doesn't know if she can take it. Her ass cheeks burn red. Dresden begs Cherry to remove the buckets. When Cherry leaves for a moment, Dresden steals another orgasm from the vibrator. This willful act of independence will have consequences...Dresden is tied up, hands behind her back, leg tied to the ceiling. Cherry grinds her pussy on the poor slut's face. Cherry informs her slut that she'll have to do better than that for her to forget her slut's indiscretion. Cherry smothers her slut's face with her ass. Dresden apologize by licking Cherry's ass and pussy til Cherry cums. Cherry, now in a better mood, is ready to fuck Dresden, but only if the little slut begs for it. Fucked with a dick on a stick. Dresden's pussy hole opens up for Cherry's dick. Now it's Dresden's turn to take it in the butt. Cherry's large dildo pushes deep into Dresden's ass, pressing on her G-spot. Anal doggy then anal missionary. With the vibrator on her pussy Dresden cums over and over until Cherry turns the vibrator on herself. Dresden is desperate to lick Cherry's wet pussy, hungry to lick all of her juice. Cherry is queen fucking greedy.",
  "models": [
    {
      "name": "Dresden",
      "person_id": 58978
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    }
  ],
  "release_date": "2018-11-08",
  "scene_id": 43801,
  "tags": [
    "bdsm",
    "bondage",
    "Cherry Torn",
    "Corporal Punishment",
    "dildo",
    "dominatrix",
    "dungeon",
    "Face Sitting",
    "femdom",
    "Fingering",
    "humiliation",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "nipple clamps",
    "pain",
    "Pussy Eating",
    "harness",
    "slave",
    "spanking",
    "straight",
    "strap on",
    "vibrator"
  ],
  "title": "Cherry Torn's Dirty-Talking Anal Lesbian Slut"
}