{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The hot and sexy Riley Nixon is an ambitious slave, late to her first meeting with the stunning Mistress Helena Locke. Helena is unhappy with Riley's tardiness and must punish her accordingly. She notices Riley is a little too eager to redeem herself, and she begins to suspect this sexy slave is here to serve her submissive self rather than her mistress. Helena shows this sexy slave her place, then bends her over and inspects her nice round ass. She gives it a few spankings, leaving her booty rosy red. Helena then directs Riley to the floor so she can worship and lick her boots clean. Riley works her tongue hard to prove her mouth is worthy so she licks her way to redemption. Helena sees Riley work her mouth and is pleased with the results. She lets Riley lick her pussy and service her like a good slave. Riley licks her until she cums all over her filthy little slave mouth. Then Riley gets tied up and takes a good flogging on the St Andrew's cross. Helena serves her slave a little pain and pleasure as she clamps Riley's nipples and plays with her pussy. She then uses a hitachi and plays with her little slave's pussy until she allows her to cum. Now that her slave's wet cunt is ready for redemption, she gets her huge strap on cock ready. She gives Riley's pussy a good punishing and reminds her that she is there to serve. Helena then takes her big cock and slides it in Riley's tight little ass. She pounds her holes and teaches this little late slave a lesson in timing. After a few orgasms and some time in the cage for later use, this slave may never be late again.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Riley Nixon",
      "person_id": 59619
    }
  ],
  "release_date": "2019-01-03",
  "scene_id": 43805,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Cage",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Hitachi",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pain",
    "Pussy Eating",
    "Slave",
    "Straight",
    "Strap On",
    "Sub"
  ],
  "title": "Riley Nixon's Late Slave Redemption"
}