{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Tis the season to be jolly, but after working all day long these two sexy present-wrappers are anything but. The hot and sexy Gia DiMarco and her coworker Aaliyah Love are tired of working late and taking orders from their hounding boss Maya Kendrick. Fed up with Maya barking orders and not helping with the workload, the two sexy disgruntled workers take Maya down and teach her a lesson she won't soon forget. They strip her clothes off and take turns spanking and flogging her super hot booty. They put Maya on the floor and take turns making her lick their pussies. Determined to teach Maya a lesson with a little pain and pleasure, they place clamps on Maya's pussy and nipples. They gag her mouth so no one can hear her scream as they give her pain and pleasure. Gia uses a cane on Maya as Aaliyah licks her pussy. They make her beg for more pleasure as they tease her pussy. Gia and Aaliyah then take turns fucking Maya with a big cock. First they fuck her tight little pussy, making her beg to cum then they stuff her ass with a big cock. Not satisfied with the punishment they are dishing out, they decide to stuff both of her holes at the same time. They give Maya a good fucking in her pussy and ass until they allow her to cum. Gia then shoves her booty in Maya's face so she can get a taste of her juicy ass. After giving her a good round of much-deserved punishment, Gia and Aaliyah take turns making Maya lick their pussies until they both cum. Now that they've taught their boss a lesson, they can wrap her up and call it a night. Another tale of holiday revenge.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aaliyah Love",
      "person_id": 61396
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2018-12-20",
  "scene_id": 43804,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "christmas",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pain",
    "Pussy Eating",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub"
  ],
  "title": "Gia DiMarco And Aaliyah Love Get Back At Their Slutty Boss"
}