{
  "collections": [
    "Hogtied"
  ],
  "description": "Demi has been doing porn for a bit, but she is brand new to us here at Kink. She contacted The Pope and begged for him to tie her up and use her like a good little slut, and we get to see it. She doesn't think of herself as a pain slut, but rather more of a rope bunny. Without hesitation, The Pope starts the day with Demi in a side suspension with her legs spread wide. She is flogged all over her body and the room slowly fills with moans and screams. Her pussy is abused by way of constant vibe action making her orgasm hard. Once she catches her breath from all of the vibration, The Pope throat fucks her before shoving the massive dildo inside of her tight little pussy and fucking her into an orgasm overload. Next, Demi finds herself in another suspension, but this time she is inverted with her legs spread. Her nipples are pinched and pulled to torment her. All of her body weight pulls back making the torment almost unbearable. Once The Pope has had his fill of toying with her, he grabs the vibe and administers non stop orgasms until she cannot handle it any longer. He steps away, only to return with with a 12 pound bowling ball to attach to her neck rope. More orgasms are ripped from her pussy and she convulses with ecstasy as she cums uncontrollably. Demi is a playful little creature, so she is made to twerk her sexy ass to entertain The Pope while in bondage. A large metal hook is brought in and he makes Demi suck on it to get it wet enough to shove into her pussy. It's then tied to her neck and then the zapper is used to continue the ass entertainment. She is finished off with more orgasms, that have proven to be more torment than anything else.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Demi Sutra",
      "person_id": 61557
    }
  ],
  "release_date": "2019-01-03",
  "scene_id": 43816,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Ebony",
    "Fingering",
    "Handler",
    "Humiliation",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Brand New Ebony Slut Demi Sutra Gets Tied and Tormented"
}