{
  "collections": [
    "Device Bondage"
  ],
  "description": "We begin with this damsel in a standing position and restrained to the steel frame with medical grade leather cuffs. She cautiously looks around the dungeon trying to find her captor. Suddenly The Pope appears and slowly walks towards his victim. A ball gag is shoved into her mouth and then he begins to squeeze and pinch trying to find out what makes her purr, and more importantly, what makes her scream. Once he makes his way to her, her pussy is already dripping wet, and although she seems afraid of him, her pussy tells a different story. A full assault to her flesh with the flogger proves to be the perfect foreplay for this little slut. The more he strikes her, the more turned on she becomes. As soon as he touches her pussy again, she squirts all over the floor, and this sets the pace for the rest of the day. The torment continues and she shows us just how much pain she is capable of taking. Now that The Pope has seen what she is capable of handling, he pulls out all the stops and administers one of the most severe and brutal bastinado sessions we’ve ever seen. Her feet are caned, cropped, and then the infamous knitting needle is used to torment all of the sensitive places on her soles. This is usually enough to break most, but it’s just the beginning for Andi. The torment continues for some time before he switches his attention to her pussy. Once the vibe is pressed against her pussy he decides to shove a dildo in her ass and fuck her like the whore that she is. Her ass is fucked and she squirts from the vibe and ass fucking. In the final scene Andi is on her back and the brutality continues. She is caned all over her body, including her ribs and pussy. It has been a long time since The Pope found someone that could handle so much brutality, and he enjoys every second of this slut. The day closes with her pussy being milked for every squirting orgasm he can get out of it.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Andi Rye",
      "person_id": 61556
    }
  ],
  "release_date": "2019-01-10",
  "scene_id": 43814,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "dungeon",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Leather Cuffs",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Redhead",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope",
    "white"
  ],
  "title": "Newbie Andi Rye Proves To Be A Squirting Pain Slut"
}