{
  "collections": [
    "Device Bondage"
  ],
  "description": "Kira loves to submit. It doesn't take much though when she is in the company of The Pope, because he is the one that she craves to submit to the most. She begins on her back for her master, held in place by steel shackles atop her cage. Her back is arched perfectly place in the small of her back. with some assistance from more steel. The Pope enters and with suction devices and electrical implements in is hands. Her body begins to shake with anticipation as his hands move around her flesh applying the suction to her nipples and her clit. The tip of the zapper caress her flesh in between the electric shocks that are administered by him. Her body jolts with every shock, but then he brings out the cattle prod and turns the intensity up ten fold. Kira shows fear in her eyes, but that doesn't stop him. He rakes her skin and shoves the cattle prod into her body to jolt her entire body. She begs to cum as The Pope fingers her pussy with a vibe pressed hard against her clit. The next scene has Kira in the throne of doom with her hands above her head and her legs spread wide. Her eyes are fixated on her master as he puts clothes pins on her breasts. Her body glistens as the drool runs down her body, and then he blindfolds her to play a game. He moves quietly around the dungeon and attack her flesh with the zapper again before making her cum. In the final scene Kira is in a doggy position for easy access to her amazing ass. Her ass and feet are shocked more before The Pope fingers and fucks her pussy.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kira Noir",
      "person_id": 58892
    }
  ],
  "release_date": "2018-12-27",
  "scene_id": 43813,
  "tags": [
    "BDSM",
    "Black",
    "black hair",
    "Bondage",
    "Cage",
    "Cattle Prod",
    "Corporal Punishment",
    "Domination",
    "drool",
    "dungeon",
    "Ebony",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "master",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "shaved",
    "Straight",
    "Submission",
    "The Pope",
    "toned",
    "Zapper"
  ],
  "title": "Hard Bodied Pain Slut Kira Noir Tormented"
}