{
  "collections": [
    "Hogtied"
  ],
  "description": "Kimber is no stranger to bondage, and today her limits are going to be pushed harder than ever before. This all natural, big booty slut starts on her back on a steel table with her legs spread wide. The Pope begins by toying with her by way of extreme pressure point play. The scary part is that Kimber knew what he was doing a soon as he laid his sadistic hands on her. Throughout the entire scene Kimber is teased and then denied with pussy play in between all of the torment. Her body is flogged to the point of tapping out and then she is finally allowed to cum. Now that the orgasms have begun The Pope is going to make her have as many as possible to torment her with her own pleasure. she is stuffed with a huge cock and when she can't handle that any more, the rest are imposed with his hands. The second scene opens and we have Kimber suspended on the wall. Clamps are put on her pussy, but quickly removed when she makes it clear that the pain is too much to bear. Next he flogs her body and turns it a bright shade of red. Now the orgasms come and again we get to see this slut writhe as her body insists on orgasming, even though it torments her. Her pussy squirts and she is flogged for making a mess on the dungeon floor, then more orgasms. The clamps are then applied to her nipples and ripped off. In the final scene Kimber is face down and her ass up in the sir for optimal punishment. Her feet are tormented with severe bastinado and then her ass is spanked. Once The Pope knows that she can no longer handle any more punishment, he destroys her pussy with even more imposed orgasms. She didn't know that her pussy could betray her body and mind, but he did, and makes sure she remembers this lesson for the rest of her life.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kimber Woods",
      "person_id": 54178
    }
  ],
  "release_date": "2018-12-20",
  "scene_id": 43815,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bear",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Rope Bondage",
    "shaved",
    "Straight",
    "Submission",
    "switch",
    "The Pope",
    "the wall",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Big Booty, Blue Eyed Babe Kimber Woods in Brutal Bondage"
}