{
  "collections": [
    "Hogtied"
  ],
  "description": "Rocky towers over almost every person she meets. She is 6'3\" tall, and just barely shorter than The Pope. These two giants collide for one of the hottest scenes in quite some time. The bondage is woven into a beautiful web of torment as it restrains her body from escape as well as keeping her completely helpless. She starts out in an asymmetrical sitting position with her neck tied up to restrict breathing. All of her sensitive spots are vulnerable and The Pope exploits them in a very sadistic way. Rocky writhes around in the rope as it reddens her skin, to try and escape the torment, but is reminded that it's inescapable and the has to endure everything he dishes out. Clothes pins are put on her nipples and a vibe pressed firmly against her pussy gets us our first of many orgasms. Rocky specifically asked for a 'futo' suspension. This basically means that she will be suspended from one leg that is bent and tied to itself. The Pope knows that she is capable of handling such a grueling suspension, or she would not have asked for it, so decides to take it up a notch and make it more extreme than it already is. Rope is wrapped around her her waist and intentionally placed above her hips so that it causes more suffering. She is toyed with before he rips more orgasms out of her willing pussy. The day ends with Rocky on the wooden pony with her pussy resting atop the wooden wedge. Almost all of her weight is resting on her pussy and it's very clear that she is suffering now more than she ever has. She struggles to find comfort, but we all know how this ends. Mouse traps are put on her nipples, then the zapper is introduced and electrifies her nipples and other sensitive parts of her body. She is made to cum once again to finish her off, before he sends her on her way.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Rocky Emerson",
      "person_id": 61399
    }
  ],
  "release_date": "2019-01-17",
  "scene_id": 43817,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Rope Bondage",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "Tall Tattooed Slut in Grueling Bondage is Blissfully Suffering"
}