{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "The hot cougar into extreme bondage is hard to find. We’re truly blessed to know one quite well. Becca Diamond, one hot and amazing woman with a rising career in the sex industry, is no stranger to Fetish Network. The last Master she served had a big black cock she enjoyed worshiping. We’re delighted to share Becca Diamond’s second round. It’s been decided it’s time for our Diamond to endure her first rope suspension. That’s right! We love Becca for rope bondage. The tight rope is tempting against her muscles. She’s been in the dungeon for awhile, tied to a crate, her legs kept open and mouth available for use. Her Master wants to prepare her before he hangs her on the wall. He shoves his big black dick deep in Becca’s mouth, fucking her throat, making her slob all over it. The spit allows Brooklyn to pile in her rubber dick deeper in Red’s throat. Spit is dripping off her face. He doesn’t need to work so hard. Diamond bobs her own head on his dick, enjoying every inch. He wants to see her squirt. He pulls out a vibrator which usually does it every time. He fingers her g-spot as he grindings the wand against her thick clit. Her pussy is like a hose. She’s ready for the wall! Rope is wrapped around her hips, knees, ankles and wrists, legs spread apart, feet off the floor. What happens next is one of the hottest moments on Fetish Network. Becca’s Master has full access to her sweet pink pussy. With the same XXL dick, he pound her pussy in, fucking her rough, using the ropes to fuck her deeper and faster. Becca actually struggles. Seems the suspension may be too much for her. But she wants to please her Master and swings herself onto his dick, ball gag in her mouth the entire time, hands gripping her neck. Her clit gets a bit of vibration torment, cumming more times she can handle. Let’s see if Becca returns after this slave training session.",
  "directors": [],
  "models": [
    {
      "name": "Becca Diamond",
      "person_id": 55119
    },
    {
      "name": "Steve Dash",
      "person_id": 61418
    }
  ],
  "release_date": "2018-09-20",
  "scene_id": 43820,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "Bondage",
    "Breast Bondage",
    "Deepthroat",
    "dungeon",
    "Facefucking",
    "Feet",
    "Fetish",
    "Fingering",
    "Gag",
    "Hitachi",
    "Latinx",
    "master",
    "MILF",
    "muscular",
    "natural boobs",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Squirting",
    "Straight",
    "Sub",
    "Suspension",
    "Tattoo",
    "the wall",
    "Partner Studio",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Becca Diamond's First Rope Suspension with Plenty of BDSM Sex"
}