{
  "collections": [
    "CFNMEU"
  ],
  "description": "Alex Stan is due for some punishment. He is shackled and blindfolded and wrapped in plastic, with his stiff cock poking through a hole. He moans as he tries to release himself. His sexy tormentor arrives and tells him to keep quiet as she starts to slap Alex and pull on his nipples that are poking through the plastic. Taking some nipple clamps she attaches them to Alex, making him moan louder. His cock stays hard as she works on those nipples. Continuing to work the nipples the girl also whips him. Then she turns her attention to his big, hard, cock. She slaps it, wanks it and then sucks the balls too. She slaps and hits the cock and balls before whipping some more and then turning Alex around. His ass is exposed and quickly gets spanked and whipped. Alex is then turned again to have his cock wanked and then to feel the clamps being applied to his ball sac and tight foreskin. After tormenting the cock, balls and nipples a while the girl pulls the plastic from Alex's body. He is pushed to the floor, with his ass exposed. That ass soon feels a finger sliding deep inside. Then a dildo goes in and fucks the hole as the girl also wanks Alex's cock. He keeps moaning as his hole gets stretched. Moving Alex onto his back the girl then shoves a cucumber into his hot hole. That really opens him up and fucks him deep as his cock is wanked too. The girl has a strap on too and is soon fucking him with that. Finally she relents and lets Alex wank himself until his shoots his hot cum.",
  "directors": [],
  "models": [
    {
      "name": "Alex Stan",
      "person_id": 61554
    },
    {
      "name": "Pomstychtiva Pritelkyne",
      "person_id": 61365
    }
  ],
  "release_date": "2018-09-21",
  "scene_id": 43829,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Ball Gag",
    "Blindfold",
    "Bondage",
    "CBT",
    "CFNM",
    "Collar",
    "Dildo",
    "dungeon",
    "Femdom",
    "Flogging",
    "foreskin",
    "Leather Cuffs",
    "Male Sub",
    "masturbation",
    "Nipple Clamps",
    "Pegging",
    "Sounding",
    "Straight",
    "Strap On",
    "Tattoo",
    "thirdparty",
    "Whipping"
  ],
  "title": "Handsome Alex Stan gets it all!"
}