{
  "collections": [
    "Device Bondage"
  ],
  "description": "Bobbi Starr is one of the sweetest girls around. If you met her anywhere else besides a porn studio, you'd never guess what she gets up to. She seems as wholesome as can be with her classic \"girl next door\" appearance complimenting an oddly innocent demeanor for a hard core porn star. Her charms won't buy her any quarter here though. Moments after her interview, cyd takes off one of her shoes - a pink high heel with an alligator skin pattern, filthy from being worn by model after model - and stuffs it in her mouth. A fashionable, yet functional gag that becomes a bit less fashionable after cyd punches holes in it and unceremoniously straps it to her face with a rough leather strip. She gags from the odor wafting into her nostrils and turns her head to try and avoid the smell, but to no avail. cyd cuts off her underwear and exposes her cunt for examination. Bobbi screws her eyes shut in a mixture of humiliation and arousal as the camera zooms in.Two more scenes follow. In one, Bobbi is bent over a device with her nipples clamped and pulled down while her arms are pulled back and up in a painful strappado. in another, she is made to kneel in a rusty iron cage. A bar runs across the cage, holding her arms up behind her by the elbows and forcing her head down. Her face presses against the cold metal as her pussy is rammed with a dildo on a steel pole and a powerful vibrator is pressed against her clit. Nipple clamps add to her torment, painfully punishing any attempt to find a bearable position for her aching body.",
  "directors": [],
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    }
  ],
  "release_date": "2007-04-11",
  "scene_id": 4382,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Cage",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "slim",
    "Straight",
    "Submission",
    "unshaved",
    "Vibrator",
    "white"
  ],
  "title": "If The Shoe Fits..."
}