{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Oscar is watching porn (Alley Pigs in Bondage) in his living room when there is a knock on the door and slaveboy Sean Patrick enters wearing a T-shirt, jeans, Converse sneakers and a collar locked around his neck. Head bowed, hands behind back, he comes slowly down the hallway, then kneels as he enters the room. Oscar chides him for kneeling without being told to (Sean jumps to his feet) and asks if Sean has something for him. Sean hands him a small pouch, which he opens. It contains a letter and a remote. Oscar tells Sean to go back to the other side of the room and read him the letter, which thanks Oscar for agreeing on short notice to boysit Mario’s slave for a week, while Mario is out of town, and tells him a little about the boy. Oscar understands very well what the remote is for. He presses the button, and Sean cries out and doubles over. During the reading of the letter, Oscar jolts Sean a number of times. He also does this while Sean is stripping down at his command. The only item of clothing Sean doesn’t remove, because he can’t, is a locked on dildo/buttplug electric bullet harness. Oscar orders Sean to masturbate, then to spank his own ass, then to smack his hard dick, then to crawl to him and lick his boots. He orders Sean to go from one boot to the other, scolding and hitting the remote when the boy doesn’t do it fast enough for him. Sean howls. Oscar pulls Sean’s face to his crotch, and makes Sean suck his dick, while pinching Sean’s nipples. He skullfucks Sean, then pushes Sean away and orders him to get hard, jolting him with the remote during the process. Finally, Oscar gets up and has Sean follow him into the bedroom on all fours. Inside, Oscar turns to face the boy whose lips rest on Oscar’s boots. Oscar orders Sean to take off his, Oscar’s, shirt, fold it, then suck his nipples. He pushes Sean’s head into his armpits. He orders the boy to remove his boots, prodding him to go faster with electric jolts. Sean kisses Oscar’s socked feet. Oscar orders Sean to remove his socks and put them in the boots. Sean licks Oscar’s jean-clad crotch. Oscar unbelts his jeans and makes Sean lick his cock and smell his crotch, then lick his balls. He beats on Sean’s tongue with his cock. He tells Sean to take just the head of his cock in his mouth, then skullfucks him. He orders Sean to put his hands behind his back when he sucks, but Sean loses balance and grabs Oscar’s legs. Oscar gets Sean to his feet, and cuffs Sean’s hands behind his back",
  "directors": [],
  "models": [
    {
      "name": "Oskar",
      "person_id": 61552
    },
    {
      "name": "Sean Patrick",
      "person_id": 61551
    }
  ],
  "release_date": "2018-09-25",
  "scene_id": 43826,
  "tags": [
    "Acrylic Plug",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot",
    "Boot Worship",
    "brunet",
    "buttplug",
    "Collar",
    "Dildo",
    "Discipline",
    "domestic",
    "Electrical Play",
    "Facefucking",
    "Feet",
    "Gay",
    "Jockstrap",
    "Leather",
    "Older/Younger",
    "other hair color",
    "harness",
    "shoe licking",
    "Slave",
    "Partner Studio",
    "Twink",
    "white"
  ],
  "title": "Boysitting: Boy Meets Boysitter"
}