{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Brunette beauty Whitney Wright is tied up and held for ransom Mr. Pete can’t resist her sex appeal and the evening turns into an Anal Heist! Wearing a sexy robe and white high heels Whitney is bound in rope, gagged and doing everything she can to get Mr. Pete’s attention. She is bored and wants to fuck! She tosses her hair in a flirtatious manner, reveals her small sexy tits and rubs her pussy until finally Mr. Pete gives in and decides to have his way and give her what she desperately wants - hardcore BDSM, flogging, fucking, sucking, slapping and domination. On all fours Whitney arches her back and wiggles her ass while Mr. Pete flogs her until her skin burns and turns red. After getting totally turned on from the corporal punishment Whitney asks Pete for that dick of his so she can suck it and boy oh boy can she suck cock. Deep throat, slurpy and wet she takes Mr. Pete to the edge with her skillful sucking but now it’s time to fuck. Tied up on all fours in doggie Whitney gets the crop on her sensitive thighs and ass, then Pete slides his fat cock inside her wet pussy and takes her to pound town. He fucks her pussy real good and then slips a glass dildo into her asshole so both holes are filled up and happy. Then Pete fucks Whitney’s ass and all is right with the world cuz she’s screaming and loving it and begging to cum. Now tied up on her back with wrists tied to ankles, Mr. Pete holds Whitney’s delicate neck, fucking her pussy and ass deep and hard filling her with pleasure until he blows his load all over her.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Whitney Wright",
      "person_id": 61018
    }
  ],
  "release_date": "2018-11-30",
  "scene_id": 43833,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Flogging",
    "foreskin",
    "High Heels",
    "Humiliation",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "slim",
    "Straight",
    "Stud",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Anal Heist"
}