{
  "collections": [
    "Str8Hell"
  ],
  "description": "Rado Zuska is one very studly guy. He knows what he likes and he likes Paul Hunter. He has him chained at the wrists and naked, but for a jock strap. He kisses the handsome Paul and plays with his nipples. He also slaps on Pauls great chest as both the oiled bodies rub against each other. Rado pushes Paul to his knees, where he can suck on some rock hard cock. Rado's dick is throbbing as it fucks into Paul's eager mouth. He pulls out and slaps that throbbing cock against Paul's face before fucking the mouth some more. Then Rado wanks himself as Paul laps at his tight balls. He fucks the cock back into Paul's mouth, slapping his handsome face too. Then Rado lays Paul down and gives him a blow job too. He sucks on Paul's rock hard cock, taking it deep into his mouth, all the while slapping on that hot body and face. Rado needs more than some cock to suck and Paul eagerly lifts his legs, so his hole is available. Quickly Rado is on it, fingering the tight hole and lapping at it with his tongue. Then Rado's cockhead is up against the hot hole, and pushing into it as Paul bends over to take it. He loves the dick slamming into his hot ass as hard as Rado can manage it. Rado grabs Pauls shoulders to give him extra leverage as the thrusts his dick all the way into that ass. Paul moans as he takes the thick dick deep in his ass. Then Paul turnbs over and lays down so that Rado can get between his legs and fuck him even harder. Paul grabs his cock and wanks it as Rado pounds his ass. Soon Paul'shot cream explodes from his cock as his ass is filled with Rado's throbbing dick. Rado keeps fucking that ass unti he is ready to cum. He pulls out and Paul sits up to suck on the rock hard dick. Rado grabs his dick and a few tugs makes it release its' hot cum. Pauls grabs the cock again and sucks the rest of the cum out of it to finish a fabulous scene.",
  "directors": [],
  "models": [
    {
      "name": "Paul Hunter",
      "person_id": 60768
    },
    {
      "name": "Rado Zuska",
      "person_id": 61061
    }
  ],
  "release_date": "2018-09-28",
  "scene_id": 43830,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Bareback",
    "bestof2018",
    "Blowjob",
    "Bondage",
    "brunet",
    "Chains",
    "Facefucking",
    "Fingering",
    "Gay",
    "jock",
    "Jockstrap",
    "Muscle",
    "Rimming",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Swallow",
    "Tattoo",
    "thirdparty",
    "Uncircumcised"
  ],
  "title": "Two hunks Paul Hunter and Rado Zuska go at it"
}