{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Mr Pete finds sexy Demi Sutra Tied up and Stranded in the woods he draws her into a world of drug smuggling, BDSM and hardcore sex. Pete is searching for something his friend Ivan supposedly left for him in a secret spot, but instead finds a beautiful damsel in distress, gagged and chained to a tree screaming for help. Adorned with long curly locks, tight cutoffs and rope binding her crotch, she is a sight for sore eyes. Mr Pete recognizes her as Ivan's girlfriend and decides to use her for his own sordid affairs. Even though she isn't happy about being tied up out in the middle of nowhere, she is a horny slut who is more than willing to give Mr Pete what he wants in order to be free. He takes her gag out and she begs for his cock in her mouth. Mr Petes thick dick plunges deep down Demi's throat turning her into a choking, slobbering mess. When he almost leaves her behind she begs him to take her with him and so he does--maybe she can help him with his dirty dealings. But first let's play! Mr Pete ties Demi up bent over a table with one leg down and one leg up spreading her pussy for easy access. He whips her with the flogger on her firm ass and thighs and teases her with his tongue until she begs him to fuck her. Mr Pete fills her wet and ready pussy right up with cock and takes her on an exhilarating ride to pound town. She can hardly contain herself with all this good fucking she squirts and cums all over Pete's capable cock. Then, tied up on her back with wrists tied to ankles, Mr Pete excites her with the crop and flogger and fingers her pussy till she squirts again. Now she's ready for more of that delicious dick, cuz she just can't get enough. Mr Pete slides his cock inside Demi's slutty little pussy and grabs the rope strapped on her chest for leverage. Her sexy natural tits bounce back and forth while he vibes her pussy and fucks her until she begs to cum, and ohhh she cums hard, causing Mr Pete to lose it and shoot his hot jizz all over Demi's satisfied pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Demi Sutra",
      "person_id": 61557
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2018-12-14",
  "scene_id": 43839,
  "tags": [
    "BDSM",
    "Blowjob",
    "Choking",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Gag",
    "Humiliation",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "Tied Up and Stranded"
}