{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Sailor Luna is the kind of wanton whore who is all too willing to do whatever it takes to please a sadistic male dominant. Her three whore holes exudes a raw sexual energy that makes a cruel man drool with desire. Sailor finds herself coerced and bound in a straight jacket and isolation hood that makes her completely out of control and vulnerable to the cruel intentions of a brutal taskmaster. After tenderizing her soft skin with a nasty electric zapper her dom works her ass over with a heavy leather flogger and thin wooden cane. She yelps and squeals and tries to escape the path of the onslaught of brutal impact play but the bondage is inescapable and she is unable to avoid the abuse of the cruel torment. She is then tied to a sybian and is repeatedly and brutally face fucked over and over until she gags and chokes all over a massive cock. All the while her greedy pussy grinds on the vibrating face of the sybian causing her to cum multiple and repeated female orgasms. Her eyes roll back into her head from the intense pain of non stop sexual stimulation while she is made to aggressively suck dick. Next she is tied to a table with her legs spread apart with tight rope bondage. Her tight pink pussy is then fucked into submission and brutally abused with a relentless hitachi. Once warmed up, the massive cock is jammed into her asshole, sending her body into tremors. The male dom fucks her tight asshole until the table she is tied to is shoved clear across the room. And before she can catch her breath, the greedy slut is tossed onto the floor, perched on her delicate knees with her ass spread wide in the air. The sadist digs in and continues the anal onslaught of her teeny butt hole. He spanks her perfect round ass until it grows red with delight causing the whore to beg to gobble up a huge load of his jizz. He is only too happy to oblige and blows a huge load of cum all over her jiggling ass and the cleans up the mess with her sweat drenched face. He spits on her and walks away, leaving her in a heap of her own mess and anal juices.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Sailor Luna",
      "person_id": 60911
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2018-12-05",
  "scene_id": 43835,
  "tags": [
    "Bondage",
    "drool",
    "Hitachi",
    "Hood",
    "Leather",
    "Pain",
    "Rope Bondage",
    "Straight",
    "Straitjacket",
    "Sub",
    "Submission",
    "Sybian",
    "Zapper"
  ],
  "title": "Whore Slut Sailor Luna Ass Fucked In Rope Bondage"
}