{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "What happens when a self-proclaimed masochist and shameless submissive Juliette March gets lured into a secret dungeon by a cruel, vindictive, and sadistic Derrick Pierce? The answer to the question is simple: jaw-dropping extreme sexual domination and cruel torment. As soon as Juliette is accosted by Derrick, he straps her upside down and spread eagle to a steel girder that supports the ceiling of an abandoned warehouse. With a leather hood completely isolating her vision, Juliette is completely vulnerable to that attacks of her relentless tormentor. He proceeds to beat her ruthlessly with a heavy leather flogger and then with a single-tailed whip. She shrieks from the excruciating horror of pain that she can't see coming and cannot control. Derrick jams a vibrator into her tiny pink pussy and rips non-stop multiple orgasms from her unwilling fuck hole. Tired of hearing her pleas for mercy, he then tosses Juliette to the floor like a rag doll and removes her leather deprivation hood. The task master then takes a small switch of bamboo and works her sensitive natural small tits and nipples, leaving a trail of painful red welts that pulsate with pain. Gasping, Juliette opens her mouth and Derrick takes the opportunity to shove his massive cock into the back of her throat. She immediately gags and chokes on it, but that is just the beginning. She then proceeds to get a hard face fucking. Now that his female sex slave is warmed up, the dom chains her to a chair with her ass exposed and open. He then spanks her tight and firm butt until it glows neon pink from the rough impact play. He then takes his cock and begins to relentless fuck her teeny pussy until she gushes from the pleasure. A girl like Juliette can't stop cumming once the validation of a giant erect penis pierces her inner reaches. She begs to cum but the dom laughs and relishes the joy of her orgasm denial. As she whimpers and pleads for release, the dom takes his cock and shoves it into her tight asshole. She screams from the pain but this only engorges the Derrick's member further and he pushes it deeper inside her. He pounds her relentlessly and finally allows his captive slut to have an orgasm. But Juliette's pleasure is short-lived and she quickly finds herself on her back with legs and arms tied with tight and restrictive rope bondage. The restraints are inescapable and she looks on in trepidation as the dom approaches her helpless body. He then fucks her sore and swollen pussy and gaping asshole until she pleads to gobble his ejaculation. And in a fevered frenzy he blows his massive load of cum all over Juliette's face and tits. Juliette smiles... she finally got what she wanted.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Juliette March",
      "person_id": 22072
    }
  ],
  "release_date": "2019-01-16",
  "scene_id": 43837,
  "tags": [
    "Ball Gag",
    "Blowjob",
    "Bondage",
    "Caning",
    "Chains",
    "Corporal Punishment",
    "Deprivation",
    "Domination",
    "dungeon",
    "Flogging",
    "Gaping",
    "Hood",
    "Leather",
    "master",
    "multiple orgasms",
    "natural boobs",
    "Orgasm Denial",
    "Pain",
    "Rope Bondage",
    "Slave",
    "Small Tits",
    "Straight",
    "Sub",
    "switch",
    "Vibrator",
    "Zapper"
  ],
  "title": "Tiny Masochist Juliette March Coerced into Bondage and Anally Fucked"
}