{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Mickey Mod can't resist the scent of a beautiful bad ass Jane Wilde. He used to be her inside man until she went rogue and fucked him over. Now he's going to pay her a visit and show her who is boss with some serious BDSM, sensory deprivation, hardcore sex and more. After a cat and mouse take down Mickey turns the tables on Ms Wilde and makes her stuff all the money into his pockets. Then he unzips his trousers and pulls his big dick out for Jane to marvel at. She is more than ready to suck that cock even though she thinks he ain't nothin' but a Pussy Ass Bitch. How can she resist when its right there in her face, stiff and promising to give her a great time. He cuffs her wrists and throat fuck central happens as Mickey plunges his dick deep down Janes throat making her gag and slobber all over her small natural tits. Still looking for the money she owes him Mickey ties Janes hands and wrists and shows her who is boss by dunking her head in a deep pool of water over and over again until she can't take it anymore and submits to his domination. Now the fun begins when Jane is on all fours in bondage begging Mickey Mod to please fuck her. Well its not a hard choice for him cuz after all he can't resist her sexy hotness. Mickey fucks Jane's slutty wet cunt deep and hard and she immediately loves it. His cock is so big and hard and long he stretches her out until she is begging to cum. She can't get enough of his action and wants it in her ass so Mickey fills her butt up with cock and pounds her out making her drool and moan with pleasure. Then on her back with legs spread wide open for easy access Mickey fucks Janes little pussy, takes her over the edge with the vibrator and then hits that ass one more time before he shoots his hot load all over her. Ahhh yes all is right in Jane Wilde's world. Now get the fuck out you Pussy Ass Bitch!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Jane Wilde",
      "person_id": 61147
    }
  ],
  "release_date": "2018-11-23",
  "scene_id": 43834,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Deepthroat",
    "Deprivation",
    "Domination",
    "drool",
    "Dunking",
    "Facefucking",
    "Gag",
    "Humiliation",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Small Tits",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Pussy Ass Bitch"
}