{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Violet Monroe is the type of quiet and gentle soul that no one ever expects to be sex-starved pain slut. But beneath her timid exterior is a submissive beast that thirsts to be abused and fucked with massive cocks. She starts her day fully suspended from an iron beam that dangles in the middle of an empty warehouse. The sounds of her screams are drowned out by the drone of trains passing by and from the wail of steel being ground. The rope bondage is severe and inescapable, so her ability to move is almost non existent. She is completely vulnerable, exposed, and in over her head to the cruel intentions of a brutal male dom. Her sadistic master Derrick Pierce quickly begins to beat her smooth and flawless skin with a heavy leather flogger. He decimates her round and perfect tits with nasty clover clamps that yank and pull at her tender nipples. As the pain of the assault flushes Violets body with endorphins, a hitachi is tied to her hungry pussy and relentlessly stimulates her clit with ceaseless orgasms. Now that she is warmed up, Derrick ties her in a kneeling position to a wooden cross. With a course piece of rope around her neck, she is made to suck and choke on his massive cock. Drool pools and drains down the front of her body, making her pussy glisten with depraved desire. As the face fucking continues, Violet submits to breathless delight and submissive ecstasy. Next she is tied to a table with her legs spread wide open, exposing her teeny pink pussy and tight asshole for a deranged fucking. But before she is penetrated, her whole body is worked over with a bamboo cane which leaves thin red welts all over taut white skin. Violet pants and praises her sadistic male taskmaster for the exquisite abuse. He then takes his giant rod and crams it into her whore whole. As a vibrator stimulates her engorged clit, she begs to cum again and again, only to be cruelly punished with orgasm denial. Violet is then flipped on the floor and fucked brutally from behind. Her tiny asshole is crammed mercilessly full with the dom's massive cock and anally fucked clear across the room. She begs for his cum and he is only too happy to oblige. Breathless and glistening with sweat, Violet's dreams come true as she gobbles a massive load blown all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Violet Monroe",
      "person_id": 20284
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    }
  ],
  "release_date": "2018-12-19",
  "scene_id": 43836,
  "tags": [
    "bondage",
    "clover clamps",
    "drool",
    "Hitachi",
    "leather",
    "master",
    "orgasm denial",
    "pain",
    "pain slut",
    "Petite",
    "rope bondage",
    "Smooth",
    "straight",
    "vibrator",
    "white"
  ],
  "title": "Petite Pain Slut Violet Monroe in Rope Bondage and Brutal Anal Fucking"
}