{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "All natural blonde girl next door, Kate Kennedy submits to inescapable bondage at the hands of Mr Pete. She's the kind of the girl that is willing to do anything and everything to receive sexual validation. She finds herself strung up in a full rope suspension with her tiny titties and pink nipples in cruel electric nipple clamps. Shock waves pulse through her body as her sensitive breasts are tormented with electricity. Mr Pete spits on her face, and beats her ass and toned stomach as she squirms and tries to lessen the pain of the bondage. Mr Pete shoves his hands into her pussy, and fingers her deep and hard until she squirts all over herself. Pleased with his female sex slave, Mr Pete tosses her to the ground and shoves his cock into her small mouth. The cruel master then relentlessly face-fucks her. Spit and drool cover her face and chest as she works that big cock. Her taskmaster then flips her onto her knees and begins to punish her tiny pink pussy with his throbbing cock. He fucks until her whole body quivers and shakes from the pain and pleasure. She begs to cum but her pleas are stifled when Mr Pete swings his leg over her body and shoves a boot into her face and mouth. To finish her day, Kate is tied on her back to a table with her legs pulled far apart. As her swollen and sensitive cunt gets pounded by the huge dick, she begs to taste his cum, so he shoots his load all over her small tits and pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Kate Kennedy",
      "person_id": 61558
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2019-01-02",
  "scene_id": 43838,
  "tags": [
    "Blonde",
    "Bondage",
    "Boot",
    "drool",
    "Electrical Play",
    "master",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "Slave",
    "Small Tits",
    "Straight",
    "Sub",
    "Suspension",
    "toned"
  ],
  "title": "Girl Next Door Kate Kennedy Tied in Rope Bondage and Fucked"
}