{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Brunette beauty Gia Derza breaks the rules and steps out to make a deal with thug Tommy Pistol she is thrust into a world of hardcore BDSM, anal sex and the gritty life of a gangster.\nGia's boyfriend Vito would have her and Tommy's head if he found out she was doing some botched business without him but she can not go home empty handed so she offers to do anything to make things right. Anything! So first things first -- outside in the park Tommy puts Gia on her knees and he pulls his cock out for a deep throat fuck session. Slurping and slobbering all over her perfect tits she sucks dick like a champ and she looks pretty doing it with her big pretty eyes staring up at her New Boss. Later that evening Tommy needs one more thing while he's collecting some bonds Vito has in the safe and Gia being the submissive little slut that she is says anything you want Boss. First time ever being tied up Gia is gagged and bound tight in doggie. Her firm curvy ass is high up in the air ready for Tommy to have his way with her. First some stinging corporeal punishment with the flogger and the crop to get Gia warmed up and then he fingers her ass and fucks her pussy good. She's going crazy from his hard driving cock and then to take things over the top he treats Gia to some hardcore anal sex which really makes her loose it. Then in a super sexy position with Gia straddling Tommy she rides his dick like a star equestrian writhing her sexy hips all over until she cums. Finally on her back tied up tight with both her holes exposed for easy access Gia is ready and wanting some more hot action. Tommy gives it to her with some flogging, cock sucking and then some ass and pussy pounding. Tommy's going wild and fucks Gia's ass with his balls! Then he takes her to good ole fucktown and pounds her gangster ass until she goes crazy with pleasure and Gia's New Boss shoots his hot wad all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Gia Derza",
      "person_id": 61617
    }
  ],
  "release_date": "2018-12-07",
  "scene_id": 43840,
  "tags": [
    "bdsm",
    "blowjob",
    "brunette",
    "cock sucking",
    "Corporal Punishment",
    "crop",
    "curvy",
    "domination",
    "flogging",
    "humiliation",
    "kinky",
    "role play",
    "rope bondage",
    "Rough Sex",
    "straight",
    "submission",
    "throat fuck",
    "top",
    "Vaginal Penetration"
  ],
  "title": "My New Boss"
}