{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When intuitive reader Sammie Six tries to put one over on Derrick Pierce, the reading does not go as planed. Derrick exposes Sammie's scam and takes her down a notch with hard punishment, anal sex, caning, bondage, and flogging. That's right, blonde cutie Sammie Six must be taught a lesson and Derrick is just the man to do it! Tied up and naked Sammie is scared of what Derrick is going to do to her. He starts with the flogger and whips her big tits, her thighs, her back , her ass until little red marks start to appear. Sammie is a pain slut and can take it without complaint. He pinches her nipples, chokes her and she wants more hitting spanking, slapping, flogging and all it does is make her pussy wet so Derrick fingers her cunt and rubs her clit until she cums. Sammie is a smart ass and cums without permission so Derrick gets things under his control and stuffs his cock down her throat. Sammie sucks dick and he slaps her tits hard reminding her who is boss. He crops Sammies tits and thighs until they are red and almost bruising and she just takes it. Then on her knees with ballgag in her mouth Sammie gets the Wartenberg wheel on her sensitive body and a punishing cane on her ass and feet but she never cries mercy. Sweating and breathless her pussy is now ready for more fucking so some hardcore fucking ensues. After she cleans her pussy juice off his cock Derrick vibes her clit with the Hitachi until she begs to cum. Derrick goes in for some ass fucking and it drives Sammie wild but she goes even more will in the next position when she is tied up on her back spread eagle. With nipple clamps clamping, zapper zapping and Hitachi vibing Derrick fucks her slutty cunt until she is moaning with pleasure and cums but she didn't ask for permission so Derrick hurts her real good just like she likes it and pulls on her nipples and fucks her ass deep until Derrick pops his load all over Sammie's face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Sammie Six",
      "person_id": 61203
    }
  ],
  "release_date": "2018-12-28",
  "scene_id": 43842,
  "tags": [
    "BDSM",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Flogging",
    "Hitachi",
    "Humiliation",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Anal Intuition"
}