{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Victoria tries to cut Tommy out of a deal, she is taken hostage and interrogated with anal sex, BDSM, electricity, huge anal toys and fisting! Victorias husband and Tommy run a heist and manage to get away with loads of money, enough cash to set them up for life so naturally Tommy wants his cut. He shows up just to have a look at the booty but when Victoria pretends not to know where it is, Tommy gets very suspicious and takes control of the situation. In an attempt to find out where the money is Tommy gags and ties Victoria up spread eagle on the dining room table and rigs up some wicked electrical bands to her thighs to shock her into telling the truth. While electrical current is coursing through her body he uses a whole arsenal of corporal punishment tools to make her confess. The cane, single tail, flogger and Wartenberg wheel all leave their marks on her sensitive skin but she still won't divulge. Choking, fingering and finally fisting her tight, shaved pussy take Victoria over the edge yet still she will not fess up. After hours of torment Tommy ties Victoria up on her knees and arms behind her back. With nipple clamps swinging, rope is everywhere holding her tight while Tommy stuffs his dick in her mouth for a deep and thorough throat fuck. Then on all fours Victoria gets the flogger and Tommy's hard cock in her pussy and ass. He fucks every hole back and forth and demands she tell him where the money is but nooooo so Tommy pulls out what he calls \"The Negotiator\" which is a huge metal dildo and slides it in and out of her ass and plays with her clit. Then bound tight on her back with her sexy legs spread wide open Tommy busts out the Hitachi while he interrogates her ass and pussy with his cock and drives her straight into ecstasy! Does Victoria tell Tommy where the money is? Watch to find out!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-01-04",
  "scene_id": 43843,
  "tags": [
    "BDSM",
    "Blowjob",
    "Choking",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Electrical Play",
    "Fingering",
    "Fisting",
    "Hitachi",
    "Humiliation",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Single Tail",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": " Sexual Interrogation"
}