{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When hot babe Jasmine Jae shocks Charles with an unexpected deal he teaches her a lesson about respect with BDSM, hardcore sex and humiliation.\nRaven haired, tall and sleek Jasmine is one sexy bitch. With her huge tits, long legs and sweet ass she is a sight for sore eyes but Charles isn’t fooled by her hotness and won’t be bullied by this bossy bombshell so he does what he has to do to teach her a lesson. Charles is in charge now so he puts a ball-gag in Jasmine’s mouth and ties her up on the bed with a bit of predicament bondage, nipple clamps strung up to the ceiling so when she moves forward to suck Charles cock it’s gonna hurt! With Jasmine’s legs spread wide and adorned with black stockings and garter belt he busts out the Hitachi on Jasmine’s clit and drives her to the edge but doesn’t let her cum. Charles has a lot more in store for this busty beauty so he brings out the big guns to show this luscious slut some discipline. Tied up with ass high in the air Jasmine gets the punishing crop, stinging flogger and lots of verbal humiliation yet still it makes her pussy very wet so Charles fucks her good with his big hard dick. He pounds her pussy for a long time making Jasmine scream and moan with pleasure and then stuffs his tantalizing cock in her mouth to let her taste her pussy. Jasmine says she likes it rough so Charles doesn’t hold back on the hardcore action fucking her pussy and her mouth hole back and forth for full satisfaction. Then laying down on her back with ball-gag, rope and nipple clamps tight on her big tits Charles teases Jasmine and her pussy with slaps and pinches and the vibrator making her squirm and twist and turn with wild abandon and finally Charles fills her pussy up with his sexy cock and takes her to pound town until he shoots his jizz all over Jasmine Jae’s pretty face. Lesson learned!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Jasmine Jae",
      "person_id": 59210
    }
  ],
  "release_date": "2019-01-11",
  "scene_id": 43845,
  "tags": [
    "BDSM",
    "Big Tits",
    "black hair",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Domination",
    "fake boobs",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Nipple Clamps",
    "Predicament Bondage",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Jasmine Jae Learns a Lesson"
}