{
  "collections": [
    "Sex And Submission"
  ],
  "description": "It's that time of year again... Time to Hunt some Cunt! When Karma Rx is punished for cumming without permission she escapes her bondage and master Charles Dera, but soon enough a cunt trap is set to lure Karma back into her kinky keepers lair. Karma tries to convince her co-servant Juliet to run away with her because she just can't stand the punishment anymore but Juliet is scared and will not budge. So after an intense and challenging escape from her bondage Karma breaks free and runs away into the hills. This will not do! Mr Dera is up for the occasion and uses Juliet as bait to entice Karma back where she belongs. Once Karma is trapped and looking into the eyes of her master she begs to make everything right. She kisses his feet and sucks his cock with determination hoping he will accept her apology. Charles drags Karma back to his dungeon and ties her up so she can't get away. On her back with rope around her huge tits Charles tells her how disappointed he is in her and reminds her how she is there to please him and not to make him go on cunt hunts to track her down. He teaches her a lesson with the crop and then fucks her throat, her tits and then her wet pussy until Karma begs to cum but no no Charles will not allow it, not yet because this is not about her its about his pleasure. Next he ties her up on all fours in doggie with rope binding around her waist and ankles and wrists and fucks her cunt good. Then on her back with legs spread wide and tied to her ankles Karma is open and ready for Charles hard cock. First Karma sucks Charles toes and licks his feet which gets her pussy extra excited. He pile drives that pussy deep and hard and relentless still not allowing her to cum until finally she can't contain herself anymore and with her tits bouncing back and forth from the pounding she looses it and cums hard while Charles shoots his hot load all over her face.\nIt's hunting season. Be sure to also watch part one and two for a totally hot kinky immersive experience into the world of the Cunt Hunt!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Karma Rx",
      "person_id": 61618
    }
  ],
  "release_date": "2018-12-21",
  "scene_id": 43841,
  "tags": [
    "BDSM",
    "Big Tits",
    "black hair",
    "Blonde",
    "Blowjob",
    "body builder",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Domination",
    "dungeon",
    "fake boobs",
    "Feet",
    "Humiliation",
    "Kinky",
    "master",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Cunt Hunt 3"
}