{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Office secretary Nadia White is horny at work. She can’t stop fantasizing about getting fucked rough and hard by a big strong man. She pulls up her favorite porn and her favorite vibrator, and starts masturbating behind her desk. Just as she’s about to cum, her boss, Derrick Pierce, walks in and finds her playing with her pussy. He decides not to fire her, but tells her to take her big tits out. If this slut can’t be professional, she’ll be the office whore. He clamps her nipples, bends her over the desk, and spanks her ass red. He ties her up and ball gags her. Nadia shivers as her boss plays with her cunt. She yelps as Derrick crops her tits and her stomach. She takes every inch of her boss’ hard cock down her whore throat and begs to cum as her boss fucks her pretty little mouth. Next, Nadia is tied on her hands and knees with an anal hook in her ass. Her hands are encased in leather mittens and her head is in a partial hood. She cries out as her boss canes her dirty feet. Derrick always knew Nadia was a slut and now he has proof. He pummels her tight cunt with his cock and gives her a hard pounding. He slaps her tits, and uses the zapper on her tits and ass. Nadia loves all the attention she’s getting from her boss. His cock feels so good, Nadia never wants him to stop. Finally, Derrick has Nadia tied on her back. He flogs her tits, thighs, and pussy before fucking her horny slutty cunt. Nadia screams as Derrick fucks her hard and fast. He slips a plug in her ass, a vibrator on her clit, and fucks her until she can’t stand to orgasm any more. Then he brings her to her knees and cums all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Nadia White",
      "person_id": 50587
    }
  ],
  "release_date": "2019-02-08",
  "scene_id": 43846,
  "tags": [
    "Athletic",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Hood",
    "Humiliation",
    "Leather",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "Vaginal Penetration",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "Bad Secretary: Newcomer Nadia White gets punished!"
}