{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Dirty Cop Tommy Pistol gets a call to investigate a possible trespassing beautiful redhead Tana Lea gets ensnared in his sordid world of BDSM and kinky hardcore sex.\nTana has lost her keys and is merely locked out of her own house so she tries to get in through a window but a nosy neighbor calls the cops to report a break-in. Meanwhile bored and corrupt Officer Pistol is snorting up some confiscated drugs at the station when he gets the call to go check it out. High as hell he goes to the place only to find Tana half naked in her living room screaming at him to get out! But all the screaming in the world won't stop Pistol from having his way with this voluptuous vixen adorned in a lacy bra and tight, skimpy panties. He finds sex toys, a dick on a stick, whips, chains and accuses her of running a brothel so he makes a dirty deal with her and boy does she resist but before you know it she is handcuffed and sucking Tommy's man meat like there's no tomorrow. Gagging and choking on his cock slobbery spit drips down on her big tits and Tommy tells her how much fun they're gonna have all day. First position Tana is gagged and tied up on her knees with her ass high in the air getting whipped with the flogger and the paddle until Pistol whips his dick out and fucks her pussy. All that hot action makes Tana drool and moan and she can't help but fuck Tommy back with her big curvy flogger red hips sliding back and forth. Next Tana is tied up on the couch with her shapely legs spread wide open showcasing her shaved pink pussy. Tommy crops her exposed cunt while she tugs on the chain of her nipple clamps creating a crazy mixed sensation of pain and pleasure. Then back to that wet slutty pussy Tommy pounds Tana out with his hard cock and pleases her with the Hitachi until she is on fire with orgasms and Tommy can't help but blow his dirty load all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Tana Lea",
      "person_id": 61416
    }
  ],
  "release_date": "2019-02-15",
  "scene_id": 43849,
  "tags": [
    "BDSM",
    "Big Tits",
    "Blowjob",
    "Chains",
    "Choking",
    "Cop",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "drool",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "mixed",
    "Nipple Clamps",
    "Paddle",
    "Pain",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "The Dirty Cop"
}