{
  "collections": [
    "Sex And Submission"
  ],
  "description": "All paralegal Maya Kendrick needs to do is get her client, Mr. Pete, to sign the plea deal her boss has worked out for him. Pete promises to sign as long as Maya loosens his cuffs. Maya knows she shouldn't, but she really feels for Mr. Pete and decides to help him out. As Maya loosens his cuffs, Mr. Pete grabs her by the throat and tells her to touch his cock. After being locked up for so long, Mr. Pete is thirsty for some action and this long legged red-head slut is ripe for the taking. He gets her on her knees and makes her suck his cock as she rubs her pussy. He feels up her tits and fucks her through the bars of his cell before telling her to unlock the door. Maya unlocks the door and finds herself tied up with her legs spread and her holes exposed. Mr. Pete clamps her nipples, flogs her ass and tits, teases her with the zapper, and finger fucks her, before sinking his dick in her tight pussy. Maya moans as she feels Mr. Pete's fat cock slide into her. She cums hard on his cock and then begs him to fuck her asshole. Mr. Pete pushes his cock into her asshole and gives this slut a good hard pounding. Maya's holes are gaping by the time Mr. Pete decides it's time to flip her over. Maya is tied on her knees with her ass up in the air. She begs Mr. Pete to hit her, so he flogs and crops her ass. After warming her ass to a rosy pink, he fucks Maya in her cunt and ass as she squeals on his fat cock. Finally, he cums all over this whore's face and leaves her for the guards to find.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2019-02-01",
  "scene_id": 43844,
  "tags": [
    "BDSM",
    "big dick",
    "Blowjob",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "foreskin",
    "Gaping",
    "Humiliation",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Stud",
    "Submission",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "Prison Paralegal"
}