{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Seemingly innocent sex kittens like platinum blonde Arielle Aquinas don't come along very often. She is the type of pain slut that can only feel sexual pleasure when restrained with inescapable rope bondage and abused with extreme and brutal impact play. She wastes no time and begs for her dom Tommy Pistol to string her up like a side of beef and and use her as his erotic punching bag. With a vibrator pinned between her legs, Tommy begins to beat every inch of her pale and fragile skin with closed fits. The pain is exquisite and heighten our little female sex slave's erotic bliss. Glistening with sweat, Arielle is tossed to the floor like a used piece of gym equipment, and is quickly restrained in tight bondage. She is then facially abused with a rough blowjob that makes her gag and drool all over Tommy's cock. As it jams in and out of her mouth, the throat fucking leaks spit down her perky small breast and pools near her tiny pussy. Her welted and sore ass shakes and jiggles as she is made to gag on Tommy's dick. Arielle is so overwhelmed by the intensity of the brutal session that she squirts all over herself and begs to cum multiple and repeated orgasms. Her cruel taskmaster relishes in the pain of her orgasm denial. She is then tied to a couch with her big round ass perched in the air. After she receives more intense impact play at the wrong end of a heavy leather flogger, Tommy shoves his cock into her tight little asshole. He then recklessly fucks her until she is screaming and howling for mercy, but also begging for an even harder fucking. Tommy is only too happy to oblige. He Arielle onto her back and begins to fuck her until she is begging to eat his load. He blows cum all over her abused pussy and makes her lick it clean. The last thing we hear from her pouty and exhausted lips is, \"I love it.\"",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Arielle Aquinas",
      "person_id": 59748
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-02-04",
  "scene_id": 43850,
  "tags": [
    "Blonde",
    "Blowjob",
    "Bondage",
    "drool",
    "Gag",
    "Leather",
    "Orgasm Denial",
    "Pain",
    "Pain Slut",
    "Punching",
    "Rope Bondage",
    "Slave",
    "Straight",
    "Sub",
    "Vibrator"
  ],
  "title": "Blonde Slut Arielle Aquinas Ass Fucked and Abused like a Punching Bag"
}