{
  "collections": [
    "Kink Features"
  ],
  "description": "Today is a new day, and it's time to test Victoria Voxxx's sexual ability. She is inspected and then introduced to Bambino, the man who is going to destroy her holes. He's here to assist The Pope in evaluating this slut and what she us capable of. Victoria begins to smile thinking that she is going to be fucked and that's all that she has to do. The Pope quickly corrects her, then advises her that there is always more than meets the eye. The attention she is getting from two men instead of one has in dripping already, yet very intimidated in the beginning. Her ass is made the center of attention to show off her marks of pride and accomplishment from Day 1. Victoria is a tough slut who knows how to process pain, but today is going to prove challenging. She is bound with her hands over her head and then brought to her knees to serve Bambino and his massive cock. She begins sucking his cock and then the pain comes in the form of floggings. Nipple clamps are added and then a vibrator is pressed firmly against her pussy to distract this slut. She is then stood back up and her pussy is violated with his cock for the first time. She is fucked mercilessly and not allowed to to cum until told to. Her goal is to stay focused and serve the cock, instead of being selfish slut and just cumming. Next she is suspended and Bambino enters to have his way with her again. This guy is a fucking machine and slams her cunt with non stop fucking to overwhelm Victoria. The Pope and Bambino take turns on on her mouth and pussy making sure this slut is overloaded with stimulation. They have done enough of the work, and it's time to have this slut show what she is made of. She is going to serve cock like she's never served it before, and will not be allowed to stop until The Pope sees fit. This s marathon, and if she can't finish there is no prize for 2nd place.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-01-01",
  "scene_id": 43857,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Choking",
    "Clover Clamps",
    "Deepthroat",
    "Dildo",
    "Facefucking",
    "Flogging",
    "Hitachi",
    "Latin",
    "Nipple Clamps",
    "Pain",
    "Pierced Nipples",
    "Rope Bondage",
    "slapper",
    "Slapping",
    "Slave",
    "sos",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Fisting",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "School of Submission: Day 2"
}