{
  "collections": [
    "Kink Features"
  ],
  "description": "The orgasms were plentiful during Victoria's first two days, but today is new, and it will be grueling. Victoria expresses confusion when she learns we would not be in the dungeon, but still her curiosity is up. She arrives bright and early and we begin with her outside at The Pope's compound. She was told to dress appropriately and then given work gloves upon arrival. The Pope walks his slut out to the location of labor. Victoria is given her instructions and told to get to work. She is going to sweat. Her heart rate will be increased and her breathing will become labored. Victoria wanted the experience of a lifetime and, as of right now, she is going to have to work for it. Today will be the day of reckoning. Every detail of the day is going to be with the intent of fucking with her. His whole purpose is to break her spirit. She is strong minded, but you begin to see her frustration with the ongoing labor, and objectification. She tries to keep a smile on her face, but she is beginning to crack and The Pope sees it; whether she wants to admit it or not. This is why she is here, which is to be pushed far beyond her comfort level and break through to a higher plane. Victoria wants to find something inside of her, and this is the way it is going to happen. There are more mind games and hard labor before The Pope finally ties her to a metal structure and reins down a brutal attack with his dragon tail, AKA \"Fluffy\". Her flesh becomes sensitive, and so a vibrator is brought in and suddenly she starts to respond, so this will be what is used to push her completely over the edge. Non-stop orgasms will be the destruction factor which leaves Victoria a mess that needs to be carried away.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-01-08",
  "scene_id": 43858,
  "tags": [
    "Ball Gag",
    "Brunette",
    "Destruction",
    "dungeon",
    "Flogging",
    "gloves",
    "Hitachi",
    "Latin",
    "natural boobs",
    "Pierced Nipples",
    "Rope Bondage",
    "shaved",
    "Slave",
    "sos",
    "Straight",
    "Submission",
    "The Pope",
    "toned",
    "Vibrator",
    "Whipping"
  ],
  "title": "School of Submission: Day 3"
}