{
  "collections": [
    "Kink Features"
  ],
  "description": "Victoria has come far, but the journey is far from over. This is the final day, but it may yet be the hardest. We are back in the dungeon, and she is going to find out why The Pope is known for being the meanest mother fucker on the internet. Victoria will be subjected to the most grueling bondage that will challenge her mentally and physically. Each tie was designed for suffering, and with added torment from him will guarantee her most extreme suffering yet. We start with her in a grueling back bend with her mouth tied to her ankles insisting that she remain in this brutal tie with no chance of escape. Her body is pulled in every direction, but The Pope uses clover clamps to pull and control what isn’t already. She is as fucked as it gets, so the only thing left to do is make this whore cum and hurt herself during her own orgasms. Next, Victoria is hoisted into the air by her hair and elbows… yes, suspended by her hair and elbows. Her pussy is milked of all of it’s nectar\nand she is exhausted of as many orgasms as she can take. The final scene is where we get\nto see exactly what this slut is made of. The bondage is a spread eagle on the floor, but\nwe all know that if the bondage isn’t grueling the torment will be. Her flesh is covered\nwith close to a hundred clothes pins, then hot molten wax is poured over that. We get to\nwatch as she processes all of this and then prepare for the most extreme orgasm of her\nlife. The entire tip of the vibe is shoved inside of her dripping wet pussy and we sit back\nand wait for what proves to be a truly devastating orgasm, and then followed with more\nuntil she has been finished off.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-01-15",
  "scene_id": 43859,
  "tags": [
    "Bondage",
    "Brunette",
    "Clothespins",
    "Clover Clamps",
    "Destruction",
    "dungeon",
    "Fingering",
    "Gag",
    "Hitachi",
    "Hot Wax",
    "Latinx",
    "natural boobs",
    "Pierced Nipples",
    "Rope Bondage",
    "shaved",
    "sos",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "toned",
    "Zipper"
  ],
  "title": "School of Submission: Day 4"
}