{
  "collections": [
    "Kink Features"
  ],
  "description": "The day begins with Victoria arriving at a shoot with some uncertainty about what to expect. She understands the basic outline, but it’s vague at best, so she is a little apprehensive about everything, yet excited to see what is going to happen. There has been talk of some kind of journey, but she has no idea what that entails. The preliminary interview happens where we get an in depth conversation between her and The Pope. He digs deep to find out details about her so that he is able to formulate a path for her journey to begin. She has committed to four straight days spent at his mercy, with the idea that he will help show her something about herself that she is looking for. The goal is to push her harder than she has ever been pushed and to take her down the path of BDSM. Victoria is led into the dungeon and is objectified instantly. She is given basic rules and then the journey begins. Tease and denial is the first activity to find out what kind of self control this slut has. The Pope toys with her and test her on many levels, from basic orgasm control to extreme pain endurance. One of the most restrictive binds is the one of the mind. She could easily walk away from this at any point, yet he has her in a place that she dare not move until given permission to do so. Everything that happens is because he said so, and she is finding out that this is going to be a lot more grueling than she thought it would be.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2018-12-25",
  "scene_id": 43856,
  "tags": [
    "BDSM",
    "Brunette",
    "Caning",
    "Choking",
    "Clothespins",
    "Clover Clamps",
    "Crop",
    "Dildo",
    "dungeon",
    "Fingering",
    "Hitachi",
    "Latinx",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pierced Nipples",
    "shaved",
    "Slave",
    "sos",
    "Spanking",
    "Speculum",
    "Straight",
    "Submission",
    "The Pope",
    "toned",
    "Whipping",
    "Zipper"
  ],
  "title": "School of Submission: Day 1 For Victoria Voxxx"
}