{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Skylar Snow walked into the dungeon and knew exactly what she wanted. A young curvy slut like her, with giant natural breasts and a tight, hungry pussy wants only one thing: to serve as a possessed sex slave. She starts off on her back with her legs strung up in the air, exposing her titties and round ass to the brutal torment of the sadistic Tommy Pistol. He begins by working her whole body over with a thin bamboo cane that leaves red and aching welts all over her legs and ass. When the searing pain of the torment is too much, her switches his focus to her huge tits and yanks at her tender nipples with clover clamps and pinching fingers. Skylar screams, which only serves to engorge her master's cock. He spreads her legs wide open and finger bangs her until she squirts into his mouth, which he then spits all over her slutty face. Before Skylar can catch her breath, she gets tied on her back with her head dangling off the edge. She is then made to gobble cock, and choke from repeated blow jobs. Her nose and eyes are covered with drool as the facial abuse challenges her gag reflex. But this only makes a wanton whore like Sklyar wet with desire. Tommy jams a vibrator onto her swollen and sensitive clit, causing her to squirm and tremble with unbearable delight. She squirts over and over as the orgasms pile up. Skylar is soaring when she is restrained with tight and inescapable rope bondage on her hands and knees. With a giant ass hook being yanked by a rope collar attached to her neck, she chokes herself as Tommy fucks her tiny pink pussy. Her eyes roll back in her head and she squirts all over his solid cock, as a Hitachi stimulates her raw and exposed clit. Worn out, but still voraciously hungry, Skylar ends her day tied to table on her back with her legs spread wide apart. Tommy switches back and forth between fucking her pussy and her asshole until she can't stop squirting. The brutal fucking reaches a fever pitch, and Tommy blows a huge load of cum all over Skylar's pussy and tits.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2019-02-18",
  "scene_id": 43851,
  "tags": [
    "Anal",
    "Ass Hook",
    "Bondage",
    "Caning",
    "Clover Clamps",
    "Collar",
    "Curvy",
    "drool",
    "dungeon",
    "Facial",
    "Gag",
    "Hitachi",
    "master",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "Slave",
    "Squirting",
    "Straight",
    "Sub",
    "Vibrator"
  ],
  "title": "Curvy Squirt Goddess Skylar Snow Rough Anal And Rope Bondage Fuck"
}