{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Dominic Pacifico is hooded and bound by leather and metal. His balls are tied tightly to a weighted bucket as he awaits the arrival of busty blonde bombshell Aiden Starr. Aiden wastes no time cutting this male dom down to size and stripping him of his ego. Dominic moans under the attention of this Goddess. He cries out as she smacks his chest and abs, and toys with his super sensitive nipples. Aiden laughs as Dominic strains in bondage, unable to escape the humiliation of being beat up and dominated by a woman. She clover-clamps his nipples, and decorates his foreskin with a crown of close-pins. Dominic yells as she drops weight after weight in the bucket connected to his balls as it pulls them further and further from his body. Next, she opens up his asshole with her hand. Working four fingers inside his greedy slut hole, Aiden laughs as Dominic pushes back like an eager slut, thirsty for more. He moans around his ball gag as she then pushes her long fat cock into his asshole and gives him a hard pounding. Aiden knows what a greedy whore this male dom is just from glancing at his asshole, so she prepares a fucking machine to pummel his ass. Dominic holds his legs open as the machine relentlessly drills into him. Aiden takes a seat on his face and has him lick her pussy while he gets fucked. Finally, Aiden commands Dominic to grab a box from the corner. She pronounces it his dinner table and directs him to make his own dinner. Dominic takes his cock in hand, jerking it as Aiden smacks his chest over and over again. Each smack brings Dominic closer and closer to cumming, and he blows his load all over his slave table. He eagerly laps it all up and eats the last remaining drops from his Mistress’s hand.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    }
  ],
  "release_date": "2018-12-04",
  "scene_id": 43865,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "foreskin",
    "Gag",
    "Humiliation",
    "Latinx",
    "Leather",
    "Male Sub",
    "muscular",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Tattoo",
    "top",
    "unshaved",
    "white"
  ],
  "title": "A Dom's Domme: Divine Bitch Aiden Starr dominates beefcake male top"
}