{
  "collections": [
    "TS Seduction"
  ],
  "description": "The Slag Angels are roughest, toughest, sexiest all girl biker gang that runs a small town in the middle of nowhere bumfuck USA. When Jethro's (Colby Jansen) best friend Bob (Dozer) goes missing, Jethro knows The Slag Angels have something to do with it. He confronts badass Angels member Paloma (Natalie Mars) in order to get some answers. Paloma knows what beefcake boys like Bob want and she's not afraid to use this knowledge to her advantage. She rips off Jethro's tank, takes out his dick, and lets him get a taste of her own sweet cock. Bob drops to his knees, worshipping this leather goddess' beautiful hard cock. Paloma then pushes Jethro's tongue into her sweaty ass, letting Jethro clean her up with his greedy tongue. She instructs him to finger fuck her asshole open so she can fuck herself with a thick dildo while Jethro sucks her cock. His eyes widen as he watches her asshole swallow up that cock! And lucky for Jethro, his cock is next. Paloma rides Jethro's hard cock before commanding him to do the work and laying on her back. Jethro pounds Paloma's tight hole as Paloma goads him into fucking her harder and faster. Once she's had her fill, it's Jethro's turn. She brings out an even bigger dildo and fucks Jethro on his hands and knees. Jethro's toes curl as Paloma fucks him with the dildo and then pushes a fat plug into his ass. She squeezes his balls as she punches that plug in his ass. Then she gives him what he's been craving -- her glorious cock. Paloma fucks her new slutty butt boy, relentlessly pounding his asshole as he moans and calls her Daddy. Jethro loves being Paloma's slut and cums all over himself, before dropping to his knees and sucking off his Daddy. After the best fuck of his life, Jethro wipes himself off and thinks about the next time he'll run into Paloma. It may be sooner than he thinks, as he is suddenly hooded and dragged away. To be continued...",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Colby Jansen",
      "person_id": 34457
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2018-11-27",
  "scene_id": 43868,
  "tags": [
    "Anal",
    "Blowjob",
    "Cock Worship",
    "Dildo",
    "Kinky",
    "Leather",
    "Male Sub",
    "Role Play",
    "slag angels",
    "Straight",
    "Swallow",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Slag Angels on Wheels: Episode One"
}