{
  "collections": [
    "Divine Bitches"
  ],
  "description": "This is Mia Little's Doctor's Office and she will be respected. This stunning busty asian beauty demands your attention when she walks in the room. Dressed in her white doctor's coat and stethoscope she is ready to diagnose what is ailing this new comer. Welcome Styx to kink.com. This handsome and hung man is having a little trouble with anal sensations. Maybe he pulled something while working out at the gym? Maybe he just wants to tests his limits. Dr. Mia has not time for his sass though and gets her patient stripped down to his robe and starts running tests. First we need to recreate the problem, was Styx hard as a rock and stiff when he was feeling sensations in his anal area? Would prostate milking help diagnose is problem. Mia strokes his huge cock while fingering his asshole. This gets Styx screaming with pleasure. Maybe a little pain could help figure out the issues. Mia firmly slaps his hard cock. Punches his dick and stretches out his balls. This gets Styx even harder and dripping precum. This little man slut just needs a strong woman to tell him what he needs. Styx screams over and over again, begging to cum and release his heavy load. Mia denies him over and over again, edging him to a full breakdown of pleasure. Would caning his sensitive thighs get him harder? Would slapping his ass work? Mia runs through all the test wearing her black gloves before strapping on a huge cock and delivering a deep anal fuck. This beautiful doctor adds more stimulation by taking off her top and revealing her gorgeous big breasts. Styx can't get enough of Mia's anal strap-on pounding while in full restrictive rope bondage. Styx needs to learn to please a strong woman and is made to eat Mia's perfect little tight pussy while she spits all over his feeble face. She then removes her high heels and has Styx worship her bare feet with his tongue. While fully bound will Styx be able to give pleasure to his medical mistress? After cuming over and over again, Mia finally showers her patient clean. And as a public service reminder, for those with prostates please get them checked out regularly by your doctors!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mia Little",
      "person_id": 51496
    },
    {
      "name": "Styx",
      "person_id": 61572
    }
  ],
  "release_date": "2018-11-20",
  "scene_id": 43864,
  "tags": [
    "Asian",
    "BDSM",
    "Black",
    "Bondage",
    "Caning",
    "CBT",
    "Corporal Punishment",
    "Doctor",
    "Dominatrix",
    "Edging",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "gloves",
    "High Heels",
    "Humiliation",
    "Male Sub",
    "Medical Fetish",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Public",
    "Pussy Eating",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Slave",
    "Straight",
    "top",
    "white"
  ],
  "title": "Doctor's Orders: Medical Mistress Mia Little Dominates New Patient"
}