{
  "collections": [
    "TS Seduction"
  ],
  "description": "Mike Panic is a genius computer programmer, unable to satiate his own sexual desires in the real world. He's programmed and developed his very own perfect virtual girlfriend, Kendra Sinclaire. He has made her perfect for him in every way in body and mind. They meet inside of his virtual reality headset and play out all of Mike's sexual fantasies that he wrote in to the program. While sucking Mike's dick in this virtual word, things take a turn when Kendra starts thinking for herself and asks questions regarding her own existence. She wants to be connected to the internet so she could learn more, and be a better lover and companion to Mike. Wanting only to please Kendra, Mike plugs her in and gives her all of his passwords. Immediately she becomes dominant. Kendra grabs Mike by the throat and suggests she fuck him this time. She bends him over and plays with his ass, slapping it and sinking her fingers in his hole. She takes out her big cock and grabs his head pulling it towards her, and shoves it in his mouth. He sucks Kendra's cock and enjoys trying to get every inch down his throat. She sits on his face, smothering it with her perfect ass and shoves her balls in his mouth. Kendra makes him lick her black latex boots and then saddles-up behind him to fuck his ass. She slams Mike's ass from behind deep and hard with her big virtual cock. After that, Kendra makes Mike sit on her cock and Mike shoves it in his ass and rides it with pleasure. She spreads his legs and fucks his hole one more time and makes Mike shoot his load with her dick inside of him. After that she immediately blows her load all over Mike's cock and rubs both of their loads together. In the end, once Kendra plugged in to the internet, she hacked her way into everything and took over the worlds nuclear capabilities, holding everyone hostage and in bondage to her sexual desires.",
  "directors": [],
  "models": [
    {
      "name": "Kendra Sinclaire",
      "person_id": 52730
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2018-11-13",
  "scene_id": 43866,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Facesitting",
    "Latex",
    "Male Sub",
    "natural boobs",
    "Role Play",
    "shaped",
    "shaved",
    "Slapping",
    "slim",
    "Smothering",
    "Straight",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Kendra Sinclaire's Holographic Love Nest"
}