{
  "collections": [
    "Bound Gods"
  ],
  "description": "For most of the world, the apocalypse has already come, but US Soldier Kyler Ash is about to stumble into his own personal hell. The sole survivor from his group, he wearily makes his way across a desert in search of water and shelter. When he stumbles across abandoned ruins, he's relieved to find some shade, but he's not alone. A zombie-like creature appears out of nowhere, and as Kyler back pedals, he falls and loses consciousness. This would've been the end but doomsday survivalist Michael Del Ray takes out the biter before dragging Kyler off. Is he Kyler's salvation or worst nightmare? When Kyler wakes up, he's hog-tied, unable to move and at the mercy of his new masked captor. Michael quickly shows Kyler who's in control. He slaps, chokes, spanks, and manhandles Kyler, prying his mouth open to suck his cock. Kyler struggles as Michael's fat cock is shoved in his mouth, and yells as Michael decorates his chest with brutal a close-pin zipper. Next, Michael has Kyler strung up and exposed. He reveals his face to Kyler, and Kyler is shocked to see someone from his past. Michael flogs Kyler's ass and slaps his dick on it before shoving his cock deep down Kyler's throat. Kyler screams out as Michael pushes his cock into Kyler's tight ass. He never thought the apocalypse would bring this. Michael uses Kyler's ass and then brings Kyler to his knees and cums all over his face. He walks away, leaving Kyler bound up and at the mercy of whoever or whatever finds him next.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Kyler Ash",
      "person_id": 59359
    },
    {
      "name": "Michael DelRay",
      "person_id": 61138
    }
  ],
  "release_date": "2018-11-01",
  "scene_id": 43877,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "halloween",
    "Humiliation",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Tattoo",
    "unshaved",
    "white",
    "Zipper"
  ],
  "title": "Doomsday Revenge: Survivor Exacts Revenge on Soldier"
}