{
  "collections": [
    "Bound Gods"
  ],
  "description": "This is Jack Dixon’s Dungeon. His muscular presence dominates every inch of this dark space. Dressed in full leathers on his throne he lights up a cigar. This hairy leather daddy fills the room with thick cigar smoke. Jack Dixon calls his submissive boy over. Chance Summerlin is bound in chains and crawls over in worship to his master. Clean his boots, yes sir. With his willing tongue Chance licks and cleans every inch of his masters boots working his way up to what he truly desires, Jack’s huge cock. Not so fast, Mr Dixon says and grabs Chance by the collar and uses his mouth as an ash tray over and over again. Filling his boy with ash as he commands him to continue cleaning and worshipping his god. Before his boy can get what he wants Chance must earn it. Bent over and ass in the air, Jack pulls out the crop and works Summerlin’s ass red. The screams gets Chance rock hard and dripping with precum. He’s earned the right to swallow Jack’s massive thick cock. Chocking on every inch this bottom worships his master. Jack’s leather gloves find their way into Chance’s mouth as he performs glove worship on his muscular god. Next Jack ties up Chance in restrictive inversion rope suspension. Chance takes the flogger on his chest and cock. His screams are muffled with a ball gag. Finally in full rope suspension, Chance is fucked hard and deep by Jack. His throbbing cock fills up Chance’s asshole like never before. Chance screams in pain and pleasure. After working his boy over Jack unloads a thick heavy load of cum on his bottoms face. Choking him with cum. Finally chance is jacked off by Jacks huge hands which gets Summerlin’s cock flooding the dungeon floor with cum.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Chance Summerlin",
      "person_id": 60103
    },
    {
      "name": "Jack Dixon",
      "person_id": 61576
    }
  ],
  "release_date": "2018-11-08",
  "scene_id": 43878,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "Chains",
    "Choking",
    "Collar",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Gag",
    "Gay",
    "gloves",
    "Hairy",
    "Humiliation",
    "Latinx",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "muscular",
    "other hair color",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Smoking",
    "Submission",
    "Suspension",
    "Swallow",
    "Tattoo",
    "white"
  ],
  "title": "Muscular Leather Daddy Smokes Cigars & Brutally Fucks Submissive Boy"
}