{
  "collections": [
    "Bound Gods"
  ],
  "description": "Casey Everett is home from school and stressed out from his midterms. Stepdad Jason Collins greets Casey, shirtless in his massage studio and gives his Stepson a hug. Jason had just finished up with a client and offers Casey a massage on the house to relieve the stress. Although reluctant at first, Casey takes him up on it. He strips down to his underwear and lays face-down on the massage table. Jason begins working out all the kinks and Casey relaxes so much he falls asleep. Suddenly he’s tied to a bed with red rope wrapped around his wrists and ankles. His Stepdad lurks in the background wearing a leather harness, jerking his big hard cock. Jason walks up and slaps Casey’s chest and asks if he wants Daddy’s cock. Casey begs for it. Jason walks around to Casey’s face and puts his cock just out of reach of Casey’s mouth. Casey works hard to get any of his Daddy’s cock in his mouth and begs for him to shove it in. Jason mounts his Stepson’s head from the edge of the mattress and skull fucks Casey, sending his long fat cock down his throat over and over. Next we find young Casey face down ass up with a ball-gag in his mouth, bound in rope with his hands behind his back. Stepdad, Jason flogs his Stepson’s ass and back as he screams through the ball-gag. In the final scene, Jason is lying on the bed with his hands behind his head, enjoying the view of Casey’s ass bouncing up and down on his fat cock. Casey rides his Stepdaddy’s cock, fucking himself deep and hard with it. Jason turns them both over to the side and he spoon fucks his Stepson hard until Casey blows his load with his Stepdad’s cock still pounding his ass. Jason tells him to get off and he shoves an electrified butt-plug up Casey’s ass and turns up the voltage. Casey’s ass spasms in time with the electricity pulses and moans in pleasure. Jason gets so turned on, he tells Casey to suck his cock and blows his load right down Casey’s throat.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Casey Everett",
      "person_id": 60450
    },
    {
      "name": "Jason Collins",
      "person_id": 61577
    }
  ],
  "release_date": "2018-10-18",
  "scene_id": 43874,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Gag",
    "Gay",
    "gloves",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "other hair color",
    "harness",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Straight Stud",
    "Submission",
    "white"
  ],
  "title": "Stepdaddy's Dungeon"
}