{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Charli Acacia has the right attitude, drive and determination to become a BDSM rough sex superstar, and when we asked her to try and squirt on camera for you guys, she said she would try her hardest even though she’s never done it before. Thatta’ girl, Charli, that’s a good sex slave! Of course, Master Bruno lends a hand, and a cock, and a whip, a vibrator and a violet wand, to help Charli achieve her dream. Chained and secured with leather straps to a small wooden box, Charli’s entire body is shocked with the violet wand to tune her up. She shrieks in agony as the static electricity stings her sensitive clit and nipples. The Hitachi wand is applied to her clit until she begs for cock. Charli receives her reward and gets her throat and pussy deeply penetrated and fucked with equal intensity. The skilled Master Bruno shoves four fingers into Charli’s gash, and puts the vibe directly on her clit until she squirts, not once, but three fucking times! It’s super intense and way better than any reality TV! Charli thinks she’s finished, but she gets the dildo on a stick jammed in her bald biscuit. More throat fucking and pussy hammering, and then Bruno dumps a huge load of spuzz in her mouth which Charli hungrily swallows down. An amazing scene with an amazing slut!",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Charli Acacia",
      "person_id": 55348
    }
  ],
  "release_date": "2018-10-04",
  "scene_id": 43872,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Brunette",
    "Dildo",
    "Electrical Play",
    "Hitachi",
    "Latinx",
    "Leather",
    "master",
    "natural boobs",
    "Rough Sex",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "Partner Studio",
    "Vibrator",
    "Violet Wand",
    "white"
  ],
  "title": "Charli Acacia #2 Sexual Disgrace Squirt Three Times"
}