{
  "collections": [
    "Bound Gods"
  ],
  "description": "Muscle God, Michael Roman stands blindfolded and angry, trapped on top of a wooden platform. His arms and legs have been tied to the wall with black rope. He struggles to get free as Cesar Xes walks up and starts to tease the captive muscle monster. Cesar pinches Roman's nipples and plays with his cock, rubbing on the outside of his leather jock. Roman tells Cesar that if he ever gets free, he's gonna get him back good. Cesar laughs it off and gets on his knees and sucks Roman's cock. After Cesar has his way with Mr. Roman, he goes off to get some water to drink. Just as Cesar turns his back to take a sip of water, Roman wriggles out of his restraints, sneaks up on Cesar and grabs him with his strong arms. Roman lifts Cesar in the air by his neck and puts him over his shoulder and spanks his ass hard multiple times. He puts Cesar on his knees and fucks his mouth with his hard cock. In the next scene, Roman has Cesar's body fully suspended with a web of black rope. Roman gets his leather flogger and hits Cesar all over his body turning his skin pink. Next, Roman bends Cesar over and shoves his big hard cock in his ass. He pounds Cesar's ass deep and hard while in a full suspension and Cesar loves every inch of it. Roman lowers Cesar to the ground and puts a spider-gag in his mouth, followed by his cock. He sticks his leather gloved hand inside Cesar's mouth and Cesar licks it. Roman removes the gag and jerks Cesar's dick, making Cesar blow a huge load all over his own body. Roman takes off one of his gloves, shoves it in Cesar's mouth, and cums on his face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cesar Xes",
      "person_id": 60954
    },
    {
      "name": "Michael Roman",
      "person_id": 61574
    }
  ],
  "release_date": "2018-10-25",
  "scene_id": 43875,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gag",
    "Gay",
    "gloves",
    "Humiliation",
    "jock",
    "Leather",
    "Lift And Carry",
    "Male Sub",
    "master",
    "Muscle",
    "harness",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "spider gag",
    "Submission",
    "Suspension",
    "the wall",
    "top"
  ],
  "title": "Cesar Xes Surrenders to Mr. Roman"
}