{
  "collections": [
    "Men On Edge"
  ],
  "description": "Michael Roman is tired of people making a mess in the alley behind his bar. But when he tries to call the cops on Dominic Pacifico, he gets taken down, and taken for a ride he isn't expecting. Dominic ties him up, and binds his arms behind his back, then begins the sexual torment, worshipping Michael's ripped, muscled body before moving down to his cock. Dominic breathes in the heady smell of Michael's cock and balls before releasing them, stroking that dick, and sucking it. All the while, Michael can't move and can't resist, but he clearly doesn't want to pull away. Sebastian Keys shows up to lend another hand. He and Dominic work Michael's hard cock in every way, stroking, sucking, working it into a lubed-up stroker, bringing him to the edge repeatedly, then leaving him there, aching to cum. They bend him over so his beautiful, muscled ass is sticking out for them to use. His perfect hole begs to get fucked, so Sebastian and Dominic shove a dick-on-a-stick into that sweet ass and work it, while Dominic simultaneously sucks his hard cock. Michael's hands are above his head, so he can't pull away or resist, and he absolutely doesn't want to now. He's getting his hard dick and his hungry ass played with, and these guys are bringing him to the brink again and again. Finally, Dominic strokes and sucks Michael's dick with full-on intent, to make this tied-up stud shoot his fucking load. Michael's entire body trembles and shakes, his muscled ass clenched tight as he blows his load all over Dominic. Finished--or so he thinks--Dominic and Sebastian then tickle him one last time, making him squirm and writhe in the ropes, before leaving him in the alley, tied up and spent.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Michael Roman",
      "person_id": 61574
    }
  ],
  "release_date": "2018-11-13",
  "scene_id": 43879,
  "tags": [
    "Ass Hook",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Clothespins",
    "Edging",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Stud",
    "Tickling"
  ],
  "title": "Indecent Exposure: Muscle Stud Michael Roman Gets His Hard Cock Milked"
}