{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Guess whose back for more lesbian domination and bondage. Our favorite kinky BDSM slut Isa Mendez. She keeps insisting on another return session, hoping for a challenge. Mila Blaze and Lexy Villa, two hot and controlling Mistresses equipped with massive strapon dildos, have a rope bondage scene in mind. They tie her wrists to a post, on her shoulder blades, legs and feet hanging over her head. Her pussy is high up enough for easy access. Lexy bows down to Isa’s face and chokes her bit while Mila fingers her pussy, warming it up for some wreckage and stretching. Mila pulls out her dick on a stick and rams it down Isa’s pussy, pulling and pushing it in and out fast and rough. Isa tries to catch her breath but Lexy won’t let her. Mila steps over Isa and fucks her with her big black rubber dick, pounding her deep and hard. Isa takes every inch. The two Mistresses untie her, stand her up and bend her over the post. They’re horny for double penetration, stuffing her holes, making her cum a few times and gag up a stream of spit. Now for the real challenge Isa asked for: an upside down wall rope suspension. Isa hangs on the wall from her waist, wrists and ankles. There’s something else hanging on the wall, pointed right at Isa’s pussy: a high speed fucking machine. It drills into her as Mila and Lexy take turns stuffing Isa’s mouth with their strapons and dicks on a stick. Isa begs to cum every few seconds, so turned on from everything. She evens gets another flogging. What a good submissive sex slave!",
  "directors": [],
  "models": [
    {
      "name": "Isa Mendez",
      "person_id": 53665
    },
    {
      "name": "Lexy Villa",
      "person_id": 53826
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    }
  ],
  "release_date": "2018-10-04",
  "scene_id": 43873,
  "tags": [
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "Domination",
    "Double Penetration",
    "Feet",
    "Flogging",
    "Gag",
    "Kinky",
    "Latinx",
    "Lesbian",
    "mixed",
    "natural boobs",
    "Rope Bondage",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "Suspension",
    "the wall",
    "Partner Studio"
  ],
  "title": "Rope Suspension BDSM Fun for Isa Mendez from Mila Blaze & Lexy Villa"
}