{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Petite beauty Moka Mora is eager to dip her toes into a little kink for her anniversary with her man Donny Sins. However she has no idea how deep kink she is getting herself into. Dressed in a tiny lace pink nightie she tells Donny she is ready for this adventure. Donny pulls out a leather blindfold which fully deprives Moka of her vision and he gets his party started with guess whose dick this is. Unable to see at all, five hung rock hard dicks are shoved in her gorgeous face. She starts choking them down and jerking them all off. Her spit is drooling out of her face as she can’t keep up with all the cocks. Deep throat cock sucking is rammed down her mouth. Her face is slapped with hard dicks as the men humiliate her. Her clothes are removed to reveal her perfect body. The tattooed guys can’t resist. They finally rip off her blindfold and Moka now realizes what she has gotten into. A five guy gang bang. She is surrounded by throbbing cocks and she must take care of each and everyone of them. The guys tie her up in restrictive rope bondage. And she is fucked deep in her tight shaved pussy by each of them. Hard cocks fuck her pussy and rip her open, while her mouth is stuffed full with more meat. Her perfect pussy is slapped hard and the pain causes her to scream. She screams how big the cocks are and how it is stretching out her tight pussy. The buff men want to fill all her holes so they flip her over and shove their giant dicks in her tight hungry asshole. Her eyes widen as she is stretched to her limits. She has never had anything that big in her before. The aggressive men take turns penetrating her holes. The double penetration stretches her open from all her holes. Finally then men all unload their cocks with huge cum loads all over her face. She is soaked in cum and can barely breathe through it all.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Mark Zane",
      "person_id": 55651
    },
    {
      "name": "Moka Mora",
      "person_id": 59853
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2018-12-12",
  "scene_id": 43889,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blindfold",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Choking",
    "Corporal Punishment",
    "Deepthroat",
    "Double Penetration",
    "Facial",
    "foreskin",
    "Gangbang",
    "Kinky",
    "Latinx",
    "Leather",
    "mixed",
    "muscular",
    "natural boobs",
    "Pain",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slapping",
    "slim",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "The Kinky Anniversary: Petite Girlfriend Aggressively Fucked by 5 Guys"
}