{
  "collections": [
    "Men On Edge"
  ],
  "description": "Naked and strapped to the hood of a white minivan, Jack Hunter gets driven through the desert under the burning sun. At the wheel is Sebastian Keys and riding shotgun is Tony Orlando. They drive Jack to some concrete desert ruins and unstrap him from the car. They use the rope Jack is already bound in to tie him in a standing position to the rebar sticking out of the concrete. He's tied with one leg in the air and his hands behind his back. Tony jerks Jacks big cock while Sebastian puts his hand over Jack's mouth to keep him quiet. Tony leans down and sucks Jacks fat dick, deep throating it and making Jack moan through Sebastian's hand-gag. Jack gets close to shooting his load and they take their hands off of him and laugh at his look and sounds of disappointment. Now with a ball-gag in his mouth, Jack gets tormented some more as Tony drops to his knees and really goes to town on Jack's dick bringing him again close to the edge as he's denied an orgasm. Before untying him the tickle his ribs and legs and get him to writhe around on one leg, unable to escape. In the next scene, Jack is blindfolded and suspended by rope from more rebar on the roof of an old ruin. His legs are spread and Tony walks into the scene ready to suck some more cock. He gets Jacks big dick hard then brings out a stroker and slides it down Jack's big shaft. He strokes him with it bringing him close to cumming and denies him again. Finally Tony and Sebastian let him cum and he shoots a huge milky load against the sunny blue sky and the two leave him there tied up and drive off into the sunset.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jack Hunter",
      "person_id": 58734
    }
  ],
  "release_date": "2018-12-11",
  "scene_id": 43882,
  "tags": [
    "BDSM",
    "big dick",
    "Bondage",
    "Edging",
    "Gag",
    "Gay",
    "Hood",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling",
    "white"
  ],
  "title": "Jack Hunter: Driven to the Edge"
}