{
  "collections": [
    "Everything Butt"
  ],
  "description": "Chanel Preston sits at her throne with two submissives kneeling at her side. To her right is Penny Pax who wants so bad to be trained to top other's asses. On her hands and knees with her round ass covered in latex and her big natural tits out, Penny listens and obeys as Chanel agrees to give her one chance. To Chanel's left is Kendra Spade who sits silent and naked and is there only to serve and to be a willing ass for Penny to practice on. But first Penny must worship Chanel's ass to show her how much she wants it. Chanel stands and lifts up her tight purple latex minidress and bends over her throne and spreads her big beautiful round ass. She tells Penny to show her what she's got and Penny dives into her ass face-first and vigorously licks her hole. Chanel shoos Penny away and tells Kendra to show her how its done. Sure enough, Kendra licks Chanel's hole with more gumption, licking and tongue-fucking her hole, getting Chanel to moan in pleasure. Chanel tells Kendra to stick a glass toy in her ass and Kendra does it perfectly, showing up Penny once again. Kendra pulls the toy out of Chanel's ass and puts it in her mouth to clean it off. She pops it in and out of Chanel's ass and feeds the toy to Penny. Next, Chanel tells Penny to put the toy into Kendra's ass and to not disappoint her. Penny stretches Kendra's ass with the clear glass toy while Chanel flogs Penny's bare ass. Chanel presses an hitachi against Kendra's pussy and she cums hard. In the next scene, Kendra is on her back with her legs spread with a metal butt-plug in her ass. Chanel tells Penny to make Kendra cum, and so with her ass in the air, Penny licks Kendra's pussy while Chanel fucks Penny's ass with a big metal dildo. After that, Chanel commands Kendra to get her ass in the air. Chanel puts a cold metal speculum into Kendra's ass and spreads it open. Penny is ordered to lick Kendra's gaping hole while Chanel puts the hitachi once again onto Kendra's pussy and Kendra cums again. Chanel puts the strap-on to work and stacks Kendra on top of Penny, both in doggie, and fucks their asses with her big strap on dildo. Kendra hops off and sticks her open mouth next to Penny's ass hoping to gag on Chanel's cock and taste the inside of Penny's ass. They both take turns riding their Mistress' cock in reverse cowgirl, fucking their own asses. In the final scene, Penny is on her back with her legs spread and Chanel fucks her with a huge class toy. She flips her over in to doggie and fists her ass and makes Kendra fist her ass too.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Kendra Spade",
      "person_id": 60694
    },
    {
      "name": "Chanel Preston",
      "person_id": 26542
    }
  ],
  "release_date": "2018-11-16",
  "scene_id": 43888,
  "tags": [
    "Acrylic Plug",
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Ass To Mouth",
    "Big Natural Tits",
    "Big Toy",
    "buttplug",
    "Deepthroat",
    "Dildo",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Flogging",
    "Gag",
    "Gaping",
    "Hitachi",
    "Humiliation",
    "Latex",
    "Lesbian",
    "LezDom",
    "Rimming",
    "Speculum",
    "Straight",
    "Strap On",
    "top"
  ],
  "title": "Anal Domination Training"
}