{
  "collections": [
    "Men On Edge"
  ],
  "description": "Welcome back Dante Colle to KinkMen! This fit and handsome stud is ready for more kink torment. Master Sebastian Keys ties up Dante’s perfect body in fully restrictive tight rope bondage. Unable to touch his own huge cock, Dante must submit to Tony Orlando’s constant pleasure. Tony starts right on Dante’s monster cock. Stroking it fully up and down until it is rock hard and ready to explode. Tony works is mouth on Dante with a deep throat gagging blowjob. Dante from the beginning says he is ready to explode, close to cumming and cannot hold it back. The edging is tormenting this submissive. Sebastian brings out the nipple clamps which gets Dante even closer to the edge. Sebastian must hold Dante back and covers his moaning mouth while Tony works on worshipping Dante’s naked feet. Licking his toes gets Dante squirming. They two bring out a sex toy jacking sleeve and get to work on Dante’s shaking cock. This is just too much for Dante and he explodes! This handsome sub couldn’t take it and went over the EDGE! Master Keys isn’t done with him yet though and torments Dante with repercussion tickling. This endurance tickling is too much for Dante who can’t fight back. The men then put Dante in a full body rubber sack. With Dante’s cock exposed and mouth in a ball gag, Tony gets back to work. Next up is a full cock stroker. Dante’s huge dick barely fits in it. Sebastian wants to turn it up again and brings out a vibrating cock ring. This again proves too much and sends Dante back over the edge with a huge cum load.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dante Colle",
      "person_id": 61292
    }
  ],
  "release_date": "2018-11-27",
  "scene_id": 43880,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "directorspicks",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "master",
    "Nipple Clamps",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Stud",
    "Sub",
    "Tickling",
    "white"
  ],
  "title": "Over the Edge: Handsome Stud Dante Colle Unable to Resist Master Keys"
}