{
  "collections": [
    "CFNMEU"
  ],
  "description": "Our sexy Aron Ros is in the mood for a massage. He sits on the table waiting for the masseuse to arrive. She tells him to lay along the table and begins to work on his back and shoulders. Using oil she massages the back and then moves down to Aron's legs. Then she pushes his underwear down a little to do the base of his back and onto his ass cheeks. As she works she pulls the underwear down further, exposing that sexy ass. Then the underwear comes off completely and she drips oil onto Aron's beautiful ass. The hands rub all over the ass, pulling the cheeks apart and rubbing into the crack. The Aron turns over, onto his back and the girl gets to work on the legs some more. He hands rub over Aron's cock and balls too and the cock begins to swell from her tough. Soon that cock is nice and hard. The masseurse takes hold on the cock and starts wanking it. Then she leans over and licks it too. She takes the head in her mouth as well as she continues to wank it. But she has other things planned for Aron too, blindfolding him. Then she takes some rop and start to tie his ankles. Soon she has his wrists and ankles shackled to a bar which hangs from the ceiling. His ass is available and she starts whipping it. Aron moans through his gag as she whips. Then she takes a dildo on a pole and shoves it deep into his tight ass, fucking it in and out. She continues to play with his ass hole, using a vibrator as well, shoving it in as deep as she can. The Aron is made to stand up, still shackled as she wanks his big cock. She flick as the cock with a leather strap and then turns him around to play with that ass some more. Then Aron is bent over so the girl can fuck him with her strapon. He moans as she works his hole with her a rubber cock. Finally she stands him up and makes him wank himself until he shoots his hot jizz all over the floor.",
  "directors": [],
  "models": [
    {
      "name": "Aron Ros",
      "person_id": 61578
    },
    {
      "name": "Pidzemellya Hospodynya",
      "person_id": 61363
    }
  ],
  "release_date": "2018-10-05",
  "scene_id": 43881,
  "tags": [
    "black hair",
    "Blindfold",
    "brunet",
    "Dildo",
    "Fishnets",
    "foreskin",
    "Gag",
    "Leather",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Paddle",
    "Pegging",
    "slim",
    "Straight",
    "Strap On",
    "thirdparty",
    "Vibrator",
    "Whipping",
    "white"
  ],
  "title": "In the Mood for a Massage"
}