{
  "collections": [
    "Everything Butt"
  ],
  "description": "Anna De Ville wants to be a powerful domme, but her teacher, London River, doesn't think she's putting in the work. When Anna shows up late for her lesson--again--London decides Anna's not going to learn how to dominate anyone today. Instead, she's getting her sweet ass trained as a sub. Anna scoffs at the idea, until London puts her in stirrups and starts finger-fucking her creamy ass. Anna's hole opens right up for the punishment, swallowing London's fingers. London can tell her little protege is hungry for more, so she picks up a thick, clear butt plug, and starts pumping it in and out of Anna's desperate ass. Her hole gapes almost immediately. She's done this before and she's clearly eager to get more. London then takes the insatiable anal slut and throws her on the bed and slides a long, thick strap-on cock into her gaping ass. She fucks her smooth ass deep and hard, opening her up even more. Anna can't get enough as she slides back on it, pulling it deeper into her fucked hole. London lets her have a vibrator, and within moments Anna is cumming hard with that dick pistoning in her asshole. Every time London pulls out, Anna's hole seems to gape even wider than it did before. London then shoves a speculum into Anna's well-used hole, and spread it open so she can play with it. She spits into that stretched out ass, visibly filling it up, then squirts into it so Anna's literally spilling over. They then use all that spit and fluid to fist Anna's hole. First she does it to herself, then London jams her fingers in, working that stretched ass while Anna cums again. Finally, it's London's turn, and her expert ass swallows Anna's fist right up. Anna fist fucks her teacher until she cums, and the two of them collapse in a heap of spit and squirt, with both of their asses well fucked.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Anna De Ville",
      "person_id": 59053
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2018-11-02",
  "scene_id": 43885,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Lesbian",
    "LezDom",
    "shaved",
    "smooth",
    "Speculum",
    "Straight",
    "Sub",
    "Teacher",
    "Vibrator"
  ],
  "title": "Holed Up: London River Anally Trains Her Whiny Protege Anna De Ville"
}