{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Christy Love is hard at work. This gorgeous model in her tight white top and red skirt perfectly define her petite body and tiny small tits. She is really trying to get her work done in the new office but some assholes in the other room won't keep it down. She storms off in her black high heels to find 5 dudes slacking off. Who is in charge here she demands and finds Mr. Pete towering above her. He grabs her by the throat, spits in her face, slaps her hard and throws her down to the ground for him and all his buddies to take turns shoving their fat cocks down her throat. She swallows each one deep, choking and gagging as their cocks are rammed down her throat. The guys rip off her clothes and tie her up in tight rope bondage. She continues to take all the dicks, one at time, two at a time, jerking off another two with her hands. Dicks slapping her face she is covered in her own spit. The dudes throw her on the couch and start fucking her tight shaved pussy. This gets Christy screaming with orgasm and squirts over and over again all over their cocks and couch. They each take a piece of her perfect pie before Mr. Pete wants to sample her other holes. They each fill up her asshole as they brutally deep fuck her in ass. An anal pounding is just the beginning as the gang then sets her up for double penetration. Air tight she has a dick in all her holes and hands. Finally after countless orgasms and squirting the dudes unleash a waterfall of cum all over her pretty little face. Time to get back to work.",
  "directors": [],
  "models": [
    {
      "name": "Christy Love",
      "person_id": 61580
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Sam Shock",
      "person_id": 61546
    }
  ],
  "release_date": "2018-11-14",
  "scene_id": 43886,
  "tags": [
    "Airtight",
    "Anal",
    "Asian",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Choking",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "High Heels",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Small Tits",
    "Squirting",
    "Straight",
    "top",
    "white"
  ],
  "title": "Shut Up & Fuck: Christy Love is Bound and Brutally Fucked by 5 Guys"
}