{
  "collections": [
    "Families Tied"
  ],
  "description": "Kacie Castle is a sexy and mischievous little slut with sparkling brown eyes that spell trouble, and a petite frame that begs to be bound and fucked. It is these exact qualities that lead Rob Piper to follow Kacie from a couple dates to a road trip to her Step-Mother's mansion. Kacie is all flirtation and batting eyelashes as she explains that her Step-Mother is definitely out of the country and that Rob and her have the run of the house, as well as all the kinky BDSM toys hidden under the pastel decor. Rob has been waiting to really dig into all the submissive potential and filthy sex he knows Kacie needs. A pair of handcuffs and tight metal nipple clamps provide the perfect catalyst and soon Rob has this perverted little whore gagging on his massive cock, moaning from heavy face slaps, and gushing squirt as he holds her down and makes her cum all over her Mommy's bedroom floor. A harsh punishment for cumming without permission includes ripping off her clamps and a flogging her bouncy ass until she can't take it anymore. She begs to be his little fuck puppet and Rob pounds her into the mattress in metal bondage. Unbeknownst to Rob, he is now a pawn in a perverse game of lesbian desire between Kacie and her Mother. Kacie has alerted her Mommy with a text that they are in her home, with the hopes that this transgression will rekindle their old taboo D/s dynamic that Kacie still dreams about. When Helena comes striding into her home she takes no pause at the sounds of fucking in her bedroom, but goes right out to the bedroom window to spy on her step-daughter and her strapping new boyfriend fucking. She gets her voyeuristic orgasm by rubbing her wet pussy with\none hand, keeping her eyes trained on her daughter getting pounded out. After her orgasm\nHelena marches back into the house and feigns a fake discovery of the young couple.\nThe game is on, and Rob is sent upstairs to clean up while Helena and Kacie go head to head. Kacie wants Helena to still be her strict BDSM Domme and taboo lesbian lover, and Helena has decided Kacie needs to grow up and learn to serve someone else. But not before she has taken one last strict over the knee spanking and licked her Mommy's pussy like a good girl. Rob is invited to join them so Helena can really train Kacie to be the anal whore she was meant to be. Drooling and begging on her new boyfriend's dick, Kacie couldn't look happier as Helena circles behind her with a hard flogging and crop to the pussy. Spit swapping, deep-throat training, and lesbian cuckolding are just a few tactics Helena brings to her daughters final test. Holding trays, as well as her orgasms, while having a zipper ripped off her nubile skin is a lesson in pain and service before pleasure. Canes further underline the point, leading to an insane double penetration scene with Helena ramming her huge strap on in Kacie's already stretched asshole that is full with Rob's hard dick straining against the walls of her pussy. Choked and cumming like an anal slut, Helena decides Kacie has proven herself and asks Rob to accept her slut step-daughter as his sexual servant.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2018-10-12",
  "scene_id": 43884,
  "tags": [
    "BDSM",
    "bestof2018",
    "Bondage",
    "Couple",
    "Crop",
    "Cuckolding",
    "Deepthroat",
    "Double Penetration",
    "Family Roleplay",
    "Flogging",
    "Kinky",
    "Lesbian",
    "Metal Bondage",
    "Nipple Clamps",
    "Pain",
    "Petite",
    "Spanking",
    "Straight",
    "Strap On",
    "Zipper"
  ],
  "title": "New Boyfriend Roped into Anally Punishing Mommy's Bad Girl"
}