{
  "collections": [
    "Families Tied"
  ],
  "description": "Avi Love is a little goth nightmare with a hot teen body brewing with evil sex magic. Her sexy step-mother Luna Star keeps bringing home the worst new age hippy geeks to live with them, but Avi has a plan. She's had it with all the fake Southern California bullshit, she just wants everyone to get real. After one bad fight with her step parents, Avi sits down at her alter and uses her dark sexual energy to curse her family. Baphomet hears her cry, and renders Avi's family unable to mask their truest desires: savage anal sex and BDSM power games. Luna Star is in the middle of arguing with her husband Derrick Pierce about the benefit of massage when Avi's sex curse hits. They leap on each other like wild animals and Derrick tears Luna's clothes off to get at her huge tits and bouncy ass. Luna begs Derrick to hurt her, and he uses anything at hand to beat her ass red. Paddles, spanking, zappers, and nipple clamps aren't enough for this sexual beast, so Derrick throws her on the floor and fucks her face until she is a slobbering mess, howling under a hard flogging with a cock deep in her throat. Bent over like a bitch, Luna has Derrick's hard dick shoved in her ass and she cums like a whore while he pounds her and zaps her with an electro wand. Luna is locked in a metal bondage bar with a spider gag holding her mouth open so Derrick can spit in her slutty face and shock her tongue as he fucks her. With nothing to stop him, he rips her metal clamps off mercilessly, and switches from fucking her ass to her pussy as he pleases. Next stop is Avi's room, where they tie her spread eagle on her bed. Avi smiles wickedly and thanks Baphomet. Avi eggs them on, hoping to find out who they truly are. Luna climbs onto her step-daughter's face and rides Avi's tongue while Derek shocks and zaps her wet pussy until she begs to cum from under her step-mother's ass. Slapped around and degraded, Avi starts to smile for the first time in months. She begs for her daddy's dick, and has an intense orgasm while getting fucked while Luna uses both hands to restrict her breathing and hold her down. The rest of the day is a dark sexy ride of rope bondage, anal sex, paddling, spanking, and reverse cowgirl riding. Avi is having fun for once and even smiles with joy when Derrick shoves his dick in her tight asshole and Luna throws her back against his cock again and again. Luna is on fire, flogging Avi with a wicked grin and licking her pussy as she rides Derrick's cock. The spell ends with a hot load on Avi's tiny bush.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Luna Star",
      "person_id": 58678
    }
  ],
  "release_date": "2018-10-26",
  "scene_id": 43887,
  "tags": [
    "BDSM",
    "Bondage",
    "Bush",
    "Crop",
    "Family Roleplay",
    "Flogging",
    "Gag",
    "halloween",
    "Hot Wax",
    "Mask",
    "Metal Bondage",
    "Nipple Clamps",
    "Paddle",
    "Rope Bondage",
    "southern",
    "Spanking",
    "spider gag",
    "Straight"
  ],
  "title": "Teen Goth Sex Witch Transforms Her Parents Into Anal Sex Monsters"
}