{
  "collections": [
    "Men On Edge"
  ],
  "description": "KinkMen Presents CONSTRAINED. Powerful Athletic Muscle Stud Alex Mecum and handsome newcomer Casey Jacks are both bound in tight restrictive rope bondage in Sebastian Keys Dungeon. Alex is fully suspended in black rope predicament bondage and blindfolded with a leather mask. This muscle stud is swinging in the air as his fat cock and huge balls are constrained in tight bondage. Casey Jacks is stripped naked and tied to a wooden bondage chair. His mouth is gagged and his hands are tied back while Tony Orlando works his hard cock. Both men are edged to excruciating pain as their balls turn blue. Sebastian teases and sucks Alex's huge cock taking him right to the edge over and over again. Tony deep throats and gags on Casey's cock getting it rock hard. Next comes the toys. Can these men withstand the pleasure? Alex gets the cock sleeve which barely fits his fat meat. He is made to fuck it in suspension and denied release just as he gets to the edge. Casey gets the vibrating cock head which Tony torments him with. Alex wants pain with his pleasure and gets his chest and cock flogged hard with corporal punishment before taking a huge dick on a stick up his tight ass. This hairy god gets fucked deep while Sebastian works his hard throbbing cock. Both men can take no more and deliver huge loads soaking the dungeon floor. The BDSM virgin Casey Jacks then gets his sensitive cock worked before endurance tickling. Alex Mecum drenches the floor before trying to get away from Sebastians tormenting endurance tickling.",
  "models": [
    {
      "name": "Alex Mecum",
      "person_id": 59595
    },
    {
      "name": "Casey Jacks ",
      "person_id": 61394
    }
  ],
  "release_date": "2018-10-16",
  "scene_id": 43894,
  "tags": [
    "athletic",
    "ball gag",
    "bdsm",
    "blindfold",
    "bondage",
    "Corporal Punishment",
    "dungeon",
    "Edging",
    "gag",
    "gay",
    "Hairy",
    "leather",
    "Male Handler",
    "Male Sub",
    "mask",
    "muscle",
    "oral sex",
    "orgasm denial",
    "pain",
    "predicament bondage",
    "Prostate Stimulation",
    "rope bondage",
    "Stud",
    "suspension",
    "tickling"
  ],
  "title": "KinkMen Presents CONSTRAINED: Athletic Men Bound, Punished, and Edged"
}