{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "The beautiful and sexy Liv Revamped has been having dirty sinful sexy dreams of being tied up, manhandled, and fucked by multiple guys. Liv goes to a near-by Catholic Church to confess her sins and while describing her dreams to the priest, her imagination gets away with her and she begins fantasizing about getting fucked at church. Suddenly Liv finds herself on her knees completely naked, tied up with rope in the praying position. Five guys dressed in all black surround her with their stiff cocks and move in toward her. She immediately gets to sucking all of their cocks with enthusiasm. They all fuck her face until she’s covered in her own drool and then they pick her up and bend her over a pew with her big perfectly round ass sticking out and her pussy begging for cock. Liv gets her pussy stuffed with the biggest cock first and moans in pleasure with a cock in her mouth as he spanks her ass. The other four guys line up to fuck her pussy and one by one they pound her slutty whole. Next, Liv gets put in a full suspension by use of a plethora of rope to hold her up and spread her legs. Again they fuck her pussy hard and she cums on their big dicks. After that, Liv gets placed in the cowgirl position and gets two big dicks stuffed inside her pussy, putting a big smile on her face, and then a big cock in her mouth. They flip her over in reverse cowgirl and double-stuff her with one dick in her ass and another in her pussy and they fuck her airtight. Liv begs for them to cum inside her pussy and gets two creampies and three big hot loads to the face.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Liv Revamped",
      "person_id": 61457
    },
    {
      "name": "Mark Zane",
      "person_id": 55651
    },
    {
      "name": "Zac Wild",
      "person_id": 61139
    }
  ],
  "release_date": "2018-11-28",
  "scene_id": 43890,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "Big Ass",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Creampie",
    "Double Penetration",
    "drool",
    "Gangbang",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rough Sex",
    "shaped",
    "shaved",
    "Straight",
    "Suspension",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "Liv Revamped: Gangbang Confessional"
}