{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Alby Rydes, one hot and horny sub slut, is back to explore her BDSM and rope bondage curiosity. Get ready for a domination clip to freshen any porn collection. Alby is left on the mattress on the floor, wrists tied together, her legs tied bent. She does have a beautiful face but her Master places a blindfold over her eyes. He pulls Rydes up on her knees and bobs her head on his dick, making her take his fat cock deep down her throat. Spit is streaming out of her, covering her huge tits. Her Master taunts her, making her tell him what a whore she is, slaps her face and tits, making her gag. He tests her pussy with a dildo on a stick, drilling it in her pussy. Alby gets creamy, keeping her legs spread apart. Watching her take gets him rock hard. Luckily for Alby, his dick is much bigger than the rubber cock. He pushes his sex slave on her side and fucks her from behind. Hearing Alby moan and scream she’s a dirty slut will make anyone cum in their pants. He pulls her on top of his lap and makes her ride his dick cowgirl style. Rydes is so turned on, she jumps on his dick, giving herself a deep penetration fuck session. Her Master slaps her ass to make her go faster. She seems tired but won’t stop. She definitely deserves a load of his cum. She wants it badly.",
  "directors": [],
  "models": [
    {
      "name": "Alby Rydes",
      "person_id": 52316
    },
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    }
  ],
  "release_date": "2018-10-11",
  "scene_id": 43897,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blindfold",
    "Bondage",
    "bottom",
    "Dildo",
    "Domination",
    "Facial",
    "fake boobs",
    "Gag",
    "Latinx",
    "master",
    "Rope Bondage",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "Tattoo",
    "Partner Studio",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Alby Rydes Earns a Facial After Another Rough Slave Training"
}