{
  "collections": [
    "Str8Hell"
  ],
  "description": "Borek Sokol is in Airport Security when his colleague Petr Zuska brings in a suspected smuggler, Laco Meido. Petr starts to search Laco, stripping him naked in the process . He spreads Laco's ass but decides he needs to examine it more closely. So Borek puts on some gloves and, as Laco is bent over the desk, he starts to explore the tight hole. Laco moans as Borek's fingers dig into his hole, finding nothing. They suspect what they want to find is deeper inside, so they have another root around inside the hole. Then they stand Laco up and decide they need some other action. They soon have him sucking on their rock hard cocks, taking turns on each. Having made him suck their cocks Petr and Borek decide to go further. They move Laco into another room and strap his arms to a beam. They blindfold him too and start hitting on his chest. Laco moans as they torment him. Then he is released from the ropes, but put onto his back and soon Borek is fucking his tight hole. He moans as the dick slams in and out of his ass, and he sucks on Petr's cock too. Then Petr and Borek swap over, so that Laco gets Petr's dick in his hole. He is put onto his knees and Petr pounds away at that hot ass. Laco moans as he takes it hard. Borek takes over the fucking again as Petr wanks himself. Then as Borek needs to cum he pulls out and is replaced by Petr's throbbing cock. Borek dumps his cum over Laco and Petr fucks that hole until his cum is ready too, pulling out and coating Laco's ass with his sticky juice. Laco is then allowed to wank himself and soon delivers his own sweet juice.",
  "directors": [],
  "models": [
    {
      "name": "Borek Sokol",
      "person_id": 60756
    },
    {
      "name": "Laco Meido",
      "person_id": 61376
    },
    {
      "name": "Petr Zuska",
      "person_id": 60766
    }
  ],
  "release_date": "2018-10-10",
  "scene_id": 43896,
  "tags": [
    "Blindfold",
    "Gay",
    "gloves",
    "thirdparty"
  ],
  "title": "Suspected Smuggling"
}