{
  "collections": [
    "Bizarre Video"
  ],
  "description": "Psychologist Mugur has a radical cure for his patient Juan Lucho’s problems. He lets Juan play with a human sex doll, clad head to toe in shimmering purple latex. The tight suit enhances her huge tits, and curvy ass.\nUnder his doctor’s supervision, Juan gets a chance to act out all his fantasies as the master of a willing obedient submissive females.\nThe Doc has Lucy crawl over to them. Juan starts by giving her an over-the-knee spanking. He then begins sucking on her giant 32F tits through the latex suit. His fingers wonder to explore her rich red mouth and shaved pussy through her open crotch. She sucks Juan’s cock, filling her red lips with his huge organ. Her green eyes peer out at us through the holes in her hood. She stands up to bend over for Juan’s johnson, which goes deep into her shaved pussy from behind. While bent over, she gives a blowjob to the good doctor. She takes his cock deep into her mouth, holding it in her black-gloved hand as her red lips suck it all in. Meanwhile she gets fucked spoon style through the open crotch of her body suit by Juan on the bed.",
  "directors": [],
  "models": [
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Latex Lucy",
      "person_id": 61550
    },
    {
      "name": "Mugur",
      "person_id": 33526
    }
  ],
  "release_date": "2018-10-09",
  "scene_id": 43891,
  "tags": [
    "Athletic",
    "big dick",
    "Big Tits",
    "Blowjob",
    "brunet",
    "Brunette",
    "Collar",
    "Curvy",
    "Doctor",
    "fake boobs",
    "Fetish",
    "foreskin",
    "gloves",
    "High Heels",
    "Hood",
    "Latex",
    "Latinx",
    "Mask",
    "master",
    "PIV",
    "shaved",
    "slim",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Stud",
    "Tag Team",
    "Partner Studio",
    "Threesome",
    "Uncircumcised",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Purple Latex Doll"
}