{
  "collections": [
    "Hogtied"
  ],
  "description": "It's no secret that The Pope loves the alt girls, but this time he has the queen of alt girls, Joanna Angel. She made her Kink.com debut recently as a top, but this time, and for the first time EVER, she submits to The Pope. This is a rite of passage for her, and to do this solidifies that she is as much of a badass as we knew she was. The first scene begins with Joanna tied in a sitting position with her legs spread wide and her arms pulled away from her. Her neck is also tied up, to ensure she is totally helpless. The Pope enters and you see her face begin to smile. All of the waiting, all of the anticipation has led up to this very moment for her. She is a good girl, and wants to prove it to him, so she is willing to do whatever it takes to please him. The Pope takes his time with her to ensure her time is well spent. He is willing to help her explore this side of her sexuality, which is a side that has never been explored until now. She is eventually blindfolded to enhance her experience, and to guarantee her the maximum stimulation form the scene. The orgasms begin, and she is overwhelmed by how hard she is cumming. The next scene begins with Joanna in a brutal suspension. The Pope told her that she would get the same treatment as a seasoned bondage slut, but only with more guidance. Her tits are covered with clothespins to bring even more discomfort to her as she hangs helplessly in the air. After more flogging, The Pope fucks her mouth and then her pussy to overwhelm her even more. She is fingered until her pussy gives up multiple squirting orgasms. In the final scene Joanna is on he back like a good slut with her legs spread nice and wide. Her pussy gets more from the flogger and then the cane is brought in to administer some bastinado. It doesn't take long for her to realize that that is a pain she never needs to experience again. To prove to he that there is more than one way to suffer, The Pope breaks out his infamous knitting needle and shows her pain that she never knew existed. He moves on to electrical play and then the final orgasms of the day. By the time that he has finished with her the entire dungeon is soaked in her sweet squirt.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Joanna Angel",
      "person_id": 61458
    }
  ],
  "release_date": "2019-02-14",
  "scene_id": 43903,
  "tags": [
    "BDSM",
    "black hair",
    "Blindfold",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Rope Bondage",
    "Squirting",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "toned",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Joanna Angel Submits to The Pope!"
}