{
  "collections": [
    "Device Bondage"
  ],
  "description": "We have seen what Victoria Voxxx is capable of handling when it comes to extreme treatment from The Pope. She has proven that she is one of the toughest models\naround, so you have to ask yourself what the hell can these two do that’s going to top\nwhat has already been done? Well…we’re glad you asked. Victoria is on her back in a\ngrueling back arch with her legs bent below her and her arms restrained with steel\nshackles. Her legs are spread, per the usual to allow easy access to her honey hole. The\nPope enters and begins to inspect her body, with a few nice hits to warm up her flesh for\nthe upcoming brutality. He begins with the cat-o-nine with its stingy leather straps\nstriping her skin. All of the sensitive areas are paid extra attention to so that she suffers\nthe way he wants her to. She is then teased and denied her first orgasm, before clothes\npins are added to her skin with precision. The Pope takes aim and has a little target\npractice using the cat-o-nine to remove the clothes pins one a ta time. A massive dildo is\nshoved inside of this whore and then multiple orgasms are ripped from her body. The\nnext scene begins with Victoria in a standing position. Her captor enters, and begins\napplying a device to disfigure her face with leather and metal face bondage. Next he\nimplements brutal nipple torment with wooden spikes and suction. What follows is an\nextreme cane session that leaves Victoria’s body shaking and quivering. In the final scene\nVictoria is in a grueling back bend position with her arms out to the sides and her head\nis upside down. This is the most vulnerable she has been all day and she is a little\nconcerned about what may happen. Victoria usually smiles with she suffers for The Pope, but once the bastinado begins, her smile is replaced with what can only be described as\nendurance and suffering. This may be the hardest The Pope has ever tormented her, and\nhe is relentless with the brutality of what he is doing. He doesn’t want to break his toy, so\nhe moves on by applying a nasty pussy clamp that pinches her outer labia and spreads her\npussy at the same time. The final orgasms are squeezed out and the end of the day is\nhere. Victoria has made it through another grueling day with The Pope and the world is\na better place because she did.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-04-18",
  "scene_id": 43907,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Caning",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Extreme Torment",
    "Fingering",
    "Handler",
    "Humiliation",
    "Latinx",
    "Leather",
    "Metal Bondage",
    "multiple orgasms",
    "natural boobs",
    "Nipple Torment",
    "Pain Slut",
    "Pierced Nipples",
    "Straight",
    "Submission",
    "The Pope",
    "toned",
    "top"
  ],
  "title": "Victoria Voxxx Endures Extreme Torment in Grueling Steel Bondage"
}