{
  "collections": [
    "Hogtied"
  ],
  "description": "Gabby showed up in a saucy mood and needed The Pope to issue some bondage therapy to get her head straight. She starts with her hands above her head and her legs spread wide. He immediately comes in and begins her torment with heavy hands striking her body. That was just a warm up for the devastating flogging that she has to endure next that is clearly the most brutal she has ever taken. Nipple clamps are added to her sensitive nipples and the pulled off of her. The orgasms are what pushes her over the edge as we see her eyes fill up with tears, and then the slow fall as she reflects on what just happened to her. Scene two starts with Gabby in a doggy style suspension, and she is already in a better mood. The Pope brings the crop with him for precision and accuracy when he abuses her body. Each strike is used to bring on the most severe pain possible, and you can see it in her face as he torments her. After he finishes with some bastinado, he breaks out the leather flogger and uses Gabby like a fucking pinata. “Fuck you, JP” are the last words she utters before the scene ends proving that he has had his way with her, and she knows there is nothing she can do to stop him. In the final scene she is on her back with her legs up and spread wide like the whore that she is. Now it’s time for some serious breath play, and it’s as extreme as it can possibly be. The Pope works her until she is in la la land, and then he moves on to her ass for some anal fucking. Now that she has been ass fucked properly, he finishes her off with a vibe and a few more orgasms. The day is over and Gabby is all smiles after a little “Fuck you JP” time!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Gabriella Paltrova",
      "person_id": 41906
    }
  ],
  "release_date": "2019-02-28",
  "scene_id": 43904,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Domination",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Leather",
    "Machine Dildo",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Petite",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Curvy Slut Gabriella Paltrova in Grueling Rope Bondage and Tormented"
}