{
  "collections": [
    "Hogtied"
  ],
  "description": "Abella is back and looking fan-fucking-tastic! She showed up at the young age of 19 and has taken Kink by storm. She is a true pain slut that loves to serve her master, and suffer however he sees fit. The Pope holds a special place in her heart and is her go to for true suffering. She knows that he won't put up with her bratty ways, and will quickly put her in her place. We begin with her there, on the floor where she belongs. She is is in a spread eagle, but all of her limbs are pulled to one point. This is a modern day quartering predicament, that will test her strength, both mentally and physically. Her clothes are cut and ripped away from her body to expose her amazing naked body. The Pope begins flogging her pussy in a fury of sadistic punishment. He toys with her, but continues to flog her all over, and slowly tightening the ropes that are pulling her in every direction. Multiple orgasms are ripped from her pussy before moving on to the next position. Now we have Abella upside down in a brutal inverted suspension with her legs spread wide. The flogger is brought back out and a full assault on her flesh begins. He administers some breath play before adding a vibe to begin the process of non stop orgasms. We get to see her begin to twilight with the breath play, but The Pope always brings her right back with a few slaps to her face. The orgasms pour out of this slut and then we move on to the final scene. Abella is in a four point hogtie, but all of her limbs are tied up to a point. Throughout the scene The Pope pulls a little more on the ropes, pulling her into a more severe hogtie. This time he enters carrying a cane and with that he administers bastinado and swift strikes to her ass as well. He begins to make her orgasms against her will, and it eventually gets to her. She struggles to get away and turns herself in the bondage to now face up. The Pope quickly grabs her, wraps his hand around her face and continues to make her cum.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Abella Danger",
      "person_id": 56157
    }
  ],
  "release_date": "2019-01-31",
  "scene_id": 43902,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "master",
    "multiple orgasms",
    "Pain",
    "Pain Slut",
    "Predicament Bondage",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Pain Slut Abella Danger Suffers in Grueling Predicament Bondage"
}