{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Oscar is eating dinner at the table, Sean is tied to a spanking bench, wearing a leather/canvas straitjacket. His eyes are taped shut with black tape. Oscar handfeeds Sean pieces of chicken. He puts a whole drumstick at Sean's lips, and urges it on the boy more quickly than Sean can eat it. Oscar wipes the greasy chicken first over Sean's face, then over Sean's cock and balls. Having greased these latter, he starts manipulating Sean's cock, which stiffens. Sean succumbs to Oscar's masturbating, his head goes back, Oscar kisses it. Oscar masturbates Sean more, then suddenly stops, takes a last piece of chicken for himself and his plate into the kitchen. On his return, he slaps the leather chestplate of the straitjacket over and over, hard. There's no way Sean can avoid the painful smacks. Oscar pushes Sean all the way down on the bench, and ties him down by the collar, exposing his ass and asshole, which he spanks painfully. Sean cries out as the spanking goes on. \"And now for dessert,\" says Oscar, and he buries his face in Sean's asscrack.\nWith tape still covering his eyes, Sean is spreadeagled on Oscar's bed, his mouth now taped, too. Oscar puts a fleshlight on Sean's long, stiff cock. and jacks it up and down, bidding Sean to cum. This happens almost at once, as Sean spills his cum onto his belly. Oscar spreads it around all over his chest, his chin, his gag, his face. He makes Sean smell it before removing the fleshlight. Sean lies on the bed, wasted, as Oscar caresses his head and kisses his gag.\nSean is bedded down for the night on a mat, his collar chained to the wall. He is no longer blindfolded, but his mouth is still taped shut. His electric bullet is back in his asshole, the locked harness holding it in. Sean's hands are cuffed behind his back. He tries to make himself comfortable and sleep, though the sound of traffic is loud. In his bed Oscar masturbates, looks for and finds the remote, and presses it. Sean convulses with a cry. Oscar gives Sean another jolt, then puts down the remote, slides down in bed and turns off the light.",
  "directors": [],
  "models": [
    {
      "name": "Oskar",
      "person_id": 61552
    },
    {
      "name": "Sean Patrick",
      "person_id": 61551
    }
  ],
  "release_date": "2018-10-18",
  "scene_id": 43909,
  "tags": [
    "BDSM",
    "Blindfold",
    "Bondage",
    "brunet",
    "Collar",
    "domestic",
    "Edging",
    "Gag",
    "Gay",
    "Handjob",
    "Leather",
    "Leather Cuffs",
    "Male Handler",
    "other hair color",
    "harness",
    "Slave",
    "Spanking",
    "Straitjacket",
    "the wall",
    "thirdparty",
    "Twink",
    "white"
  ],
  "title": "Boysitting: Dinner and Bedtime"
}