{
  "collections": [
    "Device Bondage"
  ],
  "description": "Charlotte is finally back on Device Bondage! We did one of her first shoots ever, and she has always cherished what happened between her and The Pope. She has made quite a name for herself in the adult industry, but always comes back to what she is most passionate about. BDSM is a huge part of who she is and she never wants to change that. We begin with her kneeling and elevated, made to lean back, and shackled. She is vulnerable and very aware of her circumstance. The Pope enters and starts his assault on her flesh with double floggers. Every possible inch is turned a bright red from the grueling punishment she has to endure. He begins with the front, moves to the back, and then revisits the front even more. Next a crop is introduced and her pussy is beaten hellishly with it before she is made to cum uncontrollably. Next she is restrained in a brutal steel device that has her in a doggy position. There is a lot of her body that is exposed , but his focus is on her sensitive soles. This is going to be the most brutal bastinado that she has ever had to endure. The intensity pushes her to a breaking point, but that just excites him, and he continues to brutalize her feet. Once he decides that she has had enough, he moves on to reward her by fucking her little pussy and vibe her into extreme orgasms. He goes between fucking her throat and pussy, and then back again. She is used like the good little whore that she is. Charlotte is now on her back with her legs up and spread, and held there with leather straps. The cane is his chosen tool as he revisits her feet for more punishment. Charlotte is not a fan of the cattle prod, but gets super turned on by it being an implement to threaten her with. Just the thought of it scares the fuck out of her, so The Pope makes sure to use it to his advantage. He toys with her a little more before he finishes her off with more orgasms.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    }
  ],
  "release_date": "2019-01-24",
  "scene_id": 43908,
  "tags": [
    "BDSM",
    "Bondage",
    "Cattle Prod",
    "Chains",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "Straight",
    "Submission",
    "The Pope"
  ],
  "title": "Charlotte Sartre Bound In Pipe And Chains"
}