{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "The submissive and obedient horny slut Layla Price is back to play in our dungeon for a true disrace. She’s immediately prepped for rope bondage and domination fun. She loves being slapped and spanked, gagged and fucked roughly, deep and hard down her throat and pussy. Red ball gag in her mouth, tight rope around Layla’s wrists and ankles, sat on the sybian fucking machine. It’s turned on and her Master widens her mouth for his massive dick. He makes her give him a deepthroat blowjob, pushing his meat in as far as it can go, bobbing and slapping her head on it. Layla begs for more as the vibration intensifies and spit pours out of her mouth and spread all over her face. He enjoys smacking her pussy, tits and face awake before shoving his cock in her mouth again. She can’t help gagging on his dick. He wants her to cum a few times before he widens her pussy. Turning the sybian on high usually does the trick. Next, Layla is placed on the floor, wrists and legs tied to the grounds, legs kept spread eagle. Her Master slaps her pussy and torments it with a vibrator, the last thing Price wants. Her cunt is trembling from what’s it’s been given. He has to cover her mouth from all the screaming and begging for mercy. Her pussy doesn’t need lube from the multiple orgasms, allowing the wand to glide all over her clit and pussy lips. It’s time for rough penetration! Her Master hovers over and dips his dick deep inside Layla’s pink hole. It’s still too much for her tight pussy to handle. Too bad! Her Master doesn’t care. He pounds her pussy in, ball gag in her mouth to muffle all the noise she’s making.",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Layla Price",
      "person_id": 48143
    }
  ],
  "release_date": "2018-10-18",
  "scene_id": 43910,
  "tags": [
    "Athletic",
    "Ball Gag",
    "big dick",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "Breast Bondage",
    "Deepthroat",
    "Dildo",
    "Domination",
    "dungeon",
    "Facefucking",
    "fake boobs",
    "Fingering",
    "Gag",
    "gloves",
    "Latinx",
    "master",
    "multiple orgasms",
    "PIV",
    "Redhead",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "slim",
    "Straight",
    "Sub",
    "Sybian",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Layla Price Begs for Sybian, Rope Bondage, Rough Sex & Deepthroat BJ"
}