{
  "collections": [
    "Strapon Squad"
  ],
  "description": "The last time we saw the trio Sheena Rose, Alexa Rydell and Mila Blaze, they just finished a lesbian domination threesome. Well, Sheena Rose hasn't left yet. She's still tied up in the dungeon, to the wall, only one leg touching the floor. We all know what's coming, possibly making Sheena have to hang, which sort of makes this scene a rope suspension. Yes, the rope bondage continues. Both Mistresses want to stuff her with more rubber cock. They aim their dicks at Sheena's pussy and pound in their dicks on a stick, making her take it raw and rough, shoving another down her throat, making her gag and cum over and over, our new type of double penetration. Like we guessed, she can't keep her other leg stiff on the floor from all the use, rubber cock propelled deeper into her holes. She's becoming a good little sub bondage sex slave, begging for more dick and apologizing for slutty deeds. Wondering if she's learned enough for a release? No! Mila and Alexa want to see how well Sheena's pussy can endure more rough pussy pounding after cumming so much. The BDSM fun moves off the wall, onto a crate. The double penetration continues. Both her holes are stuffed with the rubber dicks. The dicks on a stick are still in action, which means more rubber cocks stuffing poor Sheena. They start on her stomach, then flip her on her back, flog her back and breasts a bit. Sheena definitely learns a thing or two more from this scene. She apologizes over and over for being a slut. Good girl!",
  "directors": [],
  "models": [
    {
      "name": "Alexa Rydell",
      "person_id": 45452
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    },
    {
      "name": "Sheena Rose",
      "person_id": 52312
    }
  ],
  "release_date": "2018-10-18",
  "scene_id": 43916,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Femdom",
    "Gag",
    "gloves",
    "Lesbian",
    "LezDom",
    "Redhead",
    "Rope Bondage",
    "Slapping",
    "Slave",
    "Spit Roast",
    "Straight",
    "Sub",
    "Suspension",
    "Tattoo",
    "the wall",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration"
  ],
  "title": "Rope Suspension BDSM for Sheena Rose with Mila Blaze & Alexa Rydell"
}