{
  "collections": [
    "CFNMEU"
  ],
  "description": "Matej Borzik has come in to do some fitness training. He strips down to his underwear and does some stretching exercises to loosen his body. Then he picks up the dumbbells and starts to exercise. As he works a girl walks in and offers to train him. Matej is not sure but as they talk she persuades him, explaining that she likes to be dominant. With his agreement the girl starts to feel Matej's body, and licks a nipple. She turns him around and gives him some spanks on his ass. She pulls the underwear down a little to show his ass, and scratches her nails down his back. Then she has a little bite of Matej's ass as well, as he spanks it again. This time the spanking is harder and Matej rubs his ass. After biting the ass some more she turns Matej around, and exposes his cock. Before working on the dick she turns him and beats his ass with a jockstrap. She tells Matej to put the jockstrap on and slap his face, and then spanks his ass again. Turning him again she pulls the jockstrap dow to free Matej's cock which she takes in her mouth. She sucks on the cock a little and then turns him again, bending him over to show off his ass hole. The girl grabs and bites his ass as the hole it shown. She sucks a finger and rubs it over Matej's hole. Then the finger slips into his hole as Matej grabs his cock and pulls on it. The finger goes deep into his ass and fucks in and out as Matej plays with his cock. Then two fingers work their way into the ass hole. The girl moves Matej onto the training seat, legs up and continues to finger his hole as he wanks himself. His cock is hard and the girl sucks it for a while before returning to playing with his sexy hole. Next she moves Matej to the cross and shackles him too it, whipping his body and sucking his cock again. She then releases him and puts him on his knees so she can fuck his ass with her strapon. Matej moans as the rubber cock rams in and out of his ass. She sits on the bench and has Matej ride the rubber cock. His ass bounces up and down on the strapon as he keeps up with his moaning. Matej then lays down, legs up and takes the rubber cock deep into his ass again. Finally he is allowed to wank his stiff cock to a nice creamy cumshot. The girl then offers to take him to her house for more. When he agrees she lifts him onto her shoulder and walks off with him.",
  "directors": [],
  "models": [
    {
      "name": "Matej Borzik",
      "person_id": 61616
    },
    {
      "name": "Pomstychtiva Pritelkyne",
      "person_id": 61365
    }
  ],
  "release_date": "2018-10-19",
  "scene_id": 43914,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "blond",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Chains",
    "Dildo",
    "Femdom",
    "foreskin",
    "Jockstrap",
    "Leather",
    "Leather Cuffs",
    "Lift And Carry",
    "Male Sub",
    "masturbation",
    "natural boobs",
    "Pegging",
    "Slapping",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "the cross",
    "thirdparty",
    "Whipping",
    "white"
  ],
  "title": "Wild Beast"
}