{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "The submissive and obedient sex slave Montana Sky hasn’t left the dungeon yet. She’s actually all tied up for some more rope bondage and intense domination. She needs more training and disgrace. He makes her love being slapped and spanked, gagged and fucked roughly, deep and hard down her throat and pussy. Ball gag in her mouth, tight rope around her limps, pulling them in different directions. Her Master widens her mouth for his massive dick. He makes her give him a deepthroat blowjob, jamming his meat as far as it can go, bobbing and slapping her head down more. Montana begs for more as spit pours out of her mouth and is spread all over her face. He enjoys smacking her pussy, tits and face awake before shoving his cock in her pussy. He likes hearing her gag on his dick. There’s plenty of spit to shove his entire dick in Sky. He pounds her in rough, testing his slaves abilities to endure his fun. Next, Sky is placed on the floor, wrists and legs tied behind her back. Her cunt is trembling from what’s it’s been given. Her Master wants to cum and it’s her job to get it out of him. Time for another deepthroat blowjob. Her Master hovers over and dips his dick deep inside Montana’s mouth. It’s still too much for her to handle. Too bad. He continues fucking her skull. She continues to gag, spit and beg for more. He wants to give her a well deserved load from all that she’s taken. You need to see the facial Montana is left smiling with.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Montana Sky",
      "person_id": 61352
    }
  ],
  "release_date": "2018-10-25",
  "scene_id": 43925,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Chains",
    "Clothespins",
    "Deepthroat",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Facial",
    "Gag",
    "Latinx",
    "master",
    "natural boobs",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "the wall",
    "Partner Studio",
    "versatile",
    "white"
  ],
  "title": "Montana Sky Endures More Rope Bondage Slave Training with Deep Penetration"
}