{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Join Divine Goddess Cherry Torn in welcoming in the new year. Cherry has slave Marcelo to entertain her for the evening. This pathetic man worm salivates at the thought of being tormented by a gorgeous buxom babe like Cherry. And here he is, gagged, bound to a St. Andrew's Cross, and covered in clips and clamps. Cherry rakes her hands across her slave's body, flicking clips awry and causing him to twist in agony. The slave screams as Cherry begins removing the clamps one by one. Cherry takes extra delight in tugging the clover clamps on his balls and foreskin as her slave screams into the darkness. His screams make her laugh, and after she pulls all the clamps off, she strings him up by the ankles. He dangles in the air with an anal hook in his whore ass and a dildo gag positioned over his mouth. Cherry allows him to use this dildo to fuck her perfect pink pussy, but his pace is pathetic, so she holds him by the collar and uses it to bounce on that cock. Her lucky slave gets a front row seat to Cherry's orgasms. Too bad he all he can do is smell her glorious cunt as she rams his face. Next, Cherry fucks her slave with a long fat cock. She pounds his asshole as he whimpers like a pathetic little bitch. She soon switches out her cock for her fist. This loser's hole is so loose and stretched out, Cherry's hand slips right in. Her slave cries out behind his vet wrap hood as she fist-fucks him nice and deep. His sad sack slave body trembles as his ass gets pummeled by Cherry's diving fist. Once satiated, Cherry grabs a wooden 2x4 from her dungeon and smacks this slut until his ass is bright red. Laughing, she leaves him for the next Bitch to torment.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Marcelo",
      "person_id": 46090
    }
  ],
  "release_date": "2019-01-01",
  "scene_id": 43929,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Clover Clamps",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Femdom",
    "Fingering",
    "foreskin",
    "Gag",
    "Hood",
    "Humiliation",
    "Latin",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Tattoo",
    "white"
  ],
  "title": "A Divine New Years: Cherry Torn celebrates with slave's screams"
}