{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Brooklyn Blue is in trouble. Half an hour before she's supposed to turn up she sends me a text saying she's going to be late. She's just about to get on the train, from where she lives, which is two and a quarter hours away. Fucking princess. Outside it's the last day of summer. If she'd let us know two hours ago we could have gone down the beach and had a commiseratory swim. Now the tide's going out and before long it's just going to be mud down there. No point anymore. Usually we'd just have to grin and bear it. When you shoot a porno, at least when you shoot the kind of pornos we do, where you're trying to get the best out of the girl which means she's got to feel happy and horny and confident and safe, you need to keep her onside. But Andy's got other ideas. I've just worked with Brooklyn on a Television X series and she was a total whore, on-camera and off-camera, for all of the three-day production. Fucked 20 times, even did a scene for free because she was feeling so randy. There's not a lot gets in the way of Brooklyn Blue and cock. And he knows this. So when I get back from picking her up at the station lo and behold he's standing there with his camcorder pointed at us telling us the shoot starts now, no faffing, fuck you slut. Which I'm more than happy to run with and Brooklyn Blue doesn't really have much of a choice about. What follows is sexual mayhem. Alas, despite Andy's best efforts, she appears to thoroughly enjoy herself.",
  "directors": [],
  "models": [
    {
      "name": "Brooklyn Blue",
      "person_id": 61651
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2018-10-24",
  "scene_id": 43923,
  "tags": [
    "Athletic",
    "Bear",
    "big dick",
    "Big Tits",
    "black hair",
    "brunet",
    "Brunette",
    "Choking",
    "Curvy",
    "Domination",
    "Facefucking",
    "fake boobs",
    "foreskin",
    "Hair Pulling",
    "mixed",
    "Slapping",
    "Straight",
    "Sub",
    "thirdparty",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Brooklyn: Late To Shoot, Fucking Gets It"
}