{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "This opening scene is mostly exposition, this narrative builds the story of the Hardhat Master scenes to come in the following weeks. Fuckbuddy hardhats Owen Hawk and Jason Edwards are walking home from to their respective buildings from the subway. Jason Dean is taking photos of his on the block. Jason and Owen exchange a few friendly words before Owen continues on with Austin, who tells him that Jason has the hots for him. Owen shrugs it off, saying that twinkies like Dean are not his type. The hardhats separate at the entrance to Owen's building. Inside, a notice tells tenants that the cable is out. Owen trudges upstairs unhappily, tries the TV but gets no picture, opens the fridge and finds nothing to eat, curses, grabs his keys, leaves. Outside, he runs into Jason who invites him to watch the game across the street at his place, where he has satellite TV. Owen pauses, then accepts. Inside Jason's almost unbelievably froufrou apartment, Jason puts a sheet on the elegant living room couch and newspapers on the expensive coffee table so Owen can relax in his working clothes and put his boots up and make himself at home. He takes Owen's grungy sweatshirt to hang it in the hallway closet, inhaling its fragrance deeply first, then tells Owen to make himself at home while he runs out to get some beer, since there's none in the house. Owen takes a piss, and on his return to the living room, checks the apartment out and spots an open box with lots of stuff spilling out in the bedroom. It contains bondage equipment, bondage magazines (Bound & Gagged) and, startlingly, an envelope full of photos of Owen himself, taken on his building stoop the summer before. Owen replaces the photos in their envelope and the equipment in the box, but jams some leather strips into his pocket and takes the magazines and photos back to the living room. Owen is going through the magazines when he hears the door, and hides them and the envelope of photos under the newspapers on the coffee table. Jason brings Owen a beer and pulls up a Louis XV chair to watch the game, but can't take his eyes off Owen's boots. There is perceptible tension in the room and there has already been a perceptible shift in the relationship; Owen is in charge. He tells Jason to remove his jacket and tie and hang them up, which Jason does obediently. Jason sits again to watch the game but Owen teases him by crossing and recrossing his booted feet. Finally Owen breaks the silence. Jason doesn't have the slightest idea about football or any interest in it, does he? Jason admits that he doesn't, then, to cover his discomfort, asks if he can get Owen something. Owen says no, but there is something Jason can do for him: he can kiss his boots. Jason hesitates. Owen gets forceful; he orders Jason to crawl over and kiss them. Jason stops resisting; he gets on his hands and knees does it, hesitantly at first, but he quickly really gets into it. Owen tells him to lick them, which Jason does lovingly. Owen takes greater and greater control, calls Jason a boot whore, has him undo the laces with his teeth, then take the boot off, then stick his face in it. Dean obediently does what he's told. Then the other boot. At Owen's command, Jason puts the boots down and smells his socks, then licks Owen's socked foot. It is while Jason is licking and sucking Hawk's foot that the newspapers slip, revealing the hidden photos of Owen and the issues of Bound & Gagged.",
  "directors": [],
  "models": [
    {
      "name": "Austin Edwards",
      "person_id": 61646
    },
    {
      "name": "Jason Dean",
      "person_id": 61647
    },
    {
      "name": "Owen Hawk",
      "person_id": 61645
    }
  ],
  "release_date": "2018-10-23",
  "scene_id": 43920,
  "tags": [
    "Athletic",
    "Bondage",
    "Boot",
    "Boot Worship",
    "brunet",
    "domestic",
    "Domination",
    "Feet",
    "foot fetish",
    "Foot Worship",
    "foreskin",
    "Gay",
    "Leather",
    "Male Sub",
    "master",
    "shoe licking",
    "Slave",
    "Sniffing",
    "Submission",
    "thirdparty",
    "Twink",
    "white"
  ],
  "title": "Hardhat Master: When Worlds Collide"
}