{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Buxom blonde Ryan Keely receives a very special gift from dear friend Mona Wales. She rips open her present to find a very naked and hard Lance Hart awaiting her every order. Lance is eager for the opportunity to serve his new Mistress and is soon put to the test! Ryan squeezes his hard leaking cock and smothers him with her gorgeous tits. She takes him over her knee for an old fashioned spanking and makes him worship her beautiful feet. Lance takes as much of his Mistress' foot in his mouth as he can, lavishing extra attention on her toes. She instructs him on how to eat her pussy and smothers his face under her ass as she rides his tongue to orgasm. Next, Ryan fucks her new slave with a strap-on cock. Lance is a huge cockslut. He loves getting fucked by his Mistress' cock and takes every inch. He greedily sucks her cock clean after. But pleasure isn't the only thing on Ryan's agenda tonight. She flogs Lance and knees him in the balls repeatedly, savoring the sound of his suffering. She rides his cock before commanding him to fuck her just how she likes -- hard and fast! Lance pistons his hips as he struggles to plead his Mistress and to keep from cumming in her tight cunt. After using Lance to cum multiple times, Ryan jacks him off with her toes. Lance doesn't last long, he cums all over his Mistress' feet and then cleans his mess.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Ryan Keely",
      "person_id": 15370
    }
  ],
  "release_date": "2018-12-18",
  "scene_id": 43930,
  "tags": [
    "Athletic",
    "BDSM",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "CBT",
    "christmas",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Latin",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "switch",
    "versatile",
    "white"
  ],
  "title": "Holiday Tribute: Ryan Keely receives new toy Lance Hart"
}