{
  "collections": [
    "Bound Gods"
  ],
  "description": "Angel Duran is new stud here for his first time on Kink.com. The movie opens with Angel blindfolded on his knees with a bit-gag in his mouth. His arms are trapped inside of of a black latex bodysuit. Dominic Pacifico steps into the scene dressed in a black and blue, all latex uniform. He rubs his hand up and down Angel's slick latex bodysuit. He tells Angel to lick his hard cock through his latex pants. Angel licks his latex, sticking his tongue through the bit-gag to get to it. Dominic unbuttons his latex pants and pulls out his big hard uncut cock. He grabs his own balls tight in one hand and makes Angel lick them. Dominic unzips the ass fly in Angels suit and spreads his bare ass. Dominic takes out his crop and hits Angels ass repeatedly. Dominic takes the bit-gag from Angel's mouth and swaps it out for his fat cock and face fucks Angel's mouth until he's gagging and drooling all over himself. Next we find Angel completely naked, standing on a wooden platform with a spreader-bar between his legs and a metal stock trapping his neck to his hands. A spider-gag keeps his mouth open and the drool pouring out. Dominic comes up from behind and devours Angel's asshole with his tongue. Dominic grabs his leather flogger and hits Angel on his back and ass. In the final scene, Angel is tied up in rope bondage on his back with his legs spread. A rope is wrapped around his neck that goes to a pulley where Dominic can apply pressure. At first Dominic stretches Angel's hole with his latex covered hands, sticking his slick fingers inside and then shoves his cock deep in his ass and fucks him hard.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Angel Duran",
      "person_id": 61766
    }
  ],
  "release_date": "2018-12-06",
  "scene_id": 43938,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "crop",
    "domination",
    "drool",
    "gag",
    "gay",
    "humiliation",
    "latex",
    "leather",
    "Male Sub",
    "master",
    "Rimming",
    "rope bondage",
    "Rough Sex",
    "Stud",
    "submission",
    "uncut",
    "Uncut"
  ],
  "title": "Angel Duran Broken In and Stretched Out"
}