{
  "collections": [
    "TS Seduction"
  ],
  "description": "Boyfriend PUNISHMENT Part 2. After another long day at work TS Foxxy comes home to her loser slob boyfriend Mike Panic. Will this pathetic man boy ever learn how to respect a woman. He needs to be punished to learn a lesson. The stunning TS Foxxy in a tight body fitting latex outfit and divine purple hair, comes home to Mike Panic locked up and shackled naked in his cage. How long has he been trapped in there? Will Foxxy let her loser boyfriend, can he prove himself to her. She decides to let her pet out and see if he can service and please a woman. Starting with her perfect feet, Mike worships, licks and sucks her toes and arches. She uses her feet to give Mike’s cock a treat. But, she stops Mike right at the edge. Edging him gets his cock rock hard. With a riding crop, Foxxy punishes her man with corporal punishment. She raises up her dress and reveals her big round ass for him to lick. Mike starts rimming Foxxy’s perfect hole and she is now ready for more. Mike takes a deep throat cock sucking on her cock. He chokes on his mistresses perfect dick. Foxxy wants more, and she knows exactly what that is. Mike’s tight asshole. With her cock hard she shoves it in his ass and pounds the punishment into him. Mike takes it all and begs for more. His cock is rock hard and he can’t take anymore. He asks his mistress if he can shoot his hot load. Foxxy feeds it back to him before squirting herself!",
  "directors": [],
  "models": [
    {
      "name": "Mike Panic",
      "person_id": 41034
    },
    {
      "name": "TS Foxxy",
      "person_id": 20055
    }
  ],
  "release_date": "2019-01-08",
  "scene_id": 43932,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Cage",
    "Cock Worship",
    "Corporal Punishment",
    "Crop",
    "Edging",
    "fake boobs",
    "Feet",
    "Latex",
    "Latinx",
    "Male Sub",
    "Rimming",
    "Role Play",
    "shaped",
    "Squirting",
    "Straight",
    "Tattoo",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Boyfriend PUNISHMENT: TS Foxxy Pounds Loser Boyfriend Mike Panic's Ass"
}