{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Owen has Jason stand across the room and strip naked for him. He takes Jason’s belt, folds it over, slaps it against the palm of his hand. He sends Jason to get him a beer and on Jason’s return makes him bring it on all fours, set it on the coffee table, then go back to licking his socked foot. Jason tells Owen he’ll do anything to please him. Owen wonders aloud about that. At Owen’s command, Jason pulls off Owen’s sock with his teeth, then rubs it all over his face. Owen makes Jason push the coffee table aside, then come over to him, kneel and put his hands behind his back. He ties Jason’s hands with one of the leather strips he took from the box, and tells Jason to get free. Jason can’t. Owen begins undressing, makes Jason smell his briefs, slaps him, tells himself he has a little slaveboy if he wants one, only he’s not sure that he wants one. He pulls Jason’s face into his crotch, has Jason pull his jeans down with his teeth, then his briefs, but forbids him to touch his cock. He taunts Jason with his cock but never lets him lick or suck or even touch it. Jason feasts on Owen’s balls, ass and asscrack, nipples, then his armpits. Owen pushes Jason to his knees and tells him to beg for his cock, but Jason gets his face slapped for his pains and a refusal: he isn’t begging well enough. Jason lies on the couch and demands a tonguebath, from toe to top, everything, except his cock. He slaps Jason’s face away when it comes too close to that. When Owen reaches Jason’s face and licks his ears, Owen kisses Jason. Jason tells Owen fervently that he’ll do anything to give him pleasure. Owen leaves the room to return with rope and various other items from the bedroom box. Telling Jason he talks too much, Owen gags him. Owen hogties Jason on the coffee table. He sits at Jason’s head, lightly slapping Jason on the back with a black slapper and teasing his gagged mouth with his unattainable cock. Owen is uncut, and he pulls his foreskin up around Jason’s nose. He smacks Jason harder with the slapper, now on the soles of the feet, and on the ass. He buries Jason’s gagged face in his crotch, scratches Jason’s back with his fingers, leaving marks, he uses the slapper on it, and on Jason’s feet and ass. Owen asks Jason if he’s ready for his cock, demands he beg for it, even gagged. Eventually, he removes the gag and lets Jason suck and chew on his foreskin. Jason begs to be allowed to suck Owen’s cock but Owen says no and has him lick his balls, then suck a dildo. Owen’s cell phone rings.",
  "directors": [],
  "models": [
    {
      "name": "Jason Dean",
      "person_id": 61647
    },
    {
      "name": "Owen Hawk",
      "person_id": 61645
    }
  ],
  "release_date": "2018-10-30",
  "scene_id": 43934,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "Deepthroat",
    "Dildo",
    "Discipline",
    "domestic",
    "Feet",
    "foot fetish",
    "Foot Worship",
    "foreskin",
    "Gag",
    "Gay",
    "Leather",
    "Leather Belt",
    "master",
    "masturbation",
    "Paddle",
    "Rimming",
    "Rope Bondage",
    "Shrimping",
    "slapper",
    "Slapping",
    "Sniffing",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "top",
    "Twink",
    "Uncircumcised",
    "white"
  ],
  "title": "Hardhat Master: First Steps to Mastery and Slavery"
}