{
  "collections": [
    "Bound Gods"
  ],
  "description": "Buck Wright is eager to be back at KinkMen and suffering at the hands of muscular new House Dom Riley Mitchell. Restrained in leather bondage, Buck struggles on the floor of a dark dungeon as a leather clad Riley watches from the shadows. Riley approaches Buck, testing the crop on his gloved palm before smacking Buck from his feet to his chest. No inch of flesh is forgotten, especially not Buck's cock or his enticing bubble butt. Riley moves Buck to his knees so Buck can worship Riley's fat hard cock. Buck takes Riley's dick in all the way, gagging as he buries his face in Riley's crotch. Next, Buck is tied in rope on his feet, with a spreader bar between his ankles. Riley gives Buck cloverclamp wings along the back of his arms, stretching the skin taunt. He flogs Buck before shoving his cock into Buck's tight hot ass. Buck screams as Riley pounds his hole, each thrust made more overwhelming by the clamps biting into his arms. Finally, Buck wears a leather hood and is locked in a latex vaculock bed with his cock exposed. Riley runs the violet wand all over Buck's cock as Buck squirms beneath a sheet of latex. Buck shouts as Riley slips an end into Buck's uretha. Then Riley jerks Buck off and Buck blows his load all over himself. Riley gathers up his mess and shoves it all right back into his open greedy mouth, before jacking off in Buck's mouth.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Buck Wright",
      "person_id": 61329
    },
    {
      "name": "Riley Mitchell",
      "person_id": 61662
    }
  ],
  "release_date": "2018-11-29",
  "scene_id": 43937,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Feet",
    "Gay",
    "Hood",
    "Humiliation",
    "Latex",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Violet Wand"
  ],
  "title": "The Suffering of Buck Wright"
}