{
  "collections": [
    "Bound Gods"
  ],
  "description": "Cody Winter is back in the dungeon and eager to suffer. Heavy metal chains are padlocked shut around his body, keeping him standing and exposed to the devious plans of Sebastian Keys. Sebastian pinches and pulls at Cody’s sensitive nipples. He gives Cody’s foreskin a crown of closepins and crops Cody’s muscles, chest, and cock. Each minute of torment makes Cody’s cock grow harder. Next, Cody is suspended in rope while Sebastian pushes a fat metal electric plug into his ass. Cody has never taken electric toys in his ass before, and once the plug starts pulsing, he can’t get enough. He takes the maximum amount as his greedy hole clenches around the toy and his hips buck. Now that his ass is full, Sebastian calls out a house gimp to fuck his mouth. The gimp pulls Cody onto his cock, using the rope to move Cody up and down on his dick. Cody whimpers and moans from the sensations, helpless to do anything but gasp and choke around the cock in his mouth. Finally, Cody is gagged and tied with his legs spread on a spinning platform. Sebastian flogs and spanks his ass bright red and stretches Cody’s ass open on his gloved fingers. Then the gimp appears to give Cody a good hard fucking. Cody cries out around his gag as the gimp relentlessly pounds his asshole. Cody takes every inch of the gimp’s cock like the greedy slut he is. Once his hole is fucked open, Cody gets a hot load on his face before being made to cum all over himself.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cody Winter",
      "person_id": 59548
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2018-11-15",
  "scene_id": 43935,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Chains",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "foreskin",
    "Gag",
    "Gay",
    "Gimp",
    "Humiliation",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Pushed to the Max: Cody Winter takes it all"
}