{
  "collections": [
    "Men On Edge"
  ],
  "description": "Alex is a tall, lean, quiet guy, who is heavily focused on his rock hard cock. You can tie him up, spank him, tickle him, and gag him, and still, all he cares about is cumming. Tony Orlando and Sebastian Keys take aim at him and work his dick, bringing him to the edge, and at one moment, nearly going over the edge. We start by brining a visibly nervous Alex into the dungeon and tying him to a St Andrew's Cross. His cock is already leaking in his underwear as the ropes go around him and bind him. Tony starts teasing his dick through the fabric, and it's clear Alex is already desperate to cum. Precum pumps from his cock before it's even unleashed. When he's finally cut out of his underwear his cock is rock-fucking-hard. Tony jerks it and sucks it, while Alex is firmly bound to the cross. He brings in a jack-off toy and works his dick even more, bringing Alex to the edge before denying him his orgasm. Alex is a quiet guy, but his desperation is visible in his face and in his moans. He wants to cum so bad that at one point his dick spasms and a steady stream of cum pours from him. But he's got more cum in those balls, so Sebastian and Tony keep working him. They put him on his stomach, with his arms tied behind his back and a bar gag in his mouth, and jerk his dick from behind. He's completely immobilized when Sebastian shoves a dick-on-a-stick in his firm little ass. Alex moans out with desperation as his hole is worked deep and his cock is jerked. Finally they roll him onto his side, Tony deep throats his cock, then shoves it in a jerk off toy, working his dick faster and harder, until Alex can't hold back anymore. He blows his load inside the toy as if he was fucking a hot wet hole, then Sebastian pours it out onto him, and uses it to continue jerking his spent, sensitive cock. As a final punishment, Tony and Sebastian tickle the fuck out of Alex. He's still completely bound and cannot resist, he can only squirm, laugh and beg for them to stop.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alex Chandler",
      "person_id": 61663
    }
  ],
  "release_date": "2018-12-25",
  "scene_id": 43939,
  "tags": [
    "BDSM",
    "Bondage",
    "dungeon",
    "Edging",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "the cross",
    "Tickling"
  ],
  "title": "Shy Quiet Type, Alex Chandler Can Barely Hold His Load"
}