{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Mona Wales knows a man whore when she sees one and Papa Georgio is the biggest man whore around with access to her father's assets. Georgio doesn't stand a chance against Mona's wiles. Impressed by her boldness and eager to serve, Georgio agrees to help her rip off her father. But first Georgio must prove his loyalty and Mona puts him to the test to ensure he won't crack under pressure. She brings him to his knees and has him worship her stocking-clad legs. She takes him over her knee for a hard spanking before handcuffing him and cropping his cock. She kicks his cock and balls, and laughs as she notices his hard cock is leaking. Mona gags him, ties him up, flogs his chest, and sits on his face. Helplessly turned on, Georgio is so happy to have his body used by a sexy Goddess like Mona. He eagerly laps at her perfect cunt, swearing his fealty. Mona winds a trail of close-pins from his tongue down his chest to his cock. She ties up his cock and balls with twine and then fucks his brains out. She uses his whore cock to for her own pleasure, and cums all over him before allowing him to orgasm. He blows a fat load all over his chest right before Mona rips off the close-pins. Finally, Mona gives this slut what he wants, her hard lady strap-on cock. She milks his prostate with her fingers before fucking his whore ass and taking everything she wants from his body. Georgio trembles in agony and pleasure as Mona plunders his ass. She waterboards him with her squirt and makes him swear loyalty. Georgio swears to be hers and she seals the deal with a final kiss.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Papa Georgio",
      "person_id": 61743
    }
  ],
  "release_date": "2019-01-15",
  "scene_id": 43931,
  "tags": [
    "BDSM",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Spanking",
    "Straight"
  ],
  "title": "Mona Wales milks her daddy's new associate for assets"
}