{
  "collections": [
    "Bound Gods"
  ],
  "description": "New boy Cayden Stone arrives ready to serve the House under the hand of Arad Winwin. Cayden is new to kink and excited to see where his limits lay. As he strips under Arad's watchful eye, his cock grows hard between his legs. Arad commands him to worship his leather and Cayden gets to work, using his eager tongue to lick over Arad's tight leather chaps. Pleased with Cayden's enthusiasm, Arad breaks out a leather slapper to see how much this new meat can take. He hits Cayden's shoulders and his cute perky ass. Cayden moans as the slapper makes contact with his flesh and turns his skin a bright red. Cayden's enthusiasm to serve earns him the reward of sucking Arad's beautiful fat cock. Next, Cayden is tied upright. A blindfold obscures his vision as Arad paces around him, flogging his chest, stomach, back, and ass. Cayden cries out with each smack, his hard cock still aching for attention. Arad drops to his knees to tease Cayden's cock. He spits on it before swallowing it whole, working the shaft with his skilled mouth. Finally, Cayden is suspended in rope, completely helpless and at the mercy of his Master. He moans as Arad stretches open his asshole on his hard cock. Arad fucks Cayden mercilessly, using the rope to keep Cayden in place. After a hard fucking, Arad blows his load all over Cayden's face and makes him suck his cock clean. Then Cayden is commanded to cum on Arad's leather boots, clean up his mess, and worship Arad's gorgeous feet.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Arad Winwin",
      "person_id": 61417
    },
    {
      "name": "Cayden Stone",
      "person_id": 61661
    }
  ],
  "release_date": "2018-11-22",
  "scene_id": 43936,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Boot",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Flogging",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "slapper",
    "Slave",
    "Submission"
  ],
  "title": "Fresh Meat: Arad Winwin Trains New Slave"
}