{
  "collections": [
    "Families Tied"
  ],
  "description": "Bubbly and big-titted Penny Barber is determined to move up at her FBI job as an undercover agent. She has been working on one particular arms dealer Rob Piper, and is moving in for her last operation when Rob turns the tables on her. Claiming she is 5k short and that he is willing to cancel the deal, Rob gets Penny onto her knees and offering Rob anything he wants in exchange for the guns. Rob has been watching her round ass for months and knows exactly what he wants: Agent Barber with her jiggly red ass poised in the air for a hard flogging. Once her cunt has squirted multiple times and her ass is a bright pink from a heavy handed spanking, Penny gets on her knees and begs for Rob's HUGE cock in her mouth. Slobbering and gagging, Penny does the best she can with that massive dick and makes Rob very happy indeed. He throws her into handcuffs, pushes her head down and gives her the hard fucking she craves despite her protest that she is married. Railed hard and begging for Rob to cum in her, Penny is given a pass on the missing 5k and is sent on her merry way with her last arms pick up. It's too soon to celebrate for this hot MILF agent. She immediately receives a text notifying her that Rob has been playing her all along, and now has her step-daughter held hostage in a cheap motel. Penny rushed straight into the trap. Kendra is a gorgeous teen menace, tied in brutal backbend shibari and gagged with heavy metal clamps on her perky teen tits. She drools and scream around her gag as Rob offers Penny employment as his mole in the agency. Penny protests but caves once Rob starts fucking her darling daughter, making her squirt all over the floor. Swearing fidelity to Rob directly into Kendra's soaking wet cunt, Penny is made to lick and grovel until Kendra is ungagged and releases a torrent of cusses and back-talk like we have never seen. Penny has had enough of everyone playing her and telling her she sucks at her job. She cleverly offers Rob her daughter to use, and throws the little brat's mouth around his giant dick. Kendra is overwhelmed with cock, and screams in pain as Penny cruelly rips off her tit clamps and presses a vibrator down on Kendra's tender clit. Put in even tighter rope suspension Kendra takes every inch of Rob's hard cock and hollers with disbelief as she cums uncontrollably all over the floor in a fountain of squirt. The rest of the day is spent in a mother/daughter grudge match. Penny torments Kendra's tits with a flogger, smothering her dirty mouth with pussy and ass, and making sure she is milked of every last drop of teen squirt. Kendra eggs Rob on, insisting he cane Penny and fuck her in the ass. Penny's face during anal is a priceless silent scream of shock. Used up and fucked out, Kendra is made to lick Rob's cock straight out of Penny's ass and take a huge load on her face...which she then spits in her mother's face. Take that, bitch!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Kendra Spade",
      "person_id": 60694
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2018-11-09",
  "scene_id": 43947,
  "tags": [
    "big dick",
    "Black",
    "black hair",
    "Brunette",
    "Curvy",
    "Family Roleplay",
    "Flogging",
    "Gag",
    "MILF",
    "muscular",
    "natural boobs",
    "Pain",
    "shaved",
    "Smothering",
    "Spanking",
    "Straight",
    "Suspension",
    "Tattoo",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "MILF Agent Botches Undercover Anal & Sacrifices Step-Daughter"
}