{
  "collections": [
    "Men On Edge"
  ],
  "description": "KinkMen presents \"The Case with the Captive Feet\", Starring Sean Holmes & Dominic Pacifico. It's a hot day in the desert today and the muscle stud Dominic Pacifico is dragging around a heavy case back to his dark dungeon. No one in this town of sin suspects a thing of what could be in this sealed case of desire. Finally back at the dungeon Dominic slowly opens the case and reveals first timer Sean Holmes bound and struggling. This blonde surfer body straight stud is gagged and no one can hear his screams for escape. Dominic strips Sean down fully nude exposing his furry round ass and ties him up in fully restrictive rope bondage. This little slut is all ready for edging. Jerking and stroking Sean's big piece of meat, Dominic gets Sean closer and closer to the edge of cumming. Dominic takes that huge cock in his mouth for some deep throat cock sucking. Sean's balls are tugged to the ground while Dominic squeezes Sean's throbbing shaft. Sean screams to cum but is denied over and over again. His master will have his way with this little play toy today. Bound on a fuck bench with his ass in the air, Dominic continues to torment Sean's thick cock. Licking it from tip to asshole, Sean can't take anymore. Dominic switches his focus to Sean's perfectly exposed feet. Licking his sweaty soles, sucking on each toe. This get's Sean right up to the edge. Next Dominic sticks a vibrating ass plug in to stimulate and milk Sean's prostate. Finally this blonde stud's balls are fully engorged and ready to explode. Dominic makes Sean cum on his own feet, then licks it all up clean.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Sean Holmes",
      "person_id": 61664
    }
  ],
  "release_date": "2019-01-08",
  "scene_id": 43940,
  "tags": [
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "dungeon",
    "Edging",
    "Feet",
    "Gay",
    "Male Handler",
    "Male Sub",
    "master",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "Straight Stud",
    "Stud",
    "Tickling"
  ],
  "title": "Newcomer Straight Stud Sean Holmes Submits to Dominic Pacifico"
}