{
  "collections": [
    "Strapon Squad"
  ],
  "description": "Isa Mendez, one our favorite Strapon Squad sex slaves, is no stranger to the Fetish Network dungeon. She's been used, wrecked, tormented, fucked a few times, our inventory of sex toys and goodies all used on her. Every time she returns, we need to challenge her and intensify her training sessions. Let's see if Isa can endure another lesbian domination threesome. Mila Blaze knows Isa well, gaping her pussy on a few occasions during hardcore bondage scenes. She's brought along newbie Ava Kelly (one hungry deep throat cock sucker). They turn her into a kinky pet, an anal hook leash connected to her collar, fit snug into asshole. It's time for some BDSM fun. They push her onto the bed and spread her legs apart. They wake it up with a vibrator, making her moan and flinch. She begs to cum but is denied. Let's see how well she can hold her nut with Ava's huge strapon dildo up her cunt and her anal hook dangling around. Mila loves rough sex, pulling Isa onto her rubber black cock deep and hard. Ava shoves her strapon deep down Isa's throat, making her gag and scream for mercy. They make her apologize for being a dirty slut, continuing the double penetration, slapping her tits and spanking her ass. Her ass is almost as red as her lips tattoo. They pull her around on the bed, flip her back and forth on her back and stomach, legs pulled down by her head. The Mistresses enjoy wrecking her holes. They even brought a dick on a stick, a dildo attached to a handle for jack hammer pussy stretching. Isa is such a great sex slave, giving her Masters whatever they want, enjoying every minute of it.",
  "directors": [],
  "models": [
    {
      "name": "Ava Kelly",
      "person_id": 53978
    },
    {
      "name": "Isa Mendez",
      "person_id": 53665
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    }
  ],
  "release_date": "2018-11-01",
  "scene_id": 43945,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "black hair",
    "Blonde",
    "Bondage",
    "Chains",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "dungeon",
    "fake boobs",
    "Female Slave",
    "Femdom",
    "Fetish",
    "Fingering",
    "Gag",
    "Gaping",
    "gloves",
    "Hitachi",
    "Hood",
    "Kinky",
    "Latin",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Pain",
    "Rough Sex",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Sub",
    "Tag Team",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Anal Hook Double Penetration BDSM: Isa Mendez, Mila Blaze & Ava Kelly"
}