{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "When Sailor Luna volunteered to sell pies for charity, she had no idea she would stumble into her own gangbang! Her charity route takes her into a dungeon where five horny guys are awaiting their next gangbang appointment. Seeing Luna in her crop top and plaid school skirt, they immediately take her pies and feel her up. Luna is pushed to her knees and gets faced fucked by cock after cock. This cock hungry slut drools all over herself as she takes every hard inch of every cock into her mouth. It's not long before these guys decide to tie her up and stuff her from both ends. Once she's all tied up, all Luna can do is be their little fuck toy. The guys take turn fucking her pussy and mouth before she begs them to fuck her ass. They open her ass up nice and slow as she squirms from the fullness. Now that all her holes are stretched, the guys decide it's time to double stuff this slut! They fill her pussy and ass at the same time and Luna loves it. She's so overwhelmed with sensation she can barely keep a cock in her mouth as her cunt and ass get stretched open and fucked by two fat cocks. These guys decide they want their slut to focus, so they decide to stuff her from both ends. They take turns pounding her pretty pink pussy and using her pretty pink mouth. She sucks cocks, laps at their balls, and begs them to cum all over her pretty face. Her wish is their command and she gets cumsoaked by five fat loads!",
  "directors": [],
  "models": [
    {
      "name": "Dillon Cox",
      "person_id": 61545
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Jake Adams",
      "person_id": 60459
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Sailor Luna",
      "person_id": 60911
    }
  ],
  "release_date": "2018-12-26",
  "scene_id": 43954,
  "tags": [
    "Anal",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Double Penetration",
    "drool",
    "dungeon",
    "Gangbang",
    "Role Play",
    "Rough Sex",
    "Straight",
    "top"
  ],
  "title": "Cute Delivery Girl Gets Dp'd for the First Time by Horny Customers"
}