{
  "collections": [
    "Everything Butt"
  ],
  "description": "Dana DeArmond has two naked anal sluts held captive, each inside a clear acrylic cage. To the left is Ivy LeBelle, standing completely naked in a tall cage. To the right is Maddy O’Reilly, naked on her knees, trapped in a smaller cage. Their Mistress Dana DeArmond fingers her own asshole on a bed placed between the two, teasing them, knowing that they want nothing more than to taste her ass, and each other’s asses. When Dana leaves the room, Ivy escapes and lets Maddy out of her cage. The two hurry to the bed. Maddy gets to her knees and Ivy sinks her tongue into Maddy’s asshole. Maddy wants a taste and licks Ivy’s asshole like she’d been starved of it, then shoves an acrylic toy inside. She pops the toy in and out of Ivy’s ass and presses an Hitachi vibrator against her clit and Ivy has a huge orgasm. Maddy gets on her back and Ivy shoves a clear butt-plug inside of her and puts the vibrator on Maddy’s pussy. They switch places again and Maddy gets an even bigger clear toy and stretches Ivy’s ass out with it. Dana DeArmond comes back and is furious to find out that her two anal craving slaves are out of their cages and hooking up without her permission. She puts them over her knee and spanks their big round asses until they’re pink. In the next scene, Dana straps on a big dildo and fucks Maddy’s ass in doggie while Ivy lay on her back between Maddy’s legs, ready to get face-fucked for when the dildo comes out of Maddy’s asshole. Dana fucks her fast and deep and Maddy cums hard from the pounding. It’s Ivy’s turn to get fucked so Ivy gets on her back and spreads her legs wide. Dana fucks her ass well and Ivy has a shivering orgasm. Next, Dana flips Ivy over and slowly inserts a fat glass toy in her ass, creating a window for us to see deep down into her asshole. Maddy gets jealous of Ivy’s stretched ass and wants something big in her ass too so Dana gives her what she wants and shoves her fist all the way inside Maddy’s ass. And before the two get back in their cages, Dana washes their asses out with a water enema.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Ivy LeBelle",
      "person_id": 60683
    },
    {
      "name": "Maddy O'Reilly",
      "person_id": 41042
    }
  ],
  "release_date": "2018-12-14",
  "scene_id": 43959,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Tits",
    "black hair",
    "Brunette",
    "buttplug",
    "Cage",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Enema",
    "Fisting",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Rimming",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "switch",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Anal Craving Beauties"
}