{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Christmas is Goldie's favorite time of the year and tonight is Christmas Eve. Goldie tries to wait up for Santa but falls asleep waiting. Suddenly she is awakened by the entrance of men wearing Santa hats. Goldie's no fool, she knows these men aren't Santa but when they tell her they are Santa's helpers and come bearing gifts, Goldie decides to be on her best behavior. She gets on her knees as directed and tells all Santa's helpers to come and touch her. Their hands grab at her tits and smack them. They push her head down on their dicks and tell her to open her whore mouth. Looks like Christmas has come early! Goldie loves cock and eagerly swallows every inch of cock in front of her. Drool from her mouth down past her tits as Santa's helpers make her choke on their cocks. They tie her hands in front of her and fuck her tight little pussy. Goldie moans as their cocks penetrate her. She loves getting fucked roughly and used like a nasty little slut. Next, they move to the couch and shove their fingers into both her holes. Goldie squeals and soon squirts all over herself. They replace their fingers with their cocks and soon Goldie is getting fucked in her ass! She cries out as they take turns fucking her ass and before she knows it, she's double stuffed with a cock in her pussy and a cock in her ass! Santa's helpers fuck her every which way, filling her mouth and making this Christmas whore airtight. Goldie cums hard as they fuck her holes with their rock hard cocks. She begs them for their cum and is rewarded with five hot loads, one in her ass and the rest all over her cute little face. Santa's helpers finish delivering her presents and leave her tied up and covered in cum.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Dillon Cox",
      "person_id": 61545
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Goldie Glock",
      "person_id": 58292
    },
    {
      "name": "Jake Adams",
      "person_id": 60459
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-12-25",
  "scene_id": 43956,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "christmas",
    "Corporal Punishment",
    "Double Penetration",
    "drool",
    "foreskin",
    "Gangbang",
    "Latin",
    "mixed",
    "natural boobs",
    "other hair color",
    "Petite",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "toned",
    "top",
    "white"
  ],
  "title": "A Christmas Whore: Goldie Glock Stuffed Airtight on Christmas Eve"
}