{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Redhead real estate agent Penny Pax needs to make an important sale on this impossible to move property. She is desperate to get these five big men in here and make a deal today. Dressed in a casual dress with purple undies she uses her beautiful smile to entice these gentlemen, but she doesn't quite know what she has gotten herself into. The five men crowd around Penny, their unsuspecting beauty. Their hands upon her body, they roughly remove her cloths and grab her by the head to shove their huge cocks down her screaming throat. She gags and begs them to be gentle, but they tie her up and get even rougher with her tight holes. Her natural big bouncing tits are grabbed and her nipples are pulled hard. More cocks are shoved down her throat and she is made to jerk off the rest of them. Her gagging causes massive wetness in her tight pussy and the men jump on her. Tied up in full rope suspension in a ball tie position, the guys all take turns fucking her pussy and getting a deep blowjob. She is fully restrained and has to take every last pounding. After opening up her wet pussy the guys go for that tight asshole. A deep anal fucking gets Penny screaming out loud. The men keep going, and fill every one of her holes air tight. Ass, pussy, mouth and both hands are filled with huge hard cock. She screams with orgasm as she drenches the men with her pussy juice. The guys unload their huge loads all over her face and she begs for more. She drains every last one of them and is covered in thick cum.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-01-23",
  "scene_id": 43957,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Double Penetration",
    "foreskin",
    "Gangbang",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Redhead",
    "Role Play",
    "Rough Sex",
    "Straight",
    "Stud",
    "Suspension",
    "switch",
    "top",
    "white"
  ],
  "title": "Redhead Real Estate Agent Penny Pax Tied Up & Pounded by 5 Huge Cocks"
}