{
  "collections": [
    "Everything Butt"
  ],
  "description": "Chloe Cherry and Jane Wilde are just two adorably cute college freshman. They love to sneak off and experiment with each other. These two perky young tight bodies have no idea what to do with each other and usually just end up making out. They of course both want to remain a virgin. Lucky for them their sexy professor Norah Nova knows exactly how they can get what they want and still be virgins. ANAL. The girls minds are blown by this idea and can’t wait for their asses to be blown wide open as well. First Norah shows them her beautifully jeweled butt plug which they remove and start sucking on to taste Norah’s anal juices. The two girls then rim Norah and shove their long tongues up her asshole. The girls want to try this as well so Jane bends over with her ass in the air and gers rimmed by Chloe. Norah knows it’s time to take it up and brings out the metal toys. First is a metal anal hood which Jane’s hungry asshole eats right up. She never knew how much pleasure was waiting for her in that tight dark hole. Hungry for even more Jane’s asshole gapes for more toys and more attention, but it’s Chloe’s turn now. Chloe takes the same metal ass hook and this gets her screaming with orgasm after orgasm. Jane wants more and gets on her back, they bring out an even bigger ass toy but to help they also give Jane the hitachi. Her hungry asshole takes that metal rod, when she works the hitachi hard on her pussy. Norah wants to show Chloe what it looks like in Janes perfect ass. So she brings out a giant glass toy which gives everyone a perfect view of inside Jane. Norah wants to dive in even further and brings out the speculum and examines both girl’s tight gaping assholes. It’s time to lose that anal virginity, Norah puts on a huge cock strap on and fucks both girls til they scream. Chloe needs more and Norah knows this. The only thing left to take is her fist!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Jane Wilde",
      "person_id": 61147
    },
    {
      "name": "Norah Nova",
      "person_id": 57301
    }
  ],
  "release_date": "2018-11-30",
  "scene_id": 43958,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Ass Hook",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Hitachi",
    "Hood",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Petite",
    "shaved",
    "slim",
    "Speculum",
    "Straight",
    "Strap On",
    "toned",
    "white"
  ],
  "title": "College Girls Lose Their Anal Virginity to Experienced Woman"
}