{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Mega-babe Lily Lane is cock hungry and ready to prove what a good slut she is. As she stands with her head locked in a metal cage, she begs the gangbang boys to take a chance on her holes. They rip her dress off to reveal her big tits and rip her panties off to reveal her pretty pussy. Lily convinces them to let her out and she gets down on her knees, eager to get all their cocks in her mouth. She deep throats their cocks and uses her hands to jerk them off. They put her in metal stocks and continue using her pretty mouth. They put her in a leather straight jacket and pummel her pussy as she screams for more. Without her hands, all Lily can do is suck cock and take dick. These studs pound the fuck out of her pussy and put a pillow case over this bitch's head. Lily loves the rough treatment and begs them to use all her holes, so they each take turns fucking her ass. But this isn't enough for Lily. She wants all her hungry slutty holes filled at the same time. So they stuff her cunt and ass full of cock. This slut loves being double stuffed by big hard cocks. The boys rotate fucking Lily and fill her all her holes making her airtight. Finally, Lily gets down on her knees and begs for cum. She gets drenched in five hot big loads and lathers it all over her tits and pussy.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Apollo Knight",
      "person_id": 61564
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    },
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Mark Zane",
      "person_id": 55651
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2019-01-09",
  "scene_id": 43955,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Cage",
    "Corporal Punishment",
    "Double Penetration",
    "fake boobs",
    "Gangbang",
    "Latin",
    "Leather",
    "mixed",
    "muscular",
    "Role Play",
    "Rough Sex",
    "shaped",
    "shaved",
    "slim",
    "Stocks",
    "Straight",
    "Straitjacket",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Buxom slut Lily Lane takes all the cock and gets all the cum"
}