{
  "collections": [
    "Everything Butt"
  ],
  "description": "Sitting on a wooden box, wearing a black minidress, Jenna Sativa calls the beautiful and amazing anal queen, Casey Calvert over to her. Casey crawls on her hands and knees completely naked over to Jenna, wearing a leash and leather collar. Jenna tells Casey that she's here only for her own pleasure and to use Casey's body as she wishes. She tells Casey that she has a treat for her and shoves Casey's face into her big round ass. Jenna spanks Casey's ass and hands her a big dildo and tells her to put it in her ass and make her cum. Casey slides the toy into Jenna's juicy plump ass and Jenna presses an Hitachi against her pussy and cums hard. Jenna shoves Casey's head to the ground and grabs a big double-ended metal toy for Casey's ass. She pops the toy in and out of Casey's asshole and it gapes wide. Jenna then uses the other bigger end of the toy and stretches Casey's asshole even wider. After that, Jenna sits on Casey's face and fucks Casey's ass with a pink dildo while she rubs Casey's clit making her toes curl as she cums. She shoves another dildo into her ass, double stuffing it and makes Casey cum again. With Jenna's strap-on dildo, Casey's ass gets jack-hammered deep and hard. Next Jenna tells Casey to get on her back and spread her legs. She shoves a long clear wide glass toy called \"The Pillar\" into Casey's ass, creating a window to look through and see all the way into Casey's pink hole. Jenna shoves a big chrome ball into Casey's ass, and she pushes it out slow, and Jenna pops it back in. For the grande finale, Jenna shoves her whole fist into Casey's ass and she cums hard using a vibrator.",
  "directors": [],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Jenna Sativa",
      "person_id": 57072
    }
  ],
  "release_date": "2018-12-28",
  "scene_id": 43960,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Brunette",
    "buttplug",
    "Collar",
    "Dildo",
    "Dominatrix",
    "Double Anal",
    "Fisting",
    "Gaping",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Lesbian",
    "LezDom",
    "Straight",
    "Vibrator"
  ],
  "title": "Jenna's Anal Plaything"
}