{
  "collections": [
    "Everything Butt"
  ],
  "description": "It’s Abella Danger and Luna Star’s first Christmas together in their new place. Luna has decorated their house and to show her appreciation, Abella grabs Luna, pulls her close, and gives her a big kiss. She squeezes Luna’s perfectly round ass and slaps it through her denim short-shorts. She gets Luna naked from the waist down and bends her over and licks her asshole. She sticks her fingers in Luna’s hole and spanks her ass. Abella takes off her panties and they switch places. Abella bends over and Luna sticks her long tongue out and fucks Abella’s ass with it. Abella turns over, spreads her legs and Luna slides a clear glass plug inside her asshole. Abella plays with her own pussy while Luna licks the rim of her asshole with the toy still inside and Abella cums hard. They both fall asleep only to be awoken by Krampus the Christmas Demon played by Dana DeArmond. She makes them bend over and she beats both of their beautiful asses with her cane bundle. Krampus makes them lick her asshole and deep-throat her long strap-on dildo. She fucks Luna’s asshole first with her cold hard member. After that she fucks Abella’s ass with a long clear glass toy and makes her cum. Krampus gets a rainbow swirly cone and makes Luna Star sit on it. Luna rides the cone, bouncing while its buried deep in her ass. Next we peek into Abella’s asshole as Krampus tries to cram the clear glass pillar toy inside it. We take an even closer look inside as Krampus gets a metal speculum and slides it into Abella’s ass next and pries it wide open. Finally to show these two sluts who’s in charge, Krampus gets her ass in the air and makes Luna shove her fist inside. Luna is amazed as her entire fist gets swallowed up by Krampus’ asshole.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Abella Danger",
      "person_id": 56157
    },
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Luna Star",
      "person_id": 58678
    }
  ],
  "release_date": "2019-12-13",
  "scene_id": 43961,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "bottom",
    "Brunette",
    "buttplug",
    "christmas",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "Latinx",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "shaved",
    "Speculum",
    "Straight",
    "switch",
    "toned",
    "white"
  ],
  "title": "Krampus Night: Abella Danger and Luna Star Get Their Asses Punished"
}