{
  "collections": [
    "Bound Gods"
  ],
  "description": "With a leather mask covering his face and his hard cock jutting out from the leather chaps, Dallas Steele stands bound with rope. His muscular arms are outstretched, tied to the ceiling and his ankles tied to the floor. Michael Roman enters the scene in leather pants and a leather vest. He grabs Dallas by the cock and tells him who's in charge. Michael punches and slaps Dallas' chest and abs. Michael rips the leather mask from Dallas' face and kisses him hard. He gets to his knees and helps himself to Dallas' hard dick and sucks his cock while zapping him with an electric shocker. In the next scene, Dallas is bent over a wooden table with his hands bound out in front of him, a bit-gag between his teeth, and his ankles bound to the table legs. Now with an electric butt-plug inserted into his ass and electronic pads lining the backs of Dallas' upper thighs, Master Roman slowly twists the controller knob until the power is maxed out. Michael Roman flogs Dallas' back and ass while the electricity pulses through his ass and thighs. Michael removes the butt plug and replaces it with his big cock and fucks Dallas deep and hard. After that Michael ties Dallas with rope, face-first against the wall. Michael licks his ass and then plunges an anal hook into Dallas' hole. Michael Roman attaches rope to the end of the anal hook, pulls it through a pulley, and the other end is tied to a chair, using it as a weight to pull up on the hook in his ass. Michael crops his body and then jerks his cock, sending Dallas' cum flying. He takes Dallas down to pound his ass some more and blows his load all over Dallas' face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Michael Roman",
      "person_id": 61574
    },
    {
      "name": "Dallas Steele",
      "person_id": 61115
    }
  ],
  "release_date": "2018-12-20",
  "scene_id": 43968,
  "tags": [
    "Anal",
    "Ass Hook",
    "BDSM",
    "Blowjob",
    "Bondage",
    "buttplug",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Gag",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "Mask",
    "master",
    "muscular",
    "Pierced Nipples",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Tens Unit",
    "the wall",
    "Zapper"
  ],
  "title": "Serve Your Master: Michael Roman Shows Dallas Steele Who's In Charge"
}