{
  "collections": [
    "Everything Butt"
  ],
  "description": "Skylar Snow sits at the head of her classroom, wearing a short skirt and a low-cut top. Skylar studies for an exam while her mischievous classmate Penny Pax sits behind her, kicking her chair. When Skylar finally turns to her to tell her to stop, Penny tells Skylar that she's already fucked their teacher and has gotten all of the answers to the test. She explains to Skylar that if she licks her asshole, she'll share the answers with her. Skylar agrees and Penny hops on top of Skylar's desk and shoves her ass in Skylar's face. Skylar licks and fucks Penny's asshole with her long tongue, darting it in and out as Penny keeps her ass spread. Skylar gets one knee up on to her own desk and sticks out her ass. Penny pulls up Skylar's skirt and pulls down her panties. She spreads Skylar's big beautiful ass cheeks and fills her hole with a clear acrylic toy. She pops it in and out of her ass making it gape. Next, Penny straps on a huge dildo and fucks Skylar's ass with the biggest thing thats ever been inside her ass. Penny gives her permission to play with her own pussy and Skylar cums hard on Penny's big fat dildo while she gets fucked. After that, Penny tells Skylar to get on her back and spread her legs. Penny shoves a big purple butt-plug into Skylar's ass and gets big gapes. Skylar is handed a vibrator and presses it hard against her clit and squirts everywhere with the purple plug still buried deep in her ass. Then Penny places a big black, cone shaped butt-plug on a padded platform and Skylar sits on it and twerks, trying to get as much of it into her ass as possible. They swap out the cone shaped plug for a bigger rainbow colored unicorn horn toy. Skylar challenges her ass again and tries hard to get as much of it into her hole. In the final scene, Penny stretches Skylar out even more with a speculum and at the end of it all makes her clean herself out with a water enema.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2019-01-11",
  "scene_id": 43962,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Enema",
    "Gaping",
    "Lesbian",
    "LezDom",
    "shaped",
    "Speculum",
    "Straight",
    "Teacher",
    "top",
    "Vibrator"
  ],
  "title": "A.P. Anal Studies"
}