{
  "collections": [
    "Families Tied"
  ],
  "description": "Ramon Nomar is behind in the polls and looking for a win on the upcoming election, but his teen brat step-daughter Mandy isn't making it easy for him. Caught for shoplifting and an avid social media whore, Mandy might cost him the conservative vote. Luckily his right hand advisor and MILF lover Alana Cruise promises to tame Mandy and end the nude tweeting for good. Mandy's millennial will power makes Alana's admonishments fall flat and she panics, resorting to handcuffs, an electro wand, and a good old fashioned over the knee spanking. Mandy's thick round ass is mesmerizing, and Alana soon loses track of what she is doing and sticks a big metal toy in that naughty asshole instead. Mandy moans and bounces her freshly spanked booty up and down on the toy with her hands cuffed behind her back. When Ramon comes home to find them in a lesbian anal scene he loses it completely, flogging and zapping both women and bemoaning the threat to his career. If Mandy needs to be a fucking slut, she is going to do it at home out of the public eye. Ramon unzips his pants and stuffs his hard cock down her throat while she rides the metal dildo deep in her ass. Cumming with spit all over her face and her step-father's dick in her throat, Mandy starts to see the virtue in the private sphere. Ramon ties both women up in tight shibari, and stuffs a metal hook in Mandy's hungry ass. He takes his time fucking that hot teen pussy while he shocks blindfolded Alana and crops Mandy's\njuicy behind. Pushing her slutty mouth against Alana's clit, Ramon demands that she lick and\nkiss Alana's cunt like a good girl while he rails her doggy style. Alana is allowed to ride that\nwhore teen tongue until she is called the floor for ATM duty, sucking Ramons cock clean every time he pulls it out of Mandy's ass. Alana is soon to get her own sexual punishment in a bondage pile driver position, getting fucked like a sex doll while Ramon buries his face in Mandy's delicious cunt. Alana begs and begs to cum, but Ramon makes her wait until both women's asses are beaten to his liking, then allows her to orgasm all over his cock while Mandy obediently licks her pussy. Mandy is made to ride his dick and bounce her ass around while Alana spanks her and spits in her face. Ramon gets so turned on he flips them both over and sticks his cock in Mandy's tight asshole, fucking her raw until he shoots a thick hot load all over both of their pretty faces.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Alana Cruise",
      "person_id": 60194
    },
    {
      "name": "Mandy Muse",
      "person_id": 54180
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2018-12-07",
  "scene_id": 43964,
  "tags": [
    "Anal",
    "Bondage",
    "Curvy",
    "Dildo",
    "Family Roleplay",
    "Flogging",
    "Lesbian",
    "MILF",
    "Public",
    "Spanking",
    "Straight",
    "Zapper"
  ],
  "title": "Politician's Curvy Slut Step-Daughter Anally Reprimanded"
}