{
  "collections": [
    "Bound Gods"
  ],
  "description": "Casey Everett returns to KinkMen for the full dom treatment from Sebastian Keys. Casey has some idea of what he's in for, but he doesn't know for certain until he's gagged and bound to a St Andrew's cross with his arms above his head, fully exposed. Sebastian steps in and wastes no time tenderizing his hungry, willing subject. Casey literally ripples with flexing muscle as Sebastian crops him, smacks him, torments his nipples, flogs him, and demands total obedience in a cool, steady voice. Sebastian knows you don't have to yell at a sub or degrade him to get what you want, particularly someone like Casey. With Casey it's all about confidence and control, which he responds to perfectly. Looking into Sebastian's eyes like a desperate puppy, he's eager to please and receive his due punishment. Sebastian flips Casey around and tears him out of his underwear, exposing his perfect muscle ass. He teases his hole with a gloved finger, feeling how hot and eager that ass is. But Casey doesn't get the fulfillment of being fucked just yet. Sebastian pushes an electrified butt plug in that hole and cranks up the power. Casey twists and moans in his bondage, tickled and tormented by the current. At the same time, Sebastian resumes flogging him, tenderizing his solid ass and muscled back. He turns Casey around, facing front, and toys with his stiffening cock. Sebastian switches back and forth between administering pain and rewarding Casey with pleasure, and the look in Casey's eyes betrays his excitement and thrill. Casey is then put in a full suspension, blindfolded, arms behind his back, and bent over with his ass out. Sebastian peels his gloves off and begins swatting his sub with them. His legs, his ass, his back, everything exposed part of him. Casey also has electrified tens units strapped to his right foot, while Sebastian tickles the left, so he has electricity zapping him on one side, and relentless tickling on the other. Sebastian whips his hard cock out and shoves it in Casey's mouth, ordering his sub to suck it good before it goes deep into his ass. Finally, when Sebastian's ready to fuck that sweet hole, he pulls Casey to him and pounds it in. Casey's still blindfolded and fully suspended, utterly controlled by Sebastian and his solid cock. He fucks him hard and deep, with stunned ecstasy clearly audible in every one of Casey's hefty grunts. Lastly, Casey is fitted with a spider gag, covered in clamps, and is made to jerk himself off and cum while Sebastian crops and his sensitive cock. He then puts Casey on his knees, slides his dick into he mouth thru the spider gag, then shoots his hot load straight into that wide open throat.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Casey Everett",
      "person_id": 60450
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2019-01-10",
  "scene_id": 43967,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "brunet",
    "buttplug",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Electro Plug",
    "Flogging",
    "Foot Torment",
    "Gag",
    "Gay",
    "gloves",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Muscle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "spider gag",
    "Straight",
    "Sub",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "Tens Unit",
    "Tickling",
    "versatile",
    "white"
  ],
  "title": "A Hard Place: Casey Everett Tormented And Fucked In Full Suspension"
}