{
  "collections": [
    "Bound Gods"
  ],
  "description": "Clad in leather from head to toe, Jack Dixon awaits the arrival of his boy William Crown. William enters and drops to his knees, crawling toward his Daddy, only to be kicked and sent sprawling by Daddy's heavy leather motorcycle boots. Jack commands him to strip and then has him worship his leather boots and pants. William sniffs Daddy's leather and licks Daddy's boots all over. He pushes his face into Daddy's crotch, nuzzling his hard cock through the leather, as Daddy exposes his metal chastity device and crops his ass. Each smack makes William cry out, happy for attention and the honor of worshipping Daddy's leather. Jack pushes a gloved finger into William's ass to see how tight his boy is today. Since William is pretty tight, Jack decides he needs some warm up. William is suspended in rope, leaving his ass exposed to Jack's leather flogger and his mouth at the right height to suck Jack's big fat pierced cock. Jack's cock is so big, William can barely get his mouth around it. His lips stretched wide around Daddy's dick, William struggles to take all of it. Maybe his ass will have better luck. But first, Jack flogs William's ass and puts him in a leather cage with his hands tied. Jack lets him out of chastity and teases his cock to hardness before attaching a long close-pin zipper around his body. William moans as each close-pin goes on. Jack close-pins his balls before sucking on William's cock. Finally, he jacks his boy off with his leather gloved hands and makes him clean off his leather. Now it's Daddy's turn. Jack pummels William's asshole before blowing his load all over William's body.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jack Dixon",
      "person_id": 61576
    },
    {
      "name": "William Crown",
      "person_id": 61780
    }
  ],
  "release_date": "2018-12-13",
  "scene_id": 43969,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Boot",
    "Cage",
    "Chastity Play",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "gloves",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "other hair color",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Tattoo",
    "white",
    "Zipper"
  ],
  "title": "My Daddy Wears Leather: William Crown worships Jack Dixon's Leather"
}