{
  "collections": [
    "Bound Gods"
  ],
  "description": "Blake Hunter's a big, thick stack of muscle who likes to get his ass played with. Good thing hugely ripped Arad Winwin's around to give him a complete work over. Blake starts completely tied up, seated, and blindfolded, with his hard dick out. So every sensation is felt and not seen. Arad starts by cropping him, jerking his hard dick and kissing him. He then hangs a mess of lead weights to his balls, pulling them down to add a bit of pain and get his dick extra hard. Arad sucks that hard cock as he puts more and more weight on Blake's balls, and crops him even more before offering his any sort of relief. Blake is then chained up and bound with his arms above his head. He's largely immobile, a slave to Arad's whims. Arad unleashes his rock hard cock and shoves it in Blake's hungry mouth. He slaps him, spits on him, spanks him and flogs him, front and back. Blake's pale skin gets read quickly. His ass, his back, his legs and stomach. Arad beats him all around, before lowering him to the floor so he can get at his slutty hole. Arad slams his cock into Blake's ass and fucks him hard from behind. His solid muscle cock hits Blake just right, as Blake cums uncontrollably, without touching his cock at all. Arad notices that his slave came without permission, so he puts Blake on his back and works his fingers and his fist into his ass, opening him right up. Ultimately, using this big stack of muscle brings Arad to the edge, so he shoots his hot cumload all over Blake's face and gagged, open mouth.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Arad Winwin",
      "person_id": 61417
    },
    {
      "name": "Blake Hunter",
      "person_id": 61421
    }
  ],
  "release_date": "2019-01-03",
  "scene_id": 43971,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "body builder",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fisting",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "mixed",
    "Muscle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Stud",
    "Submission",
    "Weights",
    "white"
  ],
  "title": "Heavy Handed: Arad Winwin Flogs, Fucks and Fists Blake Hunter"
}