{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Charlotte is a sexy goth girl with lots of tattoos, and we love her for that. She also has an amazing ass to go along with the rest of her sexy body. We have her start with a bondage masturbation tease session. She writhes around with a big gag in her mouth that makes her drool, as she hangs from a rope from the ceiling and pleasures herself. Once her pussy is dripping down her leg, we jump right into the fucking. Charlotte is a badass when it comes to bondage, so we don't go easy on her by any means. She is tied in a sitting position with her arms pulled high above her head. The crystal palace is placed between her legs, the dildo finds its home inside of her tight wet pussy, and then we start fucking her. She moans a groans as the machine slides in and out of her pussy and orgasms pour out of her like water from a spigot. Next Charlotte is in a hogtie suspension and we see how much fucking this little slut can take. We start off slow because it's quite the feat to machine fuck someone in a suspension. We ramp the speed up, and then decide to fuck her ass just to up the ante a little more. She cums over and over again, and dare we same harder when her ass was getting pounded. A vibe is added to the mix as Charlotte is slow fucked in her ass, and the orgasms just keep coming. The day is drawing to an end and we give Charlotte a break and let her have a free-for-all. She delivers more than we thought, but also expected nothing less form this sex kitten. The machine gets up to mega speed and Charlotte needs that final push to get her to the best orgasm of the day, so she chokes herself and the gates open right up. She starts to cum, and then can't stop until the machine is finally slowed down. She finishes the day by tasting all of her juices off of the dildo. What a good slut!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    }
  ],
  "release_date": "2019-01-30",
  "scene_id": 43973,
  "tags": [
    "Bondage",
    "Dildo",
    "drool",
    "Gag",
    "Machine Dildo",
    "masturbation",
    "Straight",
    "Suspension",
    "Vaginal Penetration"
  ],
  "title": "Sexy Goth Slut Charlotte Sartre Gets Machine Fucked In Bondage"
}