{
  "collections": [
    "Bound Gods"
  ],
  "description": "HOLIDAY HORROR Part II: It’s been five full years since straight stud Kip Johnson believed he was abducted, terrorized and EDGED by perverted aliens on Christmas eve. Those “aliens” really traumatized him and he has never been able to celebrate the holidays since. His good friend Pierce Paris just wants his buddy to go out with him to a party this year. Kip has flaked on him for years! Finally Kip reveals to his muscular friend Pierce what happened to him and Pierce decides to help him out with some psychology. While under Kip unfortunately is bound and terrorized to relive his Holiday Horror alien abduction. Fully nude and bound in red rope to a medical chair in a creepy Christmas lair, an alien in latex creeps around and has his way with Kip. His gloved hands slide down Kip’s mouth while the other hand slaps and punches Kip’s rock hard monster cock. Kip screams for the alien to stop tormenting him, but it is just the beginning. The alien leans Kip over and reveals a giant phallus and rams it down Kip’s mouth. Kip is made to deep throat cock suck the aliens huge dick. The alien ties Kip up and begins to flog Kip’s muscular body. His ass turns red as the alien beats his chest with the flogger. Next up is an electric stim paddle. Kip begs for it to stop as his ass is beaten and electrified. The alien reveals himself to kip in the form of Pierce’s perfect muscular god body. With an evil grin Pierce takes Kip’s ass and fucks it deep with an anal pounding. Pierce rips clamps off Kip’s chest before shoving his cock down Kip’s mouth one last time. A huge stream of alien cum drenches Kip’s face. HOLIDAY HORROR Part I can be found on Kink’s Men On Edge channel.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Kip Johnson",
      "person_id": 51603
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2018-12-27",
  "scene_id": 43970,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "christmas",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Gay",
    "holidays",
    "Humiliation",
    "Latex",
    "Male Sub",
    "master",
    "muscular",
    "Paddle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Straight Stud",
    "Stud",
    "Submission",
    "switch",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Straight Stud Bound & Terrorized to Relive HOLIDAY HORROR Abduction"
}