{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Bored with her marriage to Fred, Dolly (Cherry Torn) lures one of her husband's employees, Mike Panic, to her home. Poor innocent Mike arrives ready to help a lonely wife with her broken internet connection, but he soon learns she has ulterior motives. Dolly compliments Mike's good hands and asks for a massage. Mike is nervous because he's never been with a woman before. Not wanting to anger her, he obeys. Soon he is worshipping her feet and kissing her legs. She demands he strip naked, but Mike is shy. Still, he finds himself agreeing to everything she commands. Mike returns the next day to fold Dolly's laundry naked while she flogs him. He knows now that he was born to obey, born to do what strong women tell him to do. He gets down on all fours so Dolly can flog his bare ass. He begs her to hurt him. A few hard slaps to the face and Dolly knows Mike is a sweet young man. And so she flogs him until his ass cheeks glow red. He moans as he's slapped. Dolly sits on his face and rubs her pussy all over him, warning him not ignore her asshole. She grinds on his face until she cums. Mike returns that night, sneaking into a bedroom Dolly has designed especially for him. He knows now that this will be his room. This will be his world. She mounts him, feeling his cock slide into her pussy. Dolly grinds on him, using him for her own pleasure until she cums. Then she binds him tightly to the bed on his back, wrists cuffed to his ankles. His ass is exposed to her, and she fucks him hard with her strap-on cock. She buries her cock deep in his ass. It's a gift Mike will learn to appreciate. Again and again.",
  "directors": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2019-03-12",
  "scene_id": 43972,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Foot Worship",
    "Gag",
    "High Heels",
    "Humiliation",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Role Play",
    "Rough Sex",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On"
  ],
  "title": "Secret Lover: Cherry Torn Ensnares Mike Panic"
}