{
  "collections": [
    "Men On Edge"
  ],
  "description": "Kip Johnson is a pig at heart, and loves to be tied up, dominated and edged. He hasn't shot with KinkMen for a while, but now he's back, ready to let Sebastian Keys and Tony Orlando go to town on his thick hard cock. They tie him up, blindfold him, gag him, wrap him in a straightjacket, face fuck him and even machine fuck him, all while edging him repeatedly. We start with Kip tied up, blindfolded with a ball gag in his mouth and his hands behind his back. He's completely vulnerable when Sebastian and Tony move in on him. They cut him out of his underwear and Tony hungrily sucks his thick cock. He then slides vibrating bullet cock-sleeve onto that dick. They clamp his balls as Tony continues to suck him, bringing him to the edge and then retreating. Kip is then put on the floor in a reclining position, stuck in a straightjacket and plugged up with a fucking machine super deep in his ass. The machine persistently fucks him as Tony toys with Kips cock, sucking it and sliding it into a jack off toy. Tony gets up and feeds Kip his own hard dick, face fucking him while Sebastian strokes his cock. Kip finally cums with the fucking machine drilling his hole and Tony jerking him off. But as a final humiliation, Tony sticks his cum-splattered feet into Kip's mouth and makes him slurp it off. Welcome back to KinkMen, Kip!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Kip Johnson",
      "person_id": 51603
    }
  ],
  "release_date": "2019-02-05",
  "scene_id": 43975,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blindfold",
    "Bondage",
    "brunet",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Humiliation",
    "Machine Dildo",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "switch",
    "Tickling",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Back For More: Kip Johnson Returns For Aggressive Cockhandling"
}