{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Charlotte Sartre is going to win your heart after you watch this match. She weighs about 105 pounds when she is soaking wet and yet she is willing to take on an experienced, powerful, muscular god like Lance Hart. Lance starts out going easy on this little girl. It appears he’s trying to be nice and lets her get some pins or holds but as the match goes one we learn, he’s just being a really big asshole and by letting her THINK she’s actually good. For Lance, this is just foreplay. He’s like a cat playing with his mouse before the real attack starts. And when the attack starts, it is relentless. Lance pins this goth girl down, steals kisses from her, penetrates her and chokes her. After 3 hard fought rounds, Lance is the winner and this is the prize you’ve all been wishing for. Before launching, we put out a survey and asked you fine folks what kind of stuff you want to see in the prize round. Several of you wished to see creampie with impregnation. Well, Lance is a mind reader because that is exactly what he wanted too. After putting his toy into submission after submission, he tells his victim exactly what he’s going to do to her. He’s going to choke her, he’s going to fuck her, and after he’s had his fun, he is going to cum inside her and leave his seed in her so that he owns her and the baby he is going to put into her. Charlotte must worship his feet, licking the soles and sucking his toes. She is fucked good and hard until her eyes roll back in ecstasy. Once she is aroused enough, Lance knows she will be in the perfect condition for breeding. He fucks her good and hard and cums deep inside of her. Then he lifts her up and carries her and his baby off the mat.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    }
  ],
  "release_date": "2018-11-15",
  "scene_id": 43984,
  "tags": [
    "Athletic",
    "black hair",
    "bottom",
    "brunet",
    "Couple",
    "Creampie",
    "Facesitting",
    "Feet",
    "Foot Worship",
    "Humiliation",
    "Muscle",
    "Muscle Worship",
    "muscular",
    "natural boobs",
    "shaved",
    "Smothering",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "versatile",
    "Weights",
    "white",
    "Wrestling"
  ],
  "title": "Muscular God Destroys Tiny Goth Female then Puts his Seed in her"
}