{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Jason's hands are tied to a chinning bar in the kitchen doorway. He is plug-gagged, collared, and wears chain-connected clover clamps. His cock and balls are tied with rope which descends to the spreader bar holding his ankles apart. Owen and Austin observe and discuss him. \"The more he suffers, the better he looks,\" Owen says, then reminds Jason that he now belongs to him. He slaps Jason around a little, flutters the chain on the clamps. Austin eats Jason's armpits. Owen smacks his butt, then suggests they take him into the bedroom, tie him on the bed and see what other toys he has to play with. He removes the clamps and painfully massages Jason's nipples.\nThe bedroom. Jason is spreadeagled on the bed, collared, tape-gagged. Owen lies on him, kissing and licking his tape gag and slapping his face. He teases Jason with his genitals, and ass, which remain inaccessible to Jason's gagged mouth, and taunts Jason with the fact that he can't have them. Austin finds two packs of clothespins in the box and throws them on the bed. He and Owen apply the pins on Jason's chest, inner thighs and balls. Owen tells Austin to suck Jason's now soft dick. Jason's dick stiffens as Austin sucks it and plays with the pins around his balls. Owen is about to remove the pins but Austin tells him to wait; he's found a box of candles and lights two, one for Owen and one for himself. They drip wax on Jason's chest. Jason writhes and moans through his gag. Austin drips wax on Jason's cock and balls. They remove the clothespins, painfully. Owen kisses Jason's gagged mouth. \"Not bad,\" he says, \"that must have hurt,\" and stares deep into Dean's eyes as Austin stares at both of them.",
  "directors": [],
  "models": [
    {
      "name": "Austin Edwards",
      "person_id": 61646
    },
    {
      "name": "Jason Dean",
      "person_id": 61647
    },
    {
      "name": "Owen Hawk",
      "person_id": 61645
    }
  ],
  "release_date": "2018-11-13",
  "scene_id": 43988,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "CBT",
    "Clothespins",
    "Clover Clamps",
    "Cock Worship",
    "Collar",
    "domestic",
    "Domination",
    "foreskin",
    "Gag",
    "Gay",
    "Hot Wax",
    "Male Handler",
    "Male Sub",
    "master",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "Slapping",
    "Slave",
    "Sniffing",
    "Tag Team",
    "thirdparty",
    "Threesome",
    "Twink",
    "Uncircumcised",
    "white",
    "Zipper"
  ],
  "title": "Hardhat Master: Punishment"
}