{
  "collections": [
    "Evolved Fights"
  ],
  "description": "This match up is incredible power exchange between two skilled wrestlers. Cheyenne Jewel has been on the wrestling scene for a long time. She is known for her Farm girl strength and knowlegde in the submission game. Max Blunts is a legit wrestler. He was on the wrestling team in school. He’s not impressed with female wrestlers at all. There were girls on the wrestling team at his school but they weren’t very good. The guys on the team use to play along to be polite to the women and let the girls, get a false sense of equality, but deep down he knew all he and the guys were always going easy on the girls to make them feel like they were part of the team. Today, Max is in for a rude awakening. He’s going up against one of Evolved Fights’ toughest Girls. Cheyenne Jewel is giving up a lot of weight against her male opponent. At first the brut strength of the male surprises Cheyenne. She is thrown around like a rag doll and even made to submit at times. She is pinned down and molested by this stud. Max even gets to sit on poor Cheyenne’s face and humiliate her with tea bagging, nuts in the face. When it seems like its over for the small female, something happens and the tables start to turn. Cheyenne is able to face ride her opponent. She leg scissor submits him over and over. The big strong man seems to have gassed himself out. He has a good lead however. Is Cheyenne’s endurance enough to win the final rounds? This is a close call. The winner makes the loser worship them. Loser is face fucks and made to lick asshole. Loser is fucked in the asshole just like a loser should be.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Max Blunts",
      "person_id": 61724
    }
  ],
  "release_date": "2018-11-16",
  "scene_id": 43994,
  "tags": [
    "Anal Fingering",
    "Brunette",
    "Humiliation",
    "mixed",
    "Muscle",
    "Muscle Worship",
    "muscular",
    "natural boobs",
    "Pegging",
    "shaved",
    "Smothering",
    "Straight",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "Partner Studio",
    "white",
    "Wrestling"
  ],
  "title": "Female Clobbers her Boyfriend in Competitive Mixed Wrestling"
}