{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "My throat still hurts. I’ve never deep throat-ed so much in my life. His dick was so big. I didn’t even touch it. He left me tied to his sybian fucking machine for awhile, my wrists tied together behind my back, my breasts bound by more tight rope. I didn’t know what the machine was until he turned it on. I couldn’t release myself. I tried so much, but the rope wouldn’t loosen. I had no choice but to enjoy the constant vibration on my pussy. I had to cum within minutes. He grabbed my head and widened my mouth with his massive dick. I haven’t been with anything bigger than him. He’s definitely trained me well in using my throat. He kept pushing his dick in deeper and deeper, faster and harder, my head bobbing while he turned the sybian up. I couldn’t concentrate on the machine and his dick but I had no choice. I teared up instantly, spit pouring out of my mouth as I gagged over and over. It seemed like days of deep throat-ing his cock. When he was finally done, I thought my disgrace was over. But it only the beginning. He got rid of the machine and bent me over on the floor. He entered my pussy roughly, pulling me back on his dick by my face and hair. I love being his whore. He leaves me shaking from orgasms wanting more.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Kimmy Lee",
      "person_id": 56661
    }
  ],
  "release_date": "2018-11-15",
  "scene_id": 43991,
  "tags": [
    "Asian",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "brunet",
    "Brunette",
    "Collar",
    "Deepthroat",
    "Deprivation",
    "dungeon",
    "Facefucking",
    "fake boobs",
    "Female Slave",
    "Hair Pulling",
    "Latinx",
    "Male Handler",
    "Nipple Clamps",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "Straight",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "Partner Studio",
    "toned",
    "versatile",
    "Vibrator"
  ],
  "title": "Kimmy Lee Deserves the Sybian before More Use"
}