{
  "collections": [
    "Strapon Squad"
  ],
  "description": "If you're caught up with one of our favorite sub sluts Isa Mendez, she came back for another go with our BDSM Mistresses, hoping for a challenge. Well, she's still in the dungeon, her bondage fun still in session. Ava Kelly and Mila Blaze want to fulfill their promise of offering an experience like no other. They've left her tied against the wall, bent over, wrists and hips attached to the wall. It's a bit reminiscent of her past rope suspension. Her pussy is begging for a big cock to fill it up. She knows we have all sizes, yet don't control the massive thick rubber dildos attached to Ava and Mila's strapons. They take turns fucking her rough and hard, pounding every inch inside her, making her take it like a good sex slave. Their dicks on a stick reach Isa's mouth perfectly, a fun double penetration between all the hole usage. They want to see how well Isa's trembling and orgasm sensitive pussy can handle the sybian fucking machine. This naughty sex toy has broken many sex slave down in seconds, staring down at the floor covered in pussy juice from squirting. Mila torments Isa with an up and down ride of vibration and twirling dildo. Her screams are muffled from being skull fucked and smacked around. Isa thinks her lesbian domination threesome is over. How wrong she is. She wanted a challenge. Her Mistresses pull her off the sybian and tie her to a crate, bent over to make an easy pig roast. The duo take turns and switch around Isa, pounding their cocks in, fingering her, tormenting her more with a vibrator, more tit slapping and spanking. Isa can hardly move from all the orgasms. Hopefully we'll see her around again. This session truly tested her limits.",
  "directors": [],
  "models": [
    {
      "name": "Ava Kelly",
      "person_id": 53978
    },
    {
      "name": "Isa Mendez",
      "person_id": 53665
    },
    {
      "name": "Mila Blaze",
      "person_id": 53894
    }
  ],
  "release_date": "2018-11-15",
  "scene_id": 43992,
  "tags": [
    "Anal Fingering",
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Big Toy",
    "black hair",
    "Blonde",
    "Bondage",
    "Breast Abuse",
    "Chains",
    "Collar",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Double Penetration",
    "drool",
    "dungeon",
    "fake boobs",
    "Female Slave",
    "Femdom",
    "Fingering",
    "gloves",
    "Hair Pulling",
    "Latin",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Spit Roast",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "switch",
    "Sybian",
    "Tag Team",
    "Tattoo",
    "the wall",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Isa Mendez Earns Another Lesbian Domination 3some"
}