{
  "collections": [
    "Device Bondage"
  ],
  "description": "Penny starts her day perched atop a custom device that was built to ensure she is helpless. Her legs and arms are spread out and all of her weight is resting on her pussy. The Pope enters and brings with him a dental device that will hold Penny’s lips apart, which will impair her ability to speak. The humiliation starts as soon as it is applied to her face. She tries her best, but she cannot help but laugh at herself because of the way she speaks with it in her mouth. Penny’s flesh falls under a full assault from a heavy leather flogger. Her tits, her ass, and everything else that he can reach is turned a bright red as the flogger flies through the air. Clothespins are applied to all of the sensitive areas as Penny helplessly watches. The orgasm reward starts and the humiliation ensues. All she has to do is just say, “pretty please”. Next Penny is in a back bend and held in place with hard steel. She balances on her head as The Pope enters and adds twine lassos to her nipples, then hangs weight on the me. The flogging starts back up, only to lead to a crop used too. Suddenly, we find out that Penny is extremely ticklish, so he exploits that weakness the way he does all of the rest of them. He rips multiple orgasms from her pussy, and in a huge turn of events, he goes back to cropping her pussy into a “pain-gasm”. The final scene begins and Penny is in a doggy position with her arms pulled back into a strappado. Her neck is chained to the floor, and after some more cropping, The Pope sets his sights on making her orgasm more than she has all day. Her pussy is filled up with a massive dildo, and the vibe is pressed firmly against her clit. He rotates between her pussy and mouth in a brutal frenzy of fucking. In the end, we have our Penny back, and that’s all that really matters.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2019-02-07",
  "scene_id": 43999,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "multiple orgasms",
    "natural boobs",
    "Pain",
    "Straight",
    "Submission",
    "switch",
    "The Pope",
    "white"
  ],
  "title": "Pretty Please, Penny Pax"
}