{
  "collections": [
    "Device Bondage"
  ],
  "description": "Angela White is back at Kink.com, and this time is punished by her master, The Pope. These two connected over year ago and brought us one of the most popular shoots of the entire year. This is a new year, and this shoot definitely is more brutal than the last. Angela trusts him, and is willing to let him do almost anything he wants to her. She doesn’t get to do these kind of shoots often due to her super busy schedule, but every chance she gets, she calls The Pope and sets their date to play. We begin with her standing with her neck in a steel trap and her wrists cuffed in steel shackles. The Pope enters and it’s very clear that she needs his touch. She maneuvers in any way possible to be able to get closer to him. After some flogging to her ass and her amazing natural tits, she is pulled into his clutches and made to cum uncontrollably. The vibe is placed in her hands as he flogs her ass more to intensify the orgasms. She can barely stand on her own, and needs a few minutes to take in what just happened to her. The next scene begins with Angela on her side and one leg held up high with more steel traps. Although she is locked into her bondage, she does everything in her power to get closer to feel his touch. He toys with her for a bit before adding nipple clamps to her amazing tits and then begins the tease and denial. A crop is brought in and her pussy and feet suffer because of it. Her emotions run high as she is pleasured and tormented all at the same time. Once the orgasms start, The Pope does everything in his power to drain her pussy. Angela actually begins to cry from being made to cum so hard. The final scene has Angela on her back with her legs spread with and then locked into place with cold steel devices. Rubber bands are placed on her feet and then the zapper is brought into the mix. Her palms begin to sweat as the anticipation builds. The teasing continues and she is made to hold her orgasms until given permission. She begs and pleads, but also wants to be a good girl. She is torn, but in the end she is a good girl, and is rewarded with mind blowing orgasms. Angela loves this type of shoot and can’t hide that fact. She smiles through it all and proves her love for BDSM.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Angela White",
      "person_id": 60688
    }
  ],
  "release_date": "2019-03-07",
  "scene_id": 44000,
  "tags": [
    "BDSM",
    "Big Tits",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Domination",
    "Feet",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "master",
    "Metal Bondage",
    "natural boobs",
    "Nipple Clamps",
    "Straight",
    "Submission",
    "The Pope",
    "white",
    "Zapper"
  ],
  "title": "Angela White Begs to Suffer For Her Master in Metal Bondage"
}