{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Sitting with his back against the headboard of the bed, Owen has Jason crawl to him and stare worshipfully at his beautiful, rockhard cock. Jason has earned it, and can now have it. As Jason sucks adoringly, Owen with a hand on Jason’s head describes their new relationship and how he will henceforth own Jason. He has Jason suck him in several different ways before he puts Jason on all fours with Austin standing in front of him at the foot of the bed so Jason can suck Austin’s cock at the same time that Owen fucks him. The sex is rough, Owen slapping Jason’s ass, Austin spitting in his face. Owen offers Austin a shot at Jason’s ass. Austin gets Jason on his back with his legs in the air, then pounds Jason hard, pulling out and ramming back in. Owen kneels beside Jason’s head, jerking off. Owen pushes Austin aside and with Jason still on his back re-enters him, now fucking him slowly and erotically. Austin feeds Jason his dick, spits in his mouth, plugs it with his dick. Cum time. Straddling Jason’s chest, Owen jerks off over it while Austin kneels at Jason’s head. Owen and Austin shoot huge loads, which they rub into Jason’s face and chest.\n\nJason and Austin asleep on the bed, their feet on Jason who lies, hooded and hands tied behind him, across the bottom of the mattress.\n\nOwen comes home in his work clothes, as at the start of the video. He removes his hardhat and workman’s belt, and drops his keys on the counter, then comes forward to stand over Jason who has been waiting for him on his knees, naked, hands behind his back, a slave collar locked around his neck. Jason licks Owen’s right boot, then on command sucks Owen’s cock until, on command, he bends to lick Owen’s left boot. Owen smiles, pleased, and tells him to get him a drink.",
  "directors": [],
  "models": [
    {
      "name": "Austin Edwards",
      "person_id": 61646
    },
    {
      "name": "Jason Dean",
      "person_id": 61647
    },
    {
      "name": "Owen Hawk",
      "person_id": 61645
    }
  ],
  "release_date": "2018-11-20",
  "scene_id": 44009,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "Boot",
    "bottom",
    "brunet",
    "Cock Worship",
    "Collar",
    "Deepthroat",
    "Facesitting",
    "Facefucking",
    "Feet",
    "foreskin",
    "Gay",
    "master",
    "Rough Sex",
    "Slapping",
    "Slave",
    "Sniffing",
    "Spit Roast",
    "Tattoo",
    "Partner Studio",
    "Twink",
    "Uncircumcised",
    "white"
  ],
  "title": "Hardhat Master: The Reward"
}