{
  "collections": [
    "Device Bondage"
  ],
  "description": "Casey is a bondage girl first and a porn star second. Her life is full of real BDSM, and for the first time ever, we get to show you how hardcore she really is. It took years of planning to get to shoot a a scene like this with such brutal torment. Casey can't show up to a shoot with her body marked up, so it took a little time to get to this point where she could take enough time off to do such an extreme shoot like this one. She begins in a standing position as The Pope enters and begins the process. He takes this time with her, and is careful not to rush this moment. Casey is warmed up with some flogging, and as the scene goes on, the flogging becomes more and more brutal. The floggers are put down and then the punching starts. Casey's faces shows a little smile as the pain overcomes her. Soon she is blindfolded and then the cane shows up. Casey is in her happy place, and only getting deeper into subspace as The Pope issues more brutality. The cane strikes against her pussy mound and suddenly we see Casey beg to cum. She is a true pain slut and today you will see more orgasms from pain than you ever have before...from any model, anywhere. As brutal as this is, it becomes a very sensual exchange between to hardcore BDSM players, and this is only the first scene. Next Casey is on her back with her legs and arms spread away from her body. Every part is exposed and The Pope is going to manipulate every inch of her flesh. After her body is covered in bright red welts from the crop, her hands are bound and tormented as well. He is diligent about keeping her present during this and releases her hands as to not distract her from the other diabolical things he is going to do to her. The squirting begins as he finger bangs her pussy, and doesn't stop until he decides that it should. The final scene begins with Casey in one of the most brutal positions in the history of Device Bondage. She is pinned in a brutal strappado against the wooden column with her head pushed down and the back of her neck against the column as well. Her as sticks out like the perfect target, so he spanks and paddles it until he decides that it is time to make her cum one last time.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    }
  ],
  "release_date": "2019-02-21",
  "scene_id": 44002,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Destruction",
    "Domination",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Punching",
    "shaved",
    "Squirting",
    "Straight",
    "Submission",
    "Tattoo",
    "The Pope",
    "toned",
    "white"
  ],
  "title": "The Destruction of Casey Calvert!"
}