{
  "collections": [
    "Hogtied"
  ],
  "description": "The scene opens up with Lily sitting on a box, and in a very rare occurrence, The Pope does extensive on-screen tying. We get to witness her mild bondage transform in to a brutal predicament position, as well as the look on her face as she realizes how fucked she just became. She looks around as if someone is going to help her out, but this slut signed up for this and now she is going to have to take it. He crops her nipples and pussy, then brings in a suction device to put on her clit. Her clit is sucked deep inside of the tube and then he continues the crop session on her body. Her pussy is red and swollen so he begins the intense orgasms against her will. The next scene starts with Lily being hoisted up into the air in a brutal suspension with bamboo hold ing her arms out to the side. All of her weight hangs from her rib cage and her ankles, so understand this is truly a brutal suspension. The Pope attempts to help her through the tie with orgasms, but the pain is too severe, so she is let down to the ground and the scene continues from there. Lily's ass is spanked, her feet are abused with rubber bands, and her face gets cropped just to put the icing on the cake. The Pope makes a few adjustments to the tie, and then hoists her back into the air and issues more orgasms before leaving her hanging alone. In the final scene Lily is on her back with both legs bound, and one of then to a column. Her flesh is tormented more and then the vibe comes back to destroy her with more orgasms than she thought she could handle. Her pussy explodes with squirting orgasms to show that she is at her peak performance.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    }
  ],
  "release_date": "2019-03-14",
  "scene_id": 44001,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "black hair",
    "Bondage",
    "bottom",
    "Brunette",
    "Cage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "fake boobs",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Latin",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "The Pope",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Tattooed Slut Brutalized in Bondage and has Squirting Orgasms"
}