{
  "collections": [
    "Bonus Hole Boys"
  ],
  "description": "Viktor Belmont is a hot FTM tech worker who has no idea what he is walking into when he\napplies for a self improvement session with Leo Forte. Viktor roles up to a sketchy warehouse complaining about lack of focus and a loss of drive and desire in his work. Leo takes one look at this gym bunny twink and gives him the ultra deluxe Mind Hack treatment paperwork: a full rope bondage BDSM sex session with the muscle god Leo Forte himself. As soon as Viktor has signed away his agency for the duration of the session, Leo throws a leather hood over his head and wrestles him into submission. Once Viktor is tied up in a tight partial suspension, Leo begins a rigorous mind fuck session, moving between pleasuring Viktor's trapped bonus hole and stiff cock, and playing with his head, choking him out and demanding he zap himself to pay for every ounce of sexual pleasure. Viktor learns to submit like a good boy, taking a hard flogging and offering his body for punishment in order to get Leo's dirty leather boot and stiff cock in his mouth. This FTM slut knows how to swallow cock, and earns himself a hard fucking in his wet hole. Helplessly struggling in the ropes, Viktor beg's his Master to cum and strains into\nthe pain to have a monster orgasm on Leo's thick dick. The next step in Viktor's treatment is being untied and submitting to a vigorous doggy fucking. There isn't much threat of Viktor running away, as he is now deeply invested in his own sexual submission and getting more of that Daddy dick. With his eyes rolling back in his head, Viktor rides hard, faster, and more enthusiastically than he has ever fucked in his life. Leo is proud of his young pupil and offers him the last stage of his self improvement: a chance to flip the Master. Viktor doesn't need to be asked twice and quickly straps on a huge cock and eats Leo's\nass like its his last meal. Leo teasingly begs Viktor to fuck him, and gets railed in a passionate flip fuck that ends when Leo shoots a hot sticky load all over his furry chest.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Viktor Belmont",
      "person_id": 56517
    },
    {
      "name": "Leo Forte",
      "person_id": 22142
    }
  ],
  "release_date": "2019-01-01",
  "scene_id": 44004,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot",
    "Boot Worship",
    "Choking",
    "flip fuck",
    "Flogging",
    "FTM",
    "Gay",
    "Hood",
    "Latin",
    "Leather",
    "master",
    "mind fuck",
    "Muscle",
    "Pain",
    "harness",
    "Rope Bondage",
    "Strap On",
    "Submission",
    "Suspension",
    "Swallow",
    "Tattoo",
    "thirdparty",
    "TS",
    "Twink",
    "Zapper"
  ],
  "title": "Hunky FTM Tech Nerd Sexually Submits in Rope"
}