{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Daisy \"Lethal Legs\" Ducati is on the mats doing our Lesbian wrestling today. She has wrestled many times for our Mixed wrestling site and we keep bringing her back because she lives up so well to her wrestling name \"Lethal Legs\". She's a tall dark beauty who dominates physically, mentally, sexually, verbally......do we really need to go on? Daisy is the full package. Today, The full package is taking on a small package. Little miss Gabriella Paltrova also lives up to her wrestling name \"Fun Sized Human\". Gabriella is a Petite woman with a curvy physique that will drive you crazy. She's got natural tits and ass that are so firm and juicy we are scared our wrestlers are going to start throwing matches just so Gabriella will put her big beautiful ass on their face. Despite her fun size, Gabriella is a demon on the mats. She's hardcore and never gives up. We want to make our matches more sexual so we have integrated a penalty segment anytime there is a submission. If there is a submission during the fight, The wrestler to administered and successfully applied the submission will get 20 seconds to do anything she wants to the person who submitted. There is no fighting back during this 20-second penalty. The person to submitted must lay there and take it. We get many orgasms during this time which are not counted towards the outcome of the score because the clock is stopped during this penalty time. This is a close match judging by the score. But only one girl can win. The winner fucks the Loser with Hair pulling, hand gagging, hardcore pussy fucking so deep it leaves the loser's pussy gaping open. Then let loser is fucked so hard anally that her asshole gapes wide open and never closes. Poor loser, now everyone will know she lost today because her butthole wont close.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Gabriella Paltrova",
      "person_id": 41906
    }
  ],
  "release_date": "2018-11-19",
  "scene_id": 44006,
  "tags": [
    "Anal",
    "Curvy",
    "Ebony",
    "Farts",
    "Gaping",
    "Hair Pulling",
    "Hand Gagging",
    "Humiliation",
    "Lesbian",
    "Lift And Carry",
    "mixed",
    "Muscle",
    "Muscle Worship",
    "Petite",
    "Smothering",
    "Straight",
    "Submission",
    "thirdparty",
    "Wrestling"
  ],
  "title": "The Legs on this Ebony Goddess Destroys this Girl's Ass"
}