{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Brandi Mae is a strong powerful Amazon woman with a chiseled body. She's somewhat of a novice to the wrestling world but her muscles have given her a lot of advantages in her matches. Today she is taking on a Brazilian Born male who has absolutely no wrestling experience what so ever. Even though Marcello does not have any experience in wrestling, he does pick up moves quickly. He's also very excited about the prospect of fucking Brandie Mae, however, he wants after he wins. He puts everything on the line. He comes out fast and hard against his powerful female opponent. He's confident that his masculine power is going to overpower the woman and that he is going to be able to put his cock in her tight muscle pussy and rub on her big fat clit. Marcello does a very good job. He is able to pin the muscle goddess, hold her down and lick her nipples and asshole. Brandi's legs are so powerful however that Marcello is unable to penetrate her during the wrestling. One of these wrestlers goes to hard in the first few rounds and gasses out. It's utterly humiliating and ridiculous. The winner makes the loser worship their feet and muscles. The loser must perform oral on the winner until the winner cums. The loser sucks so bad in the final round of wrestling due to exhaustion that the winner takes the prize of fisting the losers asshole just to rub in the humiliation.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Brandi Mae",
      "person_id": 59885
    },
    {
      "name": "Marcelo",
      "person_id": 46090
    }
  ],
  "release_date": "2018-11-20",
  "scene_id": 44007,
  "tags": [
    "Anal Fisting",
    "Big Tits",
    "body builder",
    "bottom",
    "brunet",
    "Brunette",
    "fake boobs",
    "Feet",
    "Fisting",
    "foreskin",
    "Humiliation",
    "Latin",
    "Muscle",
    "Muscle Worship",
    "muscular",
    "Pegging",
    "shaved",
    "Smothering",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "thirdparty",
    "white",
    "Wrestling"
  ],
  "title": "Muscular Female Body Builder Destroys Brazilian in Grappling Match"
}