{
  "collections": [
    "Fucking Machines"
  ],
  "description": "You guys and gals asked for it, so now you are going to get it!! We have the tiny, the sexy, the slutty, the insatiable, Lilly back and she is dying to get fucked by the machines. We add some bondage to the mix, and ask ourselves how this is a bad thing, and soon discover that it wasn't at all. She loves the bondage, but the orgasms are what she's looking for today. The bondage intensifies them for our little slut, so we had to add it. We begin with her masturbating while standing. Her panties have pearls in the perfect place and the help separate her beautifully long pussy lips. The orgasms start and she is inspired to cum in multiple positions. The first scene is now ready to start, so we hoist her hands above her head, shove a gag in her mouth, and slide the machine into her wet pussy. Even gagged you can see her smile as her pussy is penetrated for the first time by the machine. The didlo slides in and out of her pussy and the excitement mounts as she builds up to multiple orgasms. Next we have her on her back with her arms tied to her legs, and then spread wide for optimal penetration. The machine starts and so does her smile. She grins from ear to ear as her pussy is punished by the machines. We ramp the speed all the way up, and she just cannot get enough. In the final scene she is on her back with her hands bound in front of her and her legs are bound as well, but she's not tied down, so she can move around. We give her a vibe, start the machine, and fuck this slut into oblivion. Her pussy lips slap back and forth as we fuck the hell out of her until she can hardly breathe. Today was a good day!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lilly Lit",
      "person_id": 61378
    }
  ],
  "release_date": "2019-01-16",
  "scene_id": 44005,
  "tags": [
    "Bondage",
    "Gag",
    "Machine Dildo",
    "multiple orgasms",
    "Petite",
    "Straight",
    "Vaginal Penetration"
  ],
  "title": "Petite Slut Lilly Lit Gets Machine Fucked in Bondage"
}