{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We like the way Layla Price parties and she starts this one off right with not one, but two enema syringe injections, and this scene only gets crazier from there. You’ve seen those huge, black vibrating wands with the massage head that looks like a giant marshmallow, right? Our Layla gets one of those jammed all the way up her tiny little asshole where it stays for most of the rest of the scene, much too large to work itself out, even when she’s getting viciously fingerfucked and her clit vibed to bits with another wand by the unyielding master. Girls and their toys. Later on, up on all fours with a jumbo buttplug keeping that gape going, Layla learns the real meaning of BDSM when a fucking machine is introduced to her rear exit. She takes it like a champ though, and as the master increases the speed of the tireless machine, he smacks her ass with his hand to let her know that he is always in charge. Some super rough anal sex is on deck next, and Layla’s complete submission and humiliation cums to an energetic climax with a brilliant anal cream pie that is then spooned out of her ravaged bunghole with a plastic spoon and fed to her to be recycled as an oral cream pie. WTF? Exactly! Genius!!! Can Layla’s asshole take all of this? Maybe, maybe not, but she’s about to find out!",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Layla Price",
      "person_id": 48143
    }
  ],
  "release_date": "2018-11-22",
  "scene_id": 44018,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "Breast Bondage",
    "buttplug",
    "Dildo",
    "Double Penetration",
    "Enema",
    "fake boobs",
    "Feet",
    "Female Slave",
    "Fingering",
    "Gaping",
    "gloves",
    "Hitachi",
    "Humiliation",
    "Latinx",
    "Machine Dildo",
    "Male Handler",
    "master",
    "Redhead",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Sub",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Layla Price #2 Sexual Disgrace L.A. Woman Gonna Eat My Cum"
}