{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "This one's a bit of an epic, guys. Jess is a full-time escort from Newcastle and she's a total cock whore. Best of all, she never gets dommed. She hardly ever has sex in her private life and it's always her cracking the whip on the job. She even goes so far to say that she's not a sub. Don't believe a word. She's demanding when she's getting fucked - \"Harder harder! Spit on me!\" - but she just loves the way Pascal takes total control of her and rag-dolls her. There's no narrative set-up to the scene, just her strung up to the hook with P teasing the fuck out of her cunt and not letting her cum when she wants to. Then h fucks her strung up and she ends up with her feet off the ground, legs wrapped round him, crying out for him to ram her deeper and deeper. Then he gets her to suck her off and she just can't get her round the idea of not swallowing her spit. So he gets her in Ozzy and she finally gets the gist and her face ends up covered in gob juice. Then it's back up for some face-fucking on her knees again, this time for her to do it properly and spit down on her tits. And then after that there's a whole load of fucking and whole load of Jess cumming over his dripping pole. We've got lots of extras for Jess and I need to fill you in on the chronology of what we shot. She came down to us a couple of months ago. We were going to shoot her the day before she did a scene for a gig Pascal had with a TV company and that I wasn't involved with. But we only got so far as the interview, pics and solo vid. We decided to stop at that point because it was clear she was up for a pretty savage session and but P wouldn't have been able to go the whole hog with her for fear of bruising her for his gig with her the next day. So we decided that he'd do that first and then afterwards bring her back to my place for us to do the PSS ugly on her. Except that he then did his back in so we couldn't. Finally, we were able to get Jess to come down a couple of weeks ago and finish the job off in magnificent style. Like I said, Jess Scotland is worth your time.",
  "directors": [],
  "models": [
    {
      "name": "Jess Scotland",
      "person_id": 61750
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2018-11-21",
  "scene_id": 44010,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Blowjob",
    "brunet",
    "Couple",
    "Crying",
    "Discipline",
    "Domination",
    "Facefucking",
    "Feet",
    "foreskin",
    "Slapping",
    "Spanking",
    "Squirting",
    "Straight",
    "Sub",
    "Swallow",
    "thirdparty",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Jess: Controlling Escort Stripped Of Power"
}