{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We're excited to share this video, another great domination clip with sexy cougar Dani Dare. She's addicted to her Master's long and thick cock pounding her fuck holes rough and deep. This time around Dani must endure more constant orgasms. Why not start it off with the infamous sybian fucking machine? The vibration it gives has made many models squirt, especially in our BDSM scenarios. She's kept on her knees with chains and cuffs around her wrists and ankles, her tasty clit waiting on the flesh pad. The torment begins with a light buzz, Dare's Master standing over, slapping her breasts and face with his hung dick. The dial rises and his cock is shoved in her mouth, deep throating his whore. The vibration is heightened, testing Dani's focus. She's been cumming non-stop, creating a sticky puddle. She's a good slut. She gladly bobs her head on his meat, loving every drop of spit covering her huge breasts. Vibration intensified, Dani Dare is pushed down onto the sybian fucking machine to orgasm a few more times. It makes her crave his hung dick even more. You better believe her pussy becomes sensitive. Perfect! Her Master pulls the sybian away and places a crate, rising her high off the floor, her arms kept apart, in the doggy position for deep penetration. He has full access to her mouth and quivering pussy for rough fucking. She said she loves huge cocks, but can she handle one after sybian torment. He doesn't hold back, shoving every inch of his dick deep in. When he needs more spit, he makes her clean his dick off with her lips, tongue and throat. She's getting tired but takes it all. She deserves a load. She has to earn it, of course.",
  "directors": [],
  "models": [
    {
      "name": "Dani Dare",
      "person_id": 56941
    },
    {
      "name": "James Kickstand",
      "person_id": 48660
    }
  ],
  "release_date": "2018-11-29",
  "scene_id": 44028,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "Chains",
    "Deepthroat",
    "Domination",
    "dungeon",
    "Facefucking",
    "Female Slave",
    "Hair Pulling",
    "Leather Cuffs",
    "Male Handler",
    "master",
    "MILF",
    "Nipple Clamps",
    "PIV",
    "Rope Bondage",
    "Slapping",
    "Straight",
    "Sub",
    "Sybian",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Dani Dare Begs for More Cock on the Sybian & Doggy Position"
}