{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "Charlotte Sartre and Maya Sinstress have a new slave boy to amuse themselves with, and decide to play Wheel of Fortune to see what should become of him. Strapped into a swing, Tony Orlando has ass and mouth ready for abuse. The first two rounds at the wheel stop on face fucking, and Tony gets his fill with a mouth spreader and two huge dildos. The next spin, the wheel lands on castration, which the Mistresses decide to leave until later. Prophetically enough, the next spin ALSO lands on castration, and Tony is starting to get nervous about his fate. Luckily, “butt stuff” is the next category, and Maya and Charlotte enjoy themselves to the max. Hard pegging, both with strap-on and enormous dildos that are way too big for a harness, follow. Being that Tony’s ass is stretched out as hell, double anal is also in order. Then it’s time for the strange foreign objects category, and Maya has some patriotic red white and blue pompoms to stick in his ass and mouth.\nBut Tony is still hungry for more action, and begs to be fisted. So who are the Dommes to argue? Finally, they decide he’s such a fun slave, castration would just be a waste…",
  "directors": [],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Maya Sinstress",
      "person_id": 61754
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2018-11-23",
  "scene_id": 44021,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Ass To Mouth",
    "Big Natural Tits",
    "black hair",
    "bottom",
    "brunet",
    "Curvy",
    "Dildo",
    "Domination",
    "Double Anal",
    "Femdom",
    "Fisting",
    "Hand Gagging",
    "Humiliation",
    "Kinky",
    "Lingerie",
    "Male Sub",
    "Mouth Spreader",
    "natural boobs",
    "Pegging",
    "harness",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "versatile",
    "white"
  ],
  "title": "Dommes play Wheel of Fortune (misfortune?) with their Slave's Holes"
}