{
  "collections": [
    "CFNMEU"
  ],
  "description": "Erik Drda is relaxing on his bed, checking missages on his phone. His girlfriend arrives and joins him. They share a drink and the girlfriend suggests sex, but in a different way. Erik agrees that she can do anything with him. So he lays back and the girl gets to work, getting Erik’s cock hard as she kisses his body and sucks the dick. She licks and sucks Erik’s balls too before lifting his legs and rubbing his hole. She spanks his ass a little and licks the hot hole. Then she uses Erik’s tie to blindfold him, before returning to the hot hole to slip a finger inside. Erik moans as he feels his ass being invaded. The girl finds some small beads and pushes them into the hole. Then she turns her attentions to Erik’s nipples, applying some clamps to them. Next it is clothes pins that are attached to Erik’s cock and balls. After removing them she turns Erik onto his knees and spanks his sexy ass. He really feels the spanking as the girl continues to play. Her finger fucks Erik’s hole and soon she is slipping a hook into it. Having played with the hole she stands Erik, whose dick is still so hard, and she starts to suck him again. She moves Erik to a chair and as he lays back with his legs up she wanks him and fucks his hole with a vibrator. Having taken her perverse pleasures she stands Erik up and wanks his throbbing cock until it cums for her.",
  "directors": [],
  "models": [
    {
      "name": "Erik Drda",
      "person_id": 60773
    },
    {
      "name": "Pomstychtiva Pritelkyne",
      "person_id": 61365
    }
  ],
  "release_date": "2018-11-30",
  "scene_id": 44032,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Brunette",
    "buttplug",
    "CBT",
    "Clothespins",
    "domestic",
    "Femdom",
    "foreskin",
    "Male Sub",
    "Metal Plug",
    "natural boobs",
    "Nipple Clamps",
    "romance",
    "slim",
    "Spanking",
    "Straight",
    "Partner Studio",
    "Vibrator",
    "white"
  ],
  "title": "Evening Romance"
}