{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Silly little man! You thought you were satisfying your Mistress Helena Locke, but it's time for a rude awakening. Helena begins by confronting all of your inadequacies. You can't make her moan, you can't make her pussy wet, and you definitely can't fill it up. You are utterly worthless to her. So now, she's decided to demote you to her beta bitch and make you watch as she engages with another, wildly skilled, and equipped man. She doesn't stop berating you while she slowly strokes the rock hard big cock that is revealed in front of you. She goes on and on about how this real man is going to make her beg for more (something you've never been able to do) and how he's going to make her pussy so wet, unlike you. You can't make Helena cum and as punishment you're going to have to please yourself from now on. You're going to sit in the corner and watch as this real man fucks her till she's screaming and cumming all over his hard cock. Now that you know what a useless fuck you are, Helena has your full attention and drags her tongue slowly up the shaft of his dick. She stretches her mouth wide to be able to wrap her lips round his head and then slides his thick cock deep into her throat over and over again. She makes you stay on your knees and watch as his fingers rub her pussy lips, getting her warmed up to stick his thick dick deep inside her from behind. She moans with pleasure as he fucks her and you sit there like the pathetic worm you are and watch her cunt drip all over his pounding cock. Enjoy the view, because this is as close as you'll ever get to her pussy again. If only you had been able to please her. She instructs you to stroke your own sad excuse for a cock while she gets plowed over and over again, the sound of her ass slapping his muscular thighs. Don't even think of cumming until she tells you to. You have only one use left and that is to do whatever she says. She moans as he fucks her harder and harder and then he plunges his dick deep inside her pussy as they both cum. Finally, you little cuck, it's your job to clean her dripping creampie before you're allowed to orgasm. How does it feel to watch this other man's jizz ooze out of her beautiful cunt?",
  "directors": [],
  "models": [
    {
      "name": "D. Arclyte",
      "person_id": 59025
    },
    {
      "name": "Helena Locke",
      "person_id": 59793
    }
  ],
  "release_date": "2018-12-04",
  "scene_id": 44038,
  "tags": [
    "BDSM",
    "Big Ass",
    "Bondage",
    "Corset",
    "Creampie",
    "Cuckolding",
    "Femdom",
    "Fetish",
    "Kinky",
    "Leather",
    "MILF",
    "muscular",
    "PIV",
    "POV",
    "Slapping",
    "Straight",
    "thirdparty",
    "Vaginal Penetration"
  ],
  "title": "Kinky JOI: Helena Locke's Cum Eating Cuckold"
}