{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Come here slave and sit beneath Mistress Bella Rossi’s lovely feet getting sweaty in her patent leather heels. Don’t you just wish you could touch her as you gaze up at her stocking covered legs and her perfect body adorned with leather? She notices your cock getting harder and instructs you to pull it out because she wants to see what you’re working with. Is your dick worthy of her presence even? She instructs you to touch herself as she teases you. She begins to touch her luscious big tits and pulls them out of her bra so you can see her beautiful nipples. Squeezing them together she knows you’d love nothing more than to slide your penis in between her breasts and tittyfuck them. Can you imagine what it would be like to have your breath cut off from being smothered by these big tits? You just want to play with your cock and cum but she’s not going to let you get off that easy. Mistress owns your orgasms and she wants you to get off in a specific way and exactly when she tells you to. First you’re going to have to stick your greasy, pathetic face into her ass. You’re completely helpless beneath her asshhole and dripping pussy. You’re going to have to bury your face deep into her cunt and then you can touch your cock. You’re going to suffocate in that ass while she instructs you on how to jack off. She gives you a countdown of 10 and teases you the whole way. Don’t think this is a fast countdown she’s going to draw it out and edge you hard. Finally, you’re allowed to blow your load all over the floor and then she makes you lick up your own cum when you’re done. That’s a good little bitch.",
  "directors": [],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2018-12-05",
  "scene_id": 44042,
  "tags": [
    "Big Ass",
    "Big Tits",
    "Bondage",
    "Corset",
    "Crop",
    "Cuckolding",
    "Curvy",
    "dungeon",
    "Feet",
    "Femdom",
    "Fetish",
    "High Heels",
    "JOI",
    "Kinky",
    "Leather",
    "natural boobs",
    "Nylons Stockings",
    "other hair color",
    "POV",
    "Redhead",
    "shaved",
    "Slave",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "white"
  ],
  "title": "Kinky JOI: Smothered by Bella Rossi's Tits and Ass"
}