{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Well well well…you’ve made to Mia Little’s dungeon on time at least but she’s not quite ready to accept you. Her approval is crucial as you are auditioning to be her slave. Can you manage to impress her? We’re about to find out. To start, you’re going to have to be completely naked and vulnerable. We know it’s hard for you to hide your excitement now that you’re totally bare for her and she wants you to get even more excited. Looking at her perfect pierced nipples underneath her sheer bra imagine that all the blood in your body is flowing to the head of your dick as you begin to stroke it for your Mistress Mia. That’s right, touch that hard cock. Grip it, show us how tight you can squeeze it. Mia gives you permission to touch your balls. While you play with them she continues to instruct your dick stroking. Keep stroking that cock there’s no room for shyness here. Mistress Mia wants a good little submissive to entertain her by masturbating…do you think you can handle that task? Can you squeeze your cock and then make your cock flap around? Because Mia wants to see what kind of tricks you can do. She needs you to perform and to prove to her that you are worth her valuable time and attention. Afterall, she’s gone to great lengths to dress in her sexiest lingerie, complete with polka dot stockings. Do you think she’s gotten all dolled up just to lounge around? Taking her whole body in from her legs to her beautiful tits you are still instructed to keep stroking. Do you think you are worthy of being in her presence? Stroke, stroke, stroke it. Now she has taken her amazing breasts out and is teasing her nipples. Her soft voice continues to seductively conjure your stroking. Making your dick nice and hard you keep attempting to entertain and please your Mistress. Only she can decide if your brand of jacking off will make her proud. She gives you a little more motivation by turning around and sticking her ass in your face. She pulls her panties to the side to show you her dripping pussy and tight asshole. After teasing you with her holes she slides her panties off turns around and shows you what an excited audience member she is. Taking a vibrator to her clit she begins to masturbate and squeal with pleasure. Don’t stop stroking, Mia loves controlling your orgasms. While she cums hard she tells you to keep stroking your cock. Just because you got to watch her cum doesn’t mean she’s about to let you reach an orgasm. With her legs spread and her pussy in your face she finally gives you a countdown. Do you think you can impress her by showing her what a good performer you are?",
  "directors": [],
  "models": [
    {
      "name": "Mia Little",
      "person_id": 51496
    }
  ],
  "release_date": "2018-12-06",
  "scene_id": 44048,
  "tags": [
    "Asian",
    "black hair",
    "Bondage",
    "Cuckolding",
    "dungeon",
    "fake boobs",
    "Femdom",
    "Fetish",
    "High Heels",
    "Hitachi",
    "JOI",
    "Kinky",
    "Lingerie",
    "masturbation",
    "Nylons Stockings",
    "Pierced Nipples",
    "POV",
    "shaped",
    "Slave",
    "Straight",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "Vibrator"
  ],
  "title": "Kinky JOI: Mia Little's Slave Auditions"
}