{
  "collections": [
    "Str8Hell"
  ],
  "description": "Borek Sokol is working in Airport Security. As he talks on the phone there is a knock on the door and Patrik Maly enters. Borek starts to check Patrik’s luggage and finds some interesting items, sex toys, which Patrik claims are his girfriend’s. Borek decides that Patrik must be incarcerated and takes him off to the cells, where Ivan Mraz is already laying on one of the bed. Borek then leaves Patrik and Ivan alone. Patrik’s wrists are cuffed behind his back as Ivan begins to play with his own cock. Patrik tells him to stop the wanking and to help him. Ivan takes no notice and stands up, moving over to Patrik and tells him to suck his stiff cock. He grabs Patrik’s head and shoves his cock into his mouth. Ivan fucks the mouth, slapping Patrik’s face as he does so. After fucking the mouth Ivan pulls down Patrik’s jeans, finding a nice hard cock. He goes down on the cock sucking it real good. He turns Patrik over and spreads his ass to examine his tight hole. He spanks the ass as he checks it out. Then he shoves a finger into that hole as Patrik moans. Next Ivan climbs on top and slips his throbbing cock deep into Patrik’s ass. He fucks it nice and deep. Patrik moans as Ivan’s cock works his tight ass. He is turned over onto his back and Ivan’s dick goes back into his ass. Ivan fucks the ass hard and fast as Patrik manages to grab his own dick and wank it. Ivan keeps up the fucking until his unloads his cum deep inside Patrik’s hot ass. He pulls out and checks that hole again. Then he lays Patrik on his side and leaves him to recover.",
  "directors": [],
  "models": [
    {
      "name": "Borek Sokol",
      "person_id": 60756
    },
    {
      "name": "Ivan Mraz",
      "person_id": 60765
    },
    {
      "name": "Patrik Maly",
      "person_id": 61777
    }
  ],
  "release_date": "2018-12-05",
  "scene_id": 44045,
  "tags": [
    "18-Year-Old",
    "Anal",
    "Anal Fingering",
    "Athletic",
    "Bareback",
    "blond",
    "Blowjob",
    "Bondage",
    "Cop",
    "Facefucking",
    "foreskin",
    "Gay",
    "masturbation",
    "Muscle",
    "Rough Sex",
    "Slapping",
    "Smothering",
    "Straight Stud",
    "takedown",
    "Partner Studio",
    "top",
    "Twink",
    "Uncircumcised",
    "white"
  ],
  "title": "Patrik Maly Gets Used by Cellmate Ivan Mraz RAW - AIRPORT SECURITY"
}