{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Charlie Stevens, a cute newcomer to porn, is breaking her cherry with us. She’s quite brave in doing rope bondage and BDSM rough sex for her first time. It certainly doesn’t mean she’ll be given an easy slave training session. Charlie is left on the floor, wrists and tits tied together, her knees raw on the wood. It seems she doesn’t realize what’s coming, laughing a bit. Charlie’s Master bobs her head on his dick, making her take his fat cock deep down her throat. Spit is streaming out of her, covering her perky tits. Her Master taunts her, making her tell him what a whore she is, slaps her face and tits, making her gag. She’s isn’t giggling now. He tests her pussy with his big cock. Her tight pussy can’t handle it. She better get used to deep penetration. Her Master decides to challenge this newbie more. She is put on her knees, her wrists pulled to her sides, ankles tied in place. Her new BDSM Master shoves his long boner back in her mouth, excavating deep down her throat, practically fucking her skull. Charlie wasn’t expecting such a huge dick for her domination. She should have known better. Since she wants to be a slut, he wraps his hands around his neck, choking moans out of her, making her apologize for being a whore while gagging on his meat.",
  "directors": [],
  "models": [
    {
      "name": "Charlie Stevens",
      "person_id": 61353
    },
    {
      "name": "James Kickstand",
      "person_id": 48660
    }
  ],
  "release_date": "2018-12-06",
  "scene_id": 44052,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "brunet",
    "Brunette",
    "Choking",
    "Domination",
    "dungeon",
    "Facefucking",
    "Female Slave",
    "First Porn Shoot",
    "Gag",
    "Hair Pulling",
    "Latinx",
    "Male Handler",
    "master",
    "natural boobs",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Small Tits",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "versatile",
    "white"
  ],
  "title": "Newcomer Charlie Stevens Endures Rough BDSM Sex & Rope Bondage"
}