{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Hello, you desperate little slut. We know you’re aching to touch your cock for Mistress Cherry Torn. She’s wearing a black, shiny PVC dress, holding a riding crop and you’re her greedy, horny toy that she’s going to inspect and instruct in her dungeon. You’re dying to sniff her sweaty, smelly feet and slide your cock between her arch and her platform heels. This dominatrix knows you’d love to fuck her feet and then eat your own cum. Cherry tells you to stroke your slave cock, faster and faster and then makes you beg. She counts down from 10 and tells you to smack your dick, stop stroking and then slap it. Cherry knows you want to cum but what’s in it for her? The only way you will earn your orgasm is to become a filthy, fucking cumeater. She tells you to stroke your cock hard and fast and counts down from 10 again and then suddenly makes you stroke it slowly, and get your precum with your finger and taste it. You want to worship her feet with your cock. She wants you to practice eating your own load so that one day you can eat it straight from her pussy. Keep stroking, don’t stop, but don’t you dare fucking cum. Sitting in her throne you gaze upon her beautiful ass, just wishing you could see what’s under her panties. She’s fingering her clit and then slides her panties to the side to show you her pussy. Don’t you want a little taste? But you’re not a pussy-eating loser you’re a cum-eating loser. She continues to tease you with her dripping cunt and instructs you on how to jack off for her, spreading her pussylips so you can see her gorgeous cunt and asshole. She tells you to keep stroking and build your orgasm up so she can edge you even harder. She wants to make sure that you’re gonna blow the biggest load possible and make you eat up every last bit of your man-milk, you nasty little pervert. She pulls her big tits out and begins playing with them. You watch her nipples bounce up and down while you edge. Now it’s time for the final countdown you little whore. Cherry is going to countdown from 10 and then you’re going to blow that giant load of semen. Don’t waste a single drop because you know exactly what she wants you to do with it when you’re done.",
  "directors": [],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    }
  ],
  "release_date": "2018-12-07",
  "scene_id": 44053,
  "tags": [
    "Big Ass",
    "Big Tits",
    "Bondage",
    "Brunette",
    "Bush",
    "Crop",
    "Cuckolding",
    "Dominatrix",
    "dungeon",
    "Feet",
    "Femdom",
    "Fetish",
    "Fingering",
    "High Heels",
    "JOI",
    "Kinky",
    "Lingerie",
    "natural boobs",
    "Nylons Stockings",
    "other hair color",
    "POV",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "white"
  ],
  "title": "Kinky JOI- Cherry Torn's Teasing Treatment"
}