{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "The submissive and obedient sex slave Valentina needs more slut training in the dungeon. She will love being slapped and spanked, gagged and fucked roughly, deep and hard down her throat and pussy. We definitely have everything for the job. Her Master enacts another rope bondage session, revealing Valentina on her back, arms bound to her sides, legs pulled back and tied by her head. He slaps her pussy, tits and face awake. He wants her to cum a few times he penetrates her with his massive dick. A vibrator usually does the trick. He lubes her cunt and spreads the wand all over her clit and pussy lips. He then dips his dick deep in her pussy, bobbing her hips on his meat. Her BDSM Master unties Valentina and makes her give him a deepthroat BJ. After all of this, she needs more intense training. She’s sat on a mattress, legs and wrist pulled forward, a fucking machine aiming a huge dildo at her twat. She tries to get away but only ends up swallowing her Master’s cock and taking the rubber dick in her sex hole. This is our modern double penetration scene. Valentina can hardly move, slapped into taking more dicks. Seems this sex slave does need more training. Her Master gives her an incentive to work for: his cum. He shoots his load all over her face.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Valentina",
      "person_id": 56659
    }
  ],
  "release_date": "2018-12-13",
  "scene_id": 44067,
  "tags": [
    "Airtight",
    "Anal",
    "Ass Hook",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "brunet",
    "Deepthroat",
    "Dildo",
    "Double Penetration",
    "dungeon",
    "Facefucking",
    "Female Slave",
    "Fingering",
    "Hair Pulling",
    "Hitachi",
    "Latinx",
    "Machine Dildo",
    "Male Handler",
    "master",
    "natural boobs",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Spit Roast",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "Partner Studio",
    "versatile",
    "Vibrator"
  ],
  "title": "More Sex Slave Training for Valentina with Rope Bondage & Deep Pen"
}