{
  "collections": [
    "Fucking Machines"
  ],
  "description": "We wanted to make sure that all of you get what you want, so we are now going to mix it up with Fucking Machines. Going forward some will have bondage and some will not. This way there is a little something for everyone. Rocky starts us out with a sensual strip tease before we hand her the vibe and watch as she makes her pussy drip from so many orgasms. Now that her pussy is nice and primed, we can start the process of machine fucking her into oblivion. We seat her on the bench and slide the machine into her hungry pussy. The dildo slides back and forth in her honey hole as we speed the machine up for maximum fucking. She uses the vibe, but that starts to become too much for her to handle. Rocky's head is thrown back in overwhelming ecstasy while the machine makes her cum uncontrollably. We flip her over for the next scene and star to fuck her from behind. Rocky likes most things rough, and although she could not stop cumming in the last position with the machine at top speed, this time fucking her slow and deep seems to do the trick. We continue to go back and forth with the speed to give her non top orgasms. Next we have her leaning back and getting fucked more. She can barely focus on anything because her eyes keep rolling back in her head for all of the powerful orgasms. Once her pussy is completely worn our from so much fucking, we put her on the sybian to push her the rest of the way over the edge. She can't believe the power that this thing has, but she is going to find out how much she can handle before she has finally had enough.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Rocky Emerson",
      "person_id": 61399
    }
  ],
  "release_date": "2019-02-27",
  "scene_id": 44077,
  "tags": [
    "Bondage",
    "Brunette",
    "Dildo",
    "High Heels",
    "Hitachi",
    "Machine Dildo",
    "natural boobs",
    "slim",
    "Straight",
    "Sybian",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Sexy Alt Girl Rocky Emerson Has Nonstop Orgasms From Fucking Machines"
}