{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Avi Love likes to lure us in with her little strip tease and then instructs us to follow her. She walks across the room to another corner and finds a vibe and dildo. She presses the vibe against her pussy and begins to fuck her face with the dildo. Suddenly she isn't as innocent as we all thought, and as we continue to watch her she starts to fuck her pussy with the dildo while she talks dirty to the camera. She licks the dildo clean of all of her juices before we continue on to the next scene. She is placed into a diabolical device that has her bent backwards and her legs are spread wide. The machine penetrates her pussy and slowly begins to fuck her tight pussy. The machines get faster and we eventually find out what makes this sex kitten purr. We add a vibe and blow her mind with non stop orgasms. Next we put her on her back and tie her legs wide on the cathedral. The machine gets ramped up and then the vibe is added to guarantee multiple orgasms. Avi is really good about keeping her composure, but with the machines fucking her this hard, she is having a hard time doing anything, but cumming! The next logical move is to have Avi mount the cathedral on it's other shaft for fucking. She straddles the machine with her arms tied in a box tie, and almost instantly starts to orgasm. It seems like she is about to explode and then she does with squirting orgasms. We found the perfect way to fuck this little slut, and we do so until she is exhausted form the machines. She sits back to relax and enjoy all of the orgasm, but we want to see a few more, so we use the vibe to get out every drop of her cum!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Avi Love",
      "person_id": 60196
    }
  ],
  "release_date": "2019-02-13",
  "scene_id": 44076,
  "tags": [
    "Bondage",
    "Breast Bondage",
    "Brunette",
    "Dildo",
    "Hitachi",
    "Machine Dildo",
    "masturbation",
    "multiple orgasms",
    "Petite",
    "Rope Bondage",
    "Small Tits",
    "Squirting",
    "Straight",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Cute Little Avi Love Is Bound And Machine Fucked"
}