{
  "collections": [
    "Hogtied"
  ],
  "description": "Violet begins her day tied to a wooden chair and a leather head harness holding her gag in place. She struggles to escape the tight ropes, but to no avail as The Pope enters and begins inspecting his captive. He starts an assault on her nipples with pinching and twisting, and continues his torment throughout the remainder of the scene with extreme electrical torment. The zapper starts the party, then the cattle prod, and then she is finished with the taser. Violet is blindfolded and then the torment continues at more of a sadistic level than before. She is getting close to the edge and The pope has the perfect thing to push her all the way over. Next she is face down on the table in a hogtie. Her feet have bands applied to them for optimal bastinado. The torment is taken up a notch with a brutal flogging. The look on Violet's face says it all every time The Pope strikes her with the leather tails, but then her attitude changes once he touches her slutty pussy. In the final scene she is flipped over onto her back, and on the table. Her tits fall victim to The Pope's cat-o-nine with non stop lashes, and the dungeon fills up with screams of suffering. Her flesh turns a bright shade of red from all of the sadistic torment she is made to endure, but then the vibe shows up. Add some extreme breath control with non stop imposed orgasms, and you have the perfect finish to the day.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Violet October",
      "person_id": 52822
    }
  ],
  "release_date": "2019-04-11",
  "scene_id": 44075,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Caning",
    "Cattle Prod",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Fingering",
    "Flogging",
    "Gag",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Pain",
    "Pain Slut",
    "harness",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Taser",
    "The Pope",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Sassy Pain Slut Gets Tormented in Bondage"
}