{
  "collections": [
    "CFNMEU"
  ],
  "description": "Vaclav Chovanec has an interview for a job. He arrives and sits in front of the sexy interviewer who says she has some special offer for him. But first she needs to see his body, so Vaclav stands and takes off his tee shirt, turning to show his back as well as his chest. The girl then tells him to take off his jeans so she can check his legs. She stands up and says she has more to check. So she turns Vaclav around and feels his ass, pulling his underwear up into his ass crack. She runs her hands over his hairy ass and gives it a spank. As she turns him sideways it seems his cock is growing in the underwear. The girl pulls down the underwear and show him how to bend to show the ass. Turning Vaclav round she checks his big bulge, and says she can offer him the job after some more tests. Pulling down the front of the underwear frees his thick, hooded, cock that is already quite swollen. She kisses it and then begins to suck on it. She sucks on Vaclav's balls as well and then goes back to working her mouth on his cock. Vaclav is turned again to show her some more of that hot ass. She bends him over the desk and spanks on his ass before fingering his tight hole. ~Then he lays on the desk to let her suck on his big cock again. As he lays on the desk his legs are raised in the air to show his hairy hole which the girl starts fingering again. Then she fucks it with a vibrator, going in nice and deep. Vaclav wanks his cock as she plays with his ass. She stretches his hole wider, using two fingers. Then she puts on a strapon and has Vaclav suck it. He knows what is coming next, as he he told to bend over and spread his ass. The girl fucks that ass with her strapon, working the hole real well and spanking the ass too. Vaclav lays on the table for more fucking, and wanks himself hard and fast until his cum shoots out of his cock and coats his belly. He asks if he has the job and, of course, he does.",
  "directors": [],
  "models": [
    {
      "name": "Pomstychtiva Pritelkyne",
      "person_id": 61365
    },
    {
      "name": "Vaclav Chovanec",
      "person_id": 61796
    }
  ],
  "release_date": "2018-12-14",
  "scene_id": 44072,
  "tags": [
    "Anal",
    "Anal Fingering",
    "big dick",
    "Blowjob",
    "Brunette",
    "Dildo",
    "Femdom",
    "Fingering",
    "Flogging",
    "Hairy",
    "Male Sub",
    "natural boobs",
    "Pegging",
    "slim",
    "Spanking",
    "Straight",
    "thirdparty",
    "Uncircumcised",
    "Vibrator",
    "white"
  ],
  "title": "Interview"
}