{
  "collections": [
    "Device Bondage"
  ],
  "description": "Serena is alone n the dungeon with her hands pulled above her head and the rest of her body is restrained with leather straps. The Pope enters and wraps her face with black rope and fashions a gag to keep this sluts whimpers muffled. He initiates a full out assault on her flesh with heavy leather floggers. Try as she may, there is no escaping the wrath of his sadistic torment. The floggers hit every available inch of her skin as she writhes around trying to escape the fury. She is pushed to her breaking point and then the vibe is introduced to finish her off with non stop imposed orgasms. Next we have Serena in a doggy position to show off her nice plump ass. She is held in place with steel shackles and traps that keep her pinned to the wooden box, which creates the perfect platform for serving up sadistic torment. This time the pain comes in a very precise fashion. The floggers scattered as they hit the skin, but the crop is a tool of precision and The Pope uses it perfectly to inflict maximum suffering to our little pain slut. Now that Serena is warmed up, he breaks out more interesting implements to create a wide array of suffering for her. Once her ass has had enough, The Pope moves to her feet with the wooden paddle and he doesn’t let up until Serena is about to break. In the midst of her most extreme suffering yet, The Pope adds the vibe, which sends her completely over the edge. Serena is in her final position which has her on her back atop a wooden table and held in place by steel shackles. The flogger is back to tenderize her front side the way her back was. The Pope does what anyone in his position would do. He finishes her off with non stop orgasms that blow her mind, and as she writhes under his hands we see her finally give in a fully submit to him.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Serena Blair",
      "person_id": 31165
    }
  ],
  "release_date": "2019-03-21",
  "scene_id": 44074,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Paddle",
    "Pain",
    "Pain Slut",
    "shaped",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "The Pope",
    "toned",
    "white"
  ],
  "title": "Leather, Wood, and Steel with Serena Blair"
}