{
  "collections": [
    "Bound Gods"
  ],
  "description": "Tony Prower is blindfolded, gagged, and tied to a chair in his boxer briefs. He struggles in bondage as his captor Riley Mitchell approaches. Riley crops Tony's thighs, chest, stomach, and cock, and demands to know what Tony is doing here and where he comes from. Tony grunts as the crop hits his sensitive exposed flesh. Confused, he maintains his innocence. He was only out for a hike! But Riley isn't buying it. He cuts Tony's underwear off to reveal Tony's cock standing at attention. He crops Tony's cock and then decides another approach is needed. Riley takes his own cock out and pushes Tony's head down on it. Tony takes every inch, gagging on Riley's cock. He tries to pull away, but is met with the harsh sting of the zapper. Tony's struggles and yelps of pain only make Riley harder. Tony works Riley's cock, hoping his captor will take some mercy on him. Unfortunately for Tony, Riley's sole duty today is to get all the information out of Tony, any way he can. He ties Tony to a beam with his arms spread. He flogs Tony's back, ass, and leaking cock. There is no escape for Tony, all he can do is take every stroke and maintain his innocence. Riley bends Tony over and ties his arms back. He clamps close-pins along Tony's arms before giving Tony the choice of the zapper or Riley's own hard fat cock. Tony chooses dick and gets a hard fucking by his captor. Tony cries out as Riley pummels his asshole. Riley flips Tony on his back for more fucking before ripping an orgasm out of Tony. He then blows his load all across Tony's face. Relieved, Tony thinks Riley will let him go now, but his torment is just beginning...",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Riley Mitchell",
      "person_id": 61662
    },
    {
      "name": "Tony Prower",
      "person_id": 61804
    }
  ],
  "release_date": "2019-01-31",
  "scene_id": 44086,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Zapper"
  ],
  "title": "Interrogation 431: Hiker Tony Prower questioned by Riley Mitchell"
}