{
  "collections": [
    "Bound Gods"
  ],
  "description": "Kink Men newcomer Devin Trez is ready to train a new puppy in his dungeon. Clad in all leather, this black muscular handsome dom commands your attention. With each step of his leather boots on the cold wooden floor, his new toy Tony Orlando trembles while fully restrained to the wheel. Tony begs to suck his master's cock, but he doesn't know what he is getting himself into today. Devin Trez reveals he is hear to train a new dog since his last one ran away. Tony begs to not be made a dog, he just wants to suck cock, so the cane comes out first. Devin knows obedience starts with the sensitive areas and takes the cane right to Tony's hard cock. He beats Tony's body red with cane welts. Tony resists but is made to wear a leather puppy mask. This dog will break today. Devin spins the wheel that Tony is strapped to and lands him upside down ready to suck on his masters bone. Devin takes out his huge hard cock and shoves it down Tony's puppy masked throat. This gets Tony gagging and barking like a dog for more. Tony of course isnt complete with out an anal plug dog tail. With this rammed down his ass, Devin jerks off his toy for an inverted cum shot. Tony cums all over his masked face. This was only part one of Tony's obedience training. Next up Tony is bound in rope to a cross and the flogger comes out. Devin inflicts a brutal corporal punishment on Tony's backside. On all fours, Tony is cropped before strapped to a intense fucking machine. Unable to move, Tony's nipples are clamped and Devin pours hot red was all over Tony's chest. This gets Tony screaming and howling. Finally the master is ready to deliver a brutal fucking. Tony is bent over and Devin rams his hard cock into Tony's ass. This pounding delivers a huge cumshot from Devin all over Tony's whimpering face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Devin Trez",
      "person_id": 61805
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2019-02-07",
  "scene_id": 44087,
  "tags": [
    "Anal",
    "BDSM",
    "Black",
    "Blowjob",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Flogging",
    "Gay",
    "Humiliation",
    "Leather",
    "Machine Dildo",
    "Male Sub",
    "Mask",
    "master",
    "muscular",
    "Puppy Play",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission"
  ],
  "title": "OBEDIENCE TRAINING Devin Trez Disciplines New Dog with Intense Bondage"
}