{
  "collections": [
    "Bound Gods"
  ],
  "description": "New boy Ricky Daniels is new to kink and caged, awaiting the whims of leather god Arad Winwin. Arad lets Ricky out of his cage and gives him his first taste of leather. Ricky eagerly mouths Arad's leather jockstrap and sucks on his leather-clad gloved fingers on his hands and knees. He yelps as Arad uses a paddle on his back and ass. Arad's never used a paddle before and he likes it. Arad bends Ricky over the cage and inspects his tight little hole. He spits on it, before lavishing it with nice long licks. Ricky trembles with pleasure as Arad rims him. Arad sees Ricky's hard cock and gets a taste before instructing Ricky to suck his dick. Ricky loves taking cock and he takes every inch of Arad's hard cock in his slutty wet mouth. He works Arad's cock as Arad spanks his ass. Next, Ricky is strapped to the wheel and blindfolded. Arad uses a crop on his exposed stomach and thighs. He spins Ricky upside down so he has better access to Ricky's nice hard cock. Upside down, Ricky is at the perfect height to get his cock sucked and suck Arad's cock. Finally, Ricky is tied up, gagged, and fucked hard. Arad rams his cock into Ricky's ass and gives him a good hard pounding before blowing his load all over Ricky's ass. He makes Ricky suck him clean before commanding Ricky to jerk off. It doesn't take Ricky long to blow a hot fat load all over his belly.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Arad Winwin",
      "person_id": 61417
    },
    {
      "name": "Ricky Daniels",
      "person_id": 61839
    }
  ],
  "release_date": "2019-01-24",
  "scene_id": 44084,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Cage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Gay",
    "Humiliation",
    "Jockstrap",
    "Leather",
    "Male Sub",
    "master",
    "Paddle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission"
  ],
  "title": "Arad's New Boy: Ricky Daniels Serves The House"
}