{
  "collections": [
    "Men On Edge"
  ],
  "description": "Tony Prower is running the show as construction foreman until Sebastian and Dominic decide they've had enough of his power plays. They tie him up, blindfold him, bind his cock and balls, suspend him in the air face-down, and edge him repeatedly until he finally cums. No gag for Tony though...they use his sweet wet mouth for a good hearty cock sucking. They start by tying him in a standing position, legs spread, ankles bound and hands tied behind his back. He's also blindfolded, so he can't see what they're doing...or what they're about to do. Sebastian and Dominic tease his nipples and insanely hard cock, then really start working that dick. Dominic plays with it and sucks it, then Sebastian puts a vibrating cock sleeve on it, really working Tony's cock so the cum is building and stirring in his balls. They tie his cock and balls up in rope, and attach it to the floor as they keep edging him, bringing him super close to orgasm, but then denying him. They then fully suspend Tony, with his hands at his side and face-down. His mouth is right at cock-sucking level, which Dominic takes full advantage of, sliding his thick hard dick into Tony's hungry throat, which Sebastian jerks Tony's cock with a jack-off toy. They toy with Tony like this, edging him, making his raging hard dick swell and pulse. Tony can't hold it any longer, when he finally cums, screaming and wailing as his big hot load is milked out of that wet cock and shoots straight down to the floor. To finish him off, Sebastian and Dominic tickle him mercilessly, then leave him hanging...literally.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Tony Prower",
      "person_id": 61804
    }
  ],
  "release_date": "2019-02-19",
  "scene_id": 44088,
  "tags": [
    "BDSM",
    "Blindfold",
    "Bondage",
    "Edging",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "Suspension",
    "Tickling"
  ],
  "title": "...But Your Dick Says Yes: Tony Prower Edged In Full Suspension"
}