{
  "collections": [
    "Bound Gods"
  ],
  "description": "Luka Sage is on his back, strapped to a black metal table. His wrists are secured above his head with leather cuffs. His ankles, also wrapped in leather are fastened to the table. Jack Dixon enters the scene wearing a black leather apron, a leather studded hockey mask, and black latex gloves that go all the way up to his elbows. He rips Luka's shirt open and spits in his face. Luka gives him some attitude and Jack slaps his chest and stomach, turning it bright red. Jack takes six clover clamps and sticks them across his chest. He rips Luka's underwear off and sucks his hard cock through the leather mask and jerks it with his latex gloved hands. Jack lifts Luka's legs above his head and with his latex covered hands, plays with his exposed asshole. Jack grabs a string of big black anal balls and pops them into Luka's ass one by one. Jack grabs the end of the string with his teeth and pulls them back out of Luka's ass. In the next scene, Luka is bound on his knees with his arms back. Jack feeds Luka his big fat pierced cock and Luka can barley fit it into his mouth. Jack grabs a leather flogger and flogs Luka's ass until it turns pink. Jack takes a large blue dildo and stands it up under Luka's ass and makes him sit on it. Luka sits on the huge toy and it slides into his ass, stretching it out. Luka bounces on the huge dildo while Jack flogs his ass. In the final scene, Luka is in a full rope suspension with a bit-gag in his mouth. He hovers over Jack's big dick and Jack stuffs it inside Luka's ass and fucks him well. Jack makes Luka cum by jerking his hard dick and Jack blows his load all over Luka's face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jack Dixon",
      "person_id": 61576
    },
    {
      "name": "Luka Sage",
      "person_id": 61803
    }
  ],
  "release_date": "2019-01-17",
  "scene_id": 44085,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Gag",
    "Gay",
    "gloves",
    "Humiliation",
    "Latex",
    "Leather",
    "Leather Cuffs",
    "Male Sub",
    "Mask",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Suspension"
  ],
  "title": "Beast Feast"
}