{
  "collections": [
    "Men On Edge"
  ],
  "description": "Nick Fitt is a lean, muscled, horny fucker that we love to see tied up, and now he's back to get sucked, jerked and edged, and he can't control any of it. Sebastian and Dillon tie him up, keeping him on his feet for now, so they can bind him in rope and peel him out of his underwear and get at that cock. Dillion sucks him, working that dick in his wet mouth, brining Nick closer and closer to the edge as quickly as possible. Sebastian puts Nick on the floor, readying him for a full suspension. But before he strings him up, Dillon is working his cock again, sucking him and jerking him, leading him to the edge and back again. Sebastian toys with Nick's exposed, puckered hole, then hauls Nick into the air into suspension. While Dillion jerks Nicks cock, Sebastian slides a vibrating dick-on-a-stick into his hungry ass. Nick is gagged, but his moans are clearly audible as he's jerked and fucked, working him inside and out. He nearly shoots, but Dillion lets go of his throbbing cock and holds back. Soon, Nick is blindfolded and strapped to a spinning wheel, and spun around, while Sebastian and Dillion work his cock with a jerk-off toy. They stop the wheel while Nick is sideways, then continue to work his cock, edging him, and denying him. Sebastian shoves a vibrating plug in his ass while Dillion sucks his dripping wet dick and jerks him until he finally cums. They they torment his cock with overstimulation, and leave him there, spent, suspended against the wheel.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Nick Fitt",
      "person_id": 61381
    }
  ],
  "release_date": "2019-04-02",
  "scene_id": 44089,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Edging",
    "Feet",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Suspension",
    "Tickling"
  ],
  "title": "Inside, Sideways, Upside Down: Nick Fitt Gets Edged Every Which Way"
}