{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Hot tattooed alternative girl Charlotte Sartre works from her apartment, webcamming and selling her small x-rated buttons that she makes and sells online. Her next door neighbor is the tall and beautiful Casey Kisses who is trying hard to study in her apartment but cannot concentrate because of Charlotte's loud rock n' roll music blasting through the wall that they share. Casey pounds the wall in frustration but Charlotte can't hear it so Casey decides to show up at Charlotte's front door to complain. When Charlotte answers the door, the two are immediately smitten and cant believe how hot the other is. Charlotte stops the music and apologizes right away, telling Casey she'll do anything to make it up to her. Casey makes her self comfortable on Charlotte's bed and tell's Charlotte to rub her feet. Without hesitation, Charlotte gets to her knees and takes Casey's shoes and stockings off. Charlotte rubs kisses, sniffs, sucks, and licks Casey's feet and toes. Casey spreads her legs and pulls her big hard cock out of her lace panties and Charlotte crawls to worship it. She sucks and strokes Casey's smooth cock while Casey takes her shirt off, letting her perfect perky tits out to breathe. Casey takes down Charlotte's black leather miniskirt and bends her over to lick her pussy and ass with her long tongue. Casey lays Charlotte down on her back and spreads her legs and shoves her cock into Charlotte's tight slutty pussy. She pounds Charlotte's pussy hard and then flips her over into doggie style to continue with more pussy fucking. Next, Casey switches to Charlottes ass and pounds away while Charlotte presses an hitachi vibrator against her clit and cums hard with Casey's dick buried in her ass. Casey goes back to fucking Charlottes pussy and blows her load deep inside.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    }
  ],
  "release_date": "2019-02-11",
  "scene_id": 44092,
  "tags": [
    "Anal",
    "Bareback",
    "big dick",
    "black hair",
    "Blowjob",
    "bottom",
    "Brunette",
    "Cock Worship",
    "Creampie",
    "Feet",
    "Foot Worship",
    "Hitachi",
    "Leather",
    "natural boobs",
    "Pierced Nipples",
    "Role Play",
    "shaved",
    "slim",
    "smooth",
    "Straight",
    "Tattoo",
    "the wall",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Noisy Nympho Neighbor"
}