{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Shady investment entrepreneur Julia Ann overhears her assistant Jenna Foxx warn new hire Ivy LeBelle about Julia's illegal business practices. She confronts Jenna to lay down the line. She makes Jenna lie across her lap for some OTK spanking right in front of Ivy as punishment for her mouthiness. Julia bares Jenna's round ass for Ivy to admire. Julia orders Ivy to Smack Her Ass. Now it's Ivy's turn. She must humiliate herself by lying across her dominant boss' lap. Meanwhile Jenna kisses and sucks Julia Ann's toes. Both employees, wearing only their underwear, must fall to their hands and knees while Julia spanks and hits their big round asses with a crop until they are both red and throbbing. Julia Ann is pleased. She offers Ivy the chance to suck her pussy. Ivy obediently responds, calling Julia Ann \"mistress\". Indeed, she is learning fast. Ivy is ordered to remove Julia's panties and stuff them in Jenna's mouth. Ivy eagerly uses her tongue on Julia's pussy. Julia orders Jenna to remove Ivy's panties and to lick the new hire's big, luscious ass. Jenna buries her face between Ivy's ass cheeks. Julia spreads Ivy's butt cheeks wide apart while Jenna fucks Ivy's asshole with her tongue. Julia smothers Jenna, pressing her nose and mouth into Ivy's ass and holding her face until Jenna can barely stand it. Now it's time to put Ivy to work. Julia hands her a vibrator to use on Jenna while fingering her pussy. Julia watches Jenna cum while flogging Ivy's big ass. Julia orders the girls to switch positions. Julia flogs Jenna's ass while Jenna tries to hold a vibrator on Ivy's pussy. Ivy cums hard in Julia's arms, getting choked while Jenna holds the vibrator to her clit. Ivy squirts and Julia is pleased. Next Jenna is tied to a table, with clothespins on her pussy lips, then covered with new hire Ivy, with her pussy right in Jenna's face. Ivy's ass is exposed and ready for her bosses strap-on cock. Julia Ann buries her strap-on deep in Ivy's ass, all the while Jenna hungrily licks and sucks on Ivy's wet pussy. Ivy gets quite a pounding, but Julia Ann isn't done yet. Jenna is rotated around on the table and given her own strap-on to fill Ivy's pussy, while the boss gets to work again on Ivy's big ass. Finally its Julia's turn to cum, and what better way than to watch Jenna and Ivy get each other off. Legs wrapped around one another, a single vibrator for both their pussies. Julia Ann anticipates a really good working environment now that she and her employees are on the same page.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ivy LeBelle",
      "person_id": 60683
    },
    {
      "name": "Jenna Foxx",
      "person_id": 59055
    },
    {
      "name": "Julia Ann",
      "person_id": 32896
    }
  ],
  "release_date": "2019-02-28",
  "scene_id": 44091,
  "tags": [
    "BDSM",
    "Big Ass",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Double Penetration",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Foot Worship",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Role Play",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Vibrator"
  ],
  "title": "Smack Her Ass: New Hire Ivy LeBelle Submits To Jenna Foxx & Julia Ann"
}