{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Raven-haired beauty Lydia Black is here today to get beat. Aiden Starr thinks Lydia is a selfish pain whore, only here for her own pleasure. She doesn't like that, but she does like bringing pain to lost little sluts. Aiden uses the zapper on Lydia's butthole and pussy lips while the pain slut is fully tied up. She adds some nipple clamps before suspending Lydia off the floor, like a fresh piece of meat. More clamps go on Lydia's pussy lips. Can this hardcore slut take it? Open and wet, Lydia is hot for pain. Without asking for permission, a vibrator brings her to orgasm, pussy juice dripping down her thigh. Let's see how Lydia likes the cane. Her pussy turns red and puffy, marks across her ass and Lydia begs for more. She needs more. Bound and gagged, Aiden flogs and spanks Lydia's ass. Then more caning of her thighs, ass and pussy. Lydia takes a hard beating. Aiden rewards her with a vibrator on her swollen pussy. Let's see what the cattle prod can do. The cattle prod does its job and Lydia screams and twists and fights to get away but she is tied up tight. Aiden wishes to be thanked for bringing all this pain. She straddles Lydia's face, demanding some love for her own pussy. Lydia buries her tongue deep in Aiden's cunt and is rewarded with an orgasm all over her face. Lydia's thighs and pussy are nice and tender. Aiden straps on a dildo and fucks Lydia's pussy. More flogging keeps everything tender and throbbing. Lydia is released and ordered to get on her hands and knees so Aiden can fuck her in the ass. Lydia loves to be fucked in her whore asshole. Lydia needs all her holes filled at once. Ball-gag in her mouth, dick-on-a-stick in her ass, and the strap-on pounding away at her swollen pussy. Aiden Starr can't let this Pain Piggy leave without getting a fist in her ass. Lydia moans with delight as she rides Aiden's arm to another orgasm.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Lydia Black",
      "person_id": 60714
    }
  ],
  "release_date": "2019-01-31",
  "scene_id": 44090,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "Caning",
    "Cattle Prod",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "Lydia Black is Aiden Starr's Pain Piggy"
}