{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Behind the title and credits, Mario and Doug can be heard jokingly arguing - over Sean’s struggling gagged grunts - about the difficulty of rope-tying anyone up inescapably. Doug says it’s almost impossible; Mario says that’s true, if Doug’s doing the tying. They make a bet. If Mario can tie Sean up inescapably, he will give the boy to Doug for a weekend. The scene opens on Sean, tightly tied into a chair and ducttape-gagged, the two masters drinking beer and watching Sean struggle. Little by little Sean works his hands free, and then his feet, legs and body. When totally out of the ropes, he falls to his knees and bows his head to Mario.\n\nThe bed is down and Sean, standing, and still tape-gagged, is tied up by Mario, hands behind back and in a rope harness. From there he is put on the bed and Mario hogties him. When finished, Mario goes to stand beside Doug and assures him that Sean won’t escape from that. Sean immediately starts struggling. The ropes don’t look tight, but they prove effective. Sean writhes around on the bed, threatened by Mario him that if he doesn’t get free he’ll be tickled.\n\nSean gets tickled. Locked leather restraints and wearing a collar, Sean is spreadeagled on the bed and ruthlessly tickled by Mario and Doug with fingers and feathers. He thrashes around, almost unable to breathe, begging the Masters to stop, his whole body a mass of quivers. Mario blindfolds him. The two masters start tickling him again. Feet, armpits, cock and balls, sides, inner thighs,",
  "directors": [],
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 61819
    },
    {
      "name": "Mario Ortiz",
      "person_id": 61820
    },
    {
      "name": "Sean Patrick",
      "person_id": 61551
    }
  ],
  "release_date": "2018-12-25",
  "scene_id": 44123,
  "tags": [
    "Bondage",
    "brunet",
    "Collar",
    "dungeon",
    "Feet",
    "Gag",
    "Gay",
    "Leather",
    "Leather Cuffs",
    "Male Handler",
    "Male Sub",
    "master",
    "harness",
    "Rope Bondage",
    "Slave",
    "Partner Studio",
    "Threesome",
    "Tickling",
    "Twink",
    "white"
  ],
  "title": "Mario's Boy: Now Get Loose..or Else"
}