{
  "collections": [
    "TS Seduction"
  ],
  "description": "Casey Kisses is not impressed by hipster Lance Hart or the apartment he's trying to rent. It's a gross dump and greedy creeps like Lance are just taking advantage of renters in a horrible housing market. He touches her arm and that's the last straw! She kicks him in the balls, pulls him over her lap, and administers a hard spanking. Lance is taken aback but down to get a little kinky. Casey strips him and spanks this capitalist pig until his ass is red. She pushes him on his knees and tells him to worship her beautiful cock underneath her pantyhouse. Casey's cock grows hard under Lance's tongue and she has him rip open her stockings so he can give her cock the attention it deserves. Lance is on his knees, sucking Casey's cock and licking her glorious asshole. Casey has had enough of this loser's mouth - she wants his ass. She bends Lance over and gives him a good hard pounding. Lance moans as Casey hits his prostate and triggers multiple internal orgasms. Then Lance flips over and gets fucked until he can't hold his load any longer! He cums all over his belly and Casey feeds him his own cum before flipping him over again and fucking his tight ass until she cums. As cum leaks out of Lance's ass, Casey tells him the only way she'll live here is if Lance pays her and services all her friends. Dazed, Lance nods in agreement.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    }
  ],
  "release_date": "2019-03-05",
  "scene_id": 44128,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "Blowjob",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Kinky",
    "Male Sub",
    "natural boobs",
    "Nylons Stockings",
    "Rimming",
    "Role Play",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "switch",
    "top",
    "TS",
    "TS Fucks Male",
    "versatile",
    "white"
  ],
  "title": "Slumlord's Comeuppance: Casey Kisses takes down creep"
}