{
  "collections": [
    "TS Seduction"
  ],
  "description": "Kendall Penny sits at the edge of her bed wearing long leather boots and a short skirt. She waits impatiently for her Task App guy to come over and fold her laundry. Corbin Dallas knocks on the door and when he enters, is immediately apologetic to Kendall for his tardiness. Kendall scolds him for being late and tells him to get on his knees. She grabs her clean laundry and dumps it on his head and tells him to start folding. She sits behind him and makes belittling comments as Corbin, who really wants that five star review, just grins and bears it. She leaves the room for a moment and Corbin folds on the floor at the foot of her bed. He notices metal shackles attached to the bed legs and gets caught examining them. Kendall sits on her bed, kicks one long leg up and tells Corbin to worship her tall leather boots. He licks her boots all the way up and she pulls her hard cock out from her lacy panties. Corbin swallows her whole cock and sucks it with enthusiasm. She buries his head between her ass cheeks then puts him over her knee for some hard ass spankings. Kendall puts him on his back, pulls his head to the edge of the bed and shoves her hard cock down his throat and fucks his mouth. She gets Corbin's ass in the air and fucks his ass raw. After pounding his hole fast and hard, Kendall blows her load in Corbin's mouth and makes him eat every drop. After Kendall cums, she's feeling nice and jerks Corbin's cock, letting him cum as well, but as soon as he blows his load, Kendall rolls him off of her bed and tells him to get out of her house.",
  "directors": [],
  "models": [
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    },
    {
      "name": "Kendall Penny",
      "person_id": 61838
    }
  ],
  "release_date": "2019-02-05",
  "scene_id": 44127,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "Blowjob",
    "Boot Worship",
    "bottom",
    "brunet",
    "Cock Worship",
    "Humiliation",
    "Leather",
    "Male Sub",
    "Role Play",
    "Spanking",
    "Straight",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "white"
  ],
  "title": "Kendall Penny Punishes Task App Guy With Her Cock."
}