{
  "collections": [
    "Divine Bitches"
  ],
  "description": "DJ, like every other man, is a pig and drain on society. Women are fed up with this bullshit. DJ has been stressed out ever since women have been telling their story. His fragile male ego is crushed and is seeking professional help. The stunning Dr. Gia DiMarco has the perfect unconventional therapy for this loser. She blindfolds DJ and bounds his hand in rope. Unable to move, she unleashes physical pain and emotional humiliation on this man. He must repent for his sins, he must learn to respect and worship women, and she is ready to beat that mantra into him. She rips his clothes off, slaps his chest and torments his nipples. His filthy man tongue needs to be taught a lesson and she binds it with clothespins before beating on it with a cane. This filthy loser is getting hard through the treatment and still can’t control his male urges so she pulls out his dick and bits on it. She ties up his cock and balls and torments them before putting on a big strap-on to teach DJ the next lesson. What it feels like to be vulnerable and humiliated. Deep anal strap on fucking gets DJ screaming and Gia turned on with excitement of a man in pain. She pulls out a Hitachi and squirts all over this pathetic man. Finally DJ must learn to worship a woman and must learn that woman come first. She shoves her perfect feet into DJ’s mouth to gag on. He is made to worship her arches. Finally the true test, can DJ withstand his prostate being milked, while his cock is stroked and edged by a beautiful woman. Will he be able to resist his male urges before shooting his load?",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "DJ",
      "person_id": 20225
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    }
  ],
  "release_date": "2019-01-29",
  "scene_id": 44129,
  "tags": [
    "BDSM",
    "big dick",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Caning",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "Hairy",
    "Hitachi",
    "Humiliation",
    "Male Sub",
    "muscular",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Straitjacket",
    "Strap On",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Divine Therapy: Gia DiMarco Uses Unconventional Procedures to Punish"
}