{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Welcome to the Divine Bitches Reformatory for Wayward Men. The stunning Chanel Preston is the head of this house and is responsible for administering a uniquely unorthodox treatment for the men here. Dressed in her medical lab coat, black stockings and tight black dress, she puts black gloves on her hands before approaching her patient Rick Fantana. Rick is a pervert. No two ways around this, he has been in treatment for over a year and is not showing any signs of improvement. Chanel knows it’s time for the next phase, PAIN. Rick Fantana the pervert deserves pain and punishment. Fully restrained with leather straps and an open mouth spider gag, Chanel starts right away. Electric zapper right to the dick. Caning on all of Rick’s sensitive areas. Clamps all over his skin and nipples. Rick screams in pain. Chanel knows the only way this loser man will learn is if she mixes a little bit of pleasure. Rick’s cock gets hard and dripping wet with precum but he is not allowed to cum. Edged over and over again by Chanel, this man wimpers with regret of his past life. Phase two is the most effective. Chanel straps on a huge cock and fucks Rick’s sad hole. This pervert gets off on it and is rock hard again. After the anal pounding, it’s time for Rick to learn how to pleasure a woman. Rick is made to perform cunnilingus on Chanel before she flips him over and uses his pathetic dick for an epic orgasm. Finally Rick must hold his cum, edged over and over again. But, this loser loses it and is made to eat his own cum.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Rick Fantana",
      "person_id": 59599
    }
  ],
  "release_date": "2019-02-12",
  "scene_id": 44131,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "Brunette",
    "Caning",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Gag",
    "gloves",
    "Humiliation",
    "Leather",
    "Male Sub",
    "Medical Fetish",
    "Nurse",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "slim",
    "spider gag",
    "Straight",
    "white",
    "Zapper"
  ],
  "title": "Wayward Man: Nurse Chanel Preston's Unorthodox Treatment for Perverts"
}