{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We don't often brag about our scenes because we believe they speak for themselves. Sometimes, the stars really align and we manage to capture some action while filming that is just Next Level. That is the case with the footage of Bibi Miami, Callie Calypso and Master Bruno. HOT? This scene redefines that word from the jump. As the scene opens, sex slaves Callie and Bibi are tied together with rope, back-to-back, wrist-to-wrist, and kneeling nude on the concrete floor with clothespins on their nipples. They have burlap bags over their heads. Master Bruno enters the room brandishing a leather whip and riding crop. He whips both girls' tits so hard the clothespins fly across the room. The training has just begun. Then, he pours a bucket of water on their heads Gitmo style. Frightened, in pain, but totally turned on, the girls don't know what to expect next. Bruno digs into his toy chest and finds a nasty Violet Wand he uses to shock their nipples and clits into submission. More water bondage, more toys, hard slapping, harder spankings, deep throat blowjobs, deep penetrations into all of their slut holes, and a mind-bending ride on a Sybian fuck machine? and we're only half way through the scene!!! Next, the girls are bound into a 69 position on a bench. Callie has a face dildo on and is fucking Bibi Miami's pussy while Bruno savagely fucks Bibi's mouth and whips her ass at the same time. Get the point? Off the fucking rails! Watch now!",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Callie Calypso",
      "person_id": 54787
    },
    {
      "name": "Marsha May",
      "person_id": 54620
    }
  ],
  "release_date": "2018-12-27",
  "scene_id": 44135,
  "tags": [
    "69 Position",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Breast Bondage",
    "Clothespins",
    "Crop",
    "Deprivation",
    "Dildo",
    "dungeon",
    "Electrical Play",
    "Facesitting",
    "Facefucking",
    "Fear Play",
    "Female Slave",
    "Flogging",
    "gloves",
    "Hair Pulling",
    "High Heels",
    "Hood",
    "Leather",
    "Male Handler",
    "master",
    "Pain",
    "PIV",
    "Pussy Eating",
    "Rope Bondage",
    "Slapping",
    "Straight",
    "Sub",
    "Submission",
    "Sybian",
    "Tattoo",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration",
    "Vibrator",
    "Violet Wand",
    "Water Boarding"
  ],
  "title": "Bibi Miami & Callie Calypso #1 Sexual Disgrace Triple Threat"
}