{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The tables are turned on kidnapper Ruckus as damsel in distress Cherie DeVille breaks free from her bonds! Cherie tells Ruckus she'll pay him directly, but first they have to fake her second abduction so Ruckus won't get in any hot water with his boss. To really sell this story, Cherie knows she'll have to rough Ruckus up real good. She ties him up, clamps his nipples, gags him with rope, and breaks out some implements to get down to business. She starts flogging him, but the flogger just isn't leaving impressive enough marks so she uses a leather slapper and a cane to really get his skin nice and red. Ruckus cries out in pain, rethinking this plan, but it's too late now. He's already at the mercy of Cherie DeVille and his cock is leaking pre-cum as Cherie gets at every exposed piece of skin. The next step in an good abduction, as Cherie knows, is wrecking the victim -- sexually. Cherie straps on a long fat hard cock and stretches Ruckus' ass open. She fucks him, jerks his cock, and punches his chest until he admits he's a slut for her dick and begs to cum. Ruckus is so desperate, but no one cums before Cherie! She rides his face voraciously while cropping his body and Ruckus struggles to breathe while pleasing his captor. Unsatisfied with his oral skills, Cherie turns her attention to his hard cock. She rides it to multiple orgasms as Ruckus quivers beneath her before making him beg to cum. She teases his cock and pushes a vibrator into his balls. She finally lets him blow his load and wipes it off with her stocking-clad feet before making him lick her stockings clean.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2019-02-26",
  "scene_id": 44130,
  "tags": [
    "Athletic",
    "BDSM",
    "Blonde",
    "Bondage",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Kidnapping Play",
    "Leather",
    "Male Sub",
    "multiple orgasms",
    "Nipple Clamps",
    "Nylons Stockings",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slapper",
    "Slave",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "unshaved",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Reverse Abduction: Cherie DeVille outwits her captor and takes control"
}