{
  "collections": [
    "CFNMEU"
  ],
  "description": "Robin Valej has a bad back and phones a massage service to arrange some treatment. Not long afterwards a very sexy girl arrives to massage him. She tells Robin to remove his clothes and hs strips down to his underwear laying, face down, on the bed. The masseur starts to work on Robin's back, straddling his ass as she works. She soon has his underwear pulled down a little so that she can massage Robin's ass too. He reaches down and pushes the underwear further off his ass. Then the masseur takes the underwear off him completely, working her hands over his sexy ass. She spreads Robin's legs, exposing his cock and balls as she drips cream onto his sexy ass. As she works she parts Robin's cheeks showing off his hole. Then she has Robin turn over and starts to work on his legs and his chest. His cock lays on his belly as the girl's hands run all over his body. Soon her hands are rubbing over Robin's cock too and she then moves him, tying his hands to the bed frame. She leans forward and licks his cock, which gets nice and hard. Then she sucks the cock too, as Robin lays back and enjoys it. But the girl has more in store for him. She produces a dildo and makes Robin suck on it. She shoves the dildo right down his throat, and slaps his face with it. Then he pulls Robin's legs up and shows off his ass hole. She lubes his hole and shoves the dildo into his ass as he has another stuffed into his mouth. Robin moans as his hole gets filled with the dildo which is fucked in and out. The girl shoves it in deep and leaves it in place as she spanks Robin's ass. She wanks his stiff cock too and then takes a belt of his ass while the dildo is still deep in his hole. His mouth is filled with the other dildo too. All the while his cock stays hard and gets wanked from time to time. Then he is turned over, onto his knees and the girl fucks him with her strap on cock. He moan as she fucks him deep and hard. Continuing to fuck him she turns Robin over and he wanks himself to a big, creamy, climax. Then he has his ass spanked again before being sent off to the shower.",
  "directors": [],
  "models": [
    {
      "name": "Pidzemellya Hospodynya",
      "person_id": 61363
    },
    {
      "name": "Robin Valej",
      "person_id": 60769
    }
  ],
  "release_date": "2019-01-02",
  "scene_id": 44148,
  "tags": [
    "Anal",
    "Athletic",
    "black hair",
    "blond",
    "Bondage",
    "Dildo",
    "domestic",
    "Femdom",
    "foreskin",
    "Kinky",
    "Lingerie",
    "Male Sub",
    "natural boobs",
    "Pegging",
    "Rope Bondage",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "thirdparty",
    "white"
  ],
  "title": "Escort Massage"
}