{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Sean on his knees, hands behind back, sucks Mario’s cock; Doug stands behind him. Involuntary deepthroating. Mario orders Sean to play with his own dick. Sean again sucks first Mario’s cock, then Doug’s, then tries to get both cocks in his mouth together. Sean and Mario kiss as they share Sean’s mouth. Doug jerks Mario’s cock as Sean sucks Doug’s. Mario plays with Doug’s nipples as the two masters kiss.\n\nSean, gagged with black tape and collared, stands head bowed, hands behind back, as the two masters lock leather ankle restraints on him; he then offers his wrists for wrist restraints. Doug lowers a trapeze from the ceiling and Sean’s wrists are attached to either end of it. Mario brings out an inverted T-shaped steel device, an anal impaler, the short bar of which they attach to Sean’s spread ankles, then greases up a butt-plug and inserts it in Sean’s ass at a height impossible for him to evacuate. At Mario’s order, the trapeze is raised so Sean is already standing on his toes. Both masters play with Sean erotically. Mario sucks the boy’s cock while Doug licks his gag and orders Sean to kiss him through it. Doug licks Sean’s ears, pinches his nipples. Doug handgags Sean with one hand as he plays with Sean’s nipples with the other. Mario continues sucking Sean’s long, hard dick, slaps it and sucks it again. Mario stands up, sucks Doug’s proferred thumb for a moment, then sucks Sean’s nipples. They do a threesome with the bound boy, who lets himself succumb to every sensation. Mario jerks Sean’s dick, licks Sean’s armpits. Mario takes Sean’s cock in his mouth, jerking himself off, while Doug behind Sean plays with his own cock and slaps it against Sean’s impaled ass. Doug comes around in front and licks Sean’s nipples. Sean zones out, fucking himself on the anal impaler.",
  "directors": [],
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 61819
    },
    {
      "name": "Mario Ortiz",
      "person_id": 61820
    },
    {
      "name": "Sean Patrick",
      "person_id": 61551
    }
  ],
  "release_date": "2019-01-01",
  "scene_id": 44143,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Collar",
    "Dildo",
    "dungeon",
    "Gag",
    "Gay",
    "Leather",
    "shaped",
    "Slave",
    "Tag Team",
    "Partner Studio",
    "Threesome",
    "Twink",
    "Uncircumcised",
    "white"
  ],
  "title": "Mario's Boy: The Anal Impaler"
}