{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Dee williams is a legit Grappler. She is a Purple Belt in Brazilian Jiu Jitsu and she has a lot of mat experience under her belt. She’s super competitive but she’s also super submissive. She also is a big whore for orgasms and if she is close to getting some guys face on her cunt or buried into her pussy, she easily gives up control just to get her sexual satisfaction fulfilled. This is all fun and games until she starts losing in the Judges eyes. This is a Winner fucks loser style sex fight. The better sex fighter WILL win and HE WILL be able to do what ever he wants to her. Jay West is one of our smaller gentlemen but he has magnificent balls of steel that can be pulled, stretched, slapped and punched and all it really does to him is give him a boner and when he gets a boner, he actually starts to wrestle harder. Darling puts Jay into some insanely painful holds. She gets him into a banana split and slaps his balls, slapping and tugging them. She hold him down by the throat and torments his nut sack with her hand and her teeth. Jay’s boner powers activate and his wrestler starts to come out. He is able to pin Dee, shoulders down, nipples getting licked, Dee panics and turns into a damsel in distress. Is This enough to win Jay West the match? The loser is announced, the Winner takes their prize. The loser is made to cum with squirting orgasm all over the place. The winner gathers all the cum and makes the loser eat their own cum",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Jay West",
      "person_id": 53166
    }
  ],
  "release_date": "2019-01-01",
  "scene_id": 44141,
  "tags": [
    "Big Tits",
    "black hair",
    "Blonde",
    "bottom",
    "CBT",
    "Choking",
    "Humiliation",
    "Kinky",
    "MILF",
    "mixed",
    "Muscle Worship",
    "natural boobs",
    "sex fight",
    "shaped",
    "shaved",
    "Slapping",
    "slim",
    "Smothering",
    "Squirting",
    "Straight",
    "Submission",
    "Partner Studio",
    "white",
    "Wrestling"
  ],
  "title": "Big Tittied Blonde Destroys Man with Ball Busting then Fucks him"
}