{
  "collections": [
    "Str8Hell"
  ],
  "description": "In this raunchy sex scene we find Ondra Matej in the gym working out. He is a big muscle guy who really knows about fitness. Alan Milek arrives and is a slim, novice to fitness. Ondra gets right to work on him, but Alan doesn't really respond correctly. So Ondra takes charge, deciding he will get something else instead. He soon has Alan's shorts and underwear down, finding a rock hard cock. Ondra slaps at the cock and then starts wanking it. He drops to his knees and takes the cock in his mouth, working his head up and down on the shaft. He really sucks that cock well and then holds it up as he slaps as Alan's balls, making him flinch. That gets a response from Ondra who takes a whip to Alan's slim, sexy body. As he is whipped Alan's dick stays rock hard, so he clearly enjoys the attention. He is pushed to his knees and his mouth placed onto Ondra's stiff dick. Alan eagerly licks and sucks that thick cock and licks at the balls. Alan loves that big cock and his head fucks itself onto it, hard and fast. Then as Ondra lays down Alan climbs on and slides his ass down over the cock. He rides the cock as hard as he can, taking it deep, as his own cock stays hard. Ondra wants to fuck hard, so he gets Alan bent over and rams his cock in and out, from behind. His dick stretches that eager hole, working it so well. Ondra moves to spoon, and as he fucks harder and faster Alan grabs his own dick and wanks it. As he wanks his cock explodes, shooting the cum right up his chest. That sets Ondra off too, he pulls out and dumps his cum over Alan's chest and face. Then Alan sucks the spent cock, draining it of every last drop, to complete his training session.",
  "directors": [],
  "models": [
    {
      "name": "Alan Milek",
      "person_id": 61831
    },
    {
      "name": "Ondra Matej",
      "person_id": 60758
    }
  ],
  "release_date": "2019-01-02",
  "scene_id": 44146,
  "tags": [
    "Anal",
    "Blowjob",
    "Bondage",
    "Facial",
    "Flogging",
    "Gay",
    "In The Gym",
    "Muscle",
    "slim",
    "Straight Stud",
    "Stud",
    "thirdparty",
    "Twink",
    "Uncircumcised"
  ],
  "title": "Raunchy"
}