{
  "collections": [
    "Families Tied"
  ],
  "description": "Stirling Cooper strolls back into his sister-in-law's home like he owns the place after many years away. Caught by his brother for having a hot BDSM affair with his wife, Krissy Lynn, Stirling has been banned for years. Using the holidays as an excuse, Stirling gets back into Krissy's head and hot cunt, putting her submissive sexual desires to use on the living room floor. Krissy pleads for Stirling's thick cock in her mouth and cunt, but first she must have her gorgeous MILF ass reddened with a flogger, spanking, and paddle as she rubs her own pussy and ONLY cums with permission. Handcuffed and gagged, Krissy's huge tits swing with tight nipple clamps from the force of Stirling fucking her from behind. Moaning through her ball gag Krissy begs for more, and is rewarded with an anal fucking with Stirling's tie tight around her throat. Writhing with a hard cock in her pink ass Krissy starts working up for another huge orgasm when her brat step-daughter comes into the house unexpectedly.\nPanicked she's going to be caught playing her little whore games, Krissy handcuffs Stirling, who is eager to see his niece after all these years. Locked to the bannister, Stirling is furious, but he has no choice but to wait for Krissy to return and let him out. Unlucky for him, it is not Krissy, but his now grown niece that finds him locked up with a huge boner in the family den. Hot bodied little teen bitch Gia Derza is unsentimental, and quickly goes to work punishing her step-mother and uncle with a social media blackmail scheme. Whipping out her phone, Gia starts videotaping herself sucking her uncle's dick and calling her mother out as a whore. By the time Stirling breaks the railing to get out of his bind the damage is done and there is nothing left to do but punish Gia's ass. Throat fucking her pretty little face is only the start, and Gia is brought through her paces, having her young tits flogged hard, her sensitive little clit cropped, and her tight ass thoroughly fucked. She is undisciplined and can barely keep her hands out of the way so he ties her arms in a strict strappado and ride her hard until she is begging to cum with his dick deep in her ass. This isn't the end of the day, but just the beginning. Stirling decides to have a family reunion, tying Gia in a tight shibari partial suspension, covering her in her first zipper ever and clamping a heavy vibrator to her sensitive teen clit. Krissy comes home from caroling to find her big slutty secret laid bare and all she can do is give into her urges and submit to an evening of sexual BDSM games and punishing her little teen nightmare and getting her pussy filled with cock.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Krissy Lynn",
      "person_id": 19730
    },
    {
      "name": "Gia Derza",
      "person_id": 61617
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-01-18",
  "scene_id": 44153,
  "tags": [
    "Ball Gag",
    "BDSM",
    "christmas",
    "Family Roleplay",
    "Gag",
    "holidays",
    "MILF",
    "Nipple Clamps",
    "Paddle",
    "Spanking",
    "Straight",
    "Suspension",
    "Vibrator",
    "Whipping",
    "Zipper"
  ],
  "title": "Unruly Niece Gets A Fat Cock in Her Ass"
}