{
  "collections": [
    "Everything Butt"
  ],
  "description": "London River is hoping to reach some challenging fitness goals so she goes to Dana's Butt Building Emporium to make that happen. Dana DeArmond is known for her unorthodox methods but still she is the best and London wants results so she decides to trust Dana and boy oh boy is she in for a treat. Unlike other gyms Dana's philosophy is that you have to work out the whole butt including the butthole because after all, change happens from within. So using a very hands on approach Dana strips London's clothes off to see what she's working with and realizes right away that London has a solid foundation but there is lots of work to do. Starting with a warm up Dana puts London on all fours and squeezes, shakes slaps and sniffs London's curvy ass. Spreading her butt cheeks apart, Dana goes right in for a taste. She fingers and stretches London's hole to loosen her up for all the equipment she has to use for her workout. First Dana slides a metal hook into Londons ass and fucks her with it while she rubs her pussy. London is already breathing hard when Dana uses the Hitachi on her clit and makes her scream and cum hard. Moving into a squat position London spreads her ass open and slides onto a tapered ribbed butt plug to really work that booty. It's hard to balance so Dana gives her something to hold onto-her ass! So now she is not only working out her butthole, glutes and legs, she is also working her tongue out as she licks Dana's asshole and vibes her pussy until she is shaking and moaning and cums real good. After their warm up Dana crams a big strap-on dildo down Londons throat and fucks her face to get her cock all wet and slippery cuz you know what she's gonna do with it. Up on all fours Londons ass is high in the air and ready for that hot action so Dana glides it in her ass and stirs it around. Londons big tits jiggle back and forth as she fucks Dana's thick dick making her ass ooze with white sticky cum. Then she flips over and gets a good ass fucking on her back. Dana knows how to work that strap on and pounds London's ass with sexy expert moves until London is over the top with multiple orgasms. Dana checks the gape, cleans it up with her tongue and gets back to London's slutty asshole. This time with her fist! Finger by finger, Dana makes her way into Londons tight hole until her fist is all the way in, filling her up. London looks and sounds like she is in ecstasy as Dana fists her butthole until she cums again and again. Now that London's ass is getting a good work out, Dana stretches her hole even more wide open with a speculum and fingers her pussy so we can see the inside of her ass as she cums. Then Dana fucks her with a big wide acrylic butt-plug giving us another deep view into London's juicy ass. Now its Dana's turn so on her back with legs spread wide open, London works in most of her hand to Dana's butthole and vibes her pussy until her eyes roll back in her head and she has an epic orgasm. For the final part of her training London gets an enema which she takes like a pro. Workout complete! Dana's Butt Building Emporium will get a great review on Yelp.",
  "directors": [],
  "models": [
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2019-02-22",
  "scene_id": 44158,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Tits",
    "bottom",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Enema",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "natural boobs",
    "other hair color",
    "shaved",
    "Speculum",
    "Straight",
    "Strap On",
    "toned",
    "top",
    "white"
  ],
  "title": "Dana's Butt Building Emporium"
}