{
  "collections": [
    "Families Tied"
  ],
  "description": "Sovereign Syre brings her new fiance Stirling Cooper to her rich step mom’s lavish vacation\nhome. As soon as they are in the door of the mansion he has her pressed against the wall,\npulling out her luscious big tits and round ass. Unbeknownst to the couple, they are being spied on. Sovereign’s little step sister Maya found out that Sovereign was using the house for the weekend. Maya spent the previous summer as Sovereign’s secret submissive lesbian slut, serving her every sexual need behind their unsuspecting parents backs. Maya had thought this would be the perfect chance to rekindle their taboo relationship, but instead she has to rub her own lonely clit while watching Stirling flog her sister’s thighs and tits. Sovereign crawls into the bedroom for a hard spanking and bondage in a handcuffed spread eagle. Stirling slides his thick cock into Sovereign, railing her missionary and doggy. Maya blows her cover when she cums, alerting Stirling to her presence and resulting in a chase around the house. Sovereign has to come to Maya’s rescue, introducing Stirling to her annoying little sister. Mischievous little bitch Maya won’t let go of her lesbian obsession easily, and tries to blackmail Stirling, threatening to tell her parents that he is a pervert. Stirling throws her over his knee and spanks her teenage ass while choking her with her own braids. He rips off her clothes to slap her perky little tits, then pushes her onto her knees and brutally fucks her throat. Sovereign walks in on the scene, but sees through her sister’s ruse and tells Stirling to keep enjoying Maya’s mouth. Sovereign gets out her strap on and Maya finds herself exactly where she wanted to be: with her pussy impaled on her sister’s dildo. Sovereign pushes her strap-on into Maya’s tight asshole and makes her ride it as Stirling canes her pale thighs. Once Sovereign has her fill, Maya’s eyes roll back in her head as she gets a brutal anal ride on Stirling’s fat cock. Sovereign and Stirling tie Maya up in a painful partial suspension and cover her little tits in tight clamps. Sovereign lesbian cuckholds her little sister, sucking her fiance’s cock and teasing Maya’s hungry holes. When Maya can’t take it anymore Stirling fucks Maya hard in her tight bondage while Sovereign rips off her sister’s zippers. With the little sister now turned into a submissive fuck toy for the couple’s BDSM games, Stirling can now use all of their holes for his pleasure. He fucks Sovereign’s wet pussy, then pounds both of Maya’s holes, while her sister rides her face, smothering her with her juicy ass. Once Maya is pounded out like a good little anal whore, Sovereign gets Stirling’s dick in her mouth straight from her little sisters ass and teaches her little sister her final lesson: how to take a load of hot cum.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Sovereign Syre",
      "person_id": 44486
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-02-01",
  "scene_id": 44154,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Big Tits",
    "Bondage",
    "Brunette",
    "Caning",
    "Choking",
    "Corporal Punishment",
    "Couple",
    "Curvy",
    "Dildo",
    "Family Roleplay",
    "Flogging",
    "foreskin",
    "Humiliation",
    "Lesbian",
    "natural boobs",
    "other hair color",
    "shaved",
    "Smothering",
    "Spanking",
    "Straight",
    "Strap On",
    "Suspension",
    "the wall",
    "white"
  ],
  "title": "Little Lesbian Stalker Sis Trained as Sex Toy"
}