{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Mona Wales is lying on her back with her hands tied behind her. Her ankles are bound, her mouth is gagged, and there's a faint buzz that can be heard beyond her struggled moans. The perspective shifts to reveal a spreader bar keeping her legs apart and a giant vibrator strapped to her inner thigh. She squirms and pants, rolling around as the vibrator pulses pleasure onto her swollen, dripping cunt. She manages to land on her stomach and lets out a loud moan. Getting a grip on some of the rope, she begins her attempt at freeing herself. Rolling around some more she flexes her core and is able to prop herself up into a sitting position. She continues to pull at the knots behind her back and winces as she tries to untie herself. With a lot of persistence she is finally able to release her hands. Writhing around she struggles to pull the rest of the chest harness apart. With a free hand she adjusts the vibrator to make it press harder onto her clit. She continues to pull at the harness and eventually its knots begin to unravel. She grunts as she pulls and pulls at it. The ropes are getting loose and starting to droop around her body. Exasperated, she falls backward onto the floor and presses the vibrator harder against her dripping pussy. As her orgasmic panting increases she unties the spreader bar from her ankles. With the only ropes left on her bare body being the ones strapping the vibrator to her cunt she takes out her ball gag and cums hard pointing her toes the whole time. Now she takes the vibrator into her hands and pleasures herself while untying the rest of the rope.",
  "directors": [],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2019-01-03",
  "scene_id": 44159,
  "tags": [
    "Ball Gag",
    "Bondage",
    "Cuckolding",
    "Femdom",
    "Fetish",
    "Gag",
    "harness",
    "Solo Female",
    "Straight",
    "thirdparty",
    "Vibrator"
  ],
  "title": "Struggling in Bondage: Mona Wales"
}