{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "I’m not sure how I survived my last session with my new Master. I’m not sure how long he used my mouth and pussy. His slave training is very strenuous. When I was able to leave, everything was so sore, as if I was disgraced for days. Maybe I was. I felt the same thing again. I was grateful he left me blindfolded in his dungeon with wrist and ankle cuffs. I weakened so fast the way I was bound before. But it turned out this time wasn’t better. It was easier for him to throw me around, grab my head and bounce it up and down his dick. I thought I gagged a lot before. He broke my record. Every time he skull fucked me, I had to push myself away or I’d vomit. He didn’t care. He inserted his dick right back in my throat, going as deep as he could. When he was tired of my mouth, he threw me up on a crate and let me feel his dick deep up my pussy, opening it up for a snug fit. He’s so rough, grabbing the sides of my mouth tight to fuck me hard and fast. He wanted to cum this time so he wasn’t going to quit until he did. I wanted him to cum quick, but I never get what I want with him. I left with a sore jaw and throat this time.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Kayleigh Nichole",
      "person_id": 61351
    }
  ],
  "release_date": "2019-01-03",
  "scene_id": 44150,
  "tags": [
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "Deepthroat",
    "drool",
    "dungeon",
    "Facefucking",
    "Hand Gagging",
    "Latinx",
    "Leather Cuffs",
    "master",
    "Mouth Spreader",
    "natural boobs",
    "PIV",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "Swallow",
    "switch",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "versatile",
    "white"
  ],
  "title": "Kayleigh Nichole is Back for More Slave Training"
}