{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "The beautiful Kira Noir waits on a black leather chaise lounge. She nervously twiddles her thumbs, looking down in shame. She seeks psycho therapy by recommendation of her doctor for her extreme addiction to strange dick. For too long she's been having an unhealthy craving for cock. Every day she gets fucked by random strange men that she just met. Her therapist Dr. Stirling Cooper takes a seat next to Kira and she tells him everything. What Dr. Cooper suggests is an \"Immersion Therapy\". He summons four guys to enter his office and explains to Kira that the men are there to do as they please to her. The amount of dicks would certainly fuck the slut right out of her. The men all grab and grope at her tits and pussy through her clothes. They take her to her knees and and pull out their hard cocks. They stuff her mouth and fuck her throat as she drools all over herself feasting on their dicks. They strip her naked and tie her up in rope bondage. On her stomach, Kira's arms and legs are tied together behind her, making her fit body arch upward. Once again they use her mouth to please their cocks while Dr. Cooper administers shock treatment and zaps her with his electronic zapper. Next they tie Kira in a full rope suspension. Her legs are tied spread-eagle with her pussy and ass at just the right height for their cocks. They pound her pussy hard and then her ass with their big dicks and Kira wants more so they untie and take her down to double penetrate her holes. Kira gets fucked airtight with a dick in her pussy, a dick in her mouth, and one in her ass. She begs for their cum and they glaze her face with their fat loads.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-02-20",
  "scene_id": 44157,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Doctor",
    "Double Penetration",
    "foreskin",
    "Gangbang",
    "Leather",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Suspension",
    "toned",
    "top",
    "white",
    "Zapper"
  ],
  "title": "Kira Noir: Cock Crazy"
}