{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Sean is tied down on the floating bondage board. Mario tells him to say goodbye to his chest hair, which he does. Mario inserts a fat plug gag in his mouth, powders Sean's chest and proceeds to shave it. Little by little all of the hair on Sean's chest and around his nipples is removed. Mario next shaves the hair from Sean's navel down. And finally, Mario starts on Sean's crotch, rubbing the powder over it and shaving away, until the boy's pubic region, including taint, asscrack and asshole, are as soft and smooth as a baby's. When completed, Doug comes over to hear Mario tell him, \"He's all yours.\"\nThe Electric Clothespin Game. A bunch of clothespins are spilled on the board beside Sean's head. Doug tells Sean they're about to play a little game. He puts an electric egg up Sean's ass, and proceeds to attach electro bands to Sean's cock and balls. Doug removes Sean's gag and pushes a button on the tens unit. Shawn's body convulses. Doug tells Sean that that's part of the game, and gives him a kiss. Then Doug starts applying clothespins down each side of Sean's chest, 10 to a side. He flicks each of them and counts them off. He blindfolds Sean, then tells him he's going to start flicking the clothespins, and Sean will have to tell him which pin he has flicked. Every time Sean gets it wrong he gets a shock, and Sean gets it wrong often. Doug starts removing the pins; Sean has to identify each pin as it is removed. Finally they are down to the last pins, the ones on Sean's nipples. Doug removes them and massages Sean's nipples and chest.",
  "directors": [],
  "models": [
    {
      "name": "Sean Patrick",
      "person_id": 61551
    },
    {
      "name": "Doug Jeffries",
      "person_id": 61819
    },
    {
      "name": "Mario Ortiz",
      "person_id": 61820
    }
  ],
  "release_date": "2019-01-08",
  "scene_id": 44163,
  "tags": [
    "Blindfold",
    "Bondage",
    "buttplug",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Discipline",
    "dungeon",
    "Electrical Play",
    "Electro Plug",
    "Electrode Punishments",
    "Gag",
    "Gay",
    "Leather Cuffs",
    "Rope Bondage",
    "shaved",
    "smooth",
    "Suspension",
    "Tens Unit",
    "thirdparty"
  ],
  "title": "Mario's Boy: Sean Shaved, Pinned, and Electrified"
}