{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Deep in no mans land there's a farm rich in underground shale oil. Syren de Mer is a sexy oil exec who tries to convince the buxom farmer, Ryan Keely, to sell her land, but the only drilling this hot and sexy farmer is allowing on her land is deep in this execs holes. Feeling a little isolated from the world, she takes advantage of the sexy execs presence and shows her a good fracking time. She takes down Syren De Mer and preps her nice juicy booty with some spanking. Ryan then smothers Syren's face with her big juicy ass and gives her a taste of her sweet pussy. Ryan then ties and suspends Syren De Mer. She gives her a little pain before pleasure with a bit of caning and cropping. After dishing out a bit of pain on Syren's booty and feet, she takes a big dick-on-a-stick and gives her a good fucking. The filthy little exec begs to cum as she gets drilled by Ryan's dick on a stick. Ryan hits the right spot and makes Syren gush like an oil well, leaving a big wet mess all over the barn floor. Ryan then gives Syren a good flogging on her booty, leaving it nice and red before going deep inside of her with her strap on cock. She fucks Syren hard, showing her how a good drilling is done. Syren begs to cum over and over as she is ready to gush. Ryan then shoves her cock deep in Syren's ass. Now Ryan's ready to get her own pleasure. She scissors Syren and uses her body until she gets her orgasm. This dirty little exec will think twice before trying to take another country gal's farm.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ryan Keely",
      "person_id": 15370
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2019-03-14",
  "scene_id": 44166,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Bondage",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Kinky",
    "Latin",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "Redhead",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Kinky Lesbian Barn Babes"
}