{
  "collections": [
    "Device Bondage"
  ],
  "description": "Julie Night Live, Part 1\nJulie's second visit to Device Bondage was scorching hot. Way too hot for Julie as she soon finds out. Julie's poor pussy and anal pucker are rendered aflame as cyd starts off the six hour live show by smearing a liberal amount of his special \"lava\" sauce into the folds of her labia and into her tight pink rosebud at the request of sadistic DB members who clamor for it in the live show chatroom.\nJulie begins to whimper as cyd takes time to vigorously rub her clit and clit hood to ensure that the pores open up and take in as much of the concoction as possible, thus ensuring that the burning sensation will reach its maximum effect. The sauce is not even fully applied yet and the incredible discomfort is already obvious from the expression on Julie's face. Though Julie agreed to experience the sauce prior to the show, she now urgently pleads with cyd, fervently begging him to release her from the agony that relentlessly builds between her thighs with every passing moment.When cyd re-iterates his initial warning to Julie: Once the sauce goes on, there is no way to stop it or reverse it. One must simply endure the twenty or so minutes that it takes for the salve to run its terrible course. She frantically twists her head around, her eyes wide open bearing a wild, almost inhuman gleam.In the end, Julie digs down deep inside herself and finds a reserve of inner strength to draw upon and persevere through an ordeal that would have broken the spirit of someone with lesser character.\nMeanwhile, as Julie endures her torment for members watching the show live around the globe, Devaun, the \"decoration\" model for the show, provides some additional eye candy as she suffers through her own predicament, her neck and wrists trapped in a heavy set of wooden stocks. Gagged and drooling, she kneels on a patch of cold, rough concrete floor where cyd has scattered uncooked grains of rice where they will painfully dig into her knees while also serving to prevent her from finding even the slightest respite from her position.Overall, this show featured some of the most intense bondage and brutal positions that Device Bondage has released to date. Enjoy.",
  "directors": [],
  "models": [
    {
      "name": "Devaun",
      "person_id": 14316
    },
    {
      "name": "Julie Night",
      "person_id": 11190
    }
  ],
  "release_date": "2007-08-11",
  "scene_id": 4416,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Gag",
    "Handler",
    "Hood",
    "Humiliation",
    "Metal Bondage",
    "Pain",
    "Stocks",
    "Straight",
    "Submission"
  ],
  "title": "Julie Night Live, Part 1"
}