{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Poor Kacie Castle can't stop obsessing about sex and bondage with other women. She's so consumed, she can't even concentrate when speaking with her therapist Sinn Sage. Sinn takes advantage of this, and puts Kacie over her knee and spanks her. She informs Kacie that she will learn how to take a pounding today, since it's clearly the only way to cure her. Sinn spanks Kacie's ass red, pinches her nipples and slaps her breasts. But soon Kacie's puffy, wet pussy is also begging for attention. Kacie is stripped naked, handcuffed, and her dirty underwear is stuffed into her mouth. Sinn applies clamps to Kacie's tender nipples. Sage pulls out her flogger and uses it on Kacie's pussy and nipples. Hard blows that sting and gets Kacie wet. Sinn is so mean to Kacie's beautiful little titties, slapping, sucking, and biting them. Next Kacie has to lick and kiss Sinn's shoes. Sinn flogs Kacie's ass and tells her that Kacie's happy place is when someone tells her what to do and fucks her. Kacie finds herself upside down on the patient's couch, bound with rope, clamps held painfully tight across her torso. Sinn sets her big fat ass on Kacie's face, then teases Kacie by holding her pussy inches from Kacie's face. After some pussy slapping, Sinn sits on Kacie's face. Now it's Kacie's turn, and she is eagerly dutifully rewarded by tongue fucking her asshole. Unable to wait any longer, Sinn grabs her vibrator and straddles Kacie's face to cum hard. Squirting and soaking Kacie's face. She makes Kacie understand that her place in life is to simply be a dirty cum rag. Kacie is suspended in tight rope harness, ball gag to keep her quiet, her holes exposed to Sinn's sadistic whims. With Sinn behind her, Kacie has no idea what will happen until she feels Sinn's large strap-on dildo enter her pussy. Fucked hard and relentlessly. This is the therapy she needed. Kacie is put on the ground to get ass fucked. Ass up in the air, vulnerable to Sinn's predations. Sinn pounds Kacie's ass, opening her asshole and driving the strap-on dildo deep into Kacie, who has her face pressed into the office carpet. The ball gag makes it difficult for Kacie to moan with pleasure. She will have plenty to fantasize about later when her doctor's visit ends.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "Sinn Sage",
      "person_id": 19154
    }
  ],
  "release_date": "2019-04-25",
  "scene_id": 44169,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Big Ass",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Dildo",
    "Doctor",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nipple Clamps",
    "Pussy Eating",
    "harness",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "Slave",
    "Small Tits",
    "Spanking",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Diagnosis: Sinn Sage Treats Kacie Castle For Her Kinky Obsessions!"
}