{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Its the Fuck Love Party of the year and everyone is having fun except for poor little Delirious Hunter. She sits on the couch like a sad slutty party pooper while the party raves around her. A game of spin the bottle seals her fate as she gets a steamy hot kiss from the super sexy and gorgeous Leigh Raven. They make out until they realize they are the only ones left in the room. Leigh takes the opportunity to dom this party pooper slut and show her how to have a good time. She turns Delirious around and gives her nice ass a good spanking. She then makes her lick her heels and worship her feet. Leigh pulls her skirt up and makes Delirious work her mouth on her hot wet pussy. Delirious then appears tied up with her breast full of clothes pins. Leigh gives her a little punishment for being so lame at the party. She canes her feet and teases her with a few shocks from the zapper. Leigh then rides Delirious's beautiful face while she teases the clothespins on her titties. She uses Delirious's face for a few orgasms then gives delirious a little tease and denial. She works her pussy with her fingers until she squirts all over her hand. Leigh keeps finger fucking her with more tease and denial until it's time to strap on and fuck her hard. Delirious takes Leigh's big cock all the way like a slutty party pooper. Gagged and tied up, she is happy to please her new mistress with all her holes. Leigh turns her around and fucks her ass nice and hard until she cums. Leigh then gets a few more orgasms out of her face. They end the party with a boom and cum together a few more times before calling it a night. Leigh just gave this party pooper a night to remember.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Leigh Raven",
      "person_id": 59527
    },
    {
      "name": "Delirious Hunter",
      "person_id": 56555
    }
  ],
  "release_date": "2019-02-14",
  "scene_id": 44165,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Caning",
    "Clothespins",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Hitachi",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pain",
    "Pussy Eating",
    "Role Play",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Zapper"
  ],
  "title": "Fuck Love Party: Leigh Raven And Delirious Hunter Clear The Room"
}