{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Mona Wales and Pepper Hart are the perfect strangers for a hot and steamy night of wild lesbian sex. This kinky hookup starts with a hot make-out session. Mona starts fingering Pepper’s pink little pussy while pinching and sucking on her nipples. Pepper starts moaning and getting close to cumming, but Mona isn’t quite ready to let her have it. She has this sexy little stranger, hot and wet in her grasp, eager to do anything to cum, so she takes advantage of her for a little while longer. Mona strips Pepper of her clothes, then begins to test her limits. She pins her against the wall and slaps her tits and thighs. She gives her a few abdominal punches to test her core. She then takes Pepper to the bed for some over-the-knee spanking, where she gets Pepper’s nice round booty red and rosy. She starts fingering Pepper’s wet pussy and makes her beg for her orgasms. Pepper is then tied up and suspended over the bed in the perfect position to lick Mona’s pussy. Mona cums a few times then turns around and shoves Pepper’s face in her ass. She puts punishing clothespins on her sensitive nipples then turns her around to lick her pussy. She teases Pepper with her fingers and a vibrator, making her beg to cum again. She then seals Pepper’s pussy with more clothespins and continues to vibrate her pussy while she painfully slaps the clothespins off. Mona allows Pepper to cum a few more times for being a good submissive slut, but she then uses a big strap-on to fuck her hard in her tight little pussy. After using her dripping cunt, she fucks Pepper in her tight ass, using every hole for her own pleasure. Mona then shares a vibrator with Pepper so they can cum together one last time.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Pepper Hart",
      "person_id": 58839
    }
  ],
  "release_date": "2019-03-28",
  "scene_id": 44167,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "Redhead",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "the wall",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Kinky Lesbian Hookup: Mona Wales Torments and Fucks Hot Redhead!"
}