{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Report on recruit Jane Wilde. Female. Age 20. Recruit Wilde's qualifications for Operation Catfish are excellent and she has been delivered to Special Agent Chanel Preston for one-on-one examination and training using the following methods. 1: Recruit bound to a chair. Agent Preston will strip her naked, spreading her legs and exposing her pussy. Breasts groped, slapped. Nipples squeezed. Thighs slapped. Pussy slapped and fondled. 2: Recruit Wilde is blindfolded. She must learn to remain focused despite intense sexual stimulation. Agent Preston stimulates her with fingers deep in her pussy. Every body part must be tested, especially inside. Recruit Wilde is found to easily cum when a vibrator is applied to her clit along with Agent Preston fingering her pussy. 3: Recruit Wilde is bound to a mattress with rope. Nipple clamps applied. Nipples are noted as a special weakness for the recruit. Legs bound with rope, pussy exposed. Agent Preston uses face-sitting, smothering, and pussy eating to further train her. While Recruit Wilde shows too much pleasure in licking her trainer's pussy, she is able to perform the task while being smothered. 4: Dick-on-a-stick. Recruit Wilde's pussy is stretched out and abused. When a vibrator is added she comes hard. 5: Agent Preston uses a strap-on dildo to fuck Recruit's pussy. Preston knows how to bury her cock and work it hard, so her recruits can only whimper and moan. 6: Anal. Agent Preston penetrates Recruit Wilde's ass with large strap-on-cock. She's pounded hard and deep. Rope bondage and ass fucking elicit strong responses. Conclusion: Recruit Wilde is found to be an anal slut who loves getting her ass filled with cock. Perfect for her mission.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Jane Wilde",
      "person_id": 61147
    }
  ],
  "release_date": "2019-04-11",
  "scene_id": 44168,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Ass To Mouth",
    "Ball Gag",
    "BDSM",
    "Blindfold",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nipple Clamps",
    "Petite",
    "Pussy Eating",
    "Rope Bondage",
    "Slave",
    "slim",
    "Smothering",
    "Straight",
    "Strap On",
    "Sub",
    "Vibrator",
    "white"
  ],
  "title": "Operation Catfish: Chanel Preston Trains Jane Wilde For Secret Mission"
}