{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Sweet little Dresden finds herself in quite a predicament, deep in the depths of Aiden Starr’s dungeon. Aiden is a powerful domme, a master of control and punishment, and Dresden is her next subject. From the start, Dresden’s hands and neck are locked in wooden stocks, and she’s been fitted with a red ball gag. Despite her bindings, she still doesn’t seem to know her place, so Aiden takes the time to explain it to her, with pain. She cuts off Dresden’s clothes and flogs her perky, sensitive breasts and beautiful ass, paired with a good, hard spanking. It’s a beating that leaves Dresden’s skin tingling and stinging, but also gets her slutty pussy dripping wet. Aiden continues the punishment with a zapper, mercilessly electrifying Dresden’s nipples, tender thighs and wet pussy. But Aiden isn’t done with Dresdedn just yet. She puts clover clamps on Dresden’s nipples, then suspends a full bucket from them. The pain is tremendous, but still Dresden wants desperately to cum. Aiden wants to see if she can control her orgasms, so she uses a vibrator on her sensitive pussy, demanding that Dresden not dislodge the clamps and spill the bucket. Aiden leaves her in this predicament, where Dresden can’t do anything but cum. Dresden is then put on her back on a bed, with her arms in stocks and her legs tied to the ceiling. Aiden flogs that exposed, sweet ass, then takes a crop to her pussy and nipples and knuckle-fucks her helpless slave. Finally, Dresden is allowed to suck on Aiden’s sweaty feet, licking her nicely manicured toes. Dresden’s hard work and obedience is rewarded with breast smothering and then the best treat, tasting Aiden’s delicious pussy and asshole. Aiden rides Dresden’s mouth and cums. Dresden comes out of her bondage to get some slippery wet pussy fucking by Aiden and her strap-on cock. Aiden promises to use all of Dresden’s holes and finishes with some deep ass fucking. Dresden cums hard with Aiden’s cock savagely pounding in her tight ass.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Dresden",
      "person_id": 58978
    }
  ],
  "release_date": "2019-08-01",
  "scene_id": 44176,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Foot Worship",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "master",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Smothering",
    "Spanking",
    "Stocks",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "Cum Slut, Cum: Aiden Starr Demands Orgasms From Anal Lesbian Slave"
}