{
  "collections": [
    "Whipped Ass"
  ],
  "description": "An ad for a role-playing gamer’s group has led Violet Monroe to a seemingly abandoned warehouse, where she’s in for a big bait-and-switch. Violet’s tied up, gagged, and put face-down on the floor by a sadistic Lotus Lain, who can’t wait to play some games with her new friend. Lotus cuts away Violet’s clothes, exposing her pussy and nipples. She plays with her tight butthole, and envisions that it’s speaking to her, demanding to be penetrated. Lotus is ready to oblige, and she promises Violet that every bit of her will be played with. Violet tries to resist but it’s futile, and besides, Lotus likes to see her struggle. Excited by Violet’s attempts to get free, she flips her over and plays with her pussy with a vibrator, confusing Violet with sensations of both pain and pleasure. But before the pleasure continues, Lotus has even more pain planned. Violet is then bound in an extreme arch backbreaker position. Lotus makes her lick her pussy, all while grinding her crotch in Violet’s face. Of course by this point the lust and hunger have overtaken Violet, who tongues Lotus’ sweet pussy with a fervor. Violet then has to endure nipple clamps, face slapping, wicker sticks, and Lotus maliciously flogging her perfect, fuckable ass. Violet’s cries turn Lotus on, and she demands Violet thank her with her mouth. Lotus spreads her luscious ass cheeks and orders Violet to fuck her ass with her tongue, which she does with unexpected delight. Next Violet is placed in a bolero straight jacket, face-down, ass-up, with her meaty flesh exposed and vulnerable to Lotus’ sadistic whims. Lotus spanks her and paddles her until her ass is red. In fact, Lotus is so turned on she can’t help but get down and tongue Violet’s puckered asshole herself. Now the captive begins to openly beg for more. Violet wants her captor to fuck both her holes, which Lotus does immediately. Lotus slams her strap-on cock hard into Violet’s wet pussy, then trains her sights on Violet’s ass. She flips Violet over on her\nback, legs-up. Violet is bound by a strait jacket, and she can only ride the Lotus train to orgasm. Lotus drills her ass with the strap-on while giving just a little and letting Violet get off with a vibrator. But she doesn’t get it alone. Lotus straddles Violet so they can share it, and cum together.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Lotus Lain",
      "person_id": 47027
    },
    {
      "name": "Violet Monroe",
      "person_id": 20284
    }
  ],
  "release_date": "2019-05-09",
  "scene_id": 44170,
  "tags": [
    "BDSM",
    "black hair",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pussy Eating",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Straitjacket",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Lotus Lain Lures Violet Monroe To Her Lusty Lesbian Lair"
}