{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Skylar Snow auditions to be Ryan Keely’s body double. Ryan is busy being a full-time domme, but she still has a few valued clients who pay her to be a submissive. Ryan hopes to find a woman with a similar body who can pass as Ryan since she will be wearing a mask during the session. Skylar has limited bondage experience, but she is a pain slut. Ryan helps Skylar remove her clothes. Now the interview gets personal. Ryan inspects all of Skylar’s holes. Big tits, Big butt, Thick thighs. Physically it’s a match, but Ryan needs to know if Skylar can take some punishment. She orders her to bend over her knee and then begins to spank her. Skylar’s ass gets nice and red. Ryan then orders Skylar on her hands and knees and uses her cane on Skylar’s exposed ass and thighs. Skylar squeals with delight. Ryan tries breath play, face slapping, and Skylar is loving it. Ryan goes down on Skylar’s pussy. Skylar is turned on, she thinks this is going to be easy, but that was just a tease, Ryan is ready to test Skylar with a suspension. Skylar is bound and tied, her breasts exposed to Ryan’s mouth. First Ryan applies some cold, hard metal clamps to Skylar’s nipples. Now it’s time for pussy flogging. Ryan uses a zapper on Skylar’s bare feet, exposed thighs and tender pussy. Ryan gives her a break, but only for a moment while she positions herself under Skylar’s mouth. Ryan cums hard and rewards Skylar with more of the zapper. Ryan enjoys Skylar’s pussy, getting it nice and wet. Skylar is taken down and placed on the floor with a ball-gag in her mouth. Her ample breasts are tied up tight, clips circle each breast, biting tight into her tender pink flesh. Wrists clamped to her ankles. Legs spread wide open, pussy and ass exposed for Ryan to use and abuse. Ryan then gets her strap-on and fucks her hard. She then adds a vibrator Skylar squirts a gusher. Ryan releases Skylar so she can receive cock on her hands and knees. Now her ass is vulnerable to Ryan’s predations. Ryan slides her black strap-on cock in Skylar’s ass for some hard ass fucking. Ryan flips Skylar on her back, giving her an anal orgasm. It looks like Ryan has found the ideal candidate for the job, and she is already fantasizing about all the intense training she is going to give sexy Skylar.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ryan Keely",
      "person_id": 15370
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2019-06-20",
  "scene_id": 44173,
  "tags": [
    "BDSM",
    "Big Tits",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "Humiliation",
    "Kinky",
    "Latinx",
    "Lesbian",
    "LezDom",
    "Mask",
    "natural boobs",
    "other hair color",
    "Pain",
    "Pain Slut",
    "Pussy Eating",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "Body Double: Skylar Snow's Kinky Anal Lesbian Audition"
}