{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Mona Wales is a sexy hot business exec who dominates the financial business market. She has a unique “off the books” meeting where she meets with the beautiful and seductive Ashley Paige, where she can let go of her dominating role and submit to another powerful woman. She walks into her meeting place and immediately starts strapping herself to a chair. Ashley emerges from the shadows and catches Mona distracted by her phone call and not fully strapped to chair as she is supposed to be. Ashley rips the phone away from Mona and begins to give this little business exec some punishment for not being ready for their meeting. Ashley begins her punishment by dishing out a little pain with nipple pinching and slapping. She teases Mona’s senses with pain and pleasure as she rubs and teases her wet pussy. She adds a vibrator to Mona’s pussy as she canes her thighs and breast. Ashley shows this exec who the real boss is. Mona is then tied and suspended so Ashley can flog her hot body. Mona takes every hit from Ashley’s sweet punishment until her ass is rosy red. She then brings her down and makes her worship her feet. After shining Ashley’s heels with her tongue, Ashley decides it’s her turn for some pleasure. She sits on Mona’s face and rides it until she cums. Then Ashley punishes Mona with her big strap-on cock. She gives Mona’s pussy a good hard pounding as she begs for more. She then fucks Mona in the ass until she cums and squirts. Mona is a cock hungry exec who needs to let go, so Ashley fucks her pussy again until she squirts again. Ashley puts the icing on the cake with some over the knee spanking, leaving this exec’s booty fucked and glowing. Now that she has been dominated by the sexy hot Ashley Page, Mona is ready to take on the world.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ashley Paige",
      "person_id": 61984
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2019-07-04",
  "scene_id": 44174,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaped",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Vibrator",
    "white"
  ],
  "title": "Off The Books: Mona Wales Submits to Mistress Ashley Paige"
}