{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Chloe Cherry is in her favorite place, in the dungeon with her mistress Gia DiMarco. She learns that a new girl is coming to submit and try to please Gia. Will this new slave take Chloe's place? Chloe is quick to please Gia, licking her pussy. Meanwhile, the new slave is running late, and Gia is already angry. Ashlee Juliet finally arrives and must face Gia's wrath. Face slapping, titty slapping, Ashlee seems to love it all, making Gia think she may have been late on purpose. Ashlee's cute tits let her get away with anything. Gia slaps Ashlee's thighs and pussy then smacks them with a crop. The two slaves are shackled together as the slapping, and the crop continues. Chloe is such a good loyal slave; she gets to put her lips on her mistresses perfect tits while Ashlee waits. Gia makes both slaves scream with some hard titty flogging. Chloe begs her mistress to torment the fresh meat. Ashlee can take punishment and Gia is impressed. Both of their dirty filthy pussies are dripping wet after the flogging. Metal clamps are applied to the slave's breasts; not the nipples but the tender side flesh. Both girls can take the pain and are rewarded with the vibrator. The competition intensifies. Clothespins up and down their torso. Chloe has earned the privilege of eating out her mistress' pussy. Gia sits on Chloe's face. The poor slave, screaming in her pussy, wants to make her mistress cum. Gia rewards Chloe by fucking that tight, slutty submissive hole. Chloe must beg to get her ass fucked. Chloe's ass is spread nice and wide by Ashlee and her strap-on cock. Time to show her mistress how well Ashlee can fuck a slave's ass. While Chloe's ass is pounded by her rival, Gia pours hot wax across Chloe's back and ass for a little extra pain to go with her tight little asshole getting stretched wide. Gia is not without sympathy for her hardworking slut, and with a vibrator gets Chloe to cum. In the end, Chloe gets both her holes filled when Gia fucks her pussy while sitting on Ashlee's strap-on dildo and having it slide deep up her ass. Gia and Chloe fuck and cum in delight while new slave Ashlee has to watch from below. Ashlee begs for a second chance to please her mistress.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ashlee Juliet",
      "person_id": 62012
    },
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    }
  ],
  "release_date": "2019-07-18",
  "scene_id": 44175,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Flogging",
    "Hot Wax",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "The Good Slave & The Filthy Slut: Gia DiMarco Dominates Them Both!"
}