{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Aaliyah Love stops by her best friend’s workplace and finds her finishing a session with a client. As she waits for her friend Cherie DeVille to finish, she can’t help but to notice the tools and implements she uses on her clients. Intrigued by the power dynamics and pleasures of her best friend’s line of work, Aaliyah agrees to try it out, and submit to Cherie. But Cherie doesn’t play lightly with her. Instead, she dominates Aaliyah’s sweet holes into utter submission in multiple ways, including strap-on fucking, caning, spanking, fingering and pussy licking. Cherie starts by stripping Aaliyah down and humiliating her. She warms up her pussy with a few rubs then flogs her nice round ass, turning it a rosy red. Cherie then gives Aaliyah a little pleasure with a few licks on her pussy. She rubs it and fingers it, exciting her until she’s just about to climax. But Cherie switches gears and puts Aaliyah in restrained doggy on the spanking bench. It’s the perfect place for what comes next: spanking, foot torment and canning. The intensity is surprising for Aaliyah, but she continues on as Cherie then makes Aaliyah lick her pussy until she cums all over her filthy little mouth. Cherie fingers Aaliyah’s ass and stretches it with a metal plug, warming up that hole that has rarely ever seen any action. Once Aaliyah’s holes are primed and wet, Cherie demonstrates how she uses her big strap-on cock to give pleasure and pain to her clients. She pounds Aaliyah’s pussy first, teasing and denying her. She then slides into her ass, fucking her relentlessly as Aaliyah cums all over her cock. It’s a thrilling experience, but Cherie isn’t done with her new sub just yet. She makes Aaliyah finger her hard until she also cums, all over her hand. Cherie returns the favor and lets Aaliyah have one more orgasm with the vibrator. What starts as sweet curiosity ends as an explosive night filled with orgasms and domination.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aaliyah Love",
      "person_id": 61396
    },
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    }
  ],
  "release_date": "2019-05-23",
  "scene_id": 44171,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Foot Torment",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Metal Plug",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Submission",
    "switch",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "First Time Submission: Cherie DeVille Dominates Aaliyah Love!"
}