{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Perky Blonde Delirious Hunter is back on Kink and ready for true punishment. This obedient pain slut may look innocent in her bright flower summer dress, but she is tied up fully restrained in rope bondage and gagged with a ball gag in her wet mouth. Her legs spread wide open with a spreader she is ready for her master. Her handler today is the handsome Stirling Cooper with his deep commanding voice. He knows his pain slut Delirious Hunter will need special attention today. Starting with the riding crop he punishes her thighs and tight ass. Slapping her bright red in the face with his hands. She screams when her pussy is cropped hard on her clit. Her tits take the cane and she screams even louder for more punishment. She is ready to do her best to treat her master. Her nipples are clamped and extremely tormented. Her feet are flogged until she screams mercy at the top of her lungs. Not only does she know exactly how to take pain, this experienced slut is extremely skilled at delivering pleasure for her master. With locked eye contact she gives a deep throat blowjob followed by a deep hard fucking and anal pounding. She screams to have his cock go back and forth between her asshole and tight we pussy. She cums all over Stirling's hard cock and his vibrating Hitachi. Finally she begs for Stirling to cover her in cum and he unleashes the biggest cumshot we've seen on Brutal Sessions!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Delirious Hunter",
      "person_id": 56555
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-03-04",
  "scene_id": 44185,
  "tags": [
    "Anal",
    "Ball Gag",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Caning",
    "Crop",
    "Feet",
    "Flogging",
    "Gag",
    "Handler",
    "Hitachi",
    "master",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "Predicament Bondage",
    "Rope Bondage",
    "Slapping",
    "Straight",
    "Sub",
    "top"
  ],
  "title": "Obedient Pain Slut SCREAMS for Anal Punishment"
}