{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Rough sex MILF slut London River is a hungry whore. She is the kind of woman that wants sex all the time and also needs to be put in her place. She is used to being in charge and drools at the thought of a brutal sadist beating her big round ass and making her gag on giant cocks. London starts her day tied to a Saint Andrew's cross with her big titties dangling open and exposed to the cruel intentions of Derrick Pierce. Derrick rips sharp metal clover clamps off of her perky and erect nipples causing London to howl from the searing pain. She coughs and gags through the drool of a red ball gag that is pulled taut around the edges of her mouth. Derrick then jams a hitachi onto her pussy and she immediately begs to cum from the relentless clitoral stimulation. She pleads and pleads, but Derrick loves to watch a woman wither from the agony of orgasm denials, so he refuses to let her cum. He then hoists her up into in air in full suspension, dangling only her wrists and ankles. He wastes little time and immediately shoves his cock down her throat. London coughs and spews drool and spit all over her mouth. Derrick swings her into his cock making her rough blow job quickly escalate into a brutal face fucking. He then flips her over between her legs and shoves his cock into her pussy. Grabbing her by the ass, he pounds her pussy into submission causing London to have multiple orgasms in quick painful succession. Before London can catch her breath she is tossed to the floor like a rag doll and restrained in a doggie position that showcases her firm and flawless ass. Derrick then begins to abuse her big butt with a leather single tail and then with a heavy leather flogger. She barely lets out a whimper as her ass gyrates from brutal impact play. Engorged by her yelps and by the sight of her struggling in the bondage, Derrick begins to fuck all three of London's whore holes with reckless abandon. Switching fluidly from mouth, to pussy, to anal, London is made to devour her own juices and fluids. To finish her day, she is then tied with her legs spread far apart on a table. After attacking her feet and nipples with a leather riding crop and a bamboo cane, Derrick begins to fuck her unwilling pussy and asshole. As a vibrator furiously grinds away at her clit she begs to cum over and over again. And after hours of being denied the pleasure of orgasmic release, her handler finally allows London to cum. As her body shakes and trembles from the ecstatic release, Derrick blows a giant load onto her swollen and broken pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2019-04-29",
  "scene_id": 44189,
  "tags": [
    "Athletic",
    "Ball Gag",
    "Bondage",
    "bottom",
    "Brunette",
    "Clover Clamps",
    "Crop",
    "drool",
    "Feet",
    "Gag",
    "Handler",
    "Hitachi",
    "Leather",
    "MILF",
    "multiple orgasms",
    "natural boobs",
    "other hair color",
    "Pain",
    "Pain Slut",
    "Piss Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Single Tail",
    "spit",
    "Straight",
    "Sub",
    "Submission",
    "Suspension",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "MILF Slut London River Anal Fucked In Rope Bondage and Impact Play!"
}