{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Cadence Lux is behind on her rent. She's out of ideas and heads over to her landlords house to give her desperate plea. She lets herself in and finds her landlord, Stirling Cooper doing dishes in his kitchen. He's surprised but happy to see her and she explains to Stirling that she doesn't have the rent this month. Stirling begins to lecture Cadence about the importance of saving money. He pulls out a leather briefcase filled with money to demonstrate what a little self discipline can accomplish. A telephone rings in the other room and Stirling excuses himself to go and answer it. Now alone in Stirling's kitchen with a pile of money staring at her, Cadence gives in to temptation, grabs a stack of cash, and gets the hell out of there. Alone back at her apartment, Cadence hears a knock on the door. Its her landlord, Mr. Cooper. He tells Cadence that he knows she stole the money, and that she can keep it. He serves Cadence an eviction notice and tells her to lift her skirt and spread her legs. He makes her finger her pussy and fuck herself with her own dildo. He tells her to bring him something else and so she gets a pile of rope. While on her knees, Stirling ties Cadence up with her hands behind her back. Several wraps of rope go around her neck and attach to the floor behind her. He places clamps on each of her nipples, pulls out his massive hog, and asks Cadence if she's ready to pay the rent. He shoves his fat dick down her throat and fucks her face until she's drooling. He shoves her head to the floor and crops her ass and legs while he makes her apologize. He then hits her hard with the leather flogger right before shoving his colossal cock in Cadence's tight pussy. He fucks her pussy fast deep and hard and then flips her over to tie her in another rope bondage predicament. This time he ties Cadence up with her legs spread and her hands above her head. He fucks her pussy hard making her cum multiple times and shoots a huge load up and down her body.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    },
    {
      "name": "Cadence Lux",
      "person_id": 51424
    }
  ],
  "release_date": "2019-02-22",
  "scene_id": 44188,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Dildo",
    "Discipline",
    "Domination",
    "Humiliation",
    "Leather",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "The Bad Tenant"
}