{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Fresh-faced European teen slut sensation Luna Rival submits to her first Brutal Session at the hands of Tommy Pistol in an abandoned basement dungeon. She exudes the kind of innocence and causal naivete that makes the mouth of a sadist drool with cruel desires. She is quickly swallowed up and made to submit to brutal and inescapable rope bondage that coerces her back into a beautiful and painful arch. With the front of her body pulled taut and left completely vulnerable, Tommy begins to ruthlessly beat her small, all-natural breasts with a leather riding crop. Luna howls in pain as her teeny pink nipples are aggressively activated with brutal impact play. She fidgets and squirms to avoid the intense blows but the bondage is restrictive, offering no escape or mercy. Luna is then tied kneeling in front of cross with her hungry whore mouth at the perfect height to swallow cock. And Tommy is only too happy to feed her his engorged dick. He crams it down her throat making her cough and gag from a brutal face-fucking. The rough blow job is relentless and Luna spews spit all over her perky titties. She begs to cum but her cruel taskmaster loves orgasm denial and refuses to let her have any pleasure. This is about what HE wants. Luna is then restrained in a doggystyle position that exposes her tight and unwilling butthole to Tommy's depraved desires. He crams his huge cock into her ass until it barely squeaks in. The hole is so tight that he can barely slide his cock in and out without causing Luna to wince from the pain. Seeing her discomfort, his cock thickens and he begins to pound her ass into submission. Luna begs and pleads to cum but is denied again and again until she is lost in ecstasy. Panting and breathless, she is then tossed on her back and spanked with a black leather flogger until her ass is glowing a searing shade of red. Tommy then begins to fuck her pussy and then her ass, switching back and forth, using only Luna's whore-mouth to clean it off between fuck-holes. Gasping and pleading for mercy, the Tommy obliges her by cramming a Hitachi onto her swollen pussy. As the vibrator stimulates her clit, he continues to relentlessly fuck her asshole until Luna has the first of many multiple orgasms. She begs to taste his cum and he blows a massive load of jizz all over her pussy and winking butthole.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Luna Rival",
      "person_id": 60512
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-04-15",
  "scene_id": 44191,
  "tags": [
    "BDSM",
    "Bondage",
    "Clothespins",
    "Crop",
    "drool",
    "dungeon",
    "Gag",
    "Hitachi",
    "Leather",
    "multiple orgasms",
    "Orgasm Denial",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "Straight",
    "Sub",
    "Submission",
    "Swallow",
    "Vibrator"
  ],
  "title": "Euro-Teen BDSM Whore Luna Rival Anal Fucked in Brutal Rope Bondage!"
}