{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Bill Bailey has a suitcase full of cash and an FBI man hot on his trail. He enters the first house he sees to lay low and catches the beautiful and naked Demi Sutra by surprise. Demi screams as she catches sight of Bill and they struggle. Bill overpowers Demi, slaps her face, ties her up and gags her. Once she's all tied up, Bill has a moment to appreciate her lithe petite frame. He feels up her tits and pussy as she struggles in bondage, unable to escape her captor. Bill flogs Demi before putting nipple clamps on her tits and teasing her with a vibrator on her juicy cunt. Demi screams in pleasure. She doesn't know why, but this predicament has her all hot. She grinds down on the vibe trying to cum, but Bill has other plans. Demi isn't allowed to cum unless she's begging for his cock. Soon Demi is begging Bill to sick his cock in her mouth and her wish is granted. Bill inspects her mouth and spits in it, before sliding his hard cock in. He fucks her face and stuffs his whole package -- balls included -- into her pretty little mouth. Next, he ties her over a bed with her legs spread and takes a good luck at her pink pussy. Demi squirms as Bill flogs her and crops her ass. He puts close pins on her vulva and watches Demi wiggle in pain. Demi doesn't know if it's the pain or loss of control but she wants more. She begs Bill to give her more and fuck her cunt. Bill pushes his hard cock into her tight cunt, stretching it open and gives her a good hard pounding. He ties her on her back with her legs open and continues fucking her hole as Demi screams in pleasure, begging him to keep fucking her. She cums over and over with Bill in her cunt before Bill jerks off all over her sweet pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Bill Bailey",
      "person_id": 46601
    },
    {
      "name": "Demi Sutra",
      "person_id": 61557
    }
  ],
  "release_date": "2019-04-12",
  "scene_id": 44194,
  "tags": [
    "Athletic",
    "BDSM",
    "Black",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Humiliation",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "toned",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Stockholm Slut: Demi Sutra gets fuck-love struck by captor Bill Bailey"
}