{
  "collections": [
    "Sex And Submission"
  ],
  "description": "The mob has taken hostage somebody very near and dear to Bill Bailey. They'll let her go if Bill gets Lauren Phillips to sign her company over to them. Bill pays a visit to Lauren at her office to tell her to sign all of the papers but she refuses and tells Bill to,\"maker her\". Bill grabs her by the hair and unzips her top, making her big tits spill out of her shirt. He lifts her matching skirt and slaps her ass hard, just before dragging her naked into another room. Bill has Lauren get on her knees and he wraps rope around her wrists, neck, and ankles, and ties them all to a leather ottoman. He flogs her tits, legs, and stomach and tells her again to sign the papers but she spits in his face. He pulls out his cock and rubs it all over her face and then shoves it in her mouth and fucks it. Bill applies clamps to each of Lauren's nipples and she screams in pain. He chokes her with one hand and with the other, he vibes her pussy with an Hitachi pressed against her clit. Next Bill puts Lauren in a leather dog collar and attaches a leash to it. He makes her crawl around like a dog telling her to sit, speak, lay down, and beg. Bill then takes a big glass butt-plug and shoves it in Lauren's ass to get it stretched and ready for his fat cock. He shoves his cock in her ass and pounds it deep and hard while he flogs her back. He flips her over onto her back and ties her securely to the furniture with her legs spread wide open. He crops and flogs her body before getting back in her ass for some more anal fucking and blows a big load down her throat.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Bill Bailey",
      "person_id": 46601
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2019-03-22",
  "scene_id": 44192,
  "tags": [
    "Athletic",
    "BDSM",
    "Big Tits",
    "blond",
    "Blowjob",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "fake boobs",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Nipple Clamps",
    "Pain",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "switch",
    "toned",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Hostile Takeover"
}