{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When newcomer Gia Milana gets caught trying to frame Tommy Pistol in a heist he teaches her a hardcore lesson about being a snitch! Gia is one sexy babe and wearing a skin tight black catsuit, spike heels and mask she is a sight to behold. She and Tommy are partners in crime and after scoring a bag full of money they celebrate back at the clubhouse. Tommy has been dreaming about Gia’s huge tits for a long time and finally he can get his greasy paws all over them while Gia blows Tommy’s dick. Down on her knees with her big tits exposed she worships Tommy’s cock with her full sultry lips and wet mouth until Tommy shoots his jizz down her throat. They agree to meet up later for their next job but little does Gia know that Tommy saw the police badge in her bag and things are not going to happen as planned… A world of BDSM, hardcore anal sex and more await this sexy, slutty snitch. After Tommy finds a wire in Gia’s panties he ties her up tight, fucks her pussy and disciplines her with the flogger. Then she tells Tommy she wants him to take her ass so without hesitation Tommy spits on her tight hole and fucks her ass. Moaning in pleasure Gia is loving every inch of Tommy’s hard cock as he goes back and forth between her ass and her snatch. Tommy stretches her legs over his shoulders and pounds her out real good and hard. Now on all fours tied up with rope Tommy slaps Gia’s butt making it all red and then fucks that hot piece of ass again. She sucks his dick to clean it up and then sits on him reverse cowgirl and rides his cock all the way to cum town! Her huge tits bounce up and down as she takes a deep fucking in both holes until Tommy shoots his load all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Gia Milana",
      "person_id": 61912
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-03-15",
  "scene_id": 44197,
  "tags": [
    "BDSM",
    "Big Tits",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Hood",
    "Humiliation",
    "Latinx",
    "Mask",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "The Snitch"
}