{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Curvy, all-natural goddess Ryan Keely is a strong woman who’s used to being in charge. Power is the essence of her life and it fuels every decision that she makes. When she saunters into the dungeon of a cruel male dom, she craves to be put into her place and to be controlled and coerced into inescapable rope bondage and brutal corporal punishment. With an impatient and demanding woman like Ryan no time can be wasted with foreplay or warm-ups. She is quickly and severely restrained on her back with her legs pulled taut in the air. Her perfect round ass is exposed and vulnerable to the sadistic whims of her male handler, Stirling Cooper. He dives right in and begins to abuse her tender skin with a leather riding crop that makes Ryan scream and tremble from the searing pain. Once her legs are tenderized he then changes his tool to a thin bamboo cane that he uses to attack her calves and thighs. The sting of the impact pierces the stuffy air of the dungeon. Stirling then tosses Ryan to the ground and ties her on her knees to a sybian. He then electrifies her giant natural titties and inner thighs with and electric zapper. Ryan thinks that she can back talk to her dom, but she finds herself on the wrong end of his cruel intentions. As the speed and intensity of the sybian mounts, so too does the sting of electric torment. Ryan gasps for breath as Stirling seizes the moment and rams his rock hard cock deep down Ryan’s helpless throat. He face-fucks her until she gags and chokes from the rough blow job. Spit flies from the edges of her mouth as she tries to pull away and escape the brutal blow job. She begs to cum from the relentless clitoral stimulation of the sybian but the she is not permitted and her handler laughs from the pain of her orgasm denial. Before she can catch her breath, slutty stripper-heels are strapped to her feet and she is perched on one leg. Almost immediately Stirling takes his throbbing cock and shoves it into her exposed cunt. He ruthlessly slams Ryan’s tight pink fuck hole until uncontrollable multiple orgasms explode from her. She trembles and shakes from the stimulation but she’s helpless to stop the pussy pounding. To finish her off, Stirling throws her onto her back and ties her legs out wide so he can torment her tiny pink pussy. He fucks her repeatedly and relentlessly until all of Ryan’s pride, power, and inhibitions have dissolved into a pool of sweat and pussy juice. She begs her master to fill her with his jizz and he is only too happy to oblige. Stirling sprays a massive load of cum all over her swollen and aching pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Ryan Keely",
      "person_id": 15370
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-04-01",
  "scene_id": 44190,
  "tags": [
    "Athletic",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Couple",
    "Crop",
    "Curvy",
    "dungeon",
    "Feet",
    "foreskin",
    "Handler",
    "Latinx",
    "Leather",
    "Male Handler",
    "master",
    "multiple orgasms",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "Rope Bondage",
    "slim",
    "spit",
    "Straight",
    "Sub",
    "Sybian",
    "white",
    "Zapper"
  ],
  "title": "Big Titted Goddess Ryan Keely Fucked, Disciplined in Rope Bondage"
}