{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Rock legend Small Hands is hanging out backstage warming up for his show when fangirl groupie Kendra Spade blows her way in. Annoying and naive this little perky slut is begging for attention. Sign my tits please, play with my pussy. Small Hands has seen it all is just annoyed by this amateur, until she pulls out her nipple clamps. This gets Small hand's sick and devious mind excited. He pulls out the handcuffs and asks if Kendra is ready to play. This brunette has no idea what she is getting herself into. Fully cuffed and her nipples clamped, she is made to perform a brutal deep throat cock sucking. Small Hands continues to play his guitar as she bobs up and down on his hard cock. Flipping her over and fully restraining her in rope bondage, Kendra Spade takes the flogger to her ass before Small Hands pounds the fuck out of her. She screams as he delivers a brutal fucking and she cums on his cock. He flips her ass into the air and bounds her in bondage again. This time he wants that tight asshole. Kendra begs to please him as she takes his cock up her ass. A brutal deep hard anal fucking gets her to orgasm. She wants to be fucked in all her holes as Small Hands goes back and forth between tight pussy and tighter asshole. He even gets her to jerk him off with the soles of her feet. Finally Small Hands covers her in cum before he gets ready for his live show.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Kendra Spade",
      "person_id": 60694
    },
    {
      "name": "Small Hands",
      "person_id": 59499
    }
  ],
  "release_date": "2019-03-08",
  "scene_id": 44193,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Humiliation",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "The Legend & The Groupie"
}