{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Kira Noir needs help. She’s been struggling to get her life together in the face of financial debt, insecurities, and loneliness. When she hears a life coach advertising online, she figures she has nothing to loose. She texts Life Coach Derrick Pierce, who arrives ready to help. Derrick is immediately taken with Kira and leads her through some breathing exercises. When Kira decides not to continue with Derrick beyond the initial consultation, Derrick gets upset, shows up at her door, and demands she at least pay him for the first consultation. But once inside Kira’s house, Derrick knows this is his chance to help Kira and make sure she doesn’t quit! He ties her up, gags her, and places two bricks in her hands. As she squats holding the bricks above her head, he guides her through positive visualization techniques while cropping her tender thighs and cute perky tits. As her arms shake under the weight of the bricks, he takes his cock out and tells her to clear her mind and focus on his hard cock. Kira deep throats her coach’s dick, swallowing it to the base and showing how appreciative she is for his guidance. She does such a good job, Derrick lets Kira cum before he flogs her. Kira cries out and struggles in bondage as Derrick flogs her and whips her with a dragon’s tongue. Derrick turns Kira’s ass red and pays special attention to her sensitive feet. Then he pushes his hard cock into Kira’s wet cunt and gives her a deep pounding. Kira screams out and begs to cum as Derrick drives his cock in and out of her pussy. Then Derrick takes her ass. Kira’s eyes widen as Derrick pummels her tight asshole, stretching it around his hard fat cock. Finally, Derrick rewards Kira with a big load all over her fucked out pussy. He’s proud of all the progress they’ve made today, and Kira promises to never quit. Ever.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    }
  ],
  "release_date": "2019-03-29",
  "scene_id": 44195,
  "tags": [
    "Athletic",
    "BDSM",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Humiliation",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "Tattoo",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "No Quit Approach: Kira Noir gets motivational fuckdown from life coach"
}