{
  "collections": [
    "Sex And Submission"
  ],
  "description": "The beautiful brunette Alana Cruise is working for the county tax assessor's office and is on the case to find out what Stirling Cooper is hiding. His property has been red flagged for review with all the construction taking place. With a possible 400% increase in taxes or potential levy on the property, the handsome Stirling Cooper is rightfully upset. He decides to set a little trap for this perky assessor. Setting up a hidden camera in his home, he waits for Alana to return. With a checkbook in hand he offers to pay Alana Cruise with a personal check for her to make this tax nightmare go away. This little minx grabs the check before Stirling shows her the camera. Caught, but Stirling is no where near done with his payback. She almost bankrupted him and it's time for her to pay. He grabs her and ties her in restrictive rope bondage, chains, and a ball gag. She insists she'll do anything to get out of this situation and first up is a deep throat gagging blowjob. Stirling's rock hard huge cock gets Alana drooling, she can't believe how far she can take that monster. But, it's not all about pleasure, next up is the pain. Full corporal punishment with the crop and flogger all over Alana's tight little body and pussy. Flipping her over Stirling gives her a hard spanking on her red ass before delivering a deep fucking in her wet tight pussy. This assessor wouldn't be complete without anal. Stirling gets mounts her from the top and pile drives a deep anal submission. She cums soo hard from the anal fucking and hitatchi before Stirling unloads his load all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Alana Cruise",
      "person_id": 60194
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-04-05",
  "scene_id": 44196,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Chains",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Gag",
    "Humiliation",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "Straight",
    "Submission",
    "top",
    "Vaginal Penetration"
  ],
  "title": "The Tax Assessor: Alana Cruise's Anal Submission to Stirling Cooper"
}