{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Aspiring actress Alina Lopez is excited to get headshots done by industry professional Tommy Pistol. To alleviate some of the cost, she agrees to a work trade in which she models with some of Tommy’s sex products. She arrives ready to shoot and in no time, Tommy is snapping pictures of Alina with various sex toys. When Tommy pressures Alina to strip down to her bra and panties, Alina is unsure but willing to do what it takes to get a recommendation from the famous Mr. Pistol. But when he pushes her too far, she begins gathering her things to leave–until Tommy tells her that he’ll post her sexy photos on social media for the whole world to see unless she finishes the shoot. Alina acquiesces and soon finds herself tied up with her nipples clamped and gagged at the mercy of a crazed and horny photographer. Tommy tastes Alina’s drool and flogs her back as she screams out. He feels her up, spits on her face, slaps her, and tells her to suck his dick. Alina has no choice but to take his cock in her mouth. Displeased with Alina’s lackluster cock sucking, Tommy takes control. He holds her hair and fucks her face hard, making this young fresh-faced model a sloppy messy slut. Alina chokes on Tommy’s cock and cries out as spanks her ass, and flogs and crops her legs and her sweet pussy. She screams as Tommy plays with her cunt before sticking his fingers into her mouth. Next, Alina is tied in the splits position, with her ass exposed and open. Tommy flogs her and sinks his hard cock into her pussy. Alina cries out as he pummels her pussy, getting deeper and deeper with each stroke. Finally, Alina is tied on her back with her holes exposed. She moans out as Tommy ruthlessly fucks her cunt. Tommy tells her to ask him to cum in her pussy and she obeys. Tommy cums in Alina’s cunt and digs a finger in to push it all out and make her taste it. He grabs his camera for the final shots of the day and tells her to smile as he clicks the shutter.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Alina Lopez",
      "person_id": 61837
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-04-19",
  "scene_id": 44198,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Creampie",
    "Crop",
    "Domination",
    "drool",
    "Facefucking",
    "Flogging",
    "Humiliation",
    "Latinx",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "spit",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "Headshot Horror: Alina Lopez exploited!"
}