{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Lauren is finally on Fucking Machines! The wait is finally over, and believe us, it’s going to be worth it. Lauren starts out sitting on the slave stool and she slowly begins to reveal her sexy body. She barely gets her tits out for us before she breaks out the vibe and presses it firmly against her wet pussy. The moaning begins instantly and the orgasms follow shortly after that. Once the orgasms begin, it seems that they just keep coming. We sit Lauren down in a comfy chair, throw her legs over the arms of the chair and slide the machine into her tight pussy. The machine slides in and out of her welcoming pussy and then begins to accelerate quickly. We want her to cum fast and often, so we monitor her reactions to make sure she is getting fucked proper. Next we have her in a position that everyone loves with her ass up and her face down. Her holes are totally exposed and we insert the dildo and start the machine. Again the room fills with her moans of ecstasy as she begins to orgasm more. She is overwhelmed with all of the orgasms, but that doesn’t stop us. We fuck her until she’s gasping from all of her orgasms. The day is coming to a close, and we flip her back over on her side and begin the last scene. She instantly starts to orgasm, and continues throughout the scene as the vibe is pressed firmly against her wet pussy. Lauren showed up willing to give it all, and she damn sure did as the machines power fucked her pussy all day long.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2019-04-24",
  "scene_id": 44204,
  "tags": [
    "Big Tits",
    "Dildo",
    "dungeon",
    "fake boobs",
    "Machine Dildo",
    "Redhead",
    "shaved",
    "Slave",
    "Straight",
    "switch",
    "the chair",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Busty Redhead Lauren Phillips Gets Machine Fucked In The Dungeon"
}