{
  "collections": [
    "Device Bondage"
  ],
  "description": "Avi Love begins her day mummified on the floor of the dungeon. On top of her mummification, there are clear rubber belts that keep her secure and helpless, and\na head harness to bind her head as well. Only her feet and hair are visible as she lies\nhelpless on the floor awaiting her captor. The Pope enters with a leather flogger and an\nelectric taser. He exposes her important parts, her tits and pussy, then begins to toy with\nher for his amusement. Even without seeing her face it’s clear that Avi is very\ncomfortable with being under his boot and is prepared to suffer for him at whatever cost\nto her. She is allowed orgasms after suffering for him and then they move on to the next\nscene. Now we have her face-down with her ass pushed up with her sensitive soles\nexposed and restrained for some bastinado. Her ass is spanked and cropped and then\nThe Pope moves on to her feet. She screams and begs, but all this does is excite him more\nwhich she finds out quickly back fired for her. He fucks her tight little pussy and imposes\nmultiple orgasms before leaving her there alone. It’s now time to finish her off, so he puts\nher on her back and spreads her legs as wide as they will go. As the day has gone on we\nfind out that Avi loves breath play, so we get a full dose of it in the last scene, which\nmakes her orgasm harder than anything else. Her pussy drips from being used like the\nslut that she is. She still looks like the innocent girl, but after we see what The Pope does\nto her, and how she responds, it’s very clear that she is not as innocent as she looks.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Avi Love",
      "person_id": 60196
    }
  ],
  "release_date": "2019-05-02",
  "scene_id": 44207,
  "tags": [
    "BDSM",
    "Bondage",
    "Boot",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Feet",
    "Fingering",
    "Flogging",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "multiple orgasms",
    "mummification",
    "natural boobs",
    "harness",
    "slim",
    "Straight",
    "Submission",
    "Taser",
    "The Pope",
    "top",
    "unshaved",
    "white",
    "Zapper"
  ],
  "title": "Removing Her Innocence: Avi Love"
}