{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Whitney has shot for a few other Kink sites, but this is our first time getting her tied up and machine fucked. We start by giving her a ball gag and telling her to put it in her mouth, then make sure that she makes it tight. Her pussy instantly gets wet and she can't wait to start masturbating. She removes most of her clothes and then puts the vibe on her pussy. The orgasms pour out of this little slut and we can't wait to get her tied up and fuck her with the machines. We start with her on the bed and helpless against the head board, with her legs spread wide and her arms tied up and away from her body. The machine slides inside of her already wet pussy and begins fucking her. Her eyes roll back for the first orgasm as she gets a taste of how well she is going to get fucked today. After more orgasms than she thought she was going to get all day, we move on to the next scene. Next we fold her half into a pile driver with her ass and pussy up high for all to see. The machine is positioned and inserted into her wet cunt. The machine is turned up fast so we can ensure she is overwhelmed with non stop orgasms. She is allowed to have the vibe, but the machines seem to be doing a good enough job that she barely uses it. Next we have her standing above the next machine. It begins to slide in and out of her soaking wet pussy as she drools from the gag in her mouth. Her body glistens from the drool running down her body. We tell her to use the vibe until she can't take it anymore, and she does to crank out more and more orgasm until she is completely spent.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Whitney Wright",
      "person_id": 61018
    }
  ],
  "release_date": "2019-04-10",
  "scene_id": 44205,
  "tags": [
    "Ball Gag",
    "drool",
    "Gag",
    "Machine Dildo",
    "Straight",
    "Vaginal Penetration"
  ],
  "title": "Fresh Meat: Whitney Wright Is Bound And Fucked"
}