{
  "collections": [
    "Hogtied"
  ],
  "description": "Daisy is no stranger to Kink, or The Pope. She enjoys being the top as much as she enjoys being the bottom, and today she will most definitely be the bottom. She begins on a box in a brutal ground tie that has her exposed and helpless. The Pope enters with a crop in hand and begins tormenting her. After she seems to be warmed up, the zapper is introduced to inflict more suffering. Her ass, feet and nipples all get a taste of the electrical sadism that eventually graduate to the cattle prod. Now that she has been punished, it's time for the reward. Her pussy is fucked into multiple squirting orgasms to finish the scene. Next we have Daisy bent over a large wooden spool, backwards to stretch her out and make her extremely vulnerable. She is tormented with a flogger before he breaks out the cat-o-nine to completely devastate her with pain and suffering. The orgasms begin, but this time The Pope toys with Daisy by stopping the orgasms and cropping her her instead, then he goes back to the orgasms. In the final scene Daisy is on her back and her legs are spread wide. The implements are laid out around her to show her what is in store for her going forward. The Pope jumps straight to the cattle prod and terrorizes Daisy until he decides that she has had enough. Her pussy is then fucked more until she cover the table and floor in all of her squirting orgasm juice.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    }
  ],
  "release_date": "2019-03-28",
  "scene_id": 44208,
  "tags": [
    "April Showers",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "bottom",
    "Cattle Prod",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "mixed",
    "natural boobs",
    "Pain",
    "Redhead",
    "Rope Bondage",
    "Sadism",
    "shaped",
    "Squirting",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "The Pope",
    "toned",
    "top",
    "Vaginal Penetration",
    "Zapper"
  ],
  "title": "Brutal Bondage, Severe Torment, And Squirting Orgasms"
}