{
  "collections": [
    "Device Bondage"
  ],
  "description": "Lily and The Pope have quite the history together. They have been doing scenes for a very long time and have a special bond because of it. When he got the call from her that she wanted to come back and work together again, he jumped at the opportunity. For the first time she is able to go as hard as she wants to get the full experience from her master. The day begins with her standing against a wall with her wrists and ankles held in place by steel shackles. Her hands above her head and her legs are spread as The Pope enters and begins to reveal her body. He clothes are slowly moved to expose her tits and pussy, and then he begins to explore her flesh before starting the torment. Once exposed a variety of floggers are used to redden her skin from a hellish assault. Her nipples are tormented as well to make sure she suffers properly before giving her her first orgasm. Next we have the lovely Lily shackled into the throne of suffering. After toying with her sensitive nipples for a bit, it’s now time for the cane to stripe this slut up nicely. As her flesh reveals the stripes from the cane strikes on her legs, we get to see her breasts develop marks from the brutal flogging she received in the prior scene. With every strike comes pain, and then a subtle smile on Lily’s face knowing that she is being the good slut that she is expected to be. Her face is covered with a stocking, then her eyes and mouth are taped. Clothespins are put in the sensitive areas and then beaten off by The Pope. More orgasms are rewarded to her for her obedience and suffering before moving on to the final scene. Lily is in a doggy position and locked in tight with metal traps. The cane is back to add more stripes to her flesh before The Pope discovers Lily’s weakness. Lily is very ticklish and he exploits this weakness to his advantage. After some severe bastinado, tickle torment, and a brutal ass whoopin’, she is made to cum uncontrollably until she has been completely used up.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lily LaBeau",
      "person_id": 25162
    }
  ],
  "release_date": "2019-04-04",
  "scene_id": 44206,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Caning",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Flogging",
    "Foot Torment",
    "Handler",
    "Humiliation",
    "master",
    "Metal Bondage",
    "mixed",
    "natural boobs",
    "Pain",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "The Pope"
  ],
  "title": "Lily LaBeau is Brutally Tormented in Grueling Bondage"
}