{
  "collections": [
    "Bound Gods"
  ],
  "description": "The Men from Bound Gods pay homage to Michael Haneke's Funny Games in this year's special Valentine's Day update! Draven Navarro and wife Sablique Von Lux are having a quiet Valentine's at home when trouble knocks on their door in the form of one clean shaven and boyish Sebastian Keys. Sebastian's arrival is followed by the entrance of his step-father, Colby Jansen. As the night goes awry, the happy couple finds themselves threatened by this eerie and menacing father-son duo. Of the two, Draven gets picked for an evening of fun and after Colby puts Sablique away, the games begin. Draven is bound, his cock and ass exposed. Much to his humiliation, Draven's cock is rock hard and leaking. Colby squeezes his balls, pulling them hard. Father and son spank his thighs, ass, and belly, and slap his face. Draven is brought to his knees and bent over, stuck between Colby's hard cock in his mouth and the golf club Sebastian is using to sodomize his asshole. Next, Draven is tied on the staircase. His mouth full of Colby's cock, he gets flogged on his back and ass by both Colby and Sebastian. Sebastian licks Draven's puckering asshole before making Draven lick his own hole, as his step-dad single tails Draven's ass. Draven cries out in pain, as the whip whistles through the air and lands on his tender flesh. Finally, Draven is bound and gagged, his tight ass stuffed full with two hard cocks. Their two cocks sliding alongside one another, the father-son duo fucks Draven as he cries out, unable to escape this Valentine's torment. Satisfied with their work, they jerk Draven off, blow two fat loads all over his pathetic face, and leave him bound. The night is young and there are other houses on the block. Maybe yours is next.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Colby Jansen",
      "person_id": 34457
    },
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2019-02-14",
  "scene_id": 44209,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Couple",
    "Domination",
    "Double Anal",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Pain",
    "Parody",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission"
  ],
  "title": "Valentine's Visitors: Draven Navarro Gets Whipped and DP'd"
}