{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "My Master wanted to see me again. He says I've become a good sex slave and taken to his training well. My throat was still sore from the last session. But I wanted him to use my pussy again. I love taking his big cock no matter how he wants it. I love when he ties me up. He does it extra tight, especially around my tits and wrists. He made me wait after he finished the last knot. I was so horny I wanted him to take me right there and then. But he made me wait, which got me hotter. I couldn't take the tease anymore. I need his dick! I wanted it down my throat, far up my pussy in the rough manner he's so good at. I love feeling like his slut to be used whenever he wants. He finally came and pulled me up on the couch, had me hover over his dick and made me put it in my mouth, pushing my head down, taking the entire thing deep down my throat all the way to his balls. I can last longer but still gag up spit. Whenever I need a break, he shoves it down deeper. I love it all. He finally bends me over and dips his great cock up my pussy. I can feel him opening me up and tearing at my walls. He grabs me my the hair, slaps my ass, making me orgasm over and over. I had a feeling he wanted to cum this time. I wanted another taste of it.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Kimmy Lee",
      "person_id": 56661
    }
  ],
  "release_date": "2019-01-17",
  "scene_id": 44219,
  "tags": [
    "Asian",
    "Ball Gag",
    "big dick",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "brunet",
    "Brunette",
    "Deepthroat",
    "drool",
    "dungeon",
    "Facefucking",
    "fake boobs",
    "Gag",
    "Latin",
    "master",
    "Nipple Clamps",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Sub",
    "Swallow",
    "switch",
    "Tattoo",
    "thirdparty",
    "toned",
    "Vaginal Penetration",
    "versatile"
  ],
  "title": "Kimmy Lee is Tied and Bound Again for More of her Master's Dick"
}