{
  "collections": [
    "CFNMEU"
  ],
  "description": "Milen Petrof is subjected to great temptation as he sits at his desk and watches his girlfriend sleeping. He is writing in his diary as she moves around on the bed, and wakes up. She urges Milen to take a break as she feels so horny after a sexy dream. Milen is not easily persuaded so the girl turns over and shows her sexy ass. But as he watches he soon changes his mind and joins her on the bed. The girl tells him that he must do everything she tells him. Once he agrees she ties Milen's wrists to the bedframe. Then she begins to suck on Milen's nipples and rubs his cock in his underwear. She pulls the hard cock out and starts to suck it as she slaps his legs. Then she takes off Milen's underwear and slaps his cock and balls before sucking it some more. She keeps slapping his thighs and wraps a band around his balls, hitting them as she sucks his cock. That cock is so hard as she works on it. Then she takes some clothes pins and attaches them to Milen's nipples and belly hair. She uses one pin to pull on Milen's ass hair too. Then she attaches pins to his balls too before sucking that cock some more. Milen's legs are pulled in the air to expose his tight, hairy, hole. More pins are applied, this time to the hairy ass and the grils shoves a finger into Milen's hole. His ass cheeks are red from her spanking him and her finger really explores his tight hole. The thumb slides in too and is then replaced by two fingers. Milen moans as he feels them. He is turned over, onto his knees, with that sexy ass still exposed. That ass is ready for more and a vibrator soon fills it. Then it is replaced by a nice, thick, dildo. The girl pushes the dildo in nice and deep, really stretching the hole. She then moves Milen onto his knees and wanks his big cock until it delivers the hot, creamy, cum. She milks every last drop of hot juice from that cock to end a great scene.",
  "directors": [],
  "models": [
    {
      "name": "Milen Petroff",
      "person_id": 61848
    },
    {
      "name": "Pomstychtiva Pritelkyne",
      "person_id": 61365
    }
  ],
  "release_date": "2019-01-16",
  "scene_id": 44218,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Brunette",
    "CBT",
    "CFNM",
    "Clothespins",
    "Dildo",
    "domestic",
    "Edging",
    "Femdom",
    "Flogging",
    "Hairy",
    "Male Sub",
    "natural boobs",
    "Slapping",
    "slim",
    "Spanking",
    "Straight",
    "thirdparty",
    "Vibrator",
    "white"
  ],
  "title": "Temptation"
}