{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Welcome to the Lesbian Edition of Evolved Fights. We have 100% real competitive lesbian wrestling where the winner fucks the loser. Today we have two trained MMA girls on the mats. Jasmeen “Jungle” Lefleur has trained a lot in striking and some jiu jitsu. She is taking on Cheyenne “The Bitch Wrangler” Jewel who also has some training in standup and ground work. These girls have some sexual tension between them. Jasmeen is a horny powerhouse. She’s curvy in all the right places with a solid ass and muscular legs. Her amazing tits look amazing as they bounce while she fights. Cheyenne Jewel is a lean muscular equestrian. Cheyenne knows how to wrangle beasts and today she’s going to try to wrangle one of the most exotics beasts of them all. There are 3 hard fought rounds. We have evolved our rules slightly during the inception of our brand. We want to make our matches more sexual so we have integrated a penalty segment anytime there is a submission. If there is a submission during the fight, The wrestler to administered and successfully applied the submission will get 20 seconds to do anything she wants to the person who submitted. There is no fighting back during this 20 second penalty. The person to submitted must lay there and take it. We get many orgasms during this time which are not counted towards the outcome of the score because the clock is stopped during this penalty time. After 3 rounds of wrestling and several orgasms, the winner is allowed to take her prize. She makes the loser lick he feet, then she fucks her pussy hard and gags the sound of orgasms with a hand gag. Then the Winner fucks the loser in the ASS giving her a good hard Anal pounding. The winner then uses the loser as a sex toy. The winner face sits and trib fucks the loser then lifts her up and carries her off.",
  "directors": [],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Jasmeen LeFleur",
      "person_id": 59623
    }
  ],
  "release_date": "2019-01-15",
  "scene_id": 44212,
  "tags": [
    "Big Tits",
    "Brunette",
    "Curvy",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Foot Worship",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Lift And Carry",
    "mixed",
    "Muscle",
    "Muscle Worship",
    "muscular",
    "natural boobs",
    "shaved",
    "Smothering",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "top",
    "white",
    "Wrestling"
  ],
  "title": "Two MMA Trained Females Fight and Fuck for the Prize"
}