{
  "collections": [
    "Everything Butt"
  ],
  "description": "Marica Hase does as she's told and Dana DeArmond commands her to fist her ass. Dana gets her ass in the air and Marica gets to it and digs two fingers from each hand into Dana's beautiful ass and spreads her hole like a speculum. She tongue fucks Dana's ass and Dana grabs Marica's hand and jams it in there. Dana uses Marica's hand like a dildo and fucks herself with it until she cums hard with an Hitachi pressed up against her clit. In the next scene Tori Avano is next up to take a fist from Dee Williams. Dee slips in a few fingers at first and when she's knuckle deep inside Tori's asshole, Tori says she cant take any more. Tori regains composure and tells Dee to send it and soon Dee is wrist deep inside and Tori's asshole cums hard. Dee moves over to Syren De Mer and slides her whole fist inside her ass and licks Syren's pussy while she fist fucks her stretched asshole. In the next scene we have the legendary anal queen Casey Calvert completely naked on her back with her legs spread. Jenna Sativa kneels down next to her and lubes up her hand. She slowly slides it inside Casey's ass and Casey cums hard with Jenna's whole fist inside. Next up is the cute and sexy Alexa Nova who gets fisted in her yoga studio by London River. Alexa returns the favor and gets London face down and ass up. Alexa stretches London out with her fist and even gets eight fingers inside. Then Anna De Ville fists her own ass at the request of her Dom, London river who then gets her own ass fisted by Anna. For the grande finale we have Aiden Starr who has on the backs, Cheyenne Jewel and Kimberly Woods. Their legs are spread and Aiden puts a fist in each of their asses and has them both screaming, laughing and cumming from getting their asses fisted.",
  "directors": [],
  "models": [
    {
      "name": "Alexa Nova",
      "person_id": 57359
    },
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Marica Hase",
      "person_id": 44408
    },
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Jenna Sativa",
      "person_id": 57072
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Kimber Woods",
      "person_id": 54178
    },
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Tori Avano",
      "person_id": 55975
    },
    {
      "name": "Anna De Ville",
      "person_id": 59053
    }
  ],
  "release_date": "2019-01-25",
  "scene_id": 44220,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "buttplug",
    "Compilation",
    "Dildo",
    "Dominatrix",
    "Fisting",
    "Gaping",
    "gloves",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "Speculum",
    "Straight"
  ],
  "title": "Velvet Gloves, A Fisting Compilation "
}