{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Barbary Rose knows why you’re here, but you’re going to have to earn it. That’s right, you can look but you can’t touch. No, not even yourself. You have to sit and restrain yourself from grabbing your cock. Sit and watch her feel her big beautiful tits. Watch as they are perfectly perched on top of her waist clincher with just a small strip of mesh separating them as she squeezes them together. “You’re gonna have to learn how to practice patience,” she says as she feels her tits and moves her hands down her body on to her knees. She pulls her legs apart to show her pussy peeking out from a hole in her fishnet stockings. Just look at her dripping cunt but don’t you dare touch your dick. She’s going to teach you how to earn your orgasm. Her pussy is spread for you to see everything little bit of her lips and hole. She rubs her clit and knows you’re getting hard for her, but you better not touch yourself. She’s dripping wet and rubbing her juice all over her clit. She strokes herself over and and over again and begins to moan. She tells you that she is going to cum before you, those are the rules, and then gives you permission to touch your cock. She strokes herself slowly and then dips a finger inside her pussy. Don’t you wish you could be inside her? Well, you don’t get to be inside her. She instructs you to stroke your cock slow, mirroring her own pace. That’s right, watch as she slowly finger fucks herself, and you are just longing to put your cock inside of her. She knows you want to cum, but she’s going to draw it out and tease you by starting and stopping and making you do the same. Remember, you are not allowed to cum before her. You have to wait. She tells you to start stroking your cock again, but slowly and just the head. Then she slides two fingers into her cunt and starts finger fucking herself harder and faster. Okay, now you can stroke your whole cock. Now, just the head. She turns around to show you her big juicy, ass. Don’t you want to worship her beautiful asshole. She spreads her ass cheeks for you and tells you to keep stroking. She starts to move back, swerving her hips as if she’s riding your cock. Now it’s time for her to cum. She turns back around and begins to rub her clit with a vibrator. As she rubs herself she instructs you to grip your cock firmer and stroke it harder. She presses the vibrator hard onto her pussy and keeps rubbing. She rubs harder and faster instructing you to do the same with you cock. She builds up the rhythm with her vibrator and cums hard. Now that she has had an orgasm she continues to instruct your masturbating. It’s technically your turn to cum, but she wants you to beg for it. “Please Barbary, let me cum for you.” Ask her again. She tells you to stroke just the head, and fast, stroke the whole thing now with a nice firm grip as she rubs her pussy for you. She gives you a countdown. She starts to countdown from 10. “2…make it good for me…1”. Now cum. Good boy.",
  "directors": [],
  "models": [
    {
      "name": "Barbary Rose",
      "person_id": 54183
    }
  ],
  "release_date": "2019-01-17",
  "scene_id": 44223,
  "tags": [
    "Big Ass",
    "Bondage",
    "bottom",
    "Collar",
    "Corset",
    "Cuckolding",
    "Femdom",
    "Fetish",
    "Fingering",
    "Fishnets",
    "Hitachi",
    "JOI",
    "Kinky",
    "Lingerie",
    "masturbation",
    "natural boobs",
    "Redhead",
    "Solo Female",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "toned",
    "top",
    "unshaved",
    "Vibrator",
    "white"
  ],
  "title": "Kinky JOI: Barbary Rose's Goddess Body"
}