{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Whiny little sneak thief Tim Taylor breaks into the house of Oskar, a guy he tricked with the week before. He is stealing the candlesticks and silver when Oskar jumps him, cuffs his hands behind his back, drags him upstairs, throws him down in a corner and rips off the balaclava hiding his face. At this point we discover just how whiny Tim is, as he pleads over and over with Oskar not to hurt him. His whining gets on Oskar's nerves. He gags Tim with a big leather plug gag, then drags him up another flight of stairs to a dark blue room with only a cot and a puppy cage in it. Oskar kicks Tim into the cage, locks it, leaves, and returns some time later, bare-chested and clad in leather pants and boots, disgusted to discover that Tim has peed his pants. Oskar informs Tim that though they had nice and gentle sex together the week before, which was the way Tim had wanted it, they're going to do things his way now. Furthermore, he's decided that Tim needs to make a career change and become his slave, or go to jail. He gives Tim no say in the matter, and Tim's training begins. Still gagged, and with his hands still cuffed behind his back, Tim is pulled out of the cage. One end of a long chain is locked around Tim's neck, the other end locked to the head of the steel-frame single bed, giving him only a few feet to move in any direction. Uncuffed, Tim is ordered to take off his clothes and hand them to Oskar, who goes through his pants pockets, finds his wallet and learns that Tim's a lost kid who won't be missed by anybody. After locking Tim's clothes away in another room, Oskar returns to start Tim's serious training, using a wooden paddle to teach Tim various protocols, and threatening him with the gag or punishment, or both, if Tim makes irritating mouth noises or misbehaves. The scene concludes with Tim learning to kiss and lick Oskar's boots. When Tim speaks out of turn, he is regagged.",
  "directors": [],
  "models": [
    {
      "name": "Tim Taylor",
      "person_id": 61851
    },
    {
      "name": "Oskar",
      "person_id": 61552
    }
  ],
  "release_date": "2019-01-22",
  "scene_id": 44230,
  "tags": [
    "blond",
    "Bondage",
    "Cage",
    "CBT",
    "Chains",
    "domestic",
    "Feet",
    "Gag",
    "Gay",
    "Leather",
    "masturbation",
    "Paddle",
    "shoe licking",
    "Slave",
    "takedown",
    "thirdparty",
    "Twink"
  ],
  "title": "Catch a Thief: Caught in the Act"
}