{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Britney Amber is new and naive at her local gym. She starts to do some stretches before working out and keeps to herself. The other guys at the gym can't help but stare at her hot smokin' body. One of the guys, Stirling Cooper, asks if she'd like some pointer's on how to stretch properly. Although reluctant at first, Britney amuses Stirling and lets him show her something. Britney is then suddenly surprised to be surrounded on all sides by the other guys at the gym. They slowly move in closer to her and start grabbing and groping at her body. They lift her shirt up and off, exposing her big beautiful tits. They kiss and lick her nipples as they rub her pussy through her black lace panties. She drops to her knees and they whip out their big hard cocks. She sucks all of their cocks in a hot blow-bang and then the guys tie her up in rope bondage. Now all tied up in rope, they use Britney's mouth again. This time with her arms unable to move around because of the ropes, they line up to fuck her mouth and throat. They place her on her back and tie her into a different predicament and take turns fucking her ass and pussy deep and hard and raw, going back and forth. Next she sits on one of their fat cocks, sliding it into her pussy and the others take turns fucking her ass deep and hard in an intense double-penetration scene. She flips over to the reverse cowgirl position and anchors another fat cock in her ass while the rest of the guys take turns now fucking her pussy. After both holes get fucked and thoroughly wrecked, all of the guys shoot their big loads all over Britney's pretty face.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Britney Amber",
      "person_id": 57340
    },
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-03-06",
  "scene_id": 44243,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "Big Tits",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "fake boobs",
    "foreskin",
    "Gangbang",
    "Latin",
    "mixed",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "toned",
    "top",
    "white"
  ],
  "title": "Britney Amber is Gettin' Pumped"
}