{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Holly Lace arrives to class ready to teach! Unfortunately, her rowdy students aren't interested in getting taught. Instead of breaking out their books, they check her out and convince her that to be a good teacher, she's got to fuck all of them. They feel her up, and push her to the floor. Holly is a little overwhelmed, but she wants to be the best teacher for her students, so she starts sucking. She sucks every cock put in front of her with gusto. Suddenly, the Headmaster, Stirling Cooper, enters catches Holly servicing her students! Holly is mortified. Stirling is shocked to see Holly on her knees with cock in her mouth. She tells him she'll do anything to keep her job. Stirling has seen a little of what Holly can do and decides Holly can keep her job if he gets to join in. Soon Headmaster and students are being serviced by pretty Holly's sweet mouth. Next, they tie her up and fuck her over the desk. Holly gets fucked in her pussy by all the boys and their Headmaster. She sucks their cocks, and cums hard as they play with her slutty cunt. Once her pussy is stretched open, they turn their attention to her cute ass. Holly moans as they slide into her ass. She's never been fucked anally before and had no idea how good it would feel! The boys take turns fucking her ass and then decide it's time to fill all their teacher's holes at once. Holly gets cocks in her pussy, ass, and mouth. She moans as those cocks slide in and out of her wet holes. Finally, the boys and Headmaster cum all over her pretty face and leave her sitting, covered in cum and hornier for cock than she's ever been before.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Holly Lace",
      "person_id": 61863
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    },
    {
      "name": "Anthony Gaultier",
      "person_id": 61868
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    }
  ],
  "release_date": "2019-03-20",
  "scene_id": 44244,
  "tags": [
    "Anal",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Penetration",
    "Facial",
    "Gangbang",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Teacher"
  ],
  "title": "School of Hard Cocks: Hot Teacher Disciplined by Students, Headmaster"
}