{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "1. Tim gagged and strapped to spanking bench. After a few preliminary spanks, Oskar plays with Tim's balls, squeezing them and flicking at them with his fingers. He then devotes himself exclusively to Tim's ass, warming him up with multiple gentle hand spanks that grow harder. From these he graduates to a black leather slapper, and follows that with a razor strop. At the end, Tim is raising his ass up to receive the swats.\n2. Oskar sitting up naked in his own bed, legs spread as he leans against the wall, with Tim, naked and bound and (plug)-gagged between his legs. Oskar dials the police, warning Tim not to make a sound unless he wants to go to jail. Oskar tells the cop who answers, and who appears to be a fuckbuddy of his, that he's found a car on his property (the one Tim drove in to get to his place, which he knows Tim stole from another trick) and he has no idea how it got there. The cop tells him the police will pick the car up and find its owner. Some small talk before Oskar hangs up and concentrates on Tim.\n3. Different angles Tim plug-gagged and hogtied in the cage with connecting Hyatt cuffs and leg irons attached to a chain locking them to the top of the cage.\n4. Tim gets flogged. Spreadeagled in the barn. Leather Wrist restraints. When he starts screaming too loudly, Oskar gags him.\n5. Tim plug-gagged in cage, hands mitted, cock caged. He tries in vain to play with his inaccessible cock.\n6. Tim collared, cock-caged, on the blue-room bed, attached to bed by long chain. He tries to play with his cock, unsuccessfully even without mitted hands. He gets up, tests the length of his freedom, and finally flings himself on the bed, ass up, head buried in a pillow, as he plays with his asshole.\n7. Tim cleans the bathroom. Oskar stands over him as, in connecting Hyatt wrist and ankle irons, Tim scrubs the bathroom floor, then the toilet bowl\n8. Tim tied up inside his cage. Hands mitted, mouth plugged, collared, cock caged, he thrashes around hopelessly.\n9. Tim cleans a brass bed frame, while Oskar stands over him and silently gives directions.\n10. Tim in cage, plug-gagged and in rigid irons. From the look of acceptance on his gagged face, he's adopting a more philosophical attitude toward his situation.\n11. Bedtime. Tim, head-harnessed and cock-caged, is placed in sleepsack on the blue room bed. The sleepsack is then tied securely to the bedframe. Oskar says, \"sleep tight,\" and turns out the light\n12. Breakfast: Oskar at the table, eating breakfast and reading the paper. Tim, collared and in irons, eats out of a dogbowl at his feet. At a slap on the butt from Oskar, Tim immediately pushes his bowl away and gets under the table to suck Oskar's cock.\n13. Tim asleep in his cage, collared and cock-locked. He is awakened by Oskar, home from work, coming into the room. Oskar unlocks the cage door. Tim crawls out of the cage, gets on all fours and kisses Oskar's shoes.\n14. Dinner Time. Tim in collar, cock cage and wrist/ankle chains, comes in with a bottle of wine to refill Oskar's glass, then stands back awaiting orders.\n15. Tim vacuums the living room while Oskar reads the paper. With hand signals and finger snaps, Oskar directs Tim to turn off the vacuum, fall to his knees, bend to kiss Oskar's feet, get upright on his knees, stick out his tongue, suck Oskar's cock. While Tim is sucking, Oskar leans over to kiss the top of Tim's head.",
  "directors": [],
  "models": [
    {
      "name": "Tim Taylor",
      "person_id": 61851
    },
    {
      "name": "Oskar",
      "person_id": 61552
    }
  ],
  "release_date": "2019-01-29",
  "scene_id": 44245,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Cage",
    "Chains",
    "Chastity Play",
    "Collar",
    "Cop",
    "Deprivation",
    "Discipline",
    "dungeon",
    "Feet",
    "Flogging",
    "Gag",
    "Gay",
    "Leather",
    "Male Handler",
    "Paddle",
    "shoe licking",
    "shoe worship",
    "slapper",
    "Slave",
    "Spanking",
    "the wall",
    "thirdparty",
    "top"
  ],
  "title": "Catch a Thief: Slave Training pt. 1"
}