{
  "collections": [
    "Families Tied"
  ],
  "description": "Cadence Lux, India Summer and Tommy Pistol really turn up the intensity in this week's Families Tied. Cadence is an all-natural beauty, glowing with the knowledge that her boyfriend Tommy is about to propose. She begs her hot Step-Mother India Summer to come over on Valentines Day so she can introduce her to Tommy and get her blessing. But instead of romantic bliss, Cadence finds herself in a world of trouble: Her Step-Mother is an FBI agent that happens to recognize Tommy as an at-large drug smuggler. India sneaks around the house collecting evidence and calls in for a search warrant. Tommy catches her and sends Cadence away on an errand so that he can interrogate India. Heartbroken and heavily armed, Tommy soon has India stripped down and begging for forgiveness on his living room floor. Unsatisfied with her story, he fucks her throat, zapping her tight MILF body all over with an electric device until he gets the truth about whether Cadence was a plant all along. India is drooling and whimpering with her arms pinned behind her back, but Tommy still doesn't buy it and bends her over for a hard flogging and doggy fuck in belt bondage. Bent over the couch like a whore, India tries to cover it up, but she is turned on being treated like a worthless fuck doll and starts to cum on Tommy's dick. Humiliated and orgasming she begs him to stop, but he continues to interrogate her while fucking her tight wet pussy. When Cadence gets back home she find India completely naked in a painful shibari tie. Her mouth is stuffed with a ball gag and her ass full of a cold metal ass hook. Tommy is standing over India with a bunch of questions for Cadence. Cuffing his girlfriend's hands behind her back he presses her face against her Mom's freshly fucked cunt and starts asking questions. Cadence tries to tell him she didn't know, but her cunt gets wet from having her hands cuffed and Tommy gets a bit distracted. He fucks her sweet pussy until she squirts everywhere and then interrogates her with hot candle wax on her nipples. India's ass looks extra fuckable, so he throws Cadence on the floor and raw dogs her step-mothers ass right in front of her nose, stuffing his cock in Cadence's mouth to get it wet from time to time. When Cadence finally convinces Tommy that she truly loves him, and will even forsake her own family for him, he demands she prove it by helping him degrade India. Cadence is quick to train, and has a sadistic glint in her eye as she pushes India onto her fiance's cock and flogs her ass as she gets pounded. India begs to have anal orgasms, but Cadence is power mad and just zaps her instead. Cadence pushes her cunt into her Mom's mouth and gets off, squirting all over India's surprised face. Pushing India off Tommy's dick, she rides her future husband with hungry vigor, cumming and groaning with pleasure. She pushes India to the floor to catch Tommy's cum with her face, then leaves her covered in jizz and bound in duct tape for the cops.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    },
    {
      "name": "India Summer",
      "person_id": 16909
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-02-15",
  "scene_id": 44240,
  "tags": [
    "Ass Hook",
    "Ass To Mouth",
    "Ball Gag",
    "Bondage",
    "Family Roleplay",
    "Flogging",
    "Gag",
    "MILF",
    "Rope Bondage",
    "Squirting",
    "Straight",
    "Zapper"
  ],
  "title": "Agent India Summer's Ass is Destroyed by Son-In-Law"
}