{
  "collections": [
    "Families Tied"
  ],
  "description": "Seth Gamble is home from college to stay with his step-mom Cherie DeVille. But when he arrives he finds she already has a guest. Carolina Sweets has been a naughty girl at home, and has been sent to stay with Cherie for some intense bible study. Cherie is quite the stern, sexy MILF, and she loves punishing Carolina for everything. So when catches Carolina masturbating when she should be studying, Carolina gets a dirty over-the-knee spanking and a humiliating lecture about being a whore. Lucky for Carolina, Seth delights in brining out the hypocrite in his step-mom, who has a slutty suburban sex drive to match her uptight religious streak. Seth isn't home for more than 30 minutes before Cherie is on her knees, begging to be punished and presenting him with all the sex toys she purchased for him. Seth knows how to keep the upper hand in this house, and ties Cherie in a tight rope harness, putting a cold metal hook in her perfect ass and teasing her until she can barely keep her composure. Cropped, flogged, and degraded Cherie continues to struggle to get that hard cock in her mouth and pussy, throwing herself against Seth, hoping to cum just one time on her step-son's dick. Seth is Carolina's favorite kind of trouble, and she is soon tempting him to pull her plaid skirt up around her waist and get his cock wet. Thrown around her bedroom and throat fucked, Carolina cums many times on Seth's cock before Cherie catches them fucking around. Carolina is shocked to see Seth throw Cherie on her knees, and even more pleasantly surprised when he takes her hips and places her hungry cunt on her lips. Getting the hang of how this twisted household works, Carolina is inducted into a summer of electro play, rope suspensions, orgasms denial, nipple clamps, corporal, and anal sex. That's one lucky, naughty girl!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Carolina Sweets",
      "person_id": 61749
    }
  ],
  "release_date": "2019-03-01",
  "scene_id": 44241,
  "tags": [
    "Ass Hook",
    "Ball Gag",
    "Crop",
    "Family Roleplay",
    "MILF",
    "Nipple Clamps",
    "Oral Sex",
    "Pussy Eating",
    "harness",
    "Rope Bondage",
    "Spanking",
    "Straight",
    "Threesome"
  ],
  "title": "Psycho Anal Step-Mommy Cherie DeVille Is Put in Her Place"
}