{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "You've come to Chanel Preston's dungeon eager to worship every inch of her body. But it's up to her to decide when and where you'll be able to plant your lips and wandering hands. You see, now that you're in her presence she owns you, and your pleasure. You start with your eyes on her heels and slowly move your gaze up along her beautiful, long legs. Chanel knows that your cock is getting hard, and that you're just dying to touch yourself. Well you can't. Not until she gives you explicit permission. Do you think you're worthy of pleasuring yourself before this goddess? No, not yet. You must wait until she gives you explicit permission. For now you're simply allowed to admire her body while remaining completely still. She runs her hands along her thighs and up to caress her luscious tits that are trapped beneath a skin tight see through top. She rubs them over and over again letting them squeeze and bump together. You want so badly to touch yourself but Chanel is just going to tease for now until you're practically begging for it. She starts to slowly pull her blouse down and asks you if you want to see her tits. Her breasts are starting to bulge out above her neckline as she teases you more before revealing her nipples to you. With her nipples still hidden she gives you permission to touch your pants but not what's inside. That's right, you may rub the outside of your pants and make sure that your cock is nice and hard. She keeps rubbing her nipples and keeps teasing you. Now she tells you to put your hand inside your pants as she pops out her perfect pink nipples. She starts to play with them and tells you to rub your cock while she rubs her nipples. You wish you could put your mouth on them and that Chanel would just come close to you and smother you with her tits. She notices that you're stroking your cock faster and faster. But you're not allowed to cum until she tells you to, because she owns your pleasure and your orgasm. She knows that you're a filthy boy that wants to explode his cock all over her tits but don't even think about it. You stroke your cock harder and faster and are begging her to cum. You just want it so badly, but your goddess thinks otherwise. She wants to tease you and tease you until you just can't take it anymore. She knows you want her, yes keeping stroking, She giggles and then authoritatively snaps, \"Cum for me, jerk your cock till you fucking explode everywhere.\" Good boy.",
  "directors": [],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    }
  ],
  "release_date": "2019-01-31",
  "scene_id": 44257,
  "tags": [
    "Bondage",
    "Brunette",
    "Cuckolding",
    "dungeon",
    "Femdom",
    "Fetish",
    "Kinky",
    "Nylons Stockings",
    "Solo Female",
    "Straight",
    "thirdparty",
    "top"
  ],
  "title": "Kinky JOI: Worship Chanel Preston's Breasts"
}