{
  "collections": [
    "CFNMEU"
  ],
  "description": "Rosta Benecky gives us a great dream set, which is a CFNM scene with a very sexy girl. We see him exercising with some weights when the girl arrives to help him. They spend some time exercising together and then the girl begins to seduce Rosta, soon having him naked and showing off his massive, soft, cock and his sexy ass. The girl gives him a few spanks on his ass and turns Rosta around to suck on that huge cock. It grows in her mouth as she sucks on it. Then she turns Rosta around and puts him on his knees so she can see his sexy ass hole as his massive cock and balls dangle between his legs. The girl spanks Rosta's ass and pulls the cheeks wide apart. She slips a finger into his hot hole and fucks it. As she keeps up the fingering she also sucks and chews on Rosta's big balls. Then she spanks that ass some more. With her mind full of possibilities she mores Rosta to another room, tying his arms to a beam so he is at her playful mercy. She alternates between whipping his sexy body and sucking on his huge cock. Then she adjusts his restraints to get his ass available and she takes a dildo on a pole and gets it ready for that ass. Rosta struggles to see if he can release himself, but cannot. The dildo is presented to his ass and she uses the pole to push it in nice and deep. She fucks Rosta's hot ass nice and deep and sucks on his big cock too. Then she dons her strapon and fucks Rosta's ass again. His huge cock stays nice and hard as his ass gets fucked deep. The girl lays down and makes Rosta ride her rubber cock. Releasing the ties she lays him on his back and fucks him some more as he wanks his big cock. She keeps fucking him until Rosta cums and then she picks him up, spanking his ass as she walks away with him.",
  "directors": [],
  "models": [
    {
      "name": "Pomstychtiva Pritelkyne",
      "person_id": 61365
    },
    {
      "name": "Rosta Benecky",
      "person_id": 60770
    }
  ],
  "release_date": "2019-01-30",
  "scene_id": 44253,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "CFNM",
    "Chains",
    "Dildo",
    "dungeon",
    "Femdom",
    "Fingering",
    "Flogging",
    "foreskin",
    "Leather Cuffs",
    "Lift And Carry",
    "Male Sub",
    "natural boobs",
    "Pegging",
    "Rope Bondage",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "thirdparty",
    "Weights",
    "Whipping",
    "white"
  ],
  "title": "Hard Workout"
}