{
  "collections": [
    "TS Seduction"
  ],
  "description": "Jenna Creed sits at her desk at work. She is the head of HR at her big company. She calls in to her office her employee, Jonah Marx because he has sent out a sexually explicit video of himself getting fucked to all of his coworkers. Jonah nervously enters her office, and sits across from her desk. Jenna tells him that she doesn’t understand why he would do this because he’s such a model employee, and that this is a terminatable offense. Jonah doesn’t understand why its wrong and explains that he wanted to share his extra-curricular hobbies with his coworkers and he thought that they would like it . Jonah tells her that he’ll do anything to keep his job so Jenna agrees to make a deal with him and makes him stand up and strip off all of his clothes. Once completely naked, Jenna handcuffs Jonah to her desk and takes out her big black leather flogger. Jenna whips Jonah’s bare ass with the flogger. After that, she uncuffs Jonah and tells him to get on his knees. She takes off her dress, exposing her natural pierced tits and pulls her hard dick out from inside her panties. She tells Jonah to suck her cock and Jonah quickly gets to work, deep throating her cock with lots of spit and drool. Jenna turns him around and slides her stiff cock into his tight ass and fucks him hard, fast, and raw. She pounds his hole in doggie and then flips him over to fuck his ass some more. With his legs spread open wide, she fucks him even harder until he cums all over himself. She feeds Jonah his own cum and tells him to get on his knees for her turn to blow her load in his face.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Jenna Creed",
      "person_id": 61318
    },
    {
      "name": "Jonah Marx",
      "person_id": 51893
    }
  ],
  "release_date": "2019-04-02",
  "scene_id": 44268,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Cock Worship",
    "drool",
    "Leather",
    "Male Sub",
    "natural boobs",
    "Role Play",
    "shaped",
    "slim",
    "spit",
    "Straight",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Jenna Creed and Jonah Marx: Get Fired or Get Fucked"
}