{
  "collections": [
    "Bound Gods"
  ],
  "description": "Wesley Woods is bound in leather, rope, and chain. He is suspended on a knee, awaiting the whims of Master Sebastian Keys. Sebastian can't wait to wipe the smirk off this boy's face. He slaps Wesley for every infraction, delighting in the Wesley's hungry moans. He pushes his gloved fingers into Wesley's mouth and Wesley sucks them like the eager slut he is. Wesley moans as Sebastian pinches and pulls his nipples! Sebastian's grip is like a vice, and every tug has Wesley lost in a haze of pleasure and pain. He screams when Sebastian bites down on his sensitive nipples and squirms in bondage, unable to escape. Sebastian leaves no area on this slut untouched; he beats Wesley's chest, his stomach, his ass, his cock, and his feet with fist, flogger, and crop. Wesley can't help but love the pain. He screams and asks for more, more, more! Next Wesley is gagged and pulled up to his toes. Sebastian continues to flog his front and his ass as Wesley cries out. His cock and balls are held tight by Sebastian as Sebastian relentlessly flogs his abs, each stroke harder than the last. Today he's at the mercy of Mr. Keys and there is no mercy here. He gets pushed down on his knees and swallows Sebastian's rock hard cock, taking it to the hilt. Then he is blindfolded and bound to bamboo. Sebastian drips hot wax along his body as Wesley cries out. After dripping hot wax on Wesley's cock, Sebastian steps on it with a heavy leather boot. Pleased by Wesley's cries, he hoists Wesley into the air and gives him a good hard pounding! Every second of today's pain has led to this. Wesley loves getting used and quivers as Sebastian fucks his ass. After he's had his fill, Sebastian jerks off all over Wesley's face before wrapping his hand around Wesley's dick. Desperate to cum, Wesley looks down at Sebastian's gloved fist around his hard cock. Finally, he gets to blow his load all over those leather gloves.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Wesley Woods",
      "person_id": 59211
    }
  ],
  "release_date": "2019-03-14",
  "scene_id": 44266,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "Boot",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "directorspicks",
    "Domination",
    "Feet",
    "Gay",
    "gloves",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Pushing Wesley: Wesley Woods submits to Sebastian Keys"
}