{
  "collections": [
    "Bound Gods"
  ],
  "description": "Brian Bonds sits on the floor of a dungeon, alone and completely naked with his back against a dirty brick wall. Around his neck is a collar that's been chained above him to the wall. Brian's dick stays hard with the thought that hopefully he'll get a visit today from his muscle-stud captor, Jason Collins. As luck would have it, Jason Collins cavalierly enters his dungeon shirtless, wearing leather pants and leather boots, holding a big leather paddle, muscles blazing. Brian gives him his best puppy-dog eyes and begs to serve him, telling Jason all of the ways in which he would do so. Jason tells Brian to get up on his knees and paddles his chest and legs until Brian's skin turns bright pink. He attaches a clamp to each of Brian's nipples and makes him lay on his back. Jason takes his boot and steps right on the middle of Brian's chest and pulls upward on the chain that connects the two clamps, making his scream in pain. After the nipple torment, Jason releases Brian from the wall and wraps him up in rope and suspends him from the ceiling with his ass exposed. Jason shaves around Brian's asshole with an electric shaver and gets it ready for his fat cock. He then tenderizes Brian's ass with his leather flogger. After a thorough ass beating with the flogger, Jason lets Brian down from the rope suspension and flips him over with his face down and his ass up. With his arms still tied with rope behind his back, Jason grabs the ropes around Brian's wrist like a cowboy mounting a bull. He shoves his huge cock deep inside Brian's asshole and fucks him deep, hard, and fast. Jason makes Brian suck his cock and Brian is so turned on to suck his master that he blows his own load all over Jason's boots just before Jason blows his in Brian's face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 33737
    },
    {
      "name": "Jason Collins",
      "person_id": 61577
    }
  ],
  "release_date": "2019-02-28",
  "scene_id": 44260,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "Nipple Torment",
    "Paddle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "Suspension",
    "the wall"
  ],
  "title": "Brian Bonds: Locked Down"
}