{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Jessie Sparkles wants to be challenged, pushed, teased, hurt and driven to the edge by the hands of blonde Dom Helena Locke. Standing up and tied up to a rack Jessie gets the flogger on his chest until he is breathless. But that isn't quite far enough so black latex clad Helena slaps and punches his chest until it is bright red and he is screaming and shaking. This is what being pushed is all about--taking so much pain or stimulation that you don't think you can stand another second of it but you do and the challenge feels so good. She soothes him with tender strokes on his face and warm whispers but not for long because Helena has so much in store for Jessie Sparkles. On all fours strapped in and tied up Helena paddles Jessie's butt and back to get him warmed up before she fucks his little ass with a strap on. First her cock needs be lubed up so she crams it in Jessie mouth and gets it all nice and sloppy wet so it will slide deep inside his tight ass. She struts back to his arched up ass in her platform heels and teases his asshole with her cock until she finally slides it in and fucks his hole. Next we find Jessie Sparkles laying down on his back with nipple clamps on his nipples and lots of red clothes pins pinching tight on his sensitive balls as Helena flicks and pulls on them to test him. To punish Jessie for ruining her stockings she sticks her foot in his mouth to make him worship her feet and then smothers him with her curvy ass so he can make up for being so bad. Then she removes each clothes pin one by one leaving Jessie and his balls red, sore and suffering. She spits in his mouth to get it all wet and sits on his face so he can worship her ass and pussy. She rides Jessie face as he licks her cunt and ass until she is moaning with pleasure and vibes her clit until she cums all over his suffocating mug. But Helena is not done with Mr Sparkles so she flips him around and strokes and teases his already hard cock. He must not cum until she allows it of course so he has to be strong and not screw up because Helena wants to fuck him until she is good and ready for him to cum. She mounts him and slides his cock inside her cunt and fucks him good up and down and all around and grinds her wet pussy all over his dick and it drives Jessie crazy until she finally lets him shoot his load all over himself. Thank you Ma'am!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Jessie Sparkles",
      "person_id": 27566
    }
  ],
  "release_date": "2019-03-26",
  "scene_id": 44269,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Latex",
    "Male Sub",
    "Nipple Clamps",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "rack",
    "Rough Sex",
    "Slave",
    "Straight",
    "Strap On"
  ],
  "title": "Locked and Loaded: Helena Locke drives Jessie Sparkles to the edge"
}