{
  "collections": [
    "Men On Edge"
  ],
  "description": "Micah Martinez is starting his job as the new PA for KinkMen. He arrives and is greeted by Dominic Pacifico, who shows him around and assigns him his tasks for the morning. Micah is intrigued by all the toys around him and once Dominic leaves, his curiosity gets the better of him. He picks up a masturbation sleeve and tries it out. Fucking the sleeve feels so good and he's hard in no time. Micah is having so much fun, he doesn't realize Dominic and Sebastian have arrived on set! Caught in the act, Micah apologizes but it's not enough. Dominic and Sebastian decide to teach this wayward PA a lesson. They strap in him to a table with leather, gag him, put nipple suckers on him, and reveal his very excited cock. Dominic sucks his cock and Sebastian brings out a vibrating sleeve to tease Micah. Micah's cock leaks pre-cum and his body shakes as he begs to cum, but his captors aren't going to let him off easy. They tickle him all over, paying extra special attention to his sensitive feet. Then they blindfold him, tie him up, and inspect his hairy asshole. Dominic tugs on his cock and balls while Sebastian pushes a vibrating dildo in his ass. After the dildo, Sebastian uses a vibrating prostate stimulator. Micah loves it. His hole pulses with the vibration and he wants to cum so badly! Now that his hole is stretched, Sebastian and Dominic push a huge dildo into his greedy hole. After they fuck him with it, they flip him over and jerk him off. Micah blows a huge load all over his chest and then is mercilessly tickled again by Sebastian and Dominic!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Micah Martinez",
      "person_id": 61856
    }
  ],
  "release_date": "2019-03-05",
  "scene_id": 44264,
  "tags": [
    "BDSM",
    "Big Toy",
    "Blindfold",
    "Bondage",
    "Dildo",
    "Dragon Dildo",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Hairy",
    "Leather",
    "Male Handler",
    "Male Sub",
    "masturbation",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling"
  ],
  "title": "The Curious PA: Newbie Micah Martinez gets taught a lesson!"
}