{
  "collections": [
    "Men On Edge"
  ],
  "description": "Archer Croft is a brand new addition to Kink Men. This ripped-muscled, pierced, and tattooed surfer-hunk is shooting porn for the first time ever, here on Kink.com. Bondage veteran, Sebastian Keys and Dillon Diaz give Archer a nice warm welcome as he waits anxiously in their dungeon. Sebastian strips Archer's shirt off of his body and begins wrapping black rope around Archer's ripped pecs. Sebastian restrains Archer's hands behind his back with rope so he's unable to touch his own dick and anchors him to the ceiling. Dillon takes Archer's pants down revealing his already rock-hard, pierced cock. Dillon gets to work on Archer's dick, licking and sucking just the tip that sticks out of his little black underwear. Dillon gets Archer completely naked and sucks his pierced cock while Sebastian covers Archer's eyes with a blindfold. They get a wand vibrator with a stroker attachment and place it over Archer's dick and get him close to cumming. Next, Sebastian uses more rope and he lifts Archer in the air so he's lying face-down in a full suspension. Dillon gets underneath Archer and starts sucking his cock above him like a hungry baby bird. Dillon deep throats Archer's cock while Sebastian spins Archer around. Sebastian gets a dildo attachment for the wand vibrator and sinks it into Archer's ass while Archer gets his cock sucked from below. In the final scene, Archer's arms and legs are tied with rope to an examination chair on his back. With a black ball gag in his mouth, Dillon sucks and strokes Archers hard cock while Sebastian tickles his feet. Sebastian inserts a prostate vibrator into Archer's ass and the combination of the prostate vibrator and Dillon stroking his cock send him into outer space and he cums hard through his Prince Albert piercing.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Archer Croft",
      "person_id": 61844
    }
  ],
  "release_date": "2019-03-19",
  "scene_id": 44265,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blindfold",
    "Bondage",
    "Dildo",
    "dungeon",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Leather",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Suspension",
    "Tickling",
    "Vibrator"
  ],
  "title": "Archer Croft: Ripped Roped and Ready"
}