{
  "collections": [
    "TS Seduction"
  ],
  "description": "DJ is told he’s not allowed to snoop in his doctor’s office, but there are so many odd implements he can’t resist poking around. Unfortunately for him, hot latex nurse Aspen Brooks arrives to find DJ doing exactly what he’s been told not to. She orders him on the table so they can being their stress test. She opens his legs and runs the pinwheel along his cock for the first test. DJ yelps as the cold metal spikes press into his sensitive cock. Aspen smirks and grabs a mouse trap next for this misbehaving patient. DJ’s body jumps an inch off the table as the metal closes around his cock. He cries out in pain, but the test is far from over. Aspen closes his balls into a ball crusher and screws the plates nice and tight as DJ squirms on the table. She laughs before ordering him to his knees. DJ can’t believe this is happening, even as he wraps his lips around Aspen’s big hard cock. He sucks the length as Aspen moans and presses his head down on her cock. Once she’s had enough of his mouth, she orders him face down and ass up for the final test – a good hard pounding! DJ moans as Nurse Aspen pushes her gorgeous cock into his ass and fucks him hard. Aspen gasps as DJ’s ass clenches down around her cock. Her magnificent breasts bounce as she fucks him in doggy and in missionary. Finally, she blows her load all over his face before ordering him to get dressed for his doctor.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Aspen Brooks",
      "person_id": 59054
    },
    {
      "name": "DJ",
      "person_id": 20225
    }
  ],
  "release_date": "2019-03-19",
  "scene_id": 44267,
  "tags": [
    "Anal",
    "big dick",
    "Blowjob",
    "brunet",
    "CBT",
    "Cock Worship",
    "Doctor",
    "Hairy",
    "Latex",
    "Male Sub",
    "mousetrap",
    "muscular",
    "Nurse",
    "Pain",
    "Role Play",
    "shaved",
    "Straight",
    "Tattoo",
    "toned",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Stress Test: Nurse Aspen Brooks Tests Naughty Patient"
}