{
  "collections": [
    "Bound Gods"
  ],
  "description": "Dillon Diaz is tied on his knees with a partial hood on. His muscles ripple as he takes deep breaths, ready for whatever comes next. Latex-clad Arad Winwin watches from across the room. He stalks over to Dillon, hungry to see what Dillon can take. He tests Dillon's pain tolerance with a leather paddle. Dillon moans as Arad hits his chest, his stomach, and his cock. A perfect pain slut, his moaning increases with every hit and his skin turns a bright red. Arad loves seeing his slut so hard and decides to give his boy more pain. He runs a line of close pins across Dillon's chest, and puts more his nipples and balls. Dillon cries out in pain, but his cock stays rock hard. Arad thinks maybe Dillon has it too easy, and ties his legs up off the floor before kneeling and tasting Dillon's cock. Arad removes Dillon's hood and grips his neck as he lavishes Dillon with rough kisses. He spanks and flogs Dillon's ass before bringing him to his knees and taking his mouth. Dillon loves feeling Arad's rock hard cock in his mouth. He takes it all, struggling to keep pace as Arad plunders his hole. Arad tires of Dillon's inadequacies and puts a spider gag on Dillon to keep his mouth wide open. Dillon's drool drips down his body to his hard cock as he services Arad. Finally, Dillon gets to ride Arad's perfect cock as his own cock and balls are trapped in an e-stim cock ring. Dillon is so turned on by the sensations in his cock and his ass that he comes without permission and Arad is none to pleased. He makes Dillon keep riding his cock as he shocks him with a zapper until he's ready to cum. He tells Dillon to get on his knees and then blows his load all over Dillon's face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Arad Winwin",
      "person_id": 61417
    },
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    }
  ],
  "release_date": "2019-03-07",
  "scene_id": 44262,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "directorspicks",
    "Domination",
    "drool",
    "Gag",
    "Gay",
    "Hood",
    "Humiliation",
    "Latex",
    "Leather",
    "Male Sub",
    "master",
    "mixed",
    "Muscle",
    "Paddle",
    "Pain",
    "Pain Slut",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "spider gag",
    "Stud",
    "Submission",
    "Zapper"
  ],
  "title": "Dillon Diaz serves The House"
}