{
  "collections": [
    "Bound Gods"
  ],
  "description": "Fully bound in leather and locked up in chains, hairy muscle slave Brendan Patrick has been caged. This piece of man meat belongs to his hairy leather daddy Kristofer Weston. Clad from head to toe in full leathers, Kristofer lights up his cigar. This is his dungeon and he will fill it thick full of smoke. The smell drives Brendan wild, his hairy holes beg for the hot cigar and his master. Kristofer kicks the cage and reminds Brendan who is in charge here and who that cock belongs to. Kristofer pulls out his slave and blows smoke in his face before going in for a deep hairy kiss. Bending his boy over, Kristofer blows hot thick smoke up Brendan's hairy hole, then turns his cigar over. The heat and the smell fill the room before Kristofer sticks his cigar in Brendan's ass for holding. Don't drop it or there will be hell to pay. Kristofer unleashes a brutal corporal punishment on Brendan's body. His ass turns bright red from the crop and flogger. Maybe Brendan needs to cool off a bit with a mouthful of daddy's piss. Kristofer the ties up Brendan in full rope bondage suspended from the ceiling. He unleashes more torment on Brendan's quivering muscles. Can Brendan's hairy asshole take electric shock and singeing. Finally Brendan's hole is ready for his master. Kristofer delivers a deep anal fucking before unloading his thick load all over Brendan's beard. He then takes Brendan's rock hard cock in his hands and jerks off his slave in full suspension.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brendan Patrick",
      "person_id": 55528
    },
    {
      "name": "Kristofer Weston",
      "person_id": 59522
    }
  ],
  "release_date": "2019-02-21",
  "scene_id": 44261,
  "tags": [
    "Anal",
    "BDSM",
    "bit gag",
    "Blowjob",
    "Bondage",
    "Cage",
    "Chains",
    "Collar",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Flogging",
    "Gag",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "Piss Play",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Smoking",
    "Submission",
    "Suspension"
  ],
  "title": "ASH PIGS: Cigar Smoking Leather Daddy Breaks in His Hairy Muscle Slave"
}