{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "Couple Charlotte Cross and D. Arclyte are enjoying watching Alex More dance and masturbate onstage at a strip club. They seem concerned that the club is not well attended and Alex looks so young, how is she managing to make ends meet? They decide they need to save her from this unstable lifestyle. Alex approaches them hoping for lap dance money and agrees to go home with them.\nBut then, things change. Charlotte comes back with a demure outfit that she demands Alex put on, and also puts her hair in pigtails. Alex goes along with their game but then finds herself naked and getting a hard spanking for being a slut. She's choked with D's tie and made to give him a blowjob while Charlotte smacks her butt with a strap. Next Alex must eat Charlotte's pussy, and play with a teddy bear sex toy. Hard paddling and corporal punishment follow. Then, Charlotte puts Alex in a time out in the corner while she and D fuck. Finally Charlotte makes Alex give her a strap a blow job at the same time as D's real dick. Finally Charlotte fucks her while Alex sucks D's cock. Will poor Alex ever escape the clutches of the people who \"saved\" her from a life of stripping sin?",
  "directors": [],
  "models": [
    {
      "name": "Charlotte Cross",
      "person_id": 58806
    },
    {
      "name": "D. Arclyte",
      "person_id": 59025
    },
    {
      "name": "Alex More",
      "person_id": 61857
    }
  ],
  "release_date": "2019-02-08",
  "scene_id": 44272,
  "tags": [
    "Bear",
    "Blowjob",
    "Bush",
    "Choking",
    "Corporal Punishment",
    "Couple",
    "Crying",
    "Deepthroat",
    "Dildo",
    "drool",
    "Facefucking",
    "High Heels",
    "Kinky",
    "Leather Belt",
    "masturbation",
    "Nylons Stockings",
    "Older/Younger",
    "Paddle",
    "PIV",
    "Pussy Eating",
    "Small Tits",
    "Smothering",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Strap On",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration"
  ],
  "title": "Stripper Lured into Kinky Hell"
}