{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "The adorable Shiri Allwood and Mia Little are having a sleepover. They do each other's make-up, paint nails, take fun pictures, and make prank phone calls. Mia looks for some gum inside Shiri's purse but instead of finding gum, she finds a leather flogger and a ball-gag. Mia gets very excited and tells her friend that she wants to try it. Shiri agrees to let Mia sub for her and tells Mia to take off her lingerie. Mia takes off her lace panties and gets on her knees and sticks her ass high in the air. Shiri flogs Mia's ass and Mia giggles and drools through the ball-gag inside her mouth. Shiri moves down to Mia's feet and rips open her nylons and begins paddling the bottoms of her feet with the leather paddle. Mia takes the thigh-high stockings off of Shiri's long milky white legs and worships her feet, sucking and licking her toes. Mia takes down Shiri's sheer black panties revealing her rock hard cock and starts sucking. She moves up to Shiri's small natural tits and sucks on her pink puffy nipples. Mia, hungry for more cock, goes back down to Shiri's dick and deep throats her whole hog until she's covered in her own drool. Shiri lays back and spreads her long legs and Mia licks her tight little pink asshole. Mia begs for Shiri's cock to be inside of her and so Shiri puts Mia's ass in the air and slides her hard cock deep inside of Mia's tight pussy. She fucks' Mia's pussy hard and fast and then flips Mia over to fuck her some more with her legs spread wide open. After Shiri cums on Mia's pussy and ass, they both have a giggle and tell each other that they can't wait for the next slumber party. that they can't wait for the next slumber party.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Shiri Allwood",
      "person_id": 61393
    },
    {
      "name": "Mia Little",
      "person_id": 51496
    }
  ],
  "release_date": "2019-03-25",
  "scene_id": 44270,
  "tags": [
    "Blowjob",
    "Cock Worship",
    "drool",
    "Feet",
    "Gag",
    "Kinky",
    "Leather",
    "Lingerie",
    "Paddle",
    "Role Play",
    "Straight",
    "Sub",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Sexy Slumber Party"
}