{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Corbin Dallas is jerking off in bed to the curvy bodacious goddess Mimosa. He cums hard imaging Mimosa smothering him under her glorious ass and drifts off to sleep--only to awaken under the very ass he was jerking off too! Mimosa is all for slutty boys who want to worship her. She spits all over Corbin. She crushes his face between her ass cheeks and has him lick her perfect pussy as she rides his face and inspects his goods. Mimosa tastes his cock and slides her fingers into Corbin's eager asshole. Corbin moans as Mimosa has her way with him and commands him to the floor. He removes her shoes and worships her stocking clad size 12 feet. He can barely get her foot in his mouth and shivers as Mimosa wipes her foot all over his face. Mimosa can't get over how cute and adorable Corbin is. She lifts him over her shoulder and gives his little ass a good hard spanking. Corbin squirms but is helpless in the arms of this Divine Goddess. He begs for her cock and she releases him to strap on her long fat cock and plow his asshole. Corbin is collared at the end of her leash with her hard cock stretching open his tight hole. Mimosa laughs as she takes Corbin's ass in doggy and crops his back and ass. She flips him over and continues fucking him as he begs to fuck her. Mimosa grants his wish and Corbin gets to slide his hard cock into Mimosa's juicy cunt. She uses his cock to cum over and over again as Corbin struggles not to cum. He begs to cum as she edges him, denying him for her own pleasure. Finally, Corbin is allowed to cum and wakes up suddenly in Mimosa's robe. Maybe it wasn't a dream after all...",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    },
    {
      "name": "Mimosa",
      "person_id": 57584
    }
  ],
  "release_date": "2019-04-09",
  "scene_id": 44271,
  "tags": [
    "Athletic",
    "BBW",
    "BDSM",
    "Big Ass",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Collar",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "mixed",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Redhead",
    "Rough Sex",
    "shaved",
    "Slave",
    "Smothering",
    "Spanking",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "unshaved",
    "white"
  ],
  "title": "I Dream of Mimosa"
}