{
  "collections": [
    "Device Bondage"
  ],
  "description": "Rosalyn is a petite young slut with a desire to try bondage. She became curious from watching porn and thought that she would give it a try. The Pope brings her in for a Device Bondage shoot, because if you're going to do it, you might as well do it right. She is fitted and then put into the first device, which has her in a standing position with her arms pulled out to the sides. He enters and puts a gag in her mouth and suddenly we get the first signs of nervousness. She giggles to hide her fear of what is going to happen, and The Pope is more than aware of what she is doing. After some flogging and nipple clamps are added, she is pulled into a grueling predicament position to finish her off. Now that she is totally helpless, her pussy is drained with non stop orgasms. We begin the next scene with Rosalyn sitting a wooden chair with custom devices add to hold her legs wide open. The Pope enters and introduces our little slut to some electrical play with the zapper. Her nervous giggles are starting to let her slutty submissive side shine through, so the cattle prod is brought out for her to suffer more. He has toyed with her enough for now, so the vibe and zapper come back out for punishing orgasmic pleasure. The final scene has her on the floor in a spread eagle and locked in place with steel shackles. The Pope finds one of Rosalyn's weaknesses, which is that she is ticklish. He moves between tickling her and controlling her breathing. The end is upon us and it's time to make this slut cum a few more times.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Rosalyn Sphinx",
      "person_id": 61905
    }
  ],
  "release_date": "2019-05-16",
  "scene_id": 44284,
  "tags": [
    "BDSM",
    "Bondage",
    "Cattle Prod",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Fingering",
    "Flogging",
    "Gag",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "Nipple Clamps",
    "Petite",
    "Straight",
    "Submission",
    "The Pope",
    "Tickling",
    "Zapper"
  ],
  "title": "Fresh Meat: Rosalyn Sphinx"
}