{
  "collections": [
    "Device Bondage"
  ],
  "description": "Kendra Spade is one of the sweetest girls, and she's down for almost anything. Today The Pope wants to test this little slut in every possible way with hardcore bondage and brutal punishment. We start with Kendra in a doggy type position with her hands pulled into a strappado. Her neck and ankles are also restrained with steel traps that hold her in a mild squatting position. This will ensure that her body is under constant stress and that she will not be able to find any comfort at any time during the scene. She is flogged and spanked before we see her body betraying her, and her legs begin to give out. The orgasms start and she quickly forgets about the grueling pan in her lower back and legs that have been brought on by pure muscle exhaustion. Next we have Kendra standing, but with deprivation boxes are in play. Her head and hands are trapped in wooden boxes, and The Pope enters to inspect her body. She is fucked with in all of the diabolical ways that only he knows how to do. After he uses various implements to inflict suffering, he slides a bed of spikes under her feet to ensure she suffers until he is finished. Next we have her on her back and her legs held open with steel pipe and leather belts. Her feet are caned and then her pussy, and then he continues to torment her with his cane. She smiles through the tears every time he touches her wet pussy. A large didlo is shoved down her throat and then into her welcoming pussy. The Pope continues to cane her pussy and suddenly we see Kendra have her first of many pain-gasms. The fucking eventually cause massive squirting orgasms that cover the table and floor with her slut juices.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kendra Spade",
      "person_id": 60694
    }
  ],
  "release_date": "2019-06-13",
  "scene_id": 44285,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Brutal Punishment",
    "Caning",
    "Corporal Punishment",
    "Crying",
    "Curvy",
    "Deprivation",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "Muscle",
    "natural boobs",
    "Pain",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope",
    "white"
  ],
  "title": "Innocence Lost: Kendra Spade"
}