{
  "collections": [
    "Device Bondage"
  ],
  "description": "It all started at AVN earlier this year when The Pope was on the hunt for new sluts to torment. He is introduced to a sexy Alt girl who claims she enjoys suffering. She is very timid and and makes no claim to anything but being a \"good girl\" who likes impact and torment. Time passes and the time has come for her to show him what she can actually handle. She arrives on set, very timid and shy, but ready for the day. She begins in a standing position and held in place by lots of steel chains and locks. Her body is shackled in clear rubber, including a head harness that matches the rest of her restraints. The torment begins and is is very clear that Sid isn't just someone who likes torment, but rather a full blown pain slut. The Pope increase the intensity quickly, and all this does is make her smile more, rather than scream. He realizes this and begins to look for anything that will get a response from her, and finds her weakness. Imposed orgasms aren't something she is used to enduring, and it's obvious she enjoys them as much as they make her scream. Next we move on to Sid bent over a steel bar with her ass fully exposed for The Pope to do his damnedest to get this girl to squeal. Her ass is assaulted with floggers, big wooden paddles, and The Pope's massive hands, which finally get this slut purring. He continues to punish her ass until she is a very dark shade of red. The vibe is pressed firmly against her pussy and the dungeon fills with moans of submissive ecstasy as she orgasms uncontrollably. She starts the last scene on her back on the floor spread eagle. The Pope starts to apply a vicious zipper to her flesh that runs from her tits to her knees. Sid is very patient with the process as the clothespins are applied to her flesh with very little space between them. Next hot wax is poured over them to add more sensation for this pain slut. Next The Pope brings in the vibe and finger bangs her until she is ready to explode, then in one quick motion the zipper is ripped from her body to give her the most intense orgasm\nthat she has ever had.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Baby Sid",
      "person_id": 61679
    }
  ],
  "release_date": "2019-05-30",
  "scene_id": 44286,
  "tags": [
    "BDSM",
    "Bondage",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Fingering",
    "Handler",
    "Hot Wax",
    "Humiliation",
    "Metal Bondage",
    "Pain",
    "Pain Slut",
    "harness",
    "Straight",
    "Submission",
    "The Pope",
    "Zipper"
  ],
  "title": "Baby Sid Enjoys the Accommodations"
}