{
  "collections": [
    "Everything Butt"
  ],
  "description": "Chanel Preston arrives to the warehouse to find a very special gift tied up and waiting for her. Joanna is eager to serve her new Mistress and be the perfect pet. She lets out a gasp as Chanel leans in to taste her ass. Chanel's tongue presses against Joanna's hole and it's delicious. There's only one thing Chanel wants today, and it's Joanna's ass. She slips in a stainless steel dildo and pops it out to taste the inside of Joanna's ass. Pleased with what she tastes, Chanel releases Joanna and commands her to worship her asshole. Joanna dives in with enthusiasm, face buried between Chanel's glorious cheeks. Chanel moans as her slave eats her ass and then straps on a long hard cock. Joanna takes it in her mouth, working it, before Chanel plunges it in her asshole. Joanna's ass swallows it up, taking almost the entire toy. Chanel alternates fucking Joanna's mouth and her ass, making use of this sloppy slut. Next, Joanna is on her back as Chanel tries out different toys in her asshole. Joanna's eager hole takes another metal dildo, and a gets stretched open by a speculum. Chanel spits into her open ass and watches her spit disappear down that pink hole. She fucks Joanna with a clear dildo, excitedly watching Joanna's insides open up and take it. Joanna loves it when her Mistress uses her ass and cums hard as she gets fucked. Then Chanel brings out the slink. The full length of it disappears inside Joanna's petite frame. Joanna can't remember the last time she felt so full, she cums again with the slink inside her. Chanel is so turned on, she lubes up her fist and fits almost the entire thing inside Joanna's ass. Joanna screams as Chanel works her ass open on all four fingers. Finally, Joanna licks Chanel's perfect asshole and fucks it with a metal dildo. Chanel cums hard, body quivering with the force of multiple powerful orgasms.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 60449
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Joanna Angel",
      "person_id": 61458
    }
  ],
  "release_date": "2019-03-22",
  "scene_id": 44287,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Lesbian",
    "LezDom",
    "Petite",
    "Slave",
    "slink",
    "Speculum",
    "Straight"
  ],
  "title": "Perfect Pet: Joanna Angel serves the insatiable Chanel Preston"
}