{
  "collections": [
    "Hogtied"
  ],
  "description": "Cherie DeVille is no stranger to Kink.com, or to The Pope. We all love her in every situation, but today she will submit to The Pope. The bondage will test her endurance, and then he will torment her and make her cum against her will. She begins in a beautiful asymmetrical tie that has her face down with her legs spread. The Pope enters and instantly begins to make the tie more grueling before bringing out the crop. He uses this implement to be very precise at issuing pain to her sensitive soles and then her legs. She winces from the pain, but that only feeds the fire for him to continue her suffering. Next he plunges a huge dildo inside of her wet pussy and then makes her cum uncontrollably. In the nest scene, Cherie is face down on the floor with her legs spread as wide as he could get them. The Pope takes a few minutes to enjoy her flesh before moving on to her feet and putting her through a grueling bastinado session. She begs and pleads for him to stop, but all that does is make him do it more. He eventually rewards her with orgasms, then shoves a metal hook inside her pussy and then ties it around her face. More orgasms are ripped form her body before the scene ends. The last scene begins and we have Cherie on her back over a half barrel to stretch her out. The Pope enters and begins to torment her with a brutal flogging. Once he is satisfied with that, he moves on to the cat-o-nine to inflict more suffering to her sensitive nipples. The day closes with The Pope punishing her with constant orgasm, which she hates more than anything.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    }
  ],
  "release_date": "2019-05-23",
  "scene_id": 44282,
  "tags": [
    "Ball Gag",
    "BDSM",
    "blond",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "fake boobs",
    "Feet",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "MILF",
    "Pain",
    "Rope Bondage",
    "shaved",
    "Straight",
    "Submission",
    "switch",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Blond MILF Cherie DeVille in Grueling Bondage Made to Endure Torment"
}