{
  "collections": [
    "Hogtied"
  ],
  "description": "Gia is a young slut that wanted to get put in grueling bondage and then be made to suffer and orgasm at the hands of The Pope. She begins her day in a brutal predicament position on her side. Once he enters, The Pope adds more rope to intensify the tie before cropping her feet and tits. Nipple clamps are added and then the knitting needle is brought out to show our new slut what pain really is. She screams for him to stop, but in the end the only thing that will stop him is the satisfaction that she is suffering. A vibe is pressed against her pussy and orgasms begin to pour out of her young pussy. Gia finds herself in a very compromising suspension in the next scene with her legs spread as wide as they will go. The Pope enters, and as much as she tries to act like she doesn’t like it, she cums with minimal stimulation from him. Next a blindfold is put over her eyes and he begins toying with her with different implements. Her entire body shakes from the impact of his heavy flogger, then he puts the vibe on her pussy again for more mind blowing orgasms. The final scene is starting and her body has almost given out on her; she can’t take much more. The Pope finishes her off with more flogging and then shoves a dildo in her pussy and begins to fuck her. After several more orgasms, she begins to realize that orgasms can be a form of torment too. The vibe is added again and she succumbs to the imposed orgasms brought on by her sadistic master.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Gia Derza",
      "person_id": 61617
    }
  ],
  "release_date": "2019-04-25",
  "scene_id": 44283,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blindfold",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "master",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Playful, Bratty, and Helpless Gia Derza in Bondage"
}