{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Savannah Fox has ass for days that shakes so much she's earned the name \"Queen Quakes\". She has a unique fighting style that is hard for a lot of her opponents to figure out and it has won her several matches outside of \"Evolved Fights\". Today we will find out if those moves will work on an experienced male wrestler. Shawn Fox is Here with an impressive background in wrestling. He's never gone fully competitive against a female before in a sex fight. Today he is taking on his wife. That's right. Shawn and Savanna Foxx are a real-life couple and today on the mats is couples therapy. All the rage and anger they have for each other for leaving the toilet seat up or not doing the dishes is going to come out on the mats for our viewing pleasure. This match is back and forth action. Shawn is able to control Savannah for a bit and ALMOST penetrate her during the wrestling. However, is poor conditioning hinders a lot of his trademark moves. It seems as though his wife has just a tad better physical conditioning over him but he has a ton of muscle strength and weight over her. This match is a lot of fun to watch from start to finish with great sweeps, transitions, submissions, pins and mean holds. It's great to see the power struggle between each of these combatants. Each one gets a dominant position and is able to hold down and molest his or her opponent. Only one can win and after 3 round of hard-fought sex fighting a winner is determined by the judges watching. The winner makes the loser grobble for sex. The loser is made to beg to have orgasms. The loser worships the winner's muscles and is made to lick the sweat from the winner's armpits in such humiliating fashion. The loser gets fucked in the ass just like all losers should be fucked.",
  "directors": [],
  "models": [
    {
      "name": "Savannah Fox",
      "person_id": 47440
    },
    {
      "name": "Shawn Fox",
      "person_id": 51998
    }
  ],
  "release_date": "2019-02-12",
  "scene_id": 44298,
  "tags": [
    "Anal Fingering",
    "Bush",
    "Couple",
    "Dildo",
    "Facesitting",
    "Femdom",
    "Fetish",
    "leg scissors",
    "Male Sub",
    "Muscle",
    "Muscle Worship",
    "Pegging",
    "Petite",
    "Pussy Eating",
    "Rimming",
    "sex fight",
    "Smothering",
    "Spanking",
    "Straight",
    "Strap On",
    "Tattoo",
    "thirdparty",
    "Wrestling"
  ],
  "title": "Petite Female Destroys Strong Man"
}