{
  "collections": [
    "Lakeview Entertainment"
  ],
  "description": "Two bisexual submissives subject themselves to Mistress Tangent. She starts by seating Her gorgeous ass on the face of one so he acts as a human chair while She lashes up the cock of the other one. This one has huge balls and She enjoys squeezing and slapping them. Cock torment is Her specialty and She cannot resist the bursting balls. He holds the cock leash in his mouth as She applies Her brand of fun to his nuts. She produces a crop and spanks the shit out of swelling balls and then stands and knees and busts them. Happy now they are hurt, She moves Her human face cushion over to make him start sucking the thick cock.\n\nMistress Tangent has the little pig sucking the big cock in front of him with his hands bound tight behind his back. She makes sure he is taking it way down his throat as She moves behind him with Her strap-on ready to go. She grabs his leash and impales him on Her hard black cock as his mouth is filled with dick. A nice hard pounding and then She moves along side of him to supervises his cock sucking, wanting to bring a load up out of the cock in his mouth. The stiffness of the big cock makes Her think why not have him fuck himself so She has him turn around and present his ass cheeks so he can drop down and take the cock up his ass while She gazes into the eyes of the big slave, making sure he stays stiff for the ass fucking the little one is taking. The little one is grinding away like a lap dancer who needs to pay the rent that day. She does not want the big one to cum too quickly so She attaches some nipple clamps to him.\n\nThe little one is humping cock hard for Mistress Tangent, his locked chastised cock bobs up and down as he impales himself on the big one’s cock. She thinks it is time for him to suck the hot load from the big swollen balls She has brutalized and orders him to dismount. He pulls his ass off the cock and services it while Mistress Tangent holds his leash. His eager mouth makes fast work and a hot load bubbles out of the stiff cock into his mouth as Mistress Tangent holds his head and Her gaze locks directly on the cum shooter. She makes sure he sucks every drop out of cum out of the big cock and then dismisses the now limp dicked big balled male and begins to fasten the little cock sucker down for a strap-on fucking.\n\nThe little submissive, his mouth still tasting the cum from the load he sucked out a few minutes back, is spread and fucked. His tight little asshole is rocked by Mistress Tangent’s strap-on as Her beautiful perfect natural pierced breasts bob in time with his moans. She tells him to start jacking himself off and keeps fucking him until his cock shoots a wad. She wipes up the cum with Her strap-on and has him lick it off.",
  "directors": [],
  "models": [
    {
      "name": "Mistress Tangent",
      "person_id": 61815
    },
    {
      "name": "Slave",
      "person_id": 61867
    },
    {
      "name": "Slave Lance",
      "person_id": 61801
    }
  ],
  "release_date": "2019-02-15",
  "scene_id": 44302,
  "tags": [
    "Anal",
    "Bisexual",
    "Blowjob",
    "Bondage",
    "bukkake",
    "CBT",
    "Collar",
    "Corset",
    "Crop",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Gimp",
    "Hood",
    "Leather Cuffs",
    "Nipple Clamps",
    "Pegging",
    "Pierced Nipples",
    "Slapping",
    "Slave",
    "Straight",
    "Strap On",
    "Tattoo",
    "Partner Studio",
    "Threesome"
  ],
  "title": "Bursting"
}