{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "There you are on all fours waiting to take your Mistress Gia's pain, but she knows what you really want and she's going to make you work for it. You're gonna have to earn every inch of your Mistress' thick, long cock. She gives her human fucktoy some spankings and traces its flesh with a riding crop. She knows your ass is in the air, eager to feel the tip of her cock sliding in and out of your useless hole. But you have to watch as she toys with her obedient piece of flesh with her thick dick hanging between her gorgeous legs. Her fucktoy has earned the privilege of being in her presence and for now all you get to do is watch. She pulls her perfect tits out to show you more of what you're missing. She gives her slave some more spankings and it takes it so well, because it knows its gonna get her cock deep inside of its ass. It just stays there, like a still piece of meat just how she likes it, while she slowly slides her dick deep inside of her toy. Are you imagining that it's you who's getting their ass filled up? Her piece of meat can take this thick cock, every single inch of it. Are you stroking your cock now? Imagining instead that its your ass getting fucked? Go ahead and stroke your teeny, tiny little thing that you have there and wish that someday you can please her enough to get fucked by her big, hard cock. She's watching your little cock getting harder and harder. You can stroke it but don't even think about cumming. You get to watch as her obedient piece of meat takes her dick, as its hungry ass swallows that big, fucking cock. Your cock is throbbing, dripping, ready to explode as you jerk off wishing you were getting pounded by this Mistress. Get a good look at her ass in the strap-on harness bouncing up and down while she fucks her toy. Don't fucking cum, you better hold it. That's right, not until she tells you to.",
  "directors": [],
  "models": [
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2019-02-14",
  "scene_id": 44309,
  "tags": [
    "Anal",
    "Bondage",
    "Brunette",
    "Crop",
    "Cuckolding",
    "dungeon",
    "Femdom",
    "Fetish",
    "High Heels",
    "Kinky",
    "Male Sub",
    "MILF",
    "Pain",
    "Pegging",
    "harness",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Tattoo",
    "thirdparty"
  ],
  "title": "Kinky JOI: Gia Dimarco's Anal Slave"
}