{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "The amazing and beautiful babe, Jessica Fox is bored in her dungeon with fellow hot femdom, Arabelle Raphael. Dressed up in their best short latex dresses, they wait for a late client. After a long wait they decide that he's flaked and they're not at all happy about it. Jessica tells Arabelle she has some pent up aggression now due to the flaky client and Arabelle volunteers to be her submissive to help her let it all out. Arabelle bends over for her and Jessica flogs her latex covered ass, hard. Jessica lifts Arabelle's latex skirt up, revealing her bright pink ass from getting flogged. She spreads her cheeks and spits on Arabelle's pussy and spreads it open, teasing her clit. Jessica then lifts up her blue latex skirt to let her hard cock breathe. Arabelle gets to her knees and with great enthusiasm starts sucking Jessica's hard uncut cock. Arabelle asks for some spit and Jessica spits into Arabelle's mouth and on her cock making the dick sucking a hot sloppy mess. Jessica gets so turned on that she wants to return the favor. She gets Arabelle up against the wall and licks her pussy. Jessica tells her that she wants to fuck it, and so Arabelle lays on her back and spreads her long legs. Jessica fucks her raw with her hard cock and makes Arabelle cum with an Hitachi pressed on her clit while she gets fucked. Jessica flips her over into doggie-style and fucks her pussy some more. After a lot of fucking, Jessica tells Arabelle to clean her cock off with her mouth and Arabelle sucks her cock so good that Jessica cums right away, all over Arabelle's face. Jessica licks all the cum off of Arabells's face and they kiss deeply with lots of spit.",
  "directors": [],
  "models": [
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Jessica Fox",
      "person_id": 17013
    }
  ],
  "release_date": "2019-04-08",
  "scene_id": 44312,
  "tags": [
    "Blowjob",
    "Cock Worship",
    "dungeon",
    "Femdom",
    "Hitachi",
    "Latex",
    "Role Play",
    "Straight",
    "the wall",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Jessica Fox and Arabelle Raphael: Substitute Submissive"
}