{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Dressed in \"daisy-dukes\", a gingham crop-top, and cowboy boots, country-cutie Natalie Mars works on a tractor part in her barn. Meanwhile, outside of the barn, Riley Reyes' car runs out of gas. Riley walks into the barn with gas-can in hand, wearing only a short slip dress and asks Natalie if she has any fuel. Natalie looks her up and down and tells her that she may have some lying around. All of a sudden Natalie grabs Riley's arms and lifts them up above her head, attaching them to a suspension ring hanging down from the barn's ceiling. Now caught in her trap, Natalie tells Riley she wont need to worry about her car anymore because she's going to turn her into her little piggy play-pet. Natalie starts by cutting Riley's dress and panties off, leaving her completely naked. She puts pig-ears on Riley's head and uses nostril hooks to lift and stretch Riley's nose up into a little piggy nose. Natalie gropes her tits, pinches her nipples, and plays with Riley's wet pussy. She turns Riley around and spanks her perfect ass just before putting a curly pink pigtail butt-plug up Riley's piggy hole. Next, Natalie puts Riley in a small metal cage and drops her daisy-dukes, revealing her rock-hard cock and tells her to suck it. Riley sucks Natalie's cock through the cage while making pig sounds. Natalie turns around and makes Riley lick her asshole. Natalie lets Riley out of the cage and binds her legs with black wrap and puts leather mittens over her hands to look like hooves. Riley makes her walk around on her hands and knees and wiggle her piggy tail while Natalie zaps her with a cattle prod. Natalie attaches suction cups to Riley's tits and uses a hand-pump to pump up her little piggy teats. She lays Riley on her back and spreads her little piggy legs and licks her pussy. She plunges her hard cock deep inside her pussy. She tells her to snort like a pig while she's getting fucked. Natalie turns her around, removes the pigtail butt-plug and fucks her piggy-style until she blows her massive load deep inside Riley's pussy.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Natalie Mars",
      "person_id": 60280
    },
    {
      "name": "Riley Reyes",
      "person_id": 55057
    }
  ],
  "release_date": "2019-04-22",
  "scene_id": 44313,
  "tags": [
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cage",
    "Cattle Prod",
    "Cock Worship",
    "Crop",
    "Leather",
    "natural boobs",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "Suspension",
    "switch",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Natalie Mars and Riley Reyes: Hog Wild"
}