{
  "collections": [
    "Hogtied"
  ],
  "description": "Ashley Lane is a bondage slut, first and foremost. She starting doing porn, but bondage and torment are what this girl lives for. Both she and The Pope know how tough she is, and what she can handle. The Pope starts her out in a grueling side suspension that renders her completely helpless. He adds more rope and tightens it all by tying her neck to one column and her legs are pulled the opposite way to restrict her breathing. Now that the intensity has been raised with stricter bondage, the cat-o-nine makes an appearance to inflict optimal suffering. Every strike causes her to react, which in turn causes her to suffer more from the bondage. Next is the crop so The Pope can be even more precise with the painful torment. The scene finishes off with massive squirting orgasms. Next we have Ashley tethered to a wooden column by her wrist, ankles, and neck. There is no warm up, as The Pope gets right to the good stuff. He flogs her body with a vengeance as she does everything in her power to defend herself. The torment is some of the most brutal we have seen for a very long time, but it's very much within what this slut wants. The brutality continues until finally adding a crotch rope with a bowling ball tied to the end of it. She is rewarded with a few more orgasms and then it's on to the final scene. Ashley is tied to the wooden chair and the bowling ball now hangs from a rope around her neck. The Pope torments her with electricity for a bit, then decides that the best way to make her suffer is through imposed orgasms.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    }
  ],
  "release_date": "2019-05-09",
  "scene_id": 44329,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Crotch Rope",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Rope Bondage",
    "Squirting",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Hardcore Bondage and Domination Makes Ashley Lane A Happy Slut!"
}