{
  "collections": [
    "Families Tied"
  ],
  "description": "The air is tense as Mona Wales and Ashley Lane hear their late father's will read aloud. Ashley is a hot little rich girl on 24/7 spa day while her step-sister Mona is a ice cold corporate bitch who has been trying to earn her father's good graces running his company. When Ashley is assigned all of Daddy's stock shares and full control of the board, Mona is quick to remind her submissive little slut step-sister who has always run the show in their house and in their secret lesbian affections. Ashley has her cute little pink panties snatched and her cunt trapped under Mona's seductive hand. Soon she is in a stress position, with cold metal clamps on her labia and her underwear stuffed in her mouth. Shocked, degraded, and made to lick Mona's ass, she gets her orgasms at the price of her stocks.\nThe CFO of the company has other plans, and confronts Ashley with old photos of her kinky\nlifestyle, and demands that she service his cock to get the photos removed from the internet. Back on her knees, she had a spider gag tied in her slut mouth. Drooling and choking on Tommy's cock, she looks at him hatefully but rubs her greedy submissive cunt anyhow. Seeing she likes being treated like a little whore, he ties her up in tight shibari and covers her in tight clamps. Mona finds her sister getting fucked hard and joins in the fun, ripping off the clamps and riding her little sisters face. Ashley's new position at the company will be squirting on her back with a silent scream as her clit is pinched with a spare clamp. Once Ashley is taken care of, Tommy holds the company stocks over Mona's head and demands to fuck her ass in payment for his signature as witness. This is nothing new for the sleazy slut, but when she had her hands cranked back in an extreme prayer hands rope tie and gets her ass beat red her face contorts in shock and pleasure as she cums from the intense anal and painful shibari. Ashley finds them there, but is dragged to the floor and made to get her older sister's pussy off and lick Mona's well used asshole for Tommy's amusement. With her hand tied in a choke tie, Ashley is made to ride a strict reverse cowgirl, with Mona motivating her with a cane and sharp humiliation. Having served her purpose, Ashley is shoved off the cock and Mona mounts up, enjoying some anal while she shoves Ashley's face against her cunt and demands she lick her clit until Mona has orgasmed on her dumb little face and Ashley is glazed in hot cum.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-03-15",
  "scene_id": 44333,
  "tags": [
    "Choking",
    "Family Roleplay",
    "Gag",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "spider gag",
    "Squirting",
    "Stocks",
    "Straight"
  ],
  "title": "Corporate Anal Whore Sells Out Her Little Sister's Pussy"
}