{
  "collections": [
    "Families Tied"
  ],
  "description": "Riley Reyes and her step brother Derrick Pierce have been siblings and best friends since their parents married. Derrick has been the protective big brother since high school, keeping a close eye on his submissive little sister, while holding on to a 10-year, hot dominant desire for her ripe juicy ass. But then Riley surprises Derrick by bringing home her new girlfriend, the seductive masochistic slut Victoria Voxxx. Victoria immediately sees right through him, and starts a game of cat and mouse, designed to uncoil everyone's sexual secrets and BDSM fantasies. As soon as she's alone with Riley in the guest room, Victoria commands her shy girlfriend to strip down and put her curvy body up for sexual use. She electrocutes Rileys tender tits and slaps her sensitive clit, before sliding her entire hand into Rileys hungry cunt. With a belt wrapped tightly around her throat like a leash, Riley cums over and over again on the floor like a bitch in heat. Just as Victoria had hoped, Derrick hears the couple and peeks in, only to see his favorite sister getting fisted, and her evil lesibian girlfriend smiling at him. When Riley finally comes downstairs, Derrick is upset and suggests that she and Victoria should stay elsewhere. The siblings fight and Riley storms off, but she is soon replaced by a smirking Victoria who plops down on his lap and tells him that she has him figured out: he loves Riley and wants to dominate her the same way Victoria does. Going one step further, she taunts him and says he can just close his eyes and pretend SHE'S Riley. Enraged, Derrick gives masochistic whore Victoria what she really wanted, throwing her to the floor and ripping off her clothes and savagely flogging her entire athletic body until she is red and screaming. Handcuffs come out, followed a vicious set of metal clamps placed on her tiny tits, then tightened as she drools and gags on Derrick's cock. Every time she squirms away, Derrick is on her, pulling on her painful nipples, zapping and cropping her clit, and eventually turning her over and taking her bouncy ass for a hard anal ride. Riley finds Victoria grinding out some anal orgasms on her brother's cock, but when Victoria makes Derrick admit to Riley that he has always wanted to top her, she submits to her own secret desires to be used by BOTH of them. She timidly kneels and sucks her brother's cock, fresh from Victoria's ass. She's timid at first, but any hesitation is quickly replaced by her sexual lust. Victoria climbs back on Derrick's cock and makes her submissive girlfriend lick her clit at the same time. Then it's Rileys turn to get fucked, and Derrick finally pounds his little sister'ss sweet pussy, slamming his cock in her as she cums over and over again, as Victoria is electrifying her bouncy tits with a zapper. Metal toys are pulled out for double penetration and eventually Riley gets her brother fat cock slamming in her ass. The three taboo kinksters spend the rest of the day fucking and engaged in sadistic games. Victoria is put in a painful rope suspension with her legs spread wide open. She can only take Derrick's dick and beg to cum. Derrick throws Riley over and fucks his little sister's tight ass while Victoria grinds her hungry cunt in her face, making her lick all her brother's cock juice off of her lips before she kneels down and takes a hot load of cum for them both.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Riley Reyes",
      "person_id": 55057
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-04-12",
  "scene_id": 44334,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Bondage",
    "Couple",
    "Curvy",
    "Double Penetration",
    "Family Roleplay",
    "Flogging",
    "Lesbian",
    "Nipple Clamps",
    "Straight",
    "Suspension",
    "switch",
    "Threesome",
    "top",
    "Zapper"
  ],
  "title": "Seductive Lesbian Sister-In-Law Fucks The Whole Family"
}