{
  "collections": [
    "Families Tied"
  ],
  "description": "Helena Locke is a beautiful ice queen running a self-branded feminist therapy clinic. She is very good at calming her patients, but what she does with them while they are in a\nrelaxed state isn't always up to clinical standards. She has an insatiable hunger for\ncontrolling her hot step-daughter Ivy LeBelle, a curvy bodacious babe with a trusting nature and easy sexuality. Helena has been enjoying her piece of Ivy's pie for years under the guise of therapy, but when Ivy brings home her new boyfriend Seth Gamble, Helena has competition for the first time ever. Ivy tries to keep quiet while Seth throat fucks her and tears her clothes off in the guest room, but once she's in belt bondage and squirming under the crop and flogger, it's harder to keep quiet. Seth shoves a ball-gag between her pouty lips so he can fuck her wet pussy and punish her gorgeous round ass, but eventually she makes enough noise to disturb Helena's therapy office, and sets off a plan for revenge in Helena's mind. Helena tricks Seth and leads him to leave the house so she can get into Ivy's head...and her panties. Once Ivy is in a relaxed state, Helena begins aversion therapy to keep her from Seth, using electro shock pads, a zapper, and a firm spanking hand. Cuffed in thick leather restraints, Ivy has nowhere to run and writhes under her Mommy's strict hand. Furthermore, Helena has an electrified dildo to drive the point home deep into Ivy's slutty pussy. Screaming and cumming painfully from the electro torment, Ivy is rewarded for being an obedient good girl with a metal toys in her ass and a vibrator pressed down against her clit. Soon Ivy is under Helena's spell, smiling and promising to be a good girl. Meanwhile, Seth has come to his senses and calls Helena out. Throwing her against her own therapy couch and spreading her legs wide, Seth invites Ivy to come lick her Mommy's pussy and show Helena that she's really no better than him. Helena relents to her fantasies, sucking Seth's cock and having Ivy work her pussy over. Seth wants complete sexual control and throws Helena over for a hard spanking and flogging while he fucks her and presses her face into Ivy's cunt. Ivy is a complete anal whore, and wants her domme's cock in her ass, but her Mommy insists she ride reverse cowgirl like a good slut so she can punish her body with a tight zipper and orgasm denial. The day ends with Seth using all of Ivy's holes and Helena licking her step-daughter's cum off of his cock, just like she always dreamed.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Ivy LeBelle",
      "person_id": 60683
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-03-29",
  "scene_id": 44332,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Ball Gag",
    "Big Tits",
    "Bondage",
    "Crop",
    "Curvy",
    "Dildo",
    "Electrical Play",
    "Family Roleplay",
    "Flogging",
    "Gag",
    "Humiliation",
    "Leather",
    "Lesbian",
    "MILF",
    "Orgasm Denial",
    "Spanking",
    "Straight",
    "Submission",
    "Threesome",
    "Vibrator",
    "Zapper",
    "Zipper"
  ],
  "title": "Therapist Caught Scamming Her Slutty Step-Daughter's Ass"
}