{
  "collections": [
    "Device Bondage"
  ],
  "description": "Danni Rivers is super cute and seems to like bondage. She has shot for Fucking Machines a few times, so The Pope decides to take it to the next level. The day starts like any other, but once the pain starts, something happens. Something that no one, not even The Pope was expecting. This slut begins to fucking purr once he begins the torment. This isn't entirely unheard of, especially with the use of a flogger, so he continues the torment. She is only getting it on her bottom half because she is restrained in a straitjacket. After a good flogging on her ass and pussy, we see what kind of pain slut she really is. The magic wand comes out and this slut can't stop herself from having multiple orgasms. The next scene begins with Danni in a doggy position and The Pope enters with a mission. Was this a fluke, or is she a closet pain slut and doesn't even know it about herself? He's going to find out right now! His hands pound her body and then rip at her flesh, and all she does is smile and crave more. The cane is introduced first and she takes it like a champ. The feet and ass stripes appear right before our eyes, and she is still purring. Next there is the nasty knitting needle, and again she takes it all in stride. The electricity starts next, and this is the moment The Pope realizes he has a true pain slut on his hands. The only thing he can do now is enjoy the fact that he can have all the fun he wants with Danni and she will take every damn bit of it. The last scene has Danni on her back with her legs spread and exposed. Nipple clamps are put on her and then pulled, then we move into some extreme breath play with imposed orgasms. Her eyes roll back in her head, but he continues to make her cum until he has had his fill. What a slut! What a day!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Danni Rivers",
      "person_id": 61379
    }
  ],
  "release_date": "2019-06-27",
  "scene_id": 44330,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "multiple orgasms",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "slim",
    "Straight",
    "Straitjacket",
    "Submission",
    "The Pope",
    "white"
  ],
  "title": "Mega Pain Slut Danni Rivers Submits to Brutal Torment in Bondage"
}