{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Three young soldiers (Vinnie Greco, Jack Tufts, Cameron Knight) lie gagged and hogtied on the floor, squirming, twisting and turning in an effort to free themselves. They don't succeed.\nThe three soldiers, ungagged but blindfolded, are bound in chairs, hands behind backs, boots pulled up to the chair rungs. Sergeant Michael Brandon enters, looks them over, tests their bondage, sticks a finger in Knight's mouth, nuzzles Tufts' face and mouth with his lips, handgags Greco. He unties Greco and orders him to the front of the room. The camera focuses on the reactions of the two blindfolded soldiers, who hear Brandon giving Greco more orders, then hear Greco getting smacked. Brandon pulls open Knight's shirt, pulls him forward by his dogtags, kisses him, opens his pants, pulls out his cock and balls and ties them with one end of a long khaki cord, then smacks his bound dick around. Brandon next binds Tufts' cock and ball with the other end of the cord. Before doing so, he kisses Tufts, has him suck his finger, his nipples. Tufts submissively opens his mouth to receive whatever Brandon chooses to put in it. Brandon returns to Knight and slowly pulls down his blindfold. Brandon caresses Knight, makes Knight crave his soft touch, then smacks him. Brandon gathers up most of the rope, making it taut, then pulls on it.\nAt the front of the room, Greco, plug-gagged, is attached to a spanking bench by his straitjacketed sleeves. Brandon kisses Greco between hard smacks from a leather slapper. He alternates between the slapper and his hand, leaving handprints on Greco's increasingly red ass. Continuing the spanking, Brandon pulls Greco's ass cheeks apart and licks Greco's ass. Pausing, he picks up the khaki rope he'd let fall, and tugs on it, making Tufts and Knight grunt with pain.",
  "directors": [],
  "models": [
    {
      "name": "Cameron Knight",
      "person_id": 61892
    },
    {
      "name": "Jack Tufts",
      "person_id": 61891
    },
    {
      "name": "Leonardo Schiavino",
      "person_id": 61252
    },
    {
      "name": "Michael Brandon",
      "person_id": 61294
    }
  ],
  "release_date": "2019-03-05",
  "scene_id": 44349,
  "tags": [
    "BDSM",
    "Blindfold",
    "Bondage",
    "Boot",
    "CBT",
    "Domination",
    "dungeon",
    "Gag",
    "Gay",
    "Leather",
    "Paddle",
    "Pain",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "slapper",
    "Spanking",
    "Straight Jacket",
    "the chair",
    "thirdparty",
    "Voyeur"
  ],
  "title": "Soldiers in the Dungeon: Basic Training"
}