{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We are honored and quite excited to share this exclusive domination clip with hot rope bondgae. Esmi Lee, hot porn slut and an infamous femdom Mistress, has come to our dungeon for the Sexual Disgrace experience. Her new Master has the perfect approach to break her in: the sybian fucking machine. He flips it on the sybian and introduces her to his huge throbbing cock. Well, more like her throat. Deep down her throat. Fucking her throat, actually. It gets sloppy, spit pouring out of her. It only helps him get his dick in deeper. He intensifies the vibration, distracting Esmi from gagging. He smacks her face hard when she tries to take a break for air. He ramps up the sybian and bobs her head on his dick for a proper bj before retying her to hang on her feet, yet bent over. He wants total access to her bubbly ass and tight pussy. He inspects his sex slave’s pussy and asshole, spanking her a bit. She can’t go far and she won’t fall. She has to endure this rough fuck. He penetrates her deep, opening her up wide. She can barely handle it. He pounds her in, pulling her ass with ease onto his pole. Esmi can’t stop screaming, cumming over and over. Now she knows what it feels like to be a submissive sex slave.",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Esmi Lee",
      "person_id": 49417
    }
  ],
  "release_date": "2019-03-07",
  "scene_id": 44354,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Deepthroat",
    "Domination",
    "drool",
    "dungeon",
    "Facefucking",
    "Feet",
    "Female Slave",
    "Femdom",
    "gloves",
    "High Heels",
    "Latinx",
    "master",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "slim",
    "Small Tits",
    "Spanking",
    "Straight",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "Partner Studio",
    "unshaved",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Esmi Lee Endures Rough Sex & Deepthroat BJs in Rope Bondage"
}