{
  "collections": [
    "Evolved Fights"
  ],
  "description": "This match is spectacular. This is truly entertaining wrestling. Billie Boston \" The Baller\" has limited wrestling experience but he has a significant size advantage over the petite ebony muscle goddess, Kelli Provocateur. Kelli just recently started wrestling and she has made some huge gainz. She's petite but she is strong as hell and she does have more experience on the Mats that the Baller does. Round one goes exactly as most of you would expect it to go. The big bad boy comes out strong and dominates this petite lady. Kelli is pinned down and groped. She's like a sexy damsel in distress as she flails around trying to out from under the stronger man while he attempts to penetrate her but this isn't Kelli's first rodeo. She's done this before and she knows, the bigger they are, the harder they fall. Kelli waits out her opponent and gasses him out. She is able to reverse the tables and get control. She chokes Billy with her strong powerful leg scissors. She pins him down in a schoolyard pin then sits her fat juicy giant clit right on top of his mouth and smothers him with her gorgeous meat. The action goes back and forth for a while. Each opponent really wants to win so they can fuck the loser. The end comes and so to both of the wrestlers. The winner is announced. The winner does sloppy wett, juicy oral on the loser until the loser is made to cum. Drained and humiliated, the loser gets to look up at the winner while the winner does a victory pose",
  "directors": [],
  "models": [
    {
      "name": "Billy Boston",
      "person_id": 61397
    },
    {
      "name": "Kelli Provocateur",
      "person_id": 39587
    }
  ],
  "release_date": "2019-03-12",
  "scene_id": 44362,
  "tags": [
    "69 Position",
    "Blowjob",
    "Ebony",
    "Facesitting",
    "leg scissors",
    "Muscle",
    "Muscle Worship",
    "PIV",
    "Pussy Eating",
    "sex fight",
    "Smothering",
    "Straight",
    "Stud",
    "Tattoo",
    "thirdparty",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Ebony Goddess Rides Young Stud and Makes him Cum"
}