{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Brandon orders the the two chairbound soldiers to free themselves. The first to do so will be get the reward of his giant cock; the loser will get \"what losers get.\" Knight is out of his bonds before Tufts has untied the first knot. He is ordered to untie Tufts, who is then ordered to do 25 push-ups on his knuckles, as Knight gets his reward. His push-ups completed, Tufts is ordered to lick Brandon's boots while Brandon pulls down Tufts' pants and spanks his ass. Tufts is sent over to lick Greco's straitjacket-bound ass, then his cock. Brandon smacks Greco's ass as Tufts sucks him off. Knight moves up Brandon's chest to lick and suck his nipples, then starts licking Brandon's armpits. Brandon orders Knight to pull up a chair and give Tufts an over-the-knee spanking, which he does. Brandon returns to Greco and kisses him.\n\nCut to:\nKnight, Greco and Tufts, naked and gagged, with cockrings and hard-ons, face outward, their raised arms attached to an overhead chain. A long belt holds the three of them together. Their movements and size differences keep them off balance. Brandon, also naked with a hardon, enters and starts loving and abusing all of them. Brandon ungags Greco, plays with his nipples, kisses him, smacks his huge dick against Greco's very respectable but smaller one. Brandon turns the three around so he is playing with Tufts whom he ungags and hoods. He next hoods Greco and, finally, Knight.\n\nCut to:\nThe three soldiers, released from the overhead chain, blinded by their hoods, seeking and sucking each others' dicks, while Brandon encourages them with a leather slapper and orders them around. Brandon himself participates in the revels. He jerks himself off and cums massively over a soldier's hood. A moment later, he calls all three to attention. All leap to their feet, their cocks at attention, too. Blackout\n\nCut to:\nThe three soldiers, unhooded and ungagged, attached by the wrists to the overhead chain, this time facing inward. Brandon wraps a rope tightly around them. He goes from one to the other, harsh and affectionate by turns. Squeezed together, they try to maintain their balance, and kiss each other and Brandon.",
  "directors": [],
  "models": [
    {
      "name": "Cameron Knight",
      "person_id": 61892
    },
    {
      "name": "Jack Tufts",
      "person_id": 61891
    },
    {
      "name": "Leonardo Schiavino",
      "person_id": 61252
    },
    {
      "name": "Michael Brandon",
      "person_id": 61294
    }
  ],
  "release_date": "2019-03-12",
  "scene_id": 44360,
  "tags": [
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Boot",
    "CBT",
    "Discipline",
    "dungeon",
    "Feet",
    "Gag",
    "Gay",
    "Hood",
    "Leather",
    "Leather Cuffs",
    "Paddle",
    "Rimming",
    "Role Play",
    "Rope Bondage",
    "slapper",
    "Spanking",
    "Straitjacket",
    "Tattoo",
    "thirdparty"
  ],
  "title": "Soldier in the Dungeon: Advanced Training"
}