{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "Layla Price, one hot and horny sub slut, is back to explore her love for BDSM and rope bondage. Get ready for a domination clip to freshen your porn favorites. Layla is left on a mattress on the floor, wrists and ankles tied together. This video contains a very pleasant surprise. Layla's Master brought along his trusty anal hook. Layla is known for taking things up her asshole. So the hook with a big steel ball shouldn't be a problem. He ties the other end to her hair. He ties a ball gag over her mouth and lodges it deep into her mouth. He enters her pussy with his his fat cock, wrecking it instantly. He takes another rope and ties her wrist to the wall and makes her ride his cock. You'll get a better view of the hook up her tight hole while her pussy endures deep penetration. He stands up and gets a deepthroat BJ. Spit is streaming out of her, covering her huge tits. Her Master taunts her, making her tell him what a whore she is, slaps her face and tits, making her gag more. Hearing Price moan and scream she's a dirty slut will make anyone cum in their pants. She seems tired but won't stop. She definitely deserves a load of his cum. She wants it badly. She begs for it and will only get it if she swallows every drop. She keeps her mouth open for her treat.",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Layla Price",
      "person_id": 48143
    }
  ],
  "release_date": "2019-03-14",
  "scene_id": 44366,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "buttplug",
    "Deepthroat",
    "Domination",
    "Double Penetration",
    "dungeon",
    "Facefucking",
    "Facial",
    "Fingering",
    "Gag",
    "gloves",
    "Hand Gagging",
    "master",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Straight",
    "Sub",
    "Swallow",
    "Tattoo",
    "the wall",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Layla Price Loves Rope Bondage & Rough Sex with Anal Hook"
}