{
  "collections": [
    "Men On Edge"
  ],
  "description": "Riley Mitchell is a thick, muscled dom with a fat, perfect cock, and we've roped him in to get worked and edged. Sebastian and Chance take full advantage of this muscled beast, working his body, his sweet hole, and his big cock, bringing him to the edge of orgasm and then denying him, until he finally cums in a torrent of deafening roars. Riley is no stranger to kinky sex, so he goes all-in with the bondage. He's tied up in every scene, blindfolded and gagged, all to amplify the experience of having two men objectify him and use him up. Riley starts on his knees, blindfolded and tied to a metal frame. Sebastian and Chance immediately set upon him, worshiping his muscled body before unleashing his big fucking cock. Chance is a greedy slut, and immediately starts sucking him off, but Sebastian holds him back as he slides a flesh jack over that thick fucking dick. He works Riley's rock hard cock, and Riley doesn't hold back. He's a verbal guy, moaning and grunting as he's brought damn close to cumming. They pull the flesh jack off of him and Chance drops down and sucks that wet dick again, worshiping it deep in his hungry throat. Sebastian wraps up Riley's cock in rope and ties it to the metal frame, as Chance continues to work that dick with his mouth. Riley is then tied face-down to a table, with his cock sticking through a hole angled at the floor. Chance is underneath, working Riley's dick and sucking it, while Sebastian licks Riley's toes and worships his feet. He then slides a dick-on-a-stick into Riley's muscled ass and fucks his hole, as Chance continues to suck his hard cock. They slide a vibrating jacker onto that perfect dick and make Riley fuck it. With every thrust, the dick-on-a-stick punches into his ass, so he's effectively fucking himself as he fucks the jacker. Finally Riley is tied to a chair and gagged while Sebastian and Chance work his dick and suck him. Ultimately this proves too much to resist, and Riley shoots his hot load all over Chance's face and tongue, while roaring like a feral beast. Spent, he's left there to wallow in his sweat and cum.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Riley Mitchell",
      "person_id": 61662
    }
  ],
  "release_date": "2019-04-16",
  "scene_id": 44374,
  "tags": [
    "BDSM",
    "big dick",
    "Blindfold",
    "body builder",
    "Bondage",
    "brunet",
    "Edging",
    "Feet",
    "Foot Worship",
    "Gag",
    "Gay",
    "gloves",
    "Kinky",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Strokers",
    "Tattoo",
    "Tickling",
    "Vibrator",
    "white"
  ],
  "title": "Roped In: Muscle Dom Riley Mitchell Bound and Edged"
}