{
  "collections": [
    "Lakeview Entertainment"
  ],
  "description": "Nordic blonde Mistress Ariel puts big slave david through his paces for 54 minutes. She torments and teases him relentlessly, stopping only to let him regain his composure and tongue Her wet pussy clean. Her interests concern first his big balls and then his cock as She builds him up to a draining finish.\n\nThe big slave gazes up at Mistress Arielis bare pussy and feels Her high heeled boots on Her shoulders. She is cooly appraising him and his cock. She makes him lick the bottoms of Her boots briefly and then moves to his sit and focus Her attention on his bound balls. She begins to slap the back of his balls with Her well manicured hand and he starts to moan. She switches to a thin flat wooden stick and beats his balls over and over again until he starts to scream. She stands and moves over top of him then drops Her bare pussy down on his mouth and commands him to lick. After he worships for a bit and the pain in his balls settles, She moves again to torment the now swelling balls with a thin black rod.\n\nThe black rod has caused his balls to swell further as She again moves over top of him and sits on his face for tongue service. He gets his composure back as he licks greedily at Her shaved pussy and then She moves back to his swollen balls and applies a vibrator directly to the back, presses hard and holds it until any pleasure has turned to pain. She reaches for the HEAT and rubs some of the irritating ointment all over his red swollen balls and then stretches them tight and ties them down.\n\nNow that his balls have been tormented and tied She focuses Her attention on his cock. She starts to slap the shaft with a nasty cock whip and gets the reaction She wants as he starts to moan. The ball gag She has put in his mouth stifles most of the screams as She slaps him continuously. She climbs on top of him to give him a teasing break and Her wet pussy presses down on his cock and She sways up and down on the shaft to keep it hard. She knows the more excited he is the more punishment She can take and his CBT session is far from over. She moves to pick up the violet wand and turns it up then grabs his cock and begins to electrocute the sensitive ridge on the head.\n\nMistress Ariel casually lights a blue candle and locks the big slave’s cock in a metal ring. She takes Her time and drips hot wax onto the head of his cock until it is coated. He is pinned to the table but tries a bit to twist away as the hot wax on his sensitive cock head scorches him. She moves again over his face and removes his ball gag so he can service Her pussy. Punishing him has made Her wet and She peels Her pussy lips wide so he can lick all the drippings up and swallow them down. She moves back to his cock and beats all the wax off the head with the flat wooden paddle as he screams.\n\nHis cock is in agony from the beating and hot wax but She knows there is a load in his bound balls and is hell bent on extracting it. She applies the vibrator to the underside of his cock and Her well manicured fingers stroke him softly. She puts down the vibrator and Her skilled hands and finger tips dance around his cock and balls. He grows stiff under Her expert touch and She teases him a bit before grasping firmly and beginning to milk him. He begs Her for release and She grants his wish, stroking tightly as a huge load emerges from the tip of his tormented cock. She strokes until every bit of cum is drained from his tormented balls.",
  "directors": [],
  "models": [
    {
      "name": "Mistress Ariel",
      "person_id": 61900
    },
    {
      "name": "Slave David",
      "person_id": 61901
    }
  ],
  "release_date": "2019-03-15",
  "scene_id": 44370,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "CBT",
    "Edging",
    "Electrical Play",
    "Femdom",
    "Gag",
    "Handjob",
    "High Heels",
    "Hitachi",
    "Hot Wax",
    "Mask",
    "Orgasm Denial",
    "Paddle",
    "Pain",
    "Rope Bondage",
    "shaved",
    "shoe licking",
    "shoe worship",
    "Slave",
    "Small Tits",
    "Straight",
    "Swallow",
    "Tattoo",
    "Partner Studio",
    "Vibrator",
    "Violet Wand"
  ],
  "title": "CBT Session"
}