{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "It’s been a while since you’ve seen your wife, Cherry Torn, in pleasure. She’s uninterested, finds you unattractive, and is tired of your scratchy beard on her beautiful pussy. Because of this it’s been a long, long time since Cherry has felt the warm, wet pressure of a tongue pressed against her clit. Mona Wales is now in your living room kissing Cherry and caressing her voluptuous tits. She can’t stand you but Cherry assures her that you’re just there to watch and aren’t worthy of touching, sucking, of fucking either of their smoking hot bodies. As Mona drags her tongue along Cherry’s cunt, your wife begins to moan in pleasure and laugh at how inadequate you are. Mona pauses in between lapping up Cherry’s pussy juice to say how sweet it tastes, “not a trace of man.” She looks you right in the eye and tells you that she’s going to steal your wife from you and then dives in to eat more of Cherry’s dripping cunt. Then, Mona stops to tell you to hold your breath because your heavy breathing is distracting her. Just hold your breath and start stroking your cock so she can focus harder on sliding her fingers in and out of Cherry’s pussy with her tongue glued to her clit. “Even one finger is better than that pathetic excuse for a dick,” moans Cherry. Mona keeps sucking and slurping Cherry’s pussy so good that Cherry threatens to never go back to cock again. Mona tells Cherry, “Cum for me,” and then turns to you and says, “don’t you fucking touch yourself while she’s cumming.” Cherry explodes into orgasmic moaning as she cums over and over again on Mona’s face while Mona furiously tongues her swollen cunt. Now that Mona has serviced your wife’s pussy it’s her turn to receive pleasure from Cherry, but she doesn’t want you to watch. Now it’s time for you to get the fuck out.",
  "directors": [],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2019-03-14",
  "scene_id": 44378,
  "tags": [
    "BDSM",
    "Big Natural Tits",
    "black hair",
    "Blonde",
    "Bondage",
    "Bush",
    "Cuckolding",
    "Dominatrix",
    "Femdom",
    "Fetish",
    "JOI",
    "Kinky",
    "Lesbian",
    "LezDom",
    "Lingerie",
    "natural boobs",
    "Nylons Stockings",
    "other hair color",
    "Pussy Eating",
    "shaped",
    "shaved",
    "slim",
    "Small Tits",
    "Smoking",
    "Straight",
    "switch",
    "Tattoo",
    "Partner Studio",
    "white"
  ],
  "title": "Kinky JOI: Mona Wales and Cherry Torn Lesbian Cuckolding"
}