{
  "collections": [
    "Bound Gods"
  ],
  "description": "Step Brother's Michael & Alex are working in their dad's shop over break, but slacker muscle stud Alex Mecum has some serious work ethic issues. He is bored stiff with absolutely nothing to do, his straight stud brother Michael DelRay is always getting on his case to keep busy. After finishing his chores of cleaning up around the workshop Alex whips out his massive hard cock and decides to have a little me time. Michael walks in and almost catches his brother with his hard cock in his hands, slacking and jacking off. He decides this slacker needs to be taught a lesson. Alex helps out Michael test out the new wooden stock his dad built. With his arms and hands fully bound, it's time for Michael to unleash some brutal discipline. First he rips off Alex's clothes exposing his naked hairy ass. Michael knows a few red strips on that ripe butt will turn it red. He pulls out the flogger and delivers a punishment. Alex screams to be let out, but there's no way he'll escape. He is flipped over and made to suck his brother's cock, before Michael duct tapes him to a pillar and blindfolds his brother. His hard cock is stroked before 2 huge sounds come out. The first metal catheter gets fully inserted in Alex's hard cock, then clover clamps are placed on his nipples and balls. Alex creams with pain and pleasure as his brother sucks him off. Next comes out the longest sound his Alex has ever experienced. This gets him hard and ready to cum, but his brother edges him and denies that massive load. First Alex needs to get fucked. Tied up in fully restrictive suspension bondage, first Michael brings out the fuck saw and rips a new asshole in Alex. Alex begs for his stepbrothers cock and Michael delivers a huge deep anal pounding on his brothers tight asshole. Both brothers drain their balls with huge massive cum shots.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Michael DelRay",
      "person_id": 61138
    },
    {
      "name": "Alex Mecum",
      "person_id": 59595
    }
  ],
  "release_date": "2019-03-21",
  "scene_id": 44371,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Brutal Punishment",
    "Clover Clamps",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Family Roleplay",
    "Gay",
    "Hairy",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "Pain",
    "Rope Bondage",
    "Rough Sex",
    "Sounding",
    "Stocks",
    "Straight Stud",
    "Stud",
    "Submission",
    "Suspension"
  ],
  "title": "My Brother's Discipline: Michael DelRay Punishes Step-Bro Alex Mecum"
}