{
  "collections": [
    "Men On Edge"
  ],
  "description": "Joey Wagner is experienced with kinky play in his personal life and is here to shoot his first professional video with Kink Men. Sebastian has him strip down to only his underwear, letting us see his muscular hairy chest and tattoos. Joey is in good hands as Sebastian Keys wraps his chest tight with rope and Chance Summerlin kneels at his feet, teasing his cock through his underwear. Chance strokes and sucks Joey's cock deep down his throat. Sebastian fits a black rubber ball-gag into Joey's mouth and ties the leather straps tight. Joey drools on his own cock and Chance sucks it off, letting Joey fuck his mouth. Chance gets a clear stroker and uses it on Joey's throbbing cock while tongues just the tip as he strokes. He sucks and licks Joeys balls until he begs to cum, but its not time for that yet. Next, Sebastian puts a leather blind fold over Joey's eyes and ties him up using multiple ropes. Sebastian lifts Joey off of the ground for Joey's first ever full suspension. With Joey's legs spread and his body supported and cradled in the web of ropes, Chance and Sebastian each take one of his feet and suck and lick Joey's toes. They get all ten of his toes in their mouths at once while stroking Joey's cock and again Joey begs to let him cum but they back off just in time to leave his cock twitching and bouncing. Sebastian plunges a big black vibrating dildo into Joey's asshole and fucks his ass with it while Joey gets stroked. Sebastian swaps out the dildo for a different vibrating ass toy that goes straight up his slutty hole. It stimulates his prostate so good that he shoots a geyser of a load all over the room.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Joey Wagner",
      "person_id": 61902
    }
  ],
  "release_date": "2019-04-30",
  "scene_id": 44375,
  "tags": [
    "BDSM",
    "Bondage",
    "Dildo",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Hairy",
    "Kinky",
    "Leather",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "Suspension",
    "Tickling"
  ],
  "title": "Joey Wagner Gets the Edge Off"
}