{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Knight, naked except for his boots, is attached to a horizontal St. Andrews’ Cross. Greco stands by as Brandon’s assistant. Brandon shakes talcum powder over Knight’s pubic area, then shaves it. He orders Greco to blindfold and plug-gag Knight. He holds aloft a large burning blue candle and starts dripping the candle wax on Knight. He uses several blue candles on Knight’s chest, eventually calling for a whole saucepan of hot blue wax which he first pours, then splashes, down Knight’s chest and over his genitals, until a thick layer of wax covers the recruit. Brandon starts on Knight’s balls with candles, caking them over. Finally, he frees Knight’s legs, raises them and pours the wax down Knight’s asscrack and over his asshole. Blackout, and lights up to Brandon peeling the solidly caked wax off Knight. Greco and Tufts hold Knight’s legs up as Brandon cleans the wax off Knight’s asscrack and hole. Brandon kisses Knight.\n\nThe three soldiers, off balance, hang by the wrists from the chain in the center of the dungeon\n\nTufts, plug-gagged and blindfolded, is rope-tied to an upright bondage post. Greco and Knight stand to either side of the post, Greco holding a field cap full of clothespins. Sometimes licking and sucking Tufts’ dick and balls, Brandon puts the pins down both sides of Tufts’ body and his scrotum. He applies more pins to Tufts’ nipples then across Tufts’ chest. He puts them on the loose skin around the corona of Tufts’ cock. He flicks and snaps at the pins, occasionally kissing Tufts on his gag, He jiggles Tufts cock and balls. He puts clothespins on Tufts earlobes. Finally, Brandon orders Greco to put down the cap, then orders him and Knight to slowly remove the clothespins, one at a time. Toward the end, Tufts is howling through his gag. Brandon embraces him and humps his reddened body.\n\nThe three soldiers hang by the wrists from the chain in the center of the dungeon\n\nTufts in a sling, is fucked by Brandon as Knight and Greco on either side of him, play gentle with him. Tufts edges himself, as do the others, and sucks Greco’s cock. Brandon pounds him harder, while Knight plays with Brandon’s chest. The scene fades into Knight alone in the sling, fingering his own asshole. Tufts and Greco stand on either side of him. He sucks both their dicks. Brandon enters and stands in the front of the sling, playing with his cock and with Knight’s ass. Brandon rolls on a condom, lubes it up, and inserts his dick into Knight’s asshole. finally going all the way in. He pounds Knight’s ass, while Tufts slaps it and Greco jerks off over it. Brandon shoots over Knight’s face and chest. Greco spurts over his chest, followed by Tufts.\n\nThe three soldiers, facing outward, plug-gagged but fully dressed in combat gear, their cocks hanging out, with Brandon on his knees sucking them, are attached to the overhead chain. They sway and try to keep their balance. Brandon beats his meat. Cut to the bound soldiers, swaying. Brandon calls out for the next group. Sound of marching boots. “Halt!”",
  "directors": [],
  "models": [
    {
      "name": "Cameron Knight",
      "person_id": 61892
    },
    {
      "name": "Jack Tufts",
      "person_id": 61891
    },
    {
      "name": "Leonardo Schiavino",
      "person_id": 61252
    },
    {
      "name": "Michael Brandon",
      "person_id": 61294
    }
  ],
  "release_date": "2019-03-19",
  "scene_id": 44379,
  "tags": [
    "Anal",
    "Anal Fingering",
    "BDSM",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "CBT",
    "Clothespins",
    "dungeon",
    "Facefucking",
    "Fingering",
    "foreskin",
    "Gag",
    "Gay",
    "Hot Wax",
    "Latinx",
    "Leather Cuffs",
    "muscular",
    "Role Play",
    "Rough Sex",
    "Spit Roast",
    "Suspension",
    "Tattoo",
    "the cross",
    "Partner Studio",
    "white"
  ],
  "title": "Soldier in the Dungeon: Special Training"
}