{
  "collections": [
    "Bound Gods"
  ],
  "description": "Newcomer Parker Payne cautiously enters Arad Winwin’s dungeon. Clad in leather and ready to deliver pain, handsome muscle stud demands Parker to strip down fully. Parker removes all his clothes to reveal his perfect black muscle body. Time to worship Arad’s boots. Parker licks up and down cleaning his dom’s boots, as Arad takes the crop to Parkers body. Next Parker Payne is fully restricted in rope bondage and blindfolded, strapped to the cross. The crop and cane are inflicted on Parkers body. His chest, his thighs, his rock hard cock. Screams of pain are pure pleasure to Arad’s ears. Clothespins get Parker screaming as they are put on all over his body then painfully removed. Next Parker is flipped upside down on the cross, suspended. The flogger delivers a brutal punishment, before parker is made to give an inverted blowjob to the rock hard Arad. With is head down and restrained and his ass in the air, Arad stretches Parker’s balls to the limit with weights before fucking his tight ass. Deep anal is brutally pounded into Parker, before the two unload huge thick loads. Parker’s face is covered in cum, as he gives Arad one last deep throat gagging blowjob. Was this all just a dark fantasy?",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Arad Winwin",
      "person_id": 61417
    },
    {
      "name": "Parker Payne",
      "person_id": 61914
    }
  ],
  "release_date": "2019-03-28",
  "scene_id": 44373,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "Brutal Punishment",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "mixed",
    "Muscle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "the cross",
    "Weights"
  ],
  "title": "Fresh Muscle: Leather Clad Arad Winwin Punishes Newcomer Parker Payne"
}