{
  "collections": [
    "Bound Gods"
  ],
  "description": "Devin Trez tussles with police officer, Jeremy Spreadums in an alleyway. They wrestle back and forth on their feet. Devin gets the upper-hand and pulls Officer Jeremy Spreadums into an abandoned building. Devin strips Jeremy's policeman's uniform off and leaves him restrained, lying on the floor, wrapped in plastic wrap with a hood over his head and his thighs bound with leather straps. Devin crouches beside him, punches his chest and spanks his ass. Devin finds Jeremy's black leather gloves, smells them, and puts them on. Devin removes his dark blue, one-piece overalls, revealing his black leather harness and leather jock. Devin flips Jeremy over onto his stomach, spreads his asscheeks, and crops his asshole. Devin pulls Jeremy up and shoves his huge cock in his mouth. Jeremy struggles to suck Devin's fat cock through the hood. In the next scene, Jeremy is strapped to a wooden chair, bound in black rope with a leather collar around his neck and a nostril spreader pulling his nose up. Devin approaches Jeremy with an electric zapper and zaps his chest, telling him to \"oink\" like a pig. He covers Jeremy's mouth with his leather gloved hand. Jeremy's muffled screams echo through the building while Devin zaps him again and again. Devin knocks the chair backwards and squats over Jeremy's face. Devin face-fucks Jeremy with his huge cock while he zaps him some more. In the next scene, Jeremy is bent over a bathtub with his hands bound behind him with black rope. Devin whips his back with a flogger. He fucks Jeremy's ass deep and hard while he dunks Jeremy's head in and out of the water. He makes Jeremy cum and shoves his dick in Jeremy's mouth. Devin blows his load onto Jeremy's face and leaves him there tied up.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Devin Trez",
      "person_id": 61805
    },
    {
      "name": "Jeremy Spreadums",
      "person_id": 61296
    }
  ],
  "release_date": "2019-05-30",
  "scene_id": 44372,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Collar",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Feet",
    "Gay",
    "gloves",
    "Hood",
    "Humiliation",
    "jock",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "harness",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "the chair",
    "Zapper"
  ],
  "title": "Take It, Pig!"
}