{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Bella Rossi is getting her ropes in order when tractor salesman Luis Long stops by to sell some tractors. Bella isn't too interested in his tractors, but she does thing Luis can help fill some positions around her ranch. She makes him a bargain, if he'll do anything she says for one hour and gives being a ranch hand a try, maybe she'll buy one of his tractors. Luis is hesitant but figures helping out this buxom beauty won't be too difficult. Soon Luis is strung up to the barn rafters as Bella tests his strength with flogging, close pins, and edging. Luis' cock is leaking pre-cum and soon he's begging for more. The next test Bella puts Luis through is an anal test! She stretches his ass open on her cock and fucks his ass. Luis moans as Bella plunder his hole and gets a special treat when Bella takes off her bra revealing her perfect big tits. Bella spits on her tits before pressing them around Luis' cock and giving him a titty fuck while she fucks his asshole! Luis is overwhelmed with sensations and begs to cum but Bella has other ideas for this salesman. She sits on his fact and uses his tongue to bring her to an orgasm before sinking down on his hard cock. She fucks him so good, cumming over and over again on his cock. Each orgasm only makes her more insatiable. She pounds his cock and then leaves him high and dry, dick in the wind.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Luis Long",
      "person_id": 61081
    }
  ],
  "release_date": "2019-05-07",
  "scene_id": 44385,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Edging",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Tattoo",
    "white"
  ],
  "title": "The Salesman's Bargain: Bella Rossi Takes Advantage of Luis Long"
}