{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Jack Hammer is a dom, who rarely subs. But today is one of those days. And who wouldn’t be ready to do so, when gorgeous blonde bombshell Ryan Keely has you by the balls. Jack arrives at Ryan’s dungeon, ready to shut up and serve. And Ryan is not disappointed. She orders him to strip, then worship her, starting with her feet. Jack is a damn obedient sub from the start, understanding that Ryan is in control. He shows some amusement at times, but Ryan immediately corrects him, putting him back in his place. She orders him on his hands and knees, then canes the back of his legs, then paddles and spanks his ass. The smirk on his face is wiped away when Ryan then puts him on his back, puts clothespins on his nipples and smothers his face with her perfect, wet pussy. She grinds on top of him, making him please her while he remains otherwise immobile, not permitted to please himself. Jack is soon put in a partial suspension. Ryan flogs his hungry ass, then spits on his hole, prepping him to take her big strap-on cock. She thrusts her fat cock into his ass and fucks him, getting off on the very thought of plowing this typically dominant guy into submission. But Jack is gagged, and his moans are muffled, to keep him shut up. When Jack is fully trained, accepting that his role is to please Ryan and nothing more, Ryan releases him from the bondage and uses his mouth and cock to get off. She takes that big dick and rides it, giving herself one orgasm after another while Jack serves as a fuck toy on a leash. Ryan cums again and again, and only once she’s done is Jack finally finished. She denies him an orgasm and sends him on his way… until next time.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Jack Hammer",
      "person_id": 18499
    },
    {
      "name": "Ryan Keely",
      "person_id": 15370
    }
  ],
  "release_date": "2019-04-23",
  "scene_id": 44383,
  "tags": [
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "Brunette",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "Humiliation",
    "Latinx",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Orgasm Denial",
    "Paddle",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "top",
    "versatile"
  ],
  "title": "Shut Up And Serve: Ryan Keely Makes Dom Jack Hammer Her Sub"
}