{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Jessy Dubai and Daisy Ducati are planning their biggest best heist ever, but Daisy's loyalty to her beautiful busty mistress Jessy Dubai is in question. Jessy demands that Daisy Ducati prove her loyalty. She demands that Daisy will never talk and never give up her co-conspirator under any tormenting circumstances. Money changes everyone so to prove her undying loyalty she worships Jessy's feet and high heels. This dirty girl licks up and down Jessy's arches and black stockings with her tongue. But, this is just the very beginning. Restrained in rope bondage Jessy brings out the electric wand. If Daisy is ever captured can she withstand the torment of being zapped? Daisy screams in pain and pleasure as Jessy has her way with electricity all over her body. Next Daisy must show her loyalty with her mistress's hard cock in her mouth. Deep throat sloppy wet cock sucking is followed by a brutal pussy fucking. Daisy screams with orgasm as Jessy pounds away at her tight pussy hole. Wet and dripping, Daisy begs to have it in her tight little asshole next. A deep anal fucking stretches out Daisy Ducati's tight ass. Jessy Dubai keeps pounding away as Daisy screams in orgasm. This brutal fucking unleashes a huge cumshot from Jessy all over Daisy's hot little body.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Jessy Dubai",
      "person_id": 47035
    }
  ],
  "release_date": "2019-05-20",
  "scene_id": 44382,
  "tags": [
    "Anal",
    "big dick",
    "Big Tits",
    "black hair",
    "Blowjob",
    "Bondage",
    "Cock Worship",
    "Electrical Play",
    "fake boobs",
    "Feet",
    "Foot Worship",
    "foreskin",
    "High Heels",
    "Latin",
    "mixed",
    "natural boobs",
    "Pain",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "shaved",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Violet Wand"
  ],
  "title": "Best Heist Ever: Jessy Dubai Demands Daisy Ducati's Anal Loyalty"
}