{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Aspen Brooks is a gorgeous red-head beauty, with big tits and a massive cock. She's the girl who has everything, even a beautiful, sweet servant, Lindsey Love, to do her bidding. When Lindsey gives Aspen a little attitude, she gets a big dose of punishment, including paddling, and that giant cock in both her ass and her pussy. She's made to submit to Aspen entirely, until Aspen's huge cock erupts with cum. Lindsey starts in her hovel, sleeping soundly, when Aspen calls for her. Lindsey hasn't been keeping up with her duties, so Aspen decides she needs to train her. She makes Lindsey worship her feet, toe by toe, and kiss her cock through her panties. Soon Lindsey is choking down Aspen's huge cock, working it in her throat to make up for dishing out attitude and falling down on the job. Aspen paddles her sweet ass, then puts her on the floor and shoves her big hard dick into Lindsey's ass. Lindsey knows she screwed up, but she also loves when her mistress plows her holes, and she's getting all her holes plowed today. Just as Lindsey is really loving getting her gaping ass pumped with dick, Aspen rolls her over and takes her pussy. She pounds her servant's wet, hungry cunt, making her cum along the way. Finally, Aspen gets up in her throne and shoots her hot load all over Lindsey's face. She feeds her cum to her, makes her lick her fingers clean, and sends her back to her hovel.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Aspen Brooks",
      "person_id": 59054
    },
    {
      "name": "Lindsey Love",
      "person_id": 61906
    }
  ],
  "release_date": "2019-05-06",
  "scene_id": 44381,
  "tags": [
    "big dick",
    "Big Tits",
    "Blowjob",
    "Choking",
    "Cock Worship",
    "Feet",
    "Gaping",
    "Role Play",
    "shaved",
    "Straight",
    "tea2020",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Aspen Brooks Trains Live-In Servant Lindsey Love With Big Hard Cock"
}