{
  "collections": [
    "TS Seduction"
  ],
  "description": "Mike Panic is hot for his new roommate Korra Del Rio. She is getting ready for a date but she is flirting hard with Mike and its making him get all flustered. First during a chat in the kitchen Korra “accidentally” drops her towel to expose her totally hot naked body. Mike pretends not to look but can’t help notice her nice tits and super cute ass. Korra asks for Mikes help rubbing lotion on her long lean legs, strapping her high heels and checking out her tight sheer outfit. Mike tries not to Panic but Korra is such a tease! he stutters and giggles every time she says or does anything. Before Korra goes on her date she walks in on Mike stroking his hard cock and she knows that he is thinking about her. Finally she can have her way with this little coy boy and make him her fuck toy. Korra pulls Mikes pants off, slaps his ass and runs her long sexy nails all over his body. She busts out the flogger and Mike begs her to make him her slutty fuck toy, her cock slave, her bitch, anything!–he wants to be dominated by this sexy woman. Mike finally gets to peel Korras panties off and suck her dick. He is in heaven with that cock in his mouth looking up at her perky tits and long silky hair. Then she turns around and Mike tongues Korras ass as she writhes around pushing his head in further and deeper. Then she makes Mike bend over and she fucks his tight ass while he rubs his dick. She fucks him hard and deep and feels her tits while Mike grinds up against her. Mike cleans his ass off her cock and then lays him down on the bed for some more fuckin’. She mounts her little fuck toy, spreads his legs wide and fills his hole. Korra Del Rio gives Mike a good pounding until he cums all over himself. Then Korra climbs on his face and jacks her cock into Mikes mouth. What a good roommate–but wait what about that date Korra was getting ready for? Hmm maybe it was all a ploy for the coy boy…",
  "directors": [],
  "models": [
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2019-05-14",
  "scene_id": 44393,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Flogging",
    "foreskin",
    "High Heels",
    "Male Sub",
    "natural boobs",
    "Role Play",
    "shaped",
    "Slave",
    "slim",
    "Straight",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Coy Boy Fuck Toy"
}