{
  "collections": [
    "TS Seduction"
  ],
  "description": "Creeper Papa Georgio's been waiting all day for buxom beauty of his dreams, TS Foxxy, to get home. He watches her from his van and sneaks up to her window hoping to catch a glimpse of Foxxy's perfect body. Inside, Foxxy is filling her tub for a luxurious afternoon bubble bath. She strips off her lingerie, revealing her luscious tits and perfect ass. She sinks into the bubbles and takes a sip of wine to relax. She checks her reflection only to see Georgio peeping in on her so she storms outside to catch him in the act! Foxxy drags this pathetic man into her home and slaps him across the face for being a huge creep! She demands he strip for her or she'll call the police. Georgio sheds his clothing and obeys Foxxy's every order. Once he's naked, she decides she may as well put him to use and see how he likes being objectified! Georgio is scared but horny and leaks pre-cum all over Foxxy's robe so she gives him a good hard spanking as punishment and makes him suck her perfect cock. Then she pushes him down and pounds his peeping pervert asshole. Georgio moans as Foxxxy doles out his punishment. He takes every inch and begs to cum, but Foxxy isn't done yet. She jerks him off and trails her feet through his cum before making him lick her toes clean. Then she blows her load all over his face and orders him off her property once and for all!",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Papa Georgio",
      "person_id": 61743
    },
    {
      "name": "TS Foxxy",
      "person_id": 20055
    }
  ],
  "release_date": "2019-04-30",
  "scene_id": 44392,
  "tags": [
    "Anal",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "fake boobs",
    "Feet",
    "Latin",
    "Lingerie",
    "Male Sub",
    "Role Play",
    "Spanking",
    "Straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Peeper's Punishment: TS Foxxy takes down peeping tom"
}