{
  "collections": [
    "Kink Features"
  ],
  "description": "Welcome to the second installment of Kink's School of Submission, this time featuring Kristen Scott. S.O.S. is four days of mental and physical torment and challenges. It's not for just any girl. Each one has petitioned to be here, and is then hand-selected by The Pope. The experience is as real as you will ever see. There is no acting of any kind, and the raw emotion of exactly what she is experiencing is something rarely captured on video. The intent of School of Submission is to show this, and to pull back the curtain to show you see the deepest and most personal of experiences of this performer. We begin with an in depth interview between Kristen and The Pope. This is a time for discovery for both of them, and it helps The Pope set a path for Kristen over the next 4 days. Kristen is found with a small grin, staring into a mirror in the dungeon, as if she were very pleased with where she is and what is about to happen. The Pope enters and immediately begins her journey by instructing her on basic expectations that he has for her. She is told to undress while being asked questions and expected to stay focused. As he inspects her body he pokes and prods her to find out what makes her purr, as well as squeal. Kristen is now very sexually charged and it is becoming more difficult for her to stay focused. This is his intent, and she will surely pay for her slip. The Pope slowly tears away layer after layer of Kristen's walls with hopes of getting deep inside of her mind and helping her grow from the experience. At this point she is putty in his hands, yet he has only just started. Her orgasms are held at bay until he sees fit to allow her any, and when he does she can barely stand. Every second is sexually-charged, from the tease and denial to the brutal caning, and everything in between.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kristen Scott",
      "person_id": 60734
    }
  ],
  "release_date": "2019-05-27",
  "scene_id": 44396,
  "tags": [
    "BDSM",
    "Caning",
    "Clover Clamps",
    "Discipline",
    "dungeon",
    "Fingering",
    "gloves",
    "Handler",
    "Kinky",
    "masturbation",
    "slim",
    "Small Tits",
    "Straight",
    "Submission",
    "The Pope",
    "unshaved",
    "Vibrator"
  ],
  "title": "School Of Submission: Kristen Scott Day 1"
}