{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Five bored mechanics are standing around their garage, talking shop when one says he'd been thinking about proposing to his girlfriend. The other guys strongly disapprove and tell him to keep his options open. Just then, Alana Cruise walks into their shop, looking hot in a short tight teal dress and tells the guys that her car just broke down outside. The guys slowly surround her and tell Alana that they'll take care of her. They all begin to grab at her body with their ten hands. Confused but excited, Alana goes along with it and drops to her knees. They pull the top of her dress down, exposing her beautiful natural tits and pull their hard cocks out. The guys take turns shoving their big cocks down Alana's throat and she sucks them all with enthusiasm. The guys strip her completely naked and tie her up with rope while on her knees with her hands tied around a steel beam behind her. Once again they face-fuck Alana while she's tied up in bondage, taking turns with her mouth. Next, the guys tie Alana up in a partial suspension with one of her legs tied to the ceiling and the other leg standing, having to balance herself. The guys fuck her pussy deep and fast in this bondage predicament making her cum hard. They take her down and she shoves a cock in her pussy and then one of the guys shoves his cock in her ass for some hot double-penetration fucking. Then the guys fit two of their dicks inside her pussy and fuck her double-penetrated pussy deep and hard while the other guys stuff her mouth with their dicks. They turn her around and anchor a dick in her ass as the other guys line up to stretch her pussy for some more double-penetration. Ultimately Alana gets covered in their cum after being fucked raw by five mechanics.",
  "directors": [],
  "models": [
    {
      "name": "Alana Cruise",
      "person_id": 60194
    },
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-04-03",
  "scene_id": 44394,
  "tags": [
    "Anal",
    "BDSM",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Role Play",
    "Rough Sex",
    "Straight",
    "Suspension",
    "top"
  ],
  "title": "Damsel In Distress: Alana Cruise"
}