{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Whitney Wright is meeting her boyfriend Robby Echo at his stepdad's office. She gets there a little early and starts snooping through his desk and gets caught. Robby's stepdad, Sterling Cooper scolds Whitney and tells her that she lacks discipline. He bends her over his knees and lifts up her short dress, exposing her perfect ass. He spanks her gorgeous round ass until it's turned bright pink. Robby and his friends walk in as she's getting spanked and Robby is shocked at the sight. Sterling tells Robby that if he would've disciplined her, then he wouldn't have to do it himself. Robby joins in and continues spanking Whitney's ass and thighs and she is shocked at the situation that she's found herself in. Next, Sterling gets Whitney completely naked except for her stockings. He ties her up in rope bondage and gets her onto her knees and continues the punishment by making her suck all of their cocks. The five guys whip out their hard dicks and she gets into it and does her best to pleasure them all with her hands tied behind her back. They face-fuck her one by one and she tries hard to get all of their meat down her throat. After that, they tie her onto a leather stool with her ass hanging off the end in the perfect position for a spit-roast. The all take turns fucking her pussy deep and hard while her mouth is stuffed with cock. They fuck her ass next, stretching out all her holes. They move her to Sterling's leather couch to double-penetrate her pussy and ass while she sucks off the rest of the guys waiting there turn to fuck her airtight. Finally Whitney gets her face glazed with five loads, and her lesson is learned.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Chad Diamond",
      "person_id": 42305
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    },
    {
      "name": "Whitney Wright",
      "person_id": 61018
    }
  ],
  "release_date": "2019-04-17",
  "scene_id": 44395,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Discipline",
    "Double Penetration",
    "foreskin",
    "Gangbang",
    "Leather",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "spit",
    "Straight",
    "switch",
    "top",
    "versatile",
    "white"
  ],
  "title": "Whitney Wright Receives Stepdaddy's Discipline"
}