{
  "collections": [
    "Kink Features"
  ],
  "description": "It's Kristen Scott's fourth and final day in Kink's School of Submission, and she's all smiles. She has made it through day 3, which felt to her like the hardest day, so she is proud of herself. The Pope inspects his pet, removes her garment, and proceeds to enjoy\na few minutes with a toy before beginning the final push. Kristen is laid on her back and\nwe get to see The Pope put her in a grueling predicament position. We get to see\nher struggle just to get into this position, and then find what little bit of comfort she can. The Pope explains what every rope is doing and why it is specifically placed\nwhere it is. Once finished, Kristen is teetering on the top of her head and the tips of her\ntoes. The cattle prod is brought in to enforce everything that is said, and for his pleasure. This is an exercise to prove that Kristen is capable of anything she puts her\nmind to, and she knows this now. But her body can only take so much, so she is bound in another position before carrying on. We then find Kristen on her side with one leg pulled into the air. She is caned, shocked, and made to endure brutal bastinado, before the dildo shows up and The Pope fucks her face. Her signature shake starts well before he even gets to her pussy. When he does get there she is already about to explode. Kristen is pulled from the box up into a brutal hanged-man suspension, and then she is made to orgasm again to prove that she is the strongest fucking woman out there. As the day nears an end, she is allowed to orgasm freely in the arms of her master, and her final reward is to worship his boots. He is the only one that could've taken her through this journey, and it will live with her for the rest of her days.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kristen Scott",
      "person_id": 60734
    }
  ],
  "release_date": "2019-07-04",
  "scene_id": 44399,
  "tags": [
    "BDSM",
    "Brunette",
    "Cattle Prod",
    "Dildo",
    "master",
    "natural boobs",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "top",
    "white"
  ],
  "title": "School Of Submission: Kristen Scott Day 4"
}