{
  "collections": [
    "Kink Features"
  ],
  "description": "Kristen Scott's Day 3 of School of Submission subjects her to extreme physical labor. She's brought to a gym and put directly on the bicycle to get the blood pumping. This is going to be a very fast-paced day, pushing Kristen as hard as she can be pushed. Soon enough, her heart rate is up, and with a little motivation from the flogger, Kristen is feeling winded. The Pope begins fucking with her by teasing her pussy, but not letting her cum. Next she is made to focus on the slightest thing--her steps--as he tries to break her spirit. Every mistake brings repercussions, and we start to see Kristen breaking down. This is the goal, to break her down in order to build her back up, into a stronger version of herself. There are no breaks, since The Pope is making a point, and this time Kristen will find out the hard\nway why he is known as the meanest mother fucker on the internet. Every slip, every\nflaw, every slight mistake will bring big consequences. The Pope will not stop until she is broken. Kristin's fast pace is maintained all day, with physical labor, and extreme muscle fatigue, but that's still not enough. Her body almost collapses from exhaustion, but The Pope compels her continue, to prove her worth to him. She is tied between two racks and the impact begins as her exhausted body and mind have to endure a brutal attack from floggers all the way to a dragon tail, aka Fluffy. She breaks. Then she breaks again, and continues to, but she never quits and that is why she was chosen for this journey. The day ends with Kristen fighting through emotions as she is aware that she has made it, but at a cost.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kristen Scott",
      "person_id": 60734
    }
  ],
  "release_date": "2019-06-24",
  "scene_id": 44398,
  "tags": [
    "BDSM",
    "Brunette",
    "Muscle",
    "natural boobs",
    "slim",
    "Straight",
    "Submission",
    "The Pope",
    "white"
  ],
  "title": "School Of Submission: Kristen Scott Day 3"
}