{
  "collections": [
    "TS Seduction"
  ],
  "description": "Kayleigh Coxx is in the middle of a cam session when her internet gives out. She calls up her service provider who sends Mason Lear out to repair her connection. But Kayleigh doesn’t like how Mason demeans her, so she takes him down and punishes him, flogging him and fucking him with her rock hard cock, to correct his bad fucking attitude. She starts by ordering him onto the floor, and to worship her feet, legs and cock. She flogs his ass through his jeans, and after this warm-up, she demands that he strip naked. Kayleigh puts Mason her over her knee for a spanking, and swats his pale ass until he’s begging for more. She then pulls him up to suck her cock. Mason works Kayleigh’s dick until it’s rock hard, and he’s even more voracious. He slurps on her perfect dick as she demands, until she deems him ready for the main event. She bends Mason over the couch and fucks his hungry ass from behind. By now he’s fully her little bitch, and she delights in slamming his tight hold full of her hard cock. Kayleigh is a powerhouse, filling her little internet repairman with dick in every position. She gets on her back and orders him to ride her as she strokes his cock as a reward. She decided his cock looks good enough to eat, so she sucks it, taking it down, and doing it all because she likes it, whether he enjoys it or not. Kayleigh puts Mason on his back again, head down, humiliated as she pounds into his hole, reducing him to a fuck toy. Ultimately, Mason can’t contain himself as this beautiful woman fucks his ass with her hard cock. He shoots his load on himself, and Kayleigh unloads immediately after. Mason’s final humiliation comes when Kayleigh shows that he’s been broadcast on her cam the whole time. She instructs him, next time, to show a lady respect.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Kayleigh Coxx",
      "person_id": 61277
    },
    {
      "name": "Mason Lear",
      "person_id": 60275
    }
  ],
  "release_date": "2019-04-16",
  "scene_id": 44391,
  "tags": [
    "Anal",
    "Athletic",
    "black hair",
    "Blonde",
    "Blowjob",
    "Cock Worship",
    "fake boobs",
    "Feet",
    "Flogging",
    "Humiliation",
    "Male Sub",
    "Role Play",
    "Spanking",
    "Straight",
    "toned",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Hang Ups & Hook Ups: Kayleigh Coxx Calls Up Mason Lear"
}