{
  "collections": [
    "Kink Features"
  ],
  "description": "Kristen Scott is ready to begin day 2, which will include bondage and sex. We learned on Day 1 that Kristen is determined and also inspired to complete the grueling four days to expose her weaknesses and help her grow. Today we employ Derrick Pierce to exploit every sexual mistake she makes. He’s not here to just fuck a hot girl in bondage, but rather to examine her and help her work through things that she wants to improve. We begin with the basics, by testing her ability to follow directions. To rebuild something correctly you must first correct the mistakes and bad behavior that come from the past. Sometimes this means destroying everything and starting from scratch. The fundamentals are there, but they may need a lot of improvement. First we put her to work by showcasing her\nblowjob skills. Kristen definitely knows her way around a cock, but executing basic tasks\nseems to be more challenging than we expect. She can’t stop focusing on herself and\nher own needs, so correction has to happen. Next we move on to sex and bondage in a\nfull suspension, giving Derrick an all-access pass to her and her pussy. He fucks this slut\ninto uncontrollable orgasms to test her focusing skills. As with the first scene, Derrick\nuses electricity to keep her honed on the task at hand. After he has fucked her senseless\nwe move into the final scene. This time it’s up to Kristen to prove her worth. There are no\nrestraints holding her back, and so there’s nothing to blame if she fails to perform properly. She experiences the most powerful orgasms of her life and in the process she discovers more about herself than she ever thought. Kristen has done her best and given all that she can give, so Derrick flips her over and finishes the day with aggressive fucking until he throws her to her knees and blows his load all over her face.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kristen Scott",
      "person_id": 60734
    }
  ],
  "release_date": "2019-06-10",
  "scene_id": 44397,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cattle Prod",
    "Discipline",
    "Domination",
    "dungeon",
    "Kinky",
    "natural boobs",
    "Oral Sex",
    "Petite",
    "Rough Sex",
    "slim",
    "Small Tits",
    "Straight",
    "Submission",
    "Suspension",
    "Vaginal Penetration",
    "white"
  ],
  "title": "School Of Submission: Kristen Scott Day 2"
}