{
  "collections": [
    "Hogtied"
  ],
  "description": "Cadence Lux is a tough slut, and when she and The Pope get together it’s guaranteed to be something special. We find Cadence in a sitting lotus position, perched upon a wooden box, with her hands pulled behind her to support her body. Her feet are tied together and her knees are pulled down to keep her legs spread wide. There is a moment where The Pope takes his time and lets her get warmed up, but then it’s off to the races. Within the first two minutes, The Pope has pushed Cadence to tears. This is not an easy task, because she is a tough bitch, but he knows what it takes to get her to this point quickly. The flogger is used to bring the tears out in full force, before he attacks her with the crop. The magic wand is introduced and then the game of “pain or cum” is played until he decides to finally let her cum. The next scene has her bent over in a doggy position. The brutality continues with a spanking and then The Pope kneads the flesh on her back. The flogger is brought back out, but he quickly goes back to using his hands to make his victim scream in agony. After begging him to make her cry again, he begins fucking her face with a massive dildo. He moves back to her pussy and begins imposing orgasms as she is made to fuck her own throat with the dildo. Cadence is slowly melting away, but that is what she came here for; to suffer at his hands. The final scene begins, and she is bound, but not tied down. This is by design, because The Pope is about to push her further than she has ever been pushed before. The entire scene is Cadence being manipulated by heavy breath control and orgasms. Cadence completely comes unraveled. Her squirting pussy tells the full story of how turned on, yet totally overwhelmed, she is throughout the entire scene.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    }
  ],
  "release_date": "2019-06-06",
  "scene_id": 44403,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Rope Bondage",
    "shaved",
    "Spanking",
    "Squirting",
    "Straight",
    "Submission",
    "switch",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Cadence Lux in Brutally Devastating Torment and Bondage"
}