{
  "collections": [
    "Device Bondage"
  ],
  "description": "Lindsey Cruz is a very curious slut that wants to understand what real suffering is. The Pope is willing to walk her through the process and have some fun with her at the same time. She begins in the torment throne with her legs spread, ready for whatever he has in store for her. He starts with flogging her and she giggles while he does it, so he senses that she is nervous, so he begins to be playful with her. There is no ego here, so if playful is what works, then by all means, do it. He adds nipple clamps, then zaps her a few times. The giggling continues, so he ups the suffering by adding weights to the clamps, and it’s instantly apparent that this is more than she can handle at the moment. The vibe is brought in, and he plays a game with her that subjects her to more electrical play and orgasm denial. She repays him with the first of many squirting orgasms! Next Lindsey is on her back with her hips thrust into the air and her hands restrained with steel shackles. The Pope enters and goes straight for the nipples again, since that seems to be what makes her purr. Next is the flogger and she is made to recite her vowels as he torments her tits. After toying with her more with pussy torment and electrical play, she is brought to orgasm uncontrollably. In the final scene, Lindsey is on her back with her legs spread as wide as The Pope could get them. The crop is used to strike as much of her flesh as he can torment, then the zapper and cattle prod are brought back. The day ends with non stop squirting orgasms that drench the entire dungeon.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lindsey Cruz",
      "person_id": 61858
    }
  ],
  "release_date": "2019-08-08",
  "scene_id": 44400,
  "tags": [
    "BDSM",
    "Bondage",
    "Cattle Prod",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "Nipple Clamps",
    "Orgasm Denial",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope",
    "Weights",
    "Zapper"
  ],
  "title": "Fresh Meat: Lindsey Cruz in Device Bondage and Squirting"
}