{
  "collections": [
    "Everything Butt"
  ],
  "description": "When Penny Pax visits the doctor to get help with her arousal problems Dr. Britney Amber enlightens her with a thorough Anal Awakening. Dressed in a sexy red latex corset, red thigh-high stockings and red platform pumps Amber awaits Penny's visit in her sinister little doctors office full of butt toys and an examination table. Penny is reluctant to talk about what her problem is so Doc Britney takes charge and goes in for a deeper look. Equipped with plenty of tools she starts with a stainless steel anal hoo--she slides it in and out with ease revealing that Penny actually has quite a slutty asshole. Penny is a bit apprehensive with this kind of exam but she soon grows to like it very much as she moans with pleasure each time the hook fills her ass. Dr. Amber gets turned on, peels off her lab coat, grabs the Hitachi and makes Penny eat her unshaved pussy and then her sexy ass until she comes all over Penny's face and makes her lick it up. Sporting a big thick strap on Britney crams it in Penny's mouth to get it nice and wet for some fuckin'. First on all fours Penny gets a good ass fucking while her big natural tits bounce around with every thrust into her tight hole. Then Penny takes a ride on that dick reverse cowgirl and gets her rocks off real good. To continue the treatment Dr Amber slides a long stiff metal rod into Penny's ass and gets her ready for an even bigger thicker black rubber dildo and a see through plastic pillar that lets you see right inside Penny slutty asshole as the doctor fucks her. And finally something really special for Penny: the slink. Can it fit inside her butt? It seems impossible but with the aid of the magic wand Penny takes it so deep she goes over the top and has a screaming orgasm that fixes all her problems.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Britney Amber",
      "person_id": 57340
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2019-04-19",
  "scene_id": 44415,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Natural Tits",
    "Big Tits",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Corset",
    "Dildo",
    "Doctor",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "Hitachi",
    "Latex",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaved",
    "slink",
    "Straight",
    "Strap On",
    "switch",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Anal Awakening"
}