{
  "collections": [
    "Submissive X"
  ],
  "description": "Ariel X is a proud American who is willing to do anything for her country. That means she'll take a real beating just to protect her nation. Unfortunately for Ariel, her convoy was ambushed and she has been taken prisoner by the evil counter intelligence operator of a foreign country. Savannah Fox is the most wicked, cruel, war criminal known to man and today she gets her hands on Ariel x. She starts with heavy flogging first with one flogger, then with two. She beats the hell out of Ariel but Ariel is too proud to talk. Then Ariel is Stripped town and tied up in bondage. She is teased with orgasm denial using a vibrator. Just when she thinks she will never be able to cum, Savannah puts the vibe on high and makes ariel cum again and again. As Ariel is gasping for air from her powerful orgasms, Savannah jumps on to Ariel's face, Smothering her with her pussy. Savannah rides Ariel's face until she can't breathe. Then Ariel is tied up in doggy style and brutally fucked and beaten. Savannah pulls out all the stops but the stubborn Ariel takes it and never breaks.......she does it for her country.",
  "directors": [],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Savannah Fox",
      "person_id": 47440
    }
  ],
  "release_date": "2019-04-02",
  "scene_id": 44428,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "Breast Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Facesitting",
    "Femdom",
    "Flogging",
    "Hitachi",
    "Latex",
    "Leather Cuffs",
    "Lesbian",
    "LezDom",
    "MILF",
    "natural boobs",
    "Orgasm Denial",
    "Pussy Eating",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Smothering",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Spy VS Spy, Corporal Punishment"
}