{
  "collections": [
    "Lakeview Entertainment"
  ],
  "description": "Spend 39 minutes under Mistress January Seraph’s spell and watch how excited She gets tormenting hot stud slave sebastian. Temperatures rise between these two right from the start as She give him a solid over the knee spanking, strips him of his clothes and shows Her rope skills, binding him and his eager cock and balls as well. He gets his cock bitten and watches January use the vibrator to please Herself to his moans of pain. He gets to taste Her glorius pussy and then is strung up and milked out into a glass cup.\n\nMistress January is clearly pleased with hot stud slave sebastian. She immediately turns him over Her knee and spanks his bottom red. She strips him of all his clothes and shows Her rope skills, binding him and his eager cock and balls as well. His cock is whipped and his nipples clamped as he looks adoringly at January removing Her lacy bra to help him ease the pain. The tall dark haired sadist bites his nipples hard to remind him his place.\n\nA topless Mistress January gets enormous satisfaction biting sebastian’s cock and listening to him whimper. She puts him to his back and focuses Her attention and the hard round slapper, on his bound balls. His big brown eyes and whimpers of pain have made Her extremely aroused. She moves over him and straddles his body. The vibrator She presses to Her pussy takes little time in making Her orgasm multiple times and scream loudly in ecstasy. She sits on his face and yanks his balls nearly off his body before putting him to his knees to lick Her wet pussy dry. Another few orgasms and She decides She would like to stomp on his cock to make him whimper again, but first he has to lick the bottom of Her shoes clean.\n\nMistress January finishes stomping sebastian’s cock and moves him to lick and kiss the shoes that inflicted the torment. She gets the heavy red whip and orders him to bend over the crate for an ass whipping. He is told to sit on his red ass and She attaches the cock pump to him and fastens some clothespins to his nipples. Removing the pump, She whips his cock and balls and then moves toward him with a strange silver contraption. He looks pleadingly at Her but his big eyes do not produce any mercy and She traps his cock in the vise and it snaps on a cord around his balls, making them very very tight. She plays with his bound balls for a bit as he whimpers in pain.\n\nNow with sebastian standing, Mistress January ties his balls tight and separates them, stringing them down to the O-ring in the floor. She sucks his cock stiff and then cruelly bites the tip, getting him to make the noises of pain that so turn Her on. She applies the vibrator to Her pussy after releasing his left hand and orders him to milk his cock out. She orgasms loudly which seems to make him want to cum badly and She stands and Her long, well manicured fingers stroke his torso. She moves the glass cup under his cock and he asks permission to cum. She grants his wish and he deposits his essence for Her into the glass. She then makes him taste himself as they lock eyes, knowing that She will always be superior.",
  "directors": [],
  "models": [
    {
      "name": "January Seraph",
      "person_id": 15846
    },
    {
      "name": "Slave Sebastian",
      "person_id": 61918
    }
  ],
  "release_date": "2019-03-29",
  "scene_id": 44424,
  "tags": [
    "black hair",
    "Bondage",
    "bottom",
    "CBT",
    "Clothespins",
    "Dominatrix",
    "Femdom",
    "Flogging",
    "High Heels",
    "Hitachi",
    "Hood",
    "Leather Cuffs",
    "Lingerie",
    "masturbation",
    "natural boobs",
    "Nylons Stockings",
    "other hair color",
    "Paddle",
    "Pain",
    "Rope Bondage",
    "shaved",
    "slapper",
    "Slave",
    "Spanking",
    "Straight",
    "Stud",
    "Swallow",
    "Tattoo",
    "Partner Studio",
    "top",
    "Vibrator",
    "Whipping",
    "white"
  ],
  "title": "Bedroom Eyes"
}