{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "This was my first slave training session with my new Master. He said he had a surprise me. Something I’ve never tried before. He tied my tits and wrists with tight rope to posts on top of something that felt like a chair, my pussy resting on a rubber pad. My blindfold kept it mysterious. Every time I moved, it tickled me. My Master finally came in and turned on switch, a gently vibration making my pussy quiver. The vibration made me orgasm over and over, no matter how hard I try to resist. I could handle it after awhile. He kept my mouth open with hooks and shoved his massive dick deep in my throat, holding my head by the hair, pushing his meat down deeper. Spit was pouring out of my mouth down to my breasts. He raised the sybian speed, distracting me more as I slobbered over his dick. He had enough of my mouth. He pulled me up on my feet, the bondage keeping me bent over. He grabbed me by the waist and ropes, pulling back onto his cock. It’s so big. I could feel it open me up wide. I’ve never been fucked so rough and hard, his dick pushing through deeper and deeper. I have to admit, I loved when he pounded me in, his dick warming my pussy from the fast friction. Next thing I knew, he made me drop back down on the sybian and left me for the next he wanted to use me. I came so many times that night.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Mena Mason",
      "person_id": 53759
    }
  ],
  "release_date": "2019-04-04",
  "scene_id": 44432,
  "tags": [
    "Asian",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Breast Bondage",
    "brunet",
    "Brunette",
    "Deepthroat",
    "drool",
    "Facefucking",
    "Feet",
    "Latinx",
    "master",
    "Mouth Spreader",
    "natural boobs",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Sub",
    "switch",
    "Sybian",
    "Tattoo",
    "Partner Studio",
    "toned",
    "top",
    "Vaginal Penetration",
    "versatile",
    "Vibrator"
  ],
  "title": "Mena Li's Master Introduces her to the Relentless Sybian"
}