{
  "collections": [
    "Bound Gods"
  ],
  "description": "Welcome Buster Rhodes to KinkMen! Under immense pressure to meet deadlines at work, Buster is stressed out. His friend Sebastian recommends he call someone who can help him get all that stress out of his body, so Buster arranges to meet specialist Colby Jansen. Colby takes one look at Buster and knows what this stressed out boy needs. He makes Buster strip and gets him feeling present in his body by having Buster do planks and push-ups. Buster does his best to maintain form as Colby flogs him and has him lick his leather boots. Colby cuts off Buster's underwear and finds this little pervert has a Prince Albert piercing. He presses his heavy black boot down on Buster's cock and reminds Buster he's helpless and has to accept what comes. Colby flogs Buster's chest before tying him down over a cage for more flogging. The humbler pulling Buster's balls behind his legs makes every hit of the flogger more intense. Buster cries out as Colby flogs and spanks his ass. Colby reminds Buster that nothing else matters in this moment but serving him. He pulls out his cock and fucks Buster's mouth, making him take every inch of hard cock in his filthy pervert mouth. Next, Buster is blindfolded and suspended in rope. Colby flogs his boy all over before running a zipper down his two sides. Buster screams as Colby rips off the zippers and then is tied on his back with a spider gag stretching his mouth open and his legs up. Buster's body lifts off the ground as Colby canes his ass. Each stroke leaves Buster twitching for more. Colby canes his sensitive feet before finally fucking his greedy filthy fuck hole. Buster moans as Colby slams into him over and over again. Colby zaps Buster as he fucks him before blowing his load all over Buster's face. Buster loves it and cums all over his stomach. Buster feels so relaxed after his session, he decides he better come again next week.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Buster Rhodes",
      "person_id": 61923
    },
    {
      "name": "Colby Jansen",
      "person_id": 34457
    }
  ],
  "release_date": "2019-04-04",
  "scene_id": 44440,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Boot",
    "Cage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Flogging",
    "Gag",
    "Gay",
    "Humiliation",
    "Kinky",
    "Leather",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "spider gag",
    "Submission",
    "Zipper"
  ],
  "title": "SEX RELIEF: New boy's self care is BDSM"
}