{
  "collections": [
    "Bound Gods"
  ],
  "description": "Kink newcomer Argos is bound and at the mercy of a leather clad Jack Dixon. Argos is nervous for his first day serving the House but flourishes under the firm hand of Daddy Dixon. Jack strips Argos, exposed his lean form and rock hard dripping cock. He plays with Argos' nipples and tests Argos' endurance with the flogger. Argos moans as Jack hits his chest, startled by how good it feels. Next, Argos is bound and hooded, facing a mirror. Helpless, he watches as Jack plays with his cock and puts closepins on his sensitive nipples. Jack pushes his gloved-fingers into his boy's mouth, making him taste his smooth worn leather. Jack pumps Argos' hard cock until Argos is begging to cum. Jack smacks Argos' chest, reminding him who his cock belongs to. He brings out the violet wand and draws sparks down Argos' chest to his hard cock and tight balls. Argos moans as the violet wand travels up his shaft and over his sensitive nipples. Hearing his boy's moans gets Jack nice and hard. He frees his cock and stuffs it in Argos' wet eager mouth. Argos' lips stretch obscenely around Jack's fat cock. Once Jack has his fill, he flogs Argos' ass until it's a warm red and ready for a pounding. Argos is bound and gagged on his back. He moans as Jack pushes the head of his monster cock into his tight hole. Jack groans as his cock sinks inch by inch into his boy. Soon, Argos is moaning for more and Jack takes a look over at the mirror to watch his cock thrusting in and out of Argo's hungry hole. Finally, he lets Argos cum all over his belly as he gets fucked, and then it's Daddy's turn. Jack has Argos suck his cock and then cums all over his face. What a lucky boy.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Argos",
      "person_id": 61952
    },
    {
      "name": "Jack Dixon",
      "person_id": 61576
    }
  ],
  "release_date": "2019-04-18",
  "scene_id": 44458,
  "tags": [
    "Anal",
    "BDSM",
    "Bear",
    "Blowjob",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "gloves",
    "Hood",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "harness",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "smooth",
    "Submission",
    "Violet Wand"
  ],
  "title": "Argos Bound: Daddy Dixon trains new slave Argos"
}