{
  "collections": [
    "Families Tied"
  ],
  "description": "Rob Piper is just trying to be a good father, math professor, and track coach. But the\nteen college sluts surrounding him would rather suck dick than do their homework. At home he has to manage his hot teenage nightmare of a step-daughter Chloe Cherry, and at work he has posh, cocky college admissions brat Michele James. Michele's father has paid her way into a fake sports scholarship in Rob Piper's department, so she thinks she can just throw 20-grand on Rob's lap and give him a 10-minute blowjob to avoid training. He is here to show Michele that regardless of how rich and untalented she is, she is still going to work for her education. Michele is thrown on her knees and made to squat. In this position she really works her thighs, and takes Rob's huge cock in her throat, as he coaches her through some major-league dick sucking. Her milky, rich-girl ass is flogged and spanked a deep red, then her tight, posh pussy gets stretched out on her coach's thick cock. Screaming with pleasure and pain, she rides him with her big tits bouncing. But the real torment begins when Michele's put in a leather straight jacket and made to do squats on his giant dick. Sweating from orgasms and exertion, she begs to get off, but Rob demands one more orgasm, followed by a two-mile jog. But unbeknownst to him, his teen step-daughter has been watching him get this payout, and she demands she get an athletic scholarship or she'll tell her Mommy that he's fucking around. Tired of little sluts giving the commands, Rob throws her into a pile driver and paddles her bratty ass until she begs for his big cock in her asshole and pussy. Caned and fucked hard, she cums like a horny little cunt. Michele returns from her jog and is immediately put on cunt-licking duty, made to eat up all the cum from Chloe's pussy. Both girls are flogged and wrestle for his cock, trying to one-up each other in a race for the track scholarship. In the end it comes down a competitive threesome with tight rope shibari, each girl taking it deep, and keeping Rob entertained with her sexual submission until one of them is chosen, and gets a hot load on her ass for good measure!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Michele James",
      "person_id": 61936
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2019-04-26",
  "scene_id": 44451,
  "tags": [
    "Athletic",
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "Blonde",
    "Blowjob",
    "Family Roleplay",
    "Leather",
    "muscular",
    "natural boobs",
    "Pain",
    "shaved",
    "slim",
    "Straight",
    "Straitjacket",
    "Submission",
    "Tattoo",
    "Threesome",
    "top",
    "white"
  ],
  "title": "Scandalous Anal College Admission For Bratty Step-Daughter"
}