{
  "collections": [
    "Lakeview Entertainment"
  ],
  "description": "Sultry brunette Mistress Haley introduces Herself and belittles you directly before turning Her attention to dominating slave Spartacus. This 63 minute extravaganza in Femdom fun has Mistress Haley loosening up slave spartacus’s asshole after hoisting his arms back and tying off his balls. She takes him from behind with Her strap-on after some corporeal punishment and then slips into a latex outfit with Her big natural boobs sticking out obscenely and face sits and fucks him to orgasm.\n\nGorgeous brunette Mistress Haley flaunts Her body in your face and talks directly to you in a hot POV intro. Next, She has slave Spartacus by the balls and is tying them down to a brick before picking up the violet and testing his reaction to some electrical current in his cock head. She laughs and then winches him over to stick an inflatable butt plug into his backside. She pumps him up and smiles deliciously as his ass is stretched.\n\nSlave Spartacus begs Her to smack his ass as the butt plug rubs furiously on his prostate. The corseted brunette happily obliges him and uses all Her strength to redden his butt cheeks. She sits in front of him to give him some respite and teases his cock with Her talented mouth. At full attention, he gets the nastiest of Her whips on his ass as he bends low and happily accepts his punishment from his Goddess.\n\nMistress Haley switches out the harsh red whip for a bamboo cane and lays into the backside of slave Spartacus as She plays with Her pussy. The whipping and caning and his cries have made Her wet and She moves in front of him for some tongue service. Next, She has him imprisoned in the irons and lubes up his backside and give him a brief prostate massage. She slips on Her strap-on and goes to work from behind him. She drops Her top, revealing Her perfect natural breasts and they swing free as She buries Her rubber cock to the hilt in his ass.\n\nMistress Haley finishes fucking slave spartacus’ ass pussy with her strap-on and has him strapped down tight to the bondage chair. She removes Her wet panties and puts them into his mouth for him to suck clean. She threatens to castrate him if he does not service Her well and moves to sit heavily on his face. She pulls Her pussy lips open and commands him to feed on Her hole. He licks and sucks and She is still not happy so She puts nipple clamps on him and then turns to have him service Her succulent asshole with his tongue.\n\nAlthough slave Spartacus is staring to tire from all the abuse and tongue service, his cock stays hard as a rack. Mistress Haley orders up more ass worship and then turns to replenish his dry mouth with some of Her spit. She pulls on his nipple clamps and face sits him until he can take no more. She sucks sucks his cock hard after tying Her wet panties around his balls and sits on it, taking him deep inside Her pussy hole as he lays helpless beneath Her.\n\nSlave Spartacus is extremely tired and his cock is still hard. She wants to use him for Her sex slave but he must take some clothespins on his nuts before the brunette sadist and fuck him some more. Mistress Haley takes all of his hard cock and fucks him, pulling the clothespins off after She has orgasmed. She asks him if he is ready for Her pussy to milk him out and he is too exhausted to answer. She fucks him hard and he begs permission before She relents and Her pussy squeezes every last bit of juice from his swollen balls. She slowly dismounts and then drains the condom of his seed, making him consume his load that She has granted him.",
  "directors": [],
  "models": [
    {
      "name": "Mistress Haley",
      "person_id": 61939
    },
    {
      "name": "Slave Spartacus",
      "person_id": 61827
    }
  ],
  "release_date": "2019-04-12",
  "scene_id": 44455,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Brunette",
    "buttplug",
    "Caning",
    "CBT",
    "Clothespins",
    "Clover Clamps",
    "Dominatrix",
    "dungeon",
    "Edging",
    "Electrical Play",
    "Femdom",
    "Flogging",
    "Hood",
    "Latex",
    "Leather Cuffs",
    "natural boobs",
    "Nipple Clamps",
    "PIV",
    "POV",
    "rack",
    "Slave",
    "Straight",
    "Partner Studio",
    "top",
    "Vaginal Penetration",
    "Whipping"
  ],
  "title": "Hot For Haley"
}