{
  "collections": [
    "CFNMEU"
  ],
  "description": "Bradley Cook has an interview about a job. He walks into the office and sits to be interviewed by the woman. She asks him some questions, filling out a form with his answers. Bradley explains that he wishes to be a model and is asked some personal questions, about the size of his cock. Then the woman says she can check his health to be a model and tells Bradley to remove his clothes. he doesn't have underwear on but the woman says that is fine. As he stands naked, his hands covering his cock and balls the woman begins to inspect him. Bradley's hand hardly covers his big cock, as it starts to swell. Then he exposes it as the woman has to measure it. She tells him to get the cock fully hard as she wants to measure it like that. She takes hold of the cock and gently wanks it, and it soon gets hard. She blows on the cock and kisses it as she wanks it. She also rubs Bradley's balls and then licks his cock too. Clearly she wants more and soon starts to suck that big cock. She sucks it and licks up and down the shaft, then she has Bradley kneel on the sofa, showing his ass. She spanks the ass and keeps pulling on his cock. She tells him that she has to check his ass, dripping oil into the crack. She rubs the oil over Bradley's hairy hole sliding a finger inside. As she fingers his hole she also wanks on his thick cock. Then she spanks his ass too. She has more planned for Bradley, sitting him down and blindfolding him. Then she uses a whip on his sexy chest. But she cant resist his cock and is soon sucking on it again. He lifts his legs for her and she fingers his hole some more as she wanks and sucks his cock.",
  "directors": [],
  "models": [
    {
      "name": "Bradley Cook",
      "person_id": 60772
    },
    {
      "name": "Kancelarska Ucitelka",
      "person_id": 61937
    }
  ],
  "release_date": "2019-03-27",
  "scene_id": 44452,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Blindfold",
    "blond",
    "CFNM",
    "Dildo",
    "Facefucking",
    "Femdom",
    "Hairy",
    "Handjob",
    "Male Sub",
    "Pegging",
    "Redhead",
    "Role Play",
    "Straight",
    "Strap On",
    "thirdparty",
    "Uncircumcised"
  ],
  "title": "Meeting"
}