{
  "collections": [
    "Bound Gods"
  ],
  "description": "Seth Santoro is bound by leather restraints and rope. His face is wrapped in duct tape and he has a tube for air. His dick is hard under his leather jockstrap as he awaits his master, Jacen Zhu. Jacen strides over to Seth and tests his hard muscle with slaps, punches, the flogger and the crop. Seth grunts with each hit, body tensing with pain as his master's leather-gloved hands come in contact with his abs. Jacen reveals Seth's cock and crops it, and before wrapping his lips around his slave's cock. Hungry to see what this slave can do, Jacen takes the tube out of Seth's mouth and pushes him down on his own rock hard dick. Seth takes Jacen's cock all the way, gagging on it as drool leaks out of his greedy slut mouth. Next, Seth hangs by his ankles in an inverted suspension. Jacen strokes his cock as he begins to flog Seth's back and ass. Once Seth's ass is warmed up, Jacen leans in to taste it before pushing a gloved finger into Seth's tight ass. Seth moans as Jacen lavishes him with attention, but his pleasure is short lived as Jacen soon switches back to flogging. Each hit falls harder than the last and soon Seth is crying out in pain. Now that his slave's ass is tender, Jacen has Seth gagged and suspended by his arms and legs. Seth yells out around his gag as Jacen places closepins on his balls. Jacen laughs at Seth's pain and thrusts his cock into his slave's hungry hole. Seth moans as Jacen fucks him hard. Jacen pounds Seth before wrapping a gloved hand around his dick and jerking him off. Seth blows his load all over Jacen's gloves and then is released and put on his hands and knees to accept his master's fat load.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jacen Zhu",
      "person_id": 61943
    },
    {
      "name": "Seth Santoro",
      "person_id": 52710
    }
  ],
  "release_date": "2019-04-25",
  "scene_id": 44459,
  "tags": [
    "Anal",
    "BDSM",
    "bit gag",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "Crying",
    "Domination",
    "drool",
    "Facefucking",
    "Flogging",
    "Gag",
    "Gay",
    "gloves",
    "Hairy",
    "Humiliation",
    "Jockstrap",
    "Latin",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Slave",
    "spit",
    "Stud",
    "Submission",
    "Suspension"
  ],
  "title": "Muscle Stud Showdown: Seth Santoro submits to Jacen Zhu"
}