{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Joanna Angel is the kind of fresh and naive meat that makes lust-filled sadists drool with desire. Her perfectly toned body is adorned with exquisite tattoos that show off her all-natural titties and bubbly butt. Joanna immediately finds herself strung up like a sexual fuck puppet, dangling in the middle of the room with her arms and legs restrained with cruel and inescapable rope bondage. Her dom, Stirling Cooper, slowly and methodically crops her. The piercing sting of the impact play causes Joanna to howl and whimper like a caged animal. Panting and sweating, she begs the sadist to let her go through the tightening grip of a huge red ball gag. But Stirling only laughs and jams a hitachi onto her tiny pink pussy causing his fuck doll to scream with delight. Next Joanna is tied on her hands and knees with a massive anal hook rammed into tight asshole. Stirling takes out his giant cock and crams into her pussy. It barely fits because the ass hook is pushing her anal wall into her pussy. She yelps as sadist begins to recklessly fuck her. He pulls s the asshook out of her hole as she gapes. He then shoves his huge dick into her ass and fucks the little whore until she is having multiple and repeated orgasms. Gasping for breath and dripping with sweat, Joanna is then tossed onto her back with her legs tied wide apart. Completely helpless and vulnerable, she submits completely to her task master knowing that there is no escape. Stirling fucks her ass and then switches to her pussy, back and forth, only stopping to slide his dick into her mouth. Finally he tosses her to the floor and blows a huge load of hot cum all over her face and tits.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Joanna Angel",
      "person_id": 61458
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-06-10",
  "scene_id": 44468,
  "tags": [
    "Ass Hook",
    "Athletic",
    "Ball Gag",
    "black hair",
    "Bondage",
    "drool",
    "foreskin",
    "Gag",
    "Hitachi",
    "master",
    "natural boobs",
    "other hair color",
    "Rope Bondage",
    "Straight",
    "Sub",
    "toned",
    "white"
  ],
  "title": "Joanna Angel Punished with Rope Bondage and Rough Anal"
}