{
  "collections": [
    "Bound Gods"
  ],
  "description": "Fresh-faced Tobias is stripped down to his boxer briefs in bondage. Leather god Michael Roman arrives decked his leathers ready to see what his new slave can take, but Tobias has a smart mouth isn't going to submit easily. Michael is hungry to see the smug grin wiped clean off his slave's face and tells Tobias he can tap out any time. Tobias remains defiant as Michael begins hitting him with a leather slapper. Each smack stings and Tobias struggles in bondage as Michael targets his chest, biceps, ass, and thighs. Each hit falls harder than the last, but Tobias still unwilling to submit. Michael rips off Tobias' boxer briefs and slaps his hard cock around before tying it up and pulling on it hard as he settles on his throne. Tobias is on his tip toes as he struggles to maintain his balance and cries out as Michael continues to hit him. Next, Tobias is tied on his hands and knees with his head near the Michael's boots. His cock is locked away in a metal cock cage. Michael brings the flogger down on his ass over and over again until it's a bright red. Tobias takes every hit, crying out as his tender flesh is struck. There is no escaping his Master. Michael brings Tobias to his knees and has him worship his rock hard cock. Tobias struggles to take every inch as Michael fucks his face. Then Tobias is put in bondage on the leather wheel. Michael drips hot wax all across Tobias' arms before hoisting his legs up and driving his cock into Tobias' tight ass. Tobias cries out as Michael relentlessly fucks his hole. Finally, Tobias is put back on his hands and knees and gets his Master's fat load all over his face. He's ordered to cum on the floor and his Master pushes his face into his own mess.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Michael Roman",
      "person_id": 61574
    },
    {
      "name": "Tobias",
      "person_id": 61948
    }
  ],
  "release_date": "2019-05-02",
  "scene_id": 44460,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Cage",
    "Chastity Play",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gay",
    "gloves",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "slapper",
    "Slave",
    "Spanking",
    "Submission"
  ],
  "title": "The Torment of Tobias: Muscle hunk submits to Michael Roman"
}