{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "All natural blonde girl next door Lisey Sweet submits to inescapable rope bondage and rough anal sex at the hands of the sadistic Tommy Pistol. Immediately Lisey is suspended in the middle of the room, dangling from her ankles by thick leather cuffs. Her arms are restrained behind her back, making it impossible for her to resist the abuse that her dom inflicts upon her. He puts clover clamps on her nipples, then beats her mercilessly with a heavy leather flogger, while slapping and punching her perky tits. Tommy then jams a bottle of water into her exposed pussy, emptying it into her fuck-hole. Once her cunt has been filled, he water boards her face until she is gasping for breath. Lisey's cruel taskmaster jams a hitachi onto her clit and makes her squirt all over herself and the floor. Next Lisey finds herself tied to a table with her legs spread wide. The dom wastes no time and begins to slam her tight pink pussy with his solid cock. He ruthlessly fucks his sex slave, switching with depraved passion between her gaping asshole and her wet pink cunt. Lisey can't get enough and begs to cum, but Tommy loves orgasm denial and refuses to let her cum. He then tosses Lisey's legs to the side and ties her feet together. He can barely fit his cock into her compressed cunt as Lisey squirms and squeals from the pain. Tommy begins to fuck Lisey until she nearly falls off the table, gasping for breath and unable to control herself. Finally, Tommy blows a huge load of cum all over her swollen and abused pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lisey Sweet",
      "person_id": 60674
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-06-24",
  "scene_id": 44469,
  "tags": [
    "Blonde",
    "Bondage",
    "brunet",
    "Clover Clamps",
    "Feet",
    "Gaping",
    "Hitachi",
    "Latin",
    "Leather",
    "Leather Cuffs",
    "natural boobs",
    "Orgasm Denial",
    "Pain",
    "Punching",
    "Rope Bondage",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Sub",
    "white"
  ],
  "title": "All Natural Blonde Babe Lisey Sweet Ass-Fucked and Abused in Bondage"
}