{
  "collections": [
    "Men On Edge"
  ],
  "description": "When Vander Pulaski picks up Sebastian Keys and Tony Orlando, he has no idea this ride-share may be his last. As he helps the odd pair with their bags, they jump him and drag him to their warehouse. Vander is stripped to his white boxer briefs, blindfolded, and tied down. He struggles in bondage, but despite his toned muscles, can’t escape from the wandering hands of Tony Orlando. Vander tells Tony to get away, but Tony only laughs and squeezes the hard length of Vander’s cock through his briefs. They cut Vander’s briefs off him, revealing his a flushed hard cock. Tony can’t wait to taste every inch of this fresh meat. He licks Vander’s balls and runs his tongue along Vander’s shaft, teasing the sensitive head with his tongue and a fuck sleeve. Vander doesn’t know what is happening but all the sensations are starting to feel good. He begins to thrust his hips forward, seeking release. But Sebastian and Tony just pull away laughing every time he gets close. Next, they put Vander in bondage on a table with a ball stretcher pulley rigged to his body. Vander moans around his bit gag as Tony continues to tease his cock. His moans increase as they tease the head with a vibrating sleeve. Vander is so turned on, he doesn’t know what to do. Each new sensation leaves him hornier and hornier. Tony sucks on his toes and licks his feet as Sebastian runs a vibrator along his shaft. Vander doesn’t know why they are doing this to him, but he really wants to cum. His hips move faster and faster as he tries to get off. Every time Vander gets close to cumming, his tormentors back off. Finally, they allow him to blow his load. Vander things they may let him go now, but Sebastian and Tony aren’t done yet. From his feet to his armpits, they tickle him mercilessly as he thrashes on the table top.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Vander Pulaski",
      "person_id": 61944
    }
  ],
  "release_date": "2019-05-14",
  "scene_id": 44461,
  "tags": [
    "BDSM",
    "bit gag",
    "Blowjob",
    "Bondage",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Five Star Service: Driver gets taken down, pumped, and primed"
}