{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Tiny female sex slave Isabella Nice finds herself in over her head. She unwittingly saunters into the dungeon of a sadistic Seth Gamble, and finds herself held captive to his depraved desires. He strings Isabella up like a marionette and lets her dangle helplessly as he abuses her tight and smooth skin with a heavy leather flogger and riding crop. She cries out in pain as searing agony grips and causes her taut muscles to tense up. Seth jams his stiff cock into her mouth to shut her up, causing her to gag and drool. He quickly spins Isabella around and shoves it into her tight pink pussy. Desperately trying to break free of his brutal grasp, Isabella finally submits to the ecstasy of unwanted and repeated orgasms. Seth then tosses her onto a couch and ties her into a doggystyle position with inescapable rope bondage. With her young, all-natural ass perched into the air, the cruel sadist begins to fuck her asshole. Isabella is helpless and can only cum repeatedly. She is then tied to a table with her legs spread wide apart so her teeny whore holes are wide open and exposed to depraved punishment. Seth quickly slaps her face to establish control of the situation. He then pounds her pussy and switches to her asshole, repeatedly bringing her to the heights of pleasure. Gasping for air and pouring sweat, Isabella begs to taste his cum. Seth is happy to oblige and blows a massive load all over her perky small titties.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Isabella Nice",
      "person_id": 61113
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-05-27",
  "scene_id": 44467,
  "tags": [
    "big dick",
    "Bondage",
    "brunet",
    "Brunette",
    "Crop",
    "drool",
    "dungeon",
    "Gag",
    "Latin",
    "Leather",
    "muscular",
    "natural boobs",
    "Pain",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "smooth",
    "Straight",
    "Stud",
    "Sub",
    "white"
  ],
  "title": "Tiny Sex Kitten Isabella Nice Submits in Rope Bondage and Anal Fucking"
}