{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "It's always the quiet ones. Victoria Voxxx is a soft spoken and well composed natural beauty. One would never suspect that underneath her quiet demeanor lurks a sex-crazed pain pig that wants nothing more than to be tied up with inescapable rope bondage, power fucked in her tight ass, and to lick the boots of a sadistic dom. Victoria starts her day fully suspended with her legs tied wide apart. The cruel dom Mr Pete beats her all natural small breasts ruthlessly with a heavy leather flogger. He puts steel clover clamps to her pierced nipples, as as she wimpers, he gets harder and harder. He grinds a relentless vibrator onto Victoria's swollen and sensitive clit, then jams his thick hard dick into her tiny pink pussy. As Mr Pete pounds her fuck hole, he spanks her exposed ass until it's glowing red. Next Victoria's tied face-up onto a table and has her pelvis yanked viciously into the air, coercing her fragile body into a stunning back arch. As beautiful as she is, a girl like Victoria looks even better with a huge cock jammed into her mouth. And the sadist controlling her is only too happy to oblige. He shoves his cock down her throat and begins to face fuck her, compelling her to gag from the deep throat pounding. She drools and spits all over her face, and as she coughs and catches her breath, she begs to have the dick back deep inside of her throat. Now that Victoria is warmed up she's tossed like a rag doll onto a couch and tied so her toned ass is perched high in the air. Mr Pete begins to fuck her pussy, then switches directly to her tight asshole. He relentlessly pounds her fuck-holes until she is gasping and begging to cum. He denies her and watches her wither from the pain of orgasm denial. To finish her day Victoria is tied to a table on her back with her legs again spread wide open. In this exposed and vulnerable position she is completely unable stop her task master from fucking her with the senseless abandon. He slams her against the table and fucks her asshole relentlessly until Victoria is absolutely begging to cum. He finally allows her to have an orgasm, just as he blows a massive load of cum all over little pink pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-05-13",
  "scene_id": 44466,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Clover Clamps",
    "Corporal Punishment",
    "drool",
    "Facefucking",
    "Fisting",
    "Gag",
    "Hitachi",
    "Leather",
    "master",
    "Nipple Clamps",
    "Orgasm Denial",
    "Pain",
    "Pierced Nipples",
    "Rope Bondage",
    "Straight",
    "Sub",
    "Submission",
    "toned",
    "Vibrator",
    "Whipping"
  ],
  "title": "All Natural BDSM Slut Victoria Voxxx Rough Anal Brutal Bondage"
}