{
  "collections": [
    "Men On Edge"
  ],
  "description": "Colby Tucker is bound, hooded, and hard. He hasn’t cum in at least 3 days and he is so eager for it, he’s moaning before he is even touched. Sebastian Keys and Dominic Pacifico tease his hard cock, full balls, and sensitive nipples. Colby arches under each touch, thrusting into the air. He moans as Dominic wraps his lips around his hard cock, bringing him closer and closer to the edge. Dominic and Sebastian slap his hard cock around and then bring out a fuck sleeve. Colby cries out as his dick pierces its soft fleshy hole. His hips pump furiously as he tries to get himself off, but every time he’s about to cum, Sebastian pulls it just out of reach. Next, Colby is strung up and gagged. Suspended, he’s helpless as Dominic teases his cock and worships his feet. He begs to cum but the boys have more in store for him. Sebastian presses a dildo into his ass making him cry out in pleasure as it vibrates. Every sensation is intensified and Colby’s cock is getting hard and harder. He eager swallows Dominic’s hard cock and sucks it as Sebastian close pins his balls with twine connected to the floor. Balls aching with Dominic’s hard cock in his mouth, Colby doesn’t know how much longer he’ll last! Then Sebastian and Dominic start tickling him! Colby twists in bondage unable to stop laughing. Finally, they stick a prostate massager in his ass and start slowly jerking him off. Colby begs to cum, but instead gets more tickling! His laughter subsides, but his rock is still rock hard. At long last, Dominic jerks Colby off and Colby blows an explosive load all over the place! Dominic feeds some to him as Colby relaxes, completely spent.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Colby Tucker",
      "person_id": 61945
    }
  ],
  "release_date": "2019-05-28",
  "scene_id": 44462,
  "tags": [
    "BDSM",
    "Bondage",
    "Dildo",
    "Edging",
    "Feet",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Slave",
    "Tickling"
  ],
  "title": "Tuckered Out: New Slave Kept on the Edge"
}