{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Lily Lane has been a good girl. She’s attending an anonymous support group for sex addicts and is proud to share her story. After the meeting, she connects with the mysterious Mr. Pete. Eager to be a friendly ear, she gets more than she bargained for as Mr. Pete shares his deepest darkest desires with her and soon she is overcome with lust and a hunger that can only be satiated by sex! She shows Pete her big tits and pinches them just as he instructs. She’s tied up over a desk, gagged, and flogged. Pete isn’t one to ignore a pretty pussy and Lily’s is dripping wet. He makes her beg for an orgasm and then gives her a good hard fucking. Lily is in heaven. It’s been so long since she’s had cock, she’s gagging for it. Pete puts her on her knees and blindfolds her. He fucks her pretty little mouth till spit leaks down all over her perky tits. Lily loves it and comes again as Pete commands. She’s so horny for cock, she just can’t get enough. She rides Pete over a desk, bouncing her ass up and down on his rock hard cock. Finally Pete ties her on her back with her legs open. He pounds her pussy over and over again, stretching it out and making it gape wider and wider. Lily can’t believe she ever gave up sex, this all feels so fucking good! But her hunger won’t be satisfied until she gets his cum. Lily tells him to cum on her pussy and bush and gets exactly what she wants. Mr. Pete blows a fat load all over her. Lily loves feel his cum on her body. Maybe being celibate isn’t for her after all.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2019-05-17",
  "scene_id": 44473,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Tits",
    "Blindfold",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Bush",
    "Corporal Punishment",
    "Domination",
    "Facefucking",
    "fake boobs",
    "foreskin",
    "Humiliation",
    "Latinx",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "spit",
    "Straight",
    "Stud",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Fucksluts Anonymous: Lily Lane Can't Get Enough Cock!"
}