{
  "collections": [
    "TS Seduction"
  ],
  "description": "Shiri Allwood sits on a throne in the middle of her dungeon with her captive servant, Ruckus next to her, locked in a cage. She wears black latex thigh-high boots, gloves, and corset, framing her petite natural tits. She unlocks her servant’s cage and tells him to go make her a drink. After serving her drink, he stands with his head bowed, sulking. She asks why he still stands there, and he humbly reminds her of the promise she made to him. Shiri promised that if he were to stay in his cage for a week, she would let him out to play. Shiri rolls her eyes and tells him to remove his leather jock and “assume the position”. Ruckus gets on all fours on top of a dirty mattress. Between his legs, Shiri has placed a leather parachute ball stretcher. Shiri starts putting weights on the ball stretcher until Ruckus’ balls are almost touching the floor. She spanks his ass and then goes to get her leather flogger. She flogs Ruckus’ ass and back hard with the weights still attached to his balls. She takes a seat at her throne and places Ruckus over her knees and spanks him some more. She makes him lick her latex boots and he licks them from the bottom all the way up. Next, Shiri places Ruckus on his back, blindfolded on top of a leather padded platform with his legs spread and his wrists bound to his thighs with leather straps. Shiri rubs her hard cock on his, walks to where his head lies, and sinks her cock into his mouth. She climbs on top of the platform and teases Ruckus’ dick while he sucks her cock and balls in a hot sixty-nine. She takes his blindfold off, fucks his mouth some more, then goes back between his spread legs to fucks his ass deep, hard, and raw. She makes him cum by stroking his cock with her latex gloved hands and scoops up his load to makes him eat it, just before straddling his chest and blowing her load all over his face.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Ruckus",
      "person_id": 48209
    },
    {
      "name": "Shiri Allwood",
      "person_id": 61393
    }
  ],
  "release_date": "2019-05-28",
  "scene_id": 44475,
  "tags": [
    "69 Position",
    "Anal",
    "Athletic",
    "Blindfold",
    "Blowjob",
    "Boot Worship",
    "bottom",
    "brunet",
    "Cage",
    "Cock Worship",
    "Corset",
    "dungeon",
    "Flogging",
    "gloves",
    "jock",
    "Latex",
    "Leather",
    "Male Sub",
    "natural boobs",
    "Petite",
    "Redhead",
    "Role Play",
    "shoe licking",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "versatile",
    "Weights",
    "white"
  ],
  "title": "Shiri Allwood's Pitiful Pet"
}