{
  "collections": [
    "TS Seduction"
  ],
  "description": "Draven Navarro sleeps on the floor, chained to the wall, in a dark and dirty room, in only his underwear. Upstairs, you can hear the faint thumps of party music. The door opens and in walks Khloe Kay looking gorgeous and fit in her black miniskirt and crop-top. She wakes her captive boy-toy with the tip of her high heel shoe and he jumps up to greet his Princess. She gives Draven a cookie and he devours it as if he hasn’t eaten in days. She asks where his manners are and he apologizes for not showing enough gratitude. Khloe tells him that she’ll have to retrain him, so she stands him up and locks his leather wrist cuffs to a spreader-bar that hangs from the ceiling. Khloe cuts off his underwear, squats down and puts Draven’s cock between her teeth and bites down. She gets a handful of clothespins and makes two zippers down each side of his torso. Khloe gets a cane bundle and hits Draven in his ass and thighs. She rips off the zippers and the screams from Draven’s pain makes Khloe’s dick hard. She lets down his arms and takes off her top, exposing her tanned petite natural tits. She takes her skirt and panties off and teases Draven with her perfect ass and hard cock. She tells Draven to crawl to her, and suck her cock. He sucks her cock like its his last meal, deep throating her hard dick until drool drips from her balls. Khloe bends Draven over and fucks his ass raw. She pounds his hole deep and hard. She flips Draven over and fucks him on his back with his legs spread until he cums all over himself. After that, Khloe has Draven get on his knees and she blows her huge load all over his face, just before chaining him back up and returning to her party upstairs.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Khloe Kay",
      "person_id": 61949
    }
  ],
  "release_date": "2019-06-11",
  "scene_id": 44476,
  "tags": [
    "Anal",
    "Blowjob",
    "body builder",
    "bottom",
    "brunet",
    "Clothespins",
    "Cock Worship",
    "Crop",
    "drool",
    "High Heels",
    "Leather",
    "Male Sub",
    "mixed",
    "Pain",
    "Petite",
    "Role Play",
    "Straight",
    "Tattoo",
    "the wall",
    "top",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Khloe's Toy"
}