{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When blonde cutie Carolina Sweets accuses Seth Gamble of taking her money and maxing out her credit cards Seth gives her an attitude adjustment through the world of BDSM and hot hardcore sex. Carolina is a spoiled Daddy's Girl who needs to be taught a lesson about being such a brat so Seth ties her up tight and disciplines her with the flogger, the cane and nipple clamps. Bound and gagged Seth stuffs his long dick in Carolinas mouth and gives her a solid throat fucking to shut her up about how she's going to tell her Daddy everything. Seth slaps her firm natural tits and fingers her pussy while she sucks his cock in several fetching positions. Now on her knees he rips her panties off and fucks her wet pussy deep and hard. She keeps going on about her damn Daddy so he crops her butt and makes her say what a spoiled bratty little bitch she is until she cums. Then still tied up in reverse cowgirl Carolina sweets rides Seth's cock slow and easy inch by inch and then faster and faster as her perky tits bounce up and down and she begs him to cum. Then bound and gagged on her back with legs spread wide open Seth fills Carolina's tight hole and pounds that pussy until she is screaming and moaning in pleasure and Seth pops his load all over her pretty face. Take that home to your Daddy!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Carolina Sweets",
      "person_id": 61749
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-04-26",
  "scene_id": 44470,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Humiliation",
    "muscular",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "Submission",
    "Vaginal Penetration",
    "white",
    "yesdaddy"
  ],
  "title": "Daddy's Girl"
}