{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Mickey Mod and Jane Wilde were partners in crime and now that he's the boss, he keeps Jane prisoner in his house to use only for sex. He's chained her to a metal table with a gas mask over her head. Her small natural tits are bound in black rope, and leather cuffs surround her wrists and ankles. Squatting, she rubs her pussy as instructed by Mickey. He's told her to stay right on the edge of cumming, but if she cums she'll be punished. He unlocks the chain and uses it as a leash, pulling Jane buy the neck into another room. He removes the gas mask and in her mouth is a black ball gag. Mickey puts clamps on her nipples and an Hitachi on her clit. He brings her right to the edge of cumming and takes the vibe away and she screams and begs for him to let her cum. Mickey says she's got to earn it and whips out his big hard dick. Eager to suck it, she begs him to put it in her mouth. He shoves his dick down her throat and he sucks it with passion. Next, Jane is on her hands and knees with her ass in the air, wrists tied together with rope. Mickey slaps her ass and tells her to beg for his cock. She begs for him to fuck her and he slides his big fat cock deep into her tight slutty pussy and pounds it hard. She screams, asking to please let her cum, and Mickey finally lets her have one and she cums hard on his cock. Then Mickey sinks his massive meat, balls deep in her ass. He fucks and stretches out Jane's asshole until it gapes wide. He flips Jane over and puts a blindfold on her and ties Jane's wrists to her ankles with her legs spread. Mickey fucks her pussy while he presses an Hitachi against her pussy and every time she's about to cum, he takes it away. He finally lets her cum after she begs and begs. He slides his dick back in her ass and pounds it hard while using the vibrator and lets her have one more big orgasm before blowing his load on her pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Jane Wilde",
      "person_id": 61147
    },
    {
      "name": "Mickey Mod",
      "person_id": 19623
    }
  ],
  "release_date": "2019-05-06",
  "scene_id": 44471,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Leather Cuffs",
    "Mask",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Little Fuck Slave"
}