{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Delirious Hunter is cuffed and chained to the St. Andrews cross wearing black panties, sexy garter belt and black patent leather spike heels. She has a kitty mask on because she is the Pretty Little Stray Pussycat of dom Jamie French. Delirious is hunting for an owner, someone to take care of her and have their way so Jamie fully inspects her stray to see if she is worth keeping. First she cuts off her panties and tastes her pussycat’s pussy. She likes it and it makes her meow louder with every juicy lick. Jamie squeezes nipple clamps onto Hunter’s natural tits and continues to indulge herself on pussy. Then she tightens clamps on her pussy lips spreading it wide open giving so much sensation for a little kitty. Hunter throws her head back meowing and purring as Ms. French paddles her sensitive thighs turning them pink and then red. Now Delirious is off the cross and strapped in tight to a leather straight jacket ready to suck her mistresses cock. Wearing a black shiny patent leather bodice and fish net thigh highs Ms. French is in heaven as her stray takes her cock deep down her throat gagging and drooling with each thrust. Next with Ms Hunter on her back and legs spread wide open Jamie fucks her pussycats tight wet pussy, flips her over so her ass is high in the air with back arched and with the Hitachi vibrating deliciously on her clit pounds her ass until Delirious has a thundering orgasm. Stripped out of the straight jacket Ms. Hunter licks Jamie’s balls and sucks her hard dick until she busts a load all over her pretty stray’s face. Meow! Good kitty!",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Delirious Hunter",
      "person_id": 56555
    },
    {
      "name": "Jamie French",
      "person_id": 47848
    }
  ],
  "release_date": "2019-06-03",
  "scene_id": 44478,
  "tags": [
    "Big Tits",
    "Blonde",
    "Blowjob",
    "bottom",
    "Brunette",
    "Cock Worship",
    "Curvy",
    "Hitachi",
    "Leather",
    "Mask",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "shaved",
    "Straight",
    "switch",
    "Tattoo",
    "the cross",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Pretty Little Stray Pussycat"
}