{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Nurse Casey Calvert is working her shift at the Emergency Psych Ward. Her assignment is patient \"John Doe\" who is sleeping, strapped to a gurney. Casey grabs her clipboard and her specimen collector and tends to John Doe (Derrick Pierce). She closes the curtain, leans in to her patient and smells him. She draws back his sheets and exposes her patients cock and starts stroking it while he sleeps. She jerks his cock until he blows his load into her specimen collector and she quickly leaves his bedside. Back at Casey's house, she takes her new sperm sample and puts it with the others. She takes the cap off of one of the vials and rubs her pussy. As she cums, she pours the load on her face. The next day at work, Casey checks on her patient. Just as she gets ready to take another sample of his cum, he wakes up and grabs her wrist. Frightened, Nurse Calvert grabs the keys to her patients restraints and frees him from the gurney. Casey is handcuffed and brought to her knees and her patient makes her suck his cock. He face-fucks Casey until she's covered in drool. Next, Casey is tied up in rope on her knees and one elbow with a ball-gag in her mouth. Her patient flogs Casey's ass while she's tied up in rope bondage. He spanks her ass and presses an hitachi against her pussy and its too much for her sensitive clit and she screams in agony. He fucks Casey's pussy deep and hard as she screams through her ball-gag. He fucks her ass next while she's still on her knees. He flips Casey over and puts nipple clamps on her natural tits. He ties her up in rope again, this time with her legs spread and her arms tied above her head. He flogs her pussy as she writhes and screams with each hit. He enters her pussy again with his cock and fucks it hard. He pounds her asshole next and she begs him to let her cum.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    }
  ],
  "release_date": "2019-05-10",
  "scene_id": 44472,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "drool",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Nipple Clamps",
    "Nurse",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "Casey Calvert: Seed Freak"
}