{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Skylar Snow and Kayleigh Coxx have been casing a house and finally sneak in when the owners go out of town. Wearing all black, they open the back window and slowly crawl through and begin to make themselves at home. Skylar Snow strips off her black robber’s outfit and draws herself a bath. Completely naked, she slides in and sips a refreshing drink while Kayleigh goes rummaging through the house. Kayleigh comes back with an Hitachi vibrator, some jewelry, and some expensive clothes. After her bath, Skylar, wrapped in only a towel, walks up to Kayleigh who’s lying on the bed holding a leather paddle. Kayleigh strips off Skylar’s towel and tells her to get on the bed. Kayleigh puts nipple clamps on Skylar’s big natural tits, lays her down, spreads her legs, and licks her shaven pussy. After Kayleigh makes her cum, she gets Skylar up on her hands and knees and repeatedly flogs her rotund rump. After the flogging, Kayleigh sits on a leather bench in front of the bed and Skylar gets to the floor on her knees and sucks Kayleigh’s hard cock. She deep throats Kayleigh’s cock until she’s covered in her own drool. Kayleigh gets so turned on by Skylar’s cock sucking skills that she cant wait any longer to fuck Skylar’s pretty pussy. She gets Skylar back on her hands and knees with her big juicy ass in the air and starts fucking her pussy. The two move over to the bed and Skylar lies on her back and spreads her legs. Kayleigh fucks her pussy some more and then switches to fucking her ass while Skylar uses a vibrator on her pussy and cums hard. She turns over to get her ass fucked doggy-style and squirts all over Kayleigh’s dick and Kayleigh shoots her load into Skylar’s open mouth.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Kayleigh Coxx",
      "person_id": 61277
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2019-07-15",
  "scene_id": 44479,
  "tags": [
    "Big Natural Tits",
    "Blonde",
    "Blowjob",
    "Cock Worship",
    "drool",
    "fake boobs",
    "Flogging",
    "Hitachi",
    "Leather",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Paddle",
    "Role Play",
    "slim",
    "Straight",
    "toned",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Backdoor Burglars"
}