{
  "collections": [
    "TS Seduction"
  ],
  "description": "Kayleigh is hanging out at home when she gets a call from her sister Cherry Torn. Cherry is running late and won’t be home for her scheduled date, so she asks Kayleigh to keep him occupied until she gets home. Kayleigh is irritated, but when Corbin Dallas arrives, Kayleigh has some ideas on how to occupy the time. She knows all about the sick boys her sister dates and decides to have some fun of her own. She holds Corbin by the throat as she kisses him and spits in his face. She slaps him, and pulls out his cock and wraps her lips around it. She takes every inch of it into her wet mouth as Corbin moans in pleasure. Then she makes Corbin take off her shoes and suck her cock. Corbin loves being bossed around and does everything Kayleigh says. He takes her cock like a good slut, choking on it as Kayleigh holds his head down. He takes every spanking she gives him and thanks her for each one. He promises he’s so much better than her sister but also begs her not to let Cherry find out. Kayleigh doesn’t like keeping secrets from her sister and decides to make it worth her while. She takes Corbin’s ass and fucks him into the mattress. Corbin moans as Kayleigh fucks his hole wide open. Finally, Kayleigh blows her load on Corbin’s stomach and jerks him off as he promises not to fuck her sister.",
  "directors": [],
  "models": [
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    },
    {
      "name": "Kayleigh Coxx",
      "person_id": 61277
    }
  ],
  "release_date": "2019-06-25",
  "scene_id": 44477,
  "tags": [
    "Anal",
    "Athletic",
    "Blonde",
    "Blowjob",
    "bottom",
    "brunet",
    "Choking",
    "Cock Worship",
    "fake boobs",
    "Male Sub",
    "Paddle",
    "Role Play",
    "Rough Sex",
    "Sadism",
    "Spanking",
    "spit",
    "Straight",
    "toned",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "white"
  ],
  "title": "My Slutty Sister: Kayleigh Coxx Uses Sister's Boy Toy Corbin Dallas"
}