{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Seductive Casey Kisses sits on a couch wearing just a fishnet dress that lets you see her perfect tits and that giant cock of hers. She starts tugging at her cock and tells you to do the same. Look at how hard her dick is getting when she puts her hands at the base of her shaft. The head of her dick is so fucking sensitive as she strokes it getting even harder. Now she wants you to take a finger, lick it, and rub your little hole with it. Just imagine you finger is the head of her dick pressed against your hole and that your spit is her precum. That’s right, good. Keep stroking because Casey is gonna make you a bad boy today. You see, Casey is gonna eat her cum and she wants you to eat yours, too. She wants to train you to love the taste of cum. Now hold your cock and take your other hand and lick your fingers. Get your fingers nice and wet and just rub the head of your dick with them. Doesn’t that feel good? Now take that finger and stick it in your mouth with her. Her cum tastes so sweet. Now, Casey wants you to work up an edge with her. Start by paying attention to how she grips it at the base and keep stroking your dick like a good little slut. Look at her hard fucking cock while you work up an edge with her. Her dick is so hard it’s practically purple. She grips it tight as she keeps instructing you to work up a nice big load. Squeeze your dick all the way to the head while you stroke it. Keep stroking. She’s going faster and harder on her cock and tells you to get ready to squirt. She busts a hot load and it drips down the head right before she scoops it up with her finger. She tells you to squeeze out every last drop while she licks her cum off of her finger. Now, how’s that taste?",
  "directors": [],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    }
  ],
  "release_date": "2019-03-28",
  "scene_id": 44480,
  "tags": [
    "big dick",
    "Blonde",
    "Bondage",
    "Brunette",
    "Cuckolding",
    "Femdom",
    "Fetish",
    "Fishnets",
    "JOI",
    "Kinky",
    "Lingerie",
    "masturbation",
    "natural boobs",
    "shaved",
    "slim",
    "Solo TS",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "top",
    "TS",
    "white"
  ],
  "title": "KINKY JOI: Cum Eating Instructions"
}