{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The fierce blonde Delirious Hunter knows the deal is going down today, but something just doesn’t feel right. This lying dirtbag Mike Panic, just ins’t telling her the whole truth. This is her world and she demands this filthy liar learn a lesson. With a swift knee to Mike’s delicate crotch, he crumbles to the grown as Delirious restrains him. It’s time for this asshole to learn a lesson. She strips his pants off throws him on the grown. She grabs his cock with a hard tight grip as he screams for mercy. Delirious knows the best way to teach a man to be loyal is through his ass. She straps on a huge strap on cock and fucks Mike deep. Mike screams in pain as he is plowed by this powerful mistress. Her cock goes deeper and deeper with punishment as Mike gets rock hard. Maybe it’s time for Mike to cum, maybe that will show his loyalty. Mike gets rock hard with Delirious’ fingers up his ass. As he gets right up to the edge and begs to cum, she denies him over and over again. This is her world and it’s time for her pleasure. She sits on his face and demands he use that lying mouth for some good and eat her wet tight pussy and asshole. She pulls out the hitachi and cums all over Mike Panic. That lying mouth of his might have got her off, but is not forgiven yet. She moves on to use Mike’s hard cock for some good use. She fucks him while he is fully restrained in rope bondage. She cums hard again all over her toy. Next she suspends Mike’s feet into the air and he is helpless to her whims. She jerks off his hard cock and tells Mike to get dirty. Right as Mike is about to explode his load, she pulls off and starts flogging his ass. This liar is denied and punished with corporal. Mike’s ass turns bright red from the paddle and flogger. He begs his mistress for mercy.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Delirious Hunter",
      "person_id": 56555
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2019-06-18",
  "scene_id": 44484,
  "tags": [
    "Athletic",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Hitachi",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Paddle",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Tattoo",
    "white"
  ],
  "title": "Denied & Punished: Dominating Delirious Hunter Destroys Filthy Liar"
}