{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Powerful Domme Lily Lane and her partner slave Tony Orlando have something on their mind today in Lily's dark dungeon. Latex, Latex, Latex! Dressed in an extremely tight black latex bra and panties, with a busting open white latex dress and sleeves, the gorgeous busty Lily Lane attracts your attention. She is ready for her slave and latex partner Tony Orland to worship her. Crawling out in black latex romper, Tony perches himself next to his goddess. Will she let him worship her feet, or will he be made to Lick her Latex. His tongue runs up and down her body as he is instructed just to worship the latex. His tongue will not be allowed to touch her skin.\nTony licks her black panties, panting on her wet pussy and tight asshole. But it's now time for Tony to put in the work and be trained on how to worship this goddess. Turned over his latex ass is spanked before the flogger and stick come out to sting. This is turning on Tony too much, his cock gets harder with every beating and is dripping with precum. Tony is put into a latex gas mask with restricts his every single breath, and now it's time for the strap on. Lily takes Tony's ass for a deep anal strap-on fucking. His ass begs for more, and this time Lily shoves both her hands fist first into his pathetic hungry hole. Still rock hard, Tony is treated to a little surprise. His mistress rips her stalkings and uses her perfect naked feet and arches to arouse Tony's cock, while he is subjected to nipple torment from the vacuum nipple pumps. His goddess is ready to unleash a massive orgasm all over Tony's face as Tony is made to worship her perfect pussy and asshole.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2019-06-04",
  "scene_id": 44483,
  "tags": [
    "BDSM",
    "Big Tits",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fetish",
    "Fingering",
    "Humiliation",
    "Latex",
    "Latin",
    "Male Sub",
    "Mask",
    "Nipple Torment",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "Lick My Latex: Mischievous Lily Lane Devours Fetish Sub Tony Orlando"
}