{
  "collections": [
    "Kink Features"
  ],
  "description": "Kink.com brings you a special feature presentation with two of the hottest models in the industry. Casey Calvert and Charlotte Sartre are on a road trip to see an old friend when they find themselves stranded in the middle of nowhere. The hot, dry vast desert landscape is a hostile environment threatening to have its way with them but it doesn't stop these two brave explorers from seeking a solution to their problem. Little do they know that this is going to be the worst decision they could have ever made.\nThey stumble upon the ruins of an old abandoned town sitting below a massive compound on the hillside. Eerie dilapidated buildings litter the grounds and a deep sense of dread permeates this godforsaken place. A sinister presence is lurking. Is it just the relentless drone of the wind or something more malevolent?\nEven though they are stranded Casey and Charlotte are on an adventure and having fun so they fall into some heated girl on girl action in one of the creepy old buildings. Casey plays with Charlotte's small perfect tits and licks her nipples. She peels off Charlotte's little shorts and goes down on her pussy and rubs her clit until she cums. Then it's Casey's turn. Standing up against the paint chipped wall Charlotte licks Casey's shaved pussy and sexy tits until she orgasms.\nAfter their sexy make-out session the two girls continue to explore the area for something, anything to help them out of their predicament. They decide to split up to cover more ground. A decision that will change their lives forever. Soon enough Charlotte disappears and Casey goes on a mad search trying to track her down. Little does she know Charlotte is in the hands of a deeply disturbed sexual pervert who is hellbent on tormenting these two innocent beauties. You have to see it to believe it! Derelict: The Psychosexual Abduction of Casey and Charlotte a thrilling and devastating horror story directed by John Paul The Pope with BDSM, rusty chains, rope, cattle prods, spanking, floggers, the cane, hardcore finger banging, involuntary orgasms and more!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    }
  ],
  "release_date": "2019-08-30",
  "scene_id": 44485,
  "tags": [
    "BDSM",
    "black hair",
    "bottom",
    "Brunette",
    "Caning",
    "Cattle Prod",
    "Chains",
    "Fingering",
    "Flogging",
    "gloves",
    "Hitachi",
    "natural boobs",
    "Pussy Eating",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "Spanking",
    "Straight",
    "Tattoo",
    "The Pope",
    "toned",
    "white"
  ],
  "title": "Derelict: The Psychosexual Abduction of Casey and Charlotte"
}