{
  "collections": [
    "Hogtied"
  ],
  "description": "Aria is brand new to Kink.com, and we wanted her to feel welcome, so we booked her for a Hogtied shoot with The Pope; that seemed like the right thing to do. She is very nervous and a little hesitant to explore this part of her sexuality, but she knows she is in good hands and decides to go forth. She begins with her hands above her head and in the middle of the room all alone. The Pope enters and shows her pussy some attention so that she relaxes a little bit. Next, he turns her flesh to a bright red with his leather floggers. Her lower lip quivers as she is introduced to new sensations that somehow are making her pussy wet. Aria is then made to orgasm uncontrollably until he has had his fill. The second scene begins, and we have Aria on her back with her legs spread. She is subjected to some foot torment before he switches gears and introduces her to heavy breath control with orgasms. She continues to quiver any time The Pope is close to her, but she also smiles as he has his way with her. She is not quite sure how to act during the shoot, because she is overly stimulated and terrified of what may happen next. The third scene begins with Aria's ass in the air. She is flogged and spanked more before he fucks her throat, and then shoves it into her pussy. Aria is so stimulated that she can no longer take getting her pussy fucked, so she is finger blasted and vibed into non-stop orgasms for the remainder of the shoot.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Aria Lee",
      "person_id": 61955
    }
  ],
  "release_date": "2019-06-20",
  "scene_id": 44489,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Foot Torment",
    "Handler",
    "Humiliation",
    "Leather",
    "Rope Bondage",
    "Straight",
    "Submission",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Fresh Meat: Aria Lee"
}