{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Lisey Sweet is hot for cock and wants all her little Whore Holes stuffed and fucked. 5 big dicks and one Lisey: sounds like a recipe for fun! First a little game: tied up tight with a bag over her head Lisey is told to guess whose cock is in her mouth and when she is correct she gets the Hitachi as a reward. All this dick sucking is getting her warmed up for the onslaught of hardcore action that is coming her way. Bound with rope and straddling a bench Lisey has a cock in her mouth and one in her pussy. Stirling, Donny Robby, Codey and Eddie each take turns fucking her slutty pussy and then her ass. As soon as Lisey gets her ass fucked she squirts a geyser and wants more. Thick dicks fuck her non stop back and forth between her two whore holes while she gags on cock and she cums hard again and again. Next mounting one of the dicks Lisey gets double penetration: one in her pussy and one in her ass at the same time while she jacks another dick with her hands and mouth. Air tight! Her natural tits and sexy ass bounce around with every thrust. She loves getting her holes filled, stretched and split wide open with all this man meat. In reverse cowgirl Lisey gets her ass stuffed with two huge cocks and it drives her crazy moaning and screaming with pleasure until they shoot their hot jizz all over Liseys mouth and pretty face. What a good whore, she swallowed all that cum and loved it!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Lisey Sweet",
      "person_id": 60674
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-05-15",
  "scene_id": 44497,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Double Anal",
    "Double Penetration",
    "Facefucking",
    "Facial",
    "foreskin",
    "Gangbang",
    "Hitachi",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rough Sex",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "top",
    "white"
  ],
  "title": "Whore Holes: Lisey Sweet gets all her slutty holes stuffed and fucked"
}