{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "At church, Father Stirling Cooper preaches to his congregation. He speaks on the power of the sins, temptation and lust. Lexi Lore sits in the pews, mouth full of braces, wearing a low cut shirt and a short skirt. Father Stirling asks Lexi to stand beside him, and show herself before the congregation. He blames Lexi for the lust that she inflicts on the minds of all men who see her dressed in such a way. Father Sterling asks if she wishes to repent for her sins, and she says yes. Stirling has her kneel at the alter before him and asks his congregation to take part in the ceremony. The men line up and with Father Stirling leading by example they whip out their hard cocks. Lexi opens her mouth wide to receive her penance. They shove their dicks in her mouth and she sucks them all the best she can. Father Stirling spanks her with his Bible, chokes her, and spits in her face. They strip her naked and tie her up with rope in a praying position there at the alter where she kneels. They fuck her mouth some more, spank her ass, and play with her pussy. Next, they place her onto a padded table on her hands and knees, tied up with even more rope. One by one they fuck Lexi's pussy hard and spank her ass while her mouth is stuffed with cocks. After that, they move Lexi to one of the pews and triple stuff her petite frame with one dick in her ass, one in her pussy, and another in her mouth. Father Stirling and churchgoer, Mr. Pete stuff both of their big cocks inside Lexi's pussy and fuck her double-vaginal, stretching the limits of her pussy and she loves it. They flip her into the \"spoon position\" and Lexi's holes once again get fucked deep in this very creative double-penetration position. Once they all have had their way, and shoot their loads all over Lexi's face, she is forgiven.",
  "directors": [],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Lexi Lore",
      "person_id": 61958
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-05-01",
  "scene_id": 44496,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "braces",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Petite",
    "Role Play",
    "Rough Sex",
    "Straight"
  ],
  "title": "Lexi Lore: Holey Temptation"
}