{
  "collections": [
    "Device Bondage"
  ],
  "description": "Maya is kneeling on a box with her hands and neck locked into place with cold steel shackles connected to more steel. Her feet are also incapacitated because of the unforgiving steel device that holds her body captive. A big red gag is shoved in her mouth, and then clothespins are added to the perfectly sadistic spots on her body that hurt the most. The Pope breaks out his cat and starts his target practice to see if he can knock off the pins one by one. After his initial task is complete, he allows her to orgasm before moving on to the next position. In the next scene, we have Maya in a doggy position with her neck, wrists, thighs, and ankles locked into steel traps. He enters and begins to flog Maya with one goal, which is to break her. There is some spanking thrown in, but the majority of her suffering comes from the leather tails of his flogger. The response isn’t what The Pope wanted, so intensifies the torment by using the cat-o-nine again on her flesh and sensitive soles. The tears roll down her face, and that is when he decides to fuck her pretty mouth. After shoving the dildo down her throat, he moves to the backside and starts pounding her pussy. Still not completely satisfied, The Pope shoves it deep in her ass. Her orgasms show her appreciation for the reward, and then we move on to the final scene. Maya is on her back with her feet up in the air and exposed to his sadistic ways. The next 10 minutes or so, is a clinic on how to torment feet, and what real bastinado really is. The end is upon us, and the orgasms flow out of this slut so fast that we lost count of exactly how many times she actually came.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2019-07-25",
  "scene_id": 44491,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Spanking",
    "Straight",
    "Submission",
    "The Pope",
    "white"
  ],
  "title": "Red Head Slut Gets Destroyed in Diabolical Bondage"
}