{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Adult education teacher Dee Williams has had it with her students' lewd and rude comments! She tells them to leave if they are not here to learn, but her students have something else on the mind besides schoolwork. They surround her, grab her by the throat, and rip off her clothes, revealing her huge tits. Dee struggles to get away, but is over-powered, stripped, and put on her knees. She gasps as her students feel her up, grab her big tits, and smack her cute ass. Suddenly she has a cock in her mouth and two more in her hands. Dee gags on their cocks as they take turns fucking her face. Drool leaks out of her mouth, down her face and on her tits. Then they hog tie her and throw her over a desk. Unable to move, Dee has no choice but to continue sucking their hard fat cocks. She gets sloppier and sloppier with each cock and finally two students shove both their cocks in her mouth at the same time. Eager to see what her other holes can take, Dee's students string her up. Suspended from the ceiling in rope, Dee takes a cock in each end. She slides down on the dick in her cunt before sliding down on the cock in her sloppy mouth. The students always suspected their hot teacher would make a good fuck sleeve and Dee proves them right. They take turns fucking her from both ends as Dee squeals between them. Her cries are muffled by the cocks fucking her mouth. Dee is horrified but excited. All this fucking is turning her on and Dee goes from a proper school teacher to a horny greedy cock slut. Next, Dee gets stuffed airtight as her students fill all her holes. Dee loves being full of cock and her students love fucking her. They fuck her holes wide open and soon Dee is prolapsing as she orgasms. Laughing, the students continue pounding her cunt and asshole. They trade off stuffing her holes as Dee orgasms over and over again on their cocks. Finally, Dee gets on her knees and takes load after load of cum all over her face. Cum covered, Dee jerks off as she awaits her last load. She cums hard and gets the last fat load. She swallows every drop and licks her lips, satisfied and sated.",
  "directors": [],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    }
  ],
  "release_date": "2019-05-29",
  "scene_id": 44498,
  "tags": [
    "Airtight",
    "Anal",
    "BDSM",
    "Big Tits",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Double Anal",
    "Double Penetration",
    "drool",
    "Facefucking",
    "Facial",
    "Gangbang",
    "MILF",
    "Prolapse",
    "Role Play",
    "Rough Sex",
    "Straight",
    "Teacher"
  ],
  "title": "Dee Williams Gets Schooled: Big Tit Teacher Gets Stuffed Air Tight"
}