{
  "collections": [
    "Device Bondage"
  ],
  "description": "Ana Foxxx is one of the most beautiful women in the adult industry, and we’re lucky that she loves bondage so that we get to see her in scenes like this. The Pope doesn’t waste any time getting her restrained and helpless so that he can have his way with her. Her neck, wrists, and ankles are held by steel shackles that are mounted to the wall. He enters with his flogger and begins tormenting her. Ana giggles to cover the screams and frustration from his discipline, so he switches gears and gives her a real reason to laugh. He torments her with tickling until she can barely breathe, then hurts her, then tickles her more. The Pope goes back and forth for several minutes until he squeezes multiple orgasms from her to end the scene.\nNext we have Ana bent over in a doggy type position, with her head and wrists in metal traps. This time he enters with a crop in his hand, but that’s definitely not the only thing he uses to make her suffer. She is spanked for a bit, then he introduces the cat-o-nine to make this slut dance like she has never danced before. Her tits get some clothespins, then he begins to fuck her face. After testing her gag reflex, the attention is turned to her sweet pussy. Once her pussy has been fucked properly, the magic wand comes in and finishes her off and leaves her shaking in her bondage. In the final scene, we have her on her back with her legs spread nice and wide. Her sensitive soles are fully exposed, so that is the first of many targets. The Pope sets his sights on. He slowly moves to every exposed inch of her flesh with his crop. He seems to be satisfied with her suffering, so he fucks her pussy along with the magic wand to rip multiple orgasms from her pussy.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    }
  ],
  "release_date": "2019-07-11",
  "scene_id": 44490,
  "tags": [
    "BDSM",
    "Black",
    "black hair",
    "Bondage",
    "bottom",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Domination",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "multiple orgasms",
    "natural boobs",
    "Petite",
    "shaved",
    "Straight",
    "Submission",
    "The Pope",
    "the wall",
    "Tickling"
  ],
  "title": "Sexy Slut Ana Foxxx Tormented in Steel Devices"
}