{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Lilith Luxe is perched on the edge of a chair in black sheer and strappy lingerie with her legs spread wide so that her thigh high boots frame her pussy like a bullseye. She sees you there, yes you, you disgusting little freak, and beckons you to come closer. She wants you to get on your knees and crawl towards her. She wants you to kneel before her the whole time you're in her presence. She knows you sit at your boring desk all day long just waiting for someone to tell you what to do. Well now you're gonna get it, so sit down and shut the fuck up because Lilith is ready to take over and control your every move. You can start by unbuckling your belt buckle, unbutton your pants, take your zipper down nice and slow and whip your dick out. \"Let's see it,\" she giggles as she pets her pussy still trapped beneath her panties. \"Oh show it to me,\" she leans in a little closer, \"is that as far as it goes? Oh this isn't going to be hard at all.\" Unimpressed and yet strangely inspired by the small size of your cock Lilith declares that all you'll really need is one finger. She demonstrates on her tongue with her own finger licking and sucking it and telling you to rub the tip of your cock, but no you don't get to touch your dick just yet. Now take your other finger, get it nice and wet, and put it in your disgusting, puckering asshole. You see Lilith knows that everyone thinks you just a regular guy but they don't know what a little fucking whore you are. But she knows, she knows you're a disgusting little spank pig and that you even like feet. She teases you with her boots and begins to unzip her thigh high boots, the leather squeaking as they peel away from her luxurious long legs. And there, right in your face is the beautiful sweaty sole of her stocking clad foot. She tells you to start stroking your dick with one finger as she tears the stocking open releasing her pretty toes. She wiggles them in your face before doing the same to the other foot. Now she gives you permission to use two fingers on your cock while she thrusts two of her fingers in her mouth. \"Why don't we do it together,'\" she pulls her panties to the side, \"I'll put two fingers in my delicious, hairy cunt.\" She spreads her dripping pussy and pushes her fingers deep inside over and over again. Are you ready for three?\" She puts another finger in her mouth and then pushes all three into her pussy and begins to breath heavier as she fucks herself with you still on your knees. Now get those fingers on your cock and keep that finger moving in your asshole because she's about to let you have four fingers on your dick. She rubs the top of her foot to demonstrate just how she wants you to touch your cock. Rubbing her pussy again, pulls out a vibrator and starts vibing her clit. You see, her pleasure comes before yours every fucking time. And you, you're going to have to wait a long time to cum so go slow and make it worth it. Make it worth it, because after this you're going to have to pretend to be fucking normal again.",
  "directors": [],
  "models": [
    {
      "name": "Lilith Luxe",
      "person_id": 55114
    }
  ],
  "release_date": "2019-04-11",
  "scene_id": 44506,
  "tags": [
    "Bondage",
    "Brunette",
    "Cuckolding",
    "dungeon",
    "Feet",
    "Femdom",
    "Fetish",
    "foot fetish",
    "Hairy",
    "High Heels",
    "Hitachi",
    "Kinky",
    "Leather",
    "Lingerie",
    "masturbation",
    "mixed",
    "natural boobs",
    "Nylons Stockings",
    "POV",
    "slim",
    "Straight",
    "Tattoo",
    "thirdparty",
    "top",
    "Vibrator",
    "Zipper"
  ],
  "title": "KINKY JOI: Lilith Luxe Puts You in Your Place"
}