{
  "collections": [
    "Everything Butt"
  ],
  "description": "Innocent little Kendra Spade has been having some not so innocent desires for Sister Dana Vespoli. Aroused and confused, she takes her ass to church and asks father for guidance and forgiveness. She confesses her sinful dreams of the beautiful Dana Vespoli. On her knees and hands clasped together she worships Sister Dana Vespoli at the alter. Kendra puts her hands all over Dana's ass, grabbing and worshipping she removes Dana's clothes and puts her mouth on Dana's tight asshole. Kissing and spitting and tonguing Dana is in pure pleasure as Kendra worships her. It's now time for Kendra to confess her anal sins. Dana takes out a huge glass toy and works on spreading and stretching out Kendra's tight asshole. Kendra's demons are released with orgasm with each toy used on her ass. However Dana knows any true exorcism requires anal fucking and she brings out a huge strap on for Kendra. Kendra worships the strap one with her mouth, slobbering and spitting all over it before Dana turns it on her ass. Deep anal fucking gets Kendra ready for more orgasms. Next it's Dana's turn. Kendra uses her hands to pray inside of Dana's asshole with her fist. Dana uses the hitachi to bring out a screaming holy orgasm. The anal slink comes out next and fills up Dana as far as she can take it. Kendra begs Dana to not tell father about what just happened.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Dana Vespoli",
      "person_id": 3321
    },
    {
      "name": "Kendra Spade",
      "person_id": 60694
    }
  ],
  "release_date": "2019-05-31",
  "scene_id": 44500,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Toy",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Gag",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "slim",
    "slink",
    "Straight",
    "Strap On",
    "switch",
    "white"
  ],
  "title": "Take My Ass To Church: Kendra Spade Craves Holy Sister Dana Vespoli"
}