{
  "collections": [
    "Families Tied"
  ],
  "description": "Gia Derza is a teenage sexual force of nature. Her big brown eyes and sexy round ass were\nmade for trouble, and that's just where she finds herself at the end of senior year. Gia is busy fantasizing about her sexy vice principal Penny Pax spanking her slutty cunt, while Penny is patiently explaining that she will be in school all summer trying to raise her GPA enough to graduate. After fucking her way through the janitorial staff and the entire football team, the only thing keeping Gia from expulsion is her doting older step-brother Seth, who is both the school shop teacher and the Vice Principal's favorite off the clock fuck. Seth has been keeping Gia enrolled with sexual favors, and after Gia's meeting with Ms. Pax Seth reports to Penny's office for another installment. Penny loves to be bent over her desk and spanked red like a filthy whore, groveling to get some of that blue collar cock in her mouth. Throat fucked while her slutty clit is cropped and whipped, Penny swallows like a seasoned slut and waits to be fucked in both her pussy and ass in turn. She can't cum until she is properly tied up, so Seth binds her in a sexy standing tie on her prayer bench, hanging heavy metal clamps off her swollen nippled and giving her an anal fuck she'll think about all summer. He won't let her cum until she has been caned and spanked to his satisfaction, then permitting her one orgasm before ripping off her nipple clamps and stuffing his cum covered cock into her mouth. Gia is a truly bad girl and stayed after school to spy. Thinking she has her hot older brother in a corner, she threatens to tell on him unless he revises her grades to an A and gives her a taste of his sexual dominance. Gia has not bargained for what an evil sadist her brother is, and finds herself moaning in disbelief as he binds her in duct tape and fucks her face until she is covered in drool and gasping for air. Seth slaps her around to teach her a lesson, spanking that sweet teen ass and fucking her on the dirty floor of the school shop. Seth binds her in chains and attaches her cute little toes to metal nippled clamps, daring her to be disciplined about one thing in her life and keep her legs high while he fucks her wet pussy into multiple orgasms. With her eyes rolling back in her head, Gia is not ready to see Ms. Pax to casually stroll in and ask if she can also own Gia's pussy this summer. Armed with a cane and a sadistic smile, Penny fucks Gia with a metal toy and then begs Seth to suspend his little slut sister in a ball tie suspension, leaving her hanging like a helpless sex doll. Spit roasted by her brother and vice principal, all Gia can do is scream and cum until she is let down and allowed to lick Penny's clit and ass. Once Penny has enjoyed many anal orgasms on Gia's brother's cock,\nshe allows Gia to clean it off with her mouth and take an epic cream pie in her slutty teen pussy. Summer might not be so boring after all.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Gia Derza",
      "person_id": 61617
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-05-24",
  "scene_id": 44503,
  "tags": [
    "big dick",
    "Blonde",
    "brunet",
    "Brunette",
    "Chains",
    "Collar",
    "Curvy",
    "drool",
    "Family Roleplay",
    "multiple orgasms",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "shaved",
    "Spanking",
    "spit",
    "Straight",
    "Stud",
    "Suspension",
    "switch",
    "Teacher",
    "white"
  ],
  "title": "Sex Crazed Step-Sister Fucks Her Way Out of Summer School"
}