{
  "collections": [
    "Everything Butt"
  ],
  "description": "In the middle of an empty room, the beautiful red headed and long legged Lauren Phillips is standing completely naked except for the suspended steel cage that she wears over her head, trapped in it by a metal collar. Chanel Preston walks in to frame wearing a black latex minidress and shiny bright red high heels, carrying a rider's crop. Chanel makes Lauren do ballet while trapped in her cage and crops Lauren's beautiful milky white ass until it turns pink. Chanel explains to Lauren that she's going to turn her into her little anal whore and stretch out her asshole. Chanel starts inserting fingers into Lauren's ass, first one than two. Chanel gets an acrylic toy and pops it in and out of Lauren's asshole, stretching it out even more. She makes Lauren taste her own ass as she brings the toy directly from inside her ass to her mouth. Next, Chanel releases Lauren from her head-cage and bends her over a leather padded saw-horse. Chanel attaches a big fat dildo to her strap-on and pushes it into Lauren's ass and fucks her hard with it, making Lauren's asshole gape wide. After that, Lauren is placed on her back with her legs spread. Chanel inserts the glass pillar into Lauren's stretched out ass and gives us a peek into her pink insides like an anal aquarium. Chanel gives her an Hitachi to press on her pussy and Lauren cums hard with the pillar in her ass. Chanel orders Lauren to make her cum so Chanel gets comfortable with her legs spread and Lauren licks her asshole. Chanel vibes her own pussy while Lauren inserts a glass butt-plug into her asshole and Chanel cums hard with a glass toy in her ass as Lauren sucks on her toes.",
  "directors": [],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2019-05-17",
  "scene_id": 44501,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Tits",
    "Brunette",
    "buttplug",
    "Cage",
    "Collar",
    "Crop",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "High Heels",
    "Hitachi",
    "Latex",
    "Leather",
    "Lesbian",
    "LezDom",
    "Redhead",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "switch",
    "toned",
    "white"
  ],
  "title": "Lauren Phillips is Chanel Preston's Little Anal Whore"
}