{
  "collections": [
    "Device Bondage"
  ],
  "description": "Alexa lies on the floor with leather straps binding her in a strict hogtie. She can barely move any part of her body, yet she still manages to remain chipper when cyd interviews her, welcoming her back to DB for her third shoot. Alexa is slowly becoming a bondage slut as time goes by…\n\nWe soon find her seated on the floor, a spreader bar at her ankles and another at her knees. A collar around her neck is chained to her knees and also up to the ceiling, keeping her upright. Her arms are wound around her neck in tightly laced leather opera gloves. She is uncomfortable, heaving sighs as though sighing will help relieve some of the pressure on her body.\n\ncyd gets her mouth into a big smile by tying the corners back behind her head. Her nostrils are pulled up with a nosehook, completing the look. Alexa’s stretched and distorted face now resembles the classic stable of Halloween. She drools and whines until cyd presses a vibrator to her clit. Soon a thick cock is shoved in her pussy and left there with the vibrator attached. Alexa’s eyes roll back into her head as she comes over and over.\n\nLater, Alexa moans through the panel gag as she lies on her back with her hands and feet strapped together and chained up in the air. She is suddenly lifted off the ground where she swings back and forth. She screams and whimpers through the gag as her ass and pussy are flogged. Once again a thick cock and a vibrator placate her, and her muffled cries turn to pleasure instead of pain.",
  "directors": [],
  "models": [
    {
      "name": "Alexa Von Tess",
      "person_id": 12340
    }
  ],
  "release_date": "2007-04-25",
  "scene_id": 4451,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Gag",
    "gloves",
    "halloween",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Vibrator",
    "white"
  ],
  "title": "Jack o' Lantern"
}