{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Hadley Mason is bound to a chair and being held hostage by her captor Charles Dera. He demands a $20,000 ransom from her daddy but dad only wants to pay half so Charles\nsends video messages of Hadley sucking dick and getting fucked in order to persuade him to pay the full amount.\nSitting pretty with a ball-gag and tight black dress Hadley is scared but ready to do what it takes to get out of this predicament. Charles pulls Hadley’s dress down to reveal her huge natural tits and puts tight nipple clamps on. Hadley has a thing for sucking cock so Charles stuffs her mouth full of his big dick and she goes to town taking it deep down her throat choking and slobbering while her titties bounce up and down. After a thorough face fucking Hadley is tied up on all fours with her back arched presenting her pussy. Charles decides they will be girlfriend/boyfriend for the day and wants to enjoy the afternoon so he gives Hadley some rules to follow. He keeps her in line with the flogger and then rewards her by fucking her wet pussy real good and then she sucks all her slutty juices off his dick. Now on her back with wrists tied to ankles and all spread open Hadley asks Charles to fuck her like the psychotic dude he is. So he does. He fucks her pussy and her mouth and then her pussy again until she’s is moaning with pleasure and Charles shoots his hot load all over his Girlfriend for Ransom. Ahh true love",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Hadley Mason",
      "person_id": 60241
    }
  ],
  "release_date": "2019-06-14",
  "scene_id": 44527,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Natural Tits",
    "black hair",
    "Blowjob",
    "body builder",
    "Brunette",
    "Choking",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gag",
    "Humiliation",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Girlfriend for Ransom"
}