{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Wearing an orange minidress with no panties, the gorgeous Jasmine Jae digs up her dead husband's jars full of money in her front yard. Hitman Tommy Pistol hides in the distance and waits for her to go inside. Tommy sneaks up behind Jasmine as she's counting her money, but when Jasmine sees Tommy's reflection in the cookware, she turns around quick and hits him in the head with a frying pan. She handcuffs Tommy to a wooden table and wakes him up. She asks who sent him but Tommy quickly grabs the gun away from her and makes Jasmine free him from the handcuffs. Tommy puts the handcuffs on Jasmine behind her back, and makes her beg him to suck his cock. Jasmine begs ad begs and so Tommy shoves his whole cock down her throat, including the balls. He face-fucks Jasmine until she's covered in her own drool which he uses to rub her shaved pierced pussy with. He takes off his belt and whips her repeatedly on her sensitive clit. Next Tommy ties Jasmine's ankles together and her wrists together in doggie style. with a ball-gag in her mouth. He spanks and flogs her perfect, sinks his cock deep into her tight pussy, and fucks it deep hard and fast. He attaches nipple clamps to her big beautiful tits and then fucks her in her tight round ass. Tommy flips her over onto her back with her legs spread and ties up her legs and tits with rope. He crops her feet and pussy. Tommy then fucks her ass and pussy some more and torments her clit with a strong vibrating Hitachi. Tommy cums in her mouth. asks for a shovel, and then leaves her there tied up to steal all of her jars of money.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Jasmine Jae",
      "person_id": 59210
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-05-31",
  "scene_id": 44526,
  "tags": [
    "BDSM",
    "Big Tits",
    "Blowjob",
    "bottom",
    "british",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "drool",
    "fake boobs",
    "Feet",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Latin",
    "Nipple Clamps",
    "Pierced Pussy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "Tattoo",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "The Gangster's Wife"
}