{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Seth Gamble drives into his garage and shuts the door. Inside the trunk is the adorable, Juliette March. She pounds and screams from the inside, yelling at Seth to let her out. Seth yells back that if she's good, he'll open the trunk and let her out. He opens the trunk and we see Juliette with her petite tits exposed with her shirt ripped open and a black rubber ball-gag in her mouth. Her wrists are tied and her legs are bound together with tan rope. She yells for him to let her go and Seth says he will but only if she sucks his cock. Through the ball-gag Juliette agrees to the terms so Seth grabs Juliette's face and shoves his cock down her throat. He face-fucks her right there in the trunk, upside-down with her head sticking out. After that, Seth takes Juliette out of the trunk and places her on her knees, completely naked with her ass tied up in the air. He flogs her juicy round ass hard and makes her beg to get fucked. Seth gives her his stiff cock and fucks her tight pussy. Seth pushes his hard dick into her tight asshole and Juliette screams. He slaps her face and fucks her ass deep and hard until she cums multiple times. Next we find Juliette on her back with her arms tied above her head and ropes around her thighs that hold her legs wide open. Clover clamps pinch her nipples and are attached to metal rigging that hangs from the ceiling, swinging back and forth, pulling on the clamps with every sway. Seth flogs her abs and turns her pale skin pink. He fucks her pussy, tormenting her sensitive clit with the Hitachi vibrator, blows his load, and leaves her there to writhe.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Juliette March",
      "person_id": 22072
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-07-12",
  "scene_id": 44528,
  "tags": [
    "BDSM",
    "big dick",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Hitachi",
    "Humiliation",
    "mixed",
    "muscular",
    "natural boobs",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Stud",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Trunk Girl: Juliette March Abducted by Seth Gamble"
}