{
  "collections": [
    "Evolved Fights"
  ],
  "description": "This is the match of the century!!! two Elite wrestlers in their own rights. Sebasitan Keys is a champion on his site, Cheyenne Jewel has won championships for her weightclasses in other federations. Both of these two muscle babes have what it takes to be a champion. They have the muscle, the endureance, the skill....they have it all. As we've said 1000000 times, this is 100% real competitive unscripted wrestling. This is NOT a femdom site. If you came for FEMDOM this shoot is NOT for you. This is power against power. The female does get advantages but this male is skilled and gets submissions and pins. This guy does not just lay over and take it. He knows what to do, when to do and how to do it. This is a true challenge for our girl today. She's a strong farm girl and she can handle it. She pushes through a lot of submission attempts and pins. She's able to reverse holds and put her opponent into trouble. This is back and forth. The judges had a really hard time determining some of these rounds. This deserves a rematch down the line. However, Today we have a winner and the winner doesn't take mercy on the loser. Because the winner had to work SO hard for this victory, the winner is NOT going to be nice. The winner wants to put the loser in their place. The Winner face fucks the loser, the choke fucks the loser and has her/his way with the loser. The loser is used for the winner's pleasure and finally the winner is brought to climax and cums all over the losers face. The loser is left alone on the mats to sit in humiliation covered in winner cum.",
  "directors": [],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2019-04-24",
  "scene_id": 44536,
  "tags": [
    "Champion",
    "Femdom",
    "Humiliation",
    "Muscle",
    "Straight",
    "Submission",
    "thirdparty",
    "Wrestling"
  ],
  "title": "Powerful Male does the Impossible and Fucks the Woman"
}