{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Vera King is a sadist's dream. She has only one desire and that is to serve at the brutal whim of a cruel task-master, and to gobble as much cock as she possibly can. She starts her day on the ground, stripped naked, with her torso yanked high in the air, suspended with inescapable rope bondage. She is immediately inflicted with cruel impact play with a heavy leather flogger. Her entire chest turns red from the intense pain session. Her dom Tommy Pistol steps on her face with his thick leather boots, leaving a humiliating tread mark across Vera's face. This sort of dismissive treatment only makes Vera's pussy drip with even more desire. Tommy shoves his dick into her mouth. She tries to spit it out but she's unable to escape the brutal face fucking. She spews spit all over her whore face, and helplessly gasps for air in between deep-throating that brutal cock. Next Vera is tied in a doggie position that showcases her tiny bubble butt. Tommy wastes no time, and shoves his cock into Vera's mouth yet again. After making her gag several times, he saunters behind his helpless sex slave and jams his dick into her tight pink pussy. Vera flinches from the incursion as Tommy switches back and forth and fucks her tight butt hole and then back to her pussy. As he pounds her little ass, Vera squeals with delight and begs to be fucked harder and deeper. Tommy then flips his fuck toy onto her back and yanks her legs straight up in the air and restrains her helpless limbs to the side. He then recommits himself to fucking this whore as he pleases. He slams her pussy as Vera whispers her pleas to cum. But Tommy heckles her as she withers from the humiliation of orgasm denial. After her trembling subsides, Tommy jams his cock back into her ass for one more brutal fuck, before shooting his load all over Vera's ass and pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Vera King",
      "person_id": 61988
    }
  ],
  "release_date": "2019-08-05",
  "scene_id": 44532,
  "tags": [
    "Bondage",
    "brunet",
    "Gag",
    "Humiliation",
    "Latin",
    "Leather",
    "master",
    "Orgasm Denial",
    "Pain",
    "Rope Bondage",
    "Slave",
    "spit",
    "Straight",
    "Sub"
  ],
  "title": "Girl Next Door Vera King Gets Every Hole Fucked in Rope Bondage"
}