{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Gabi Gold is all too eager to serve under the boot of sadistic male dom. She is the kind of wanton slut that only feels complete when she is catering to his cruel whims. Gabi starts her day shackled to a Saint Andrew’s Cross with stiff leather ankle and wrist cuffs. Her natural perky breasts are completely vulnerable and exposed to the brutal smacks of a heavy leather flogger and a stiff leather riding crop. Her nipples and inner thighs are beaten mercilessly until she is gasping and shrieking through the edges of the giant red ball gag that has been crammed into her mouth. Next Gabi is restrained on the floor with an e-stim attached to her thighs. Her master, Derrick Pierce, saunters over and jams his massive cock deep into her mouth. As he throat fucks her, she gags and spits all over her beautiful face. Derrick then turns on the electrodes and shocks her legs repeatedly. Gabi can barely scream, the pain is so intense. But she wants to serve her master well and to prove her worth as a sex slave, so she shoves her face onto her master’s cock with reckless abandon. Before she can catch her breath, Gabi is quickly tied on her hands and knees, presenting her round and perfect ass in the air. Without hesitation, Derrick takes shoved his cock deep into her tight asshole. He fucks her hard, making his little pig squeal with delight. He shoves her face into the table and puts his foot on her head. The masochistic whore smiles from the abusive ass-fucking. Gabi is then flipped onto her back and her legs are pulled straight up in the air, restrained with inescapable rope bondage. Derrick then re-inserts his solid dick into her tight pink pussy and then switches to her gaping asshole. Gabi starts to beg to cum. But Derrick laughs and looks on with cruel delight as she winces from the pain. He continues to her fuck her until she can no longer talk. Her eyes roll back into head and she begs again and again to cum. And just when she can’t hold it another second Derrick tosses her to the floor and blows his load all over her sweaty face. Gabi licks it all up and whispers, “Thank you sir.”",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Gabi Gold",
      "person_id": 62002
    }
  ],
  "release_date": "2019-07-08",
  "scene_id": 44530,
  "tags": [
    "Athletic",
    "Ball Gag",
    "big dick",
    "Blonde",
    "Bondage",
    "Boot",
    "brunet",
    "Crop",
    "foreskin",
    "Gag",
    "Gaping",
    "Leather",
    "master",
    "other hair color",
    "Pain",
    "Rope Bondage",
    "Slave",
    "Straight",
    "Stud",
    "Sub",
    "Tattoo",
    "white"
  ],
  "title": "Blonde Girl Next Door Gabi Gold Rough Anal Fuck in Brutal Bondage"
}