{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Keira Croft is a secret slut and is no stranger to being tied up and abused. She is the kind of whore that you would never suspect if you met her at the supermarket. But beneath her quiet exterior is a hungry BDSM pain slut that wants nothing more than to be restrained and used. She begins her session suspended in the middle of the room, dangling only from black leather wrist and ankle cuffs. As she twirls helplessly about like a fuck toy, she is completely vulnerable and exposed to the cruel whims of her dom Seth Gamble. He wastes no time and immediately begins to relentlessly swat her with a heavy leather flogger and a cruel leather whip. She howls and begs for more. With a rubber gas mask strapped to her face, Keira gasps for breath as she's punished even more. Seth yanks her gas mask off and shoves his dick deep into her mouth. The rough blow job and face fucking instantly makes her choke and gag. But even through the brutal deep throat action you can hear Keria grunting out her thank yous. Next she is tied in an ass-up doggystyle position with tight and inescapable rope bondage. Seth immediately shoves his huge cock into her tight pink pussy, causing her to squeal with delight. He begins to fuck his tied up fuck slave like a rabid dog. Keira begs to fucked harder, so he shoves his cock into her tiny asshole and then begins switching back and forth to her tiny pussy. The table shakes and slams against the floor as Keira crumbles from the multiple orgasms. To finish her off, Seth flips Keira over and ties one of her legs straight up in the air. He tenderizes her over stimulated and sensitive skin with a cruel bamboo cane that leaves stinging red welts all over her legs and ass. Seth them seizes the moment and renews his attack on her pussy and asshole. He fucks her relentlessly and Keira begs to cum. When she is finally allowed to orgasm she unleashes massive gushing squirts all over Seth's cock as her ass is being rammed into brutal submission. Keira is breathless in a pool of her own messy fluids as Seth blows his load all over her face and tits. He then leaves her there, to wallow in her slutty mess.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Keira Croft",
      "person_id": 62001
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-07-22",
  "scene_id": 44531,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Choking",
    "Gag",
    "Leather",
    "Mask",
    "multiple orgasms",
    "muscular",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "shaved",
    "Slave",
    "Straight",
    "Stud",
    "Sub",
    "Submission",
    "white"
  ],
  "title": "All Natural Pain Pig Keira Croft Squirts in Rope Bondage"
}