{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Daisy Ducati enters your room looking like she's been up to no good. She knows she was supposed to save some slutty energy for you but she got a little sidetracked. Instead she met a hot stud down at the bar and fucked him. That's right, a total fucking stranger busted a big load into her pussy right before she came upstairs. And since you've really never been able to please her anyway you get to sit on the floor looking up at her on the couch touching herself and going on and on about how good of a fuck he was. Now, if you want to be a good boy and lick up all the cum out of her pussy, then maybe next time she'll find a cock for you to suck. You know that would make her happy. You see you're just a dirty little cuck for her to use and the only time you get to touch Daisy is when you're cleaning up her mess. She keeps stripping and telling you how much she likes seeing you on your hands and knees begging like a dog. She likes when you beg for it, begging for her cum filled pussy. She turns around and begins stripping off her panties. She spreads her pussy to show you that fat load he left for you. You sit and watch as his cum oozes out from deep within the walls of her cunt. She laughs at how pathetic you are as she starts to blow a glass toy with her mouth. Wrapping her lips around the glass dildo she gets it nice and wet just before plunging the toy into her cum filled hole. You could never make her feel this good and just sit and watch as she fucks herself while mocking your shrimp dick. Now she has a vibrator and is amplifying her orgasm, getting hotter and wetter, she fucks herself and pulls the dildo out right as her pussy pumps her squirt in your face. She cums over and over again squirting a big wet mess of her cum and the cum of that total stranger. Now, you clean it up.",
  "directors": [],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    }
  ],
  "release_date": "2019-04-25",
  "scene_id": 44545,
  "tags": [
    "Bondage",
    "Cuckolding",
    "Dildo",
    "Ebony",
    "Femdom",
    "Fetish",
    "Hitachi",
    "Kinky",
    "Lingerie",
    "masturbation",
    "mixed",
    "natural boobs",
    "POV",
    "Redhead",
    "shaped",
    "Small Tits",
    "Squirting",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "thirdparty",
    "toned",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Kinky JOI: Pussy Full of Cum Cuckold"
}