{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Casey Kisses is a sexy, long-legged blonde who has booked an important 4th of July photo shoot with famous photographer Joanna Angel. This could be Casey's big break, but she is uncomfortable when Joanna insists she shows more skin, tugging at her bikini bottoms to show more ass. Joanna has no time for amateurs, she wants Casey to show off her tits. Joanna promises she knows people that can make Casey a star. Yes, Casey will do anything, but on her own terms. She orders Joanna down on her knees. Casey tears off Joanna's top and fondles and sucks Joanna's firm breasts. Joanna's tough facade crumbles and soon is willing to do anything to please her statuesque model. Casey wants Joanna to show off her own skills, meaning blow job skills. Joanna's attitude is silenced with Casey's firm cock planted in her mouth. Joanna is eager to suck Casey's cock, taking it deep down her throat. With her cock good and hard, Casey places Joanna on all fours and spreads her ass cheeks so Casey can get in some good old-fashioned pussy licking. Joanna begs for Casey's cock and she gets it, doggy style on the studio couch. Flipped on her back, legs spread wide, Joanna gets her pussy fucked hard and pounded into the couch by Casey's cock. Switching positions, Casey sits back on the couch and Joanna straddles her lap, riding Casey's hard cock. Casey has turned Joanna from a stuck-up high fashion photographer into a whimpering, moaning cock whore. Casey spreads Joanna's ass wide and her cock slams deep into her pussy. In the end, Joanna is on her knees begging for Casey's load. She gets it too, right down her throat. But it's not over for Joanna, she still has a shoot to finish, making Casey famous, and she better do a good job or she won't be getting anymore of that delicious cock.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Joanna Angel",
      "person_id": 61458
    }
  ],
  "release_date": "2019-07-01",
  "scene_id": 44554,
  "tags": [
    "big dick",
    "black hair",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "july 4th",
    "natural boobs",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "Tattoo",
    "tea2020",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "American Beauties: Casey Fucks Joanna For Some July 4th Fireworks"
}