{
  "collections": [
    "Lakeview Entertainment"
  ],
  "description": "Watch cum slut tosha try and survive a 73 minute double session with Mistress Autumn and Mistress Kiss. The Ladies bend him over and apply the cane to his ass and the violet wand to the back of his balls before both tag team fucking him with strap-ons. Nipple torment and then some heavy oral service from the slut before they bind him on his back and finish him off with an orgasm onto their big beautiful natural breasts. He licks his juice off their tits as his head spins from pain and pleasure.\nMistress Autumn and Mistress Kiss discuss ass fucking slaves as they wait for cum slut tosha to strip down. He goes over the kneeler and they commence a severe double corporeal punishment mixed with violet wand shocks to the back of his balls. Mistress Kiss uses the cane as Mistress Autumn locks his head between Her long legs. Mistress Kiss then turns up the wand and shocks his balls as Mistress Autumn holds them tight. Mistress Autumn then viciously applies the cane to his ass cheeks as Mistress Kiss immobilizes his head between Her legs.\nMistress Autumn delivers another ten hard strokes with the cane as Mistress Kiss alternates with the thick leather strap. His ass, now turning purple, gets a brief break as the two ladies caress each other and lock lips. The now topless twosome turn on cum slut tosha and rain blows down with the whips until he is screaming. Mistress Kiss puts on Her strap-on as Mistress Autumn uses the harsh pancake slapper to inflict even more damage on his ass. Tosha is then made to suck Mistress Kisses cock preparatory for an ass fucking.\nMistress Kiss stood tall on Her black boots and drover Her hard rubber cock hard and fast into the tight asspussy of cum slut tosha as Mistress Autumn hit him and kissed Her. Now Autumn dons Her strap-on and they start a tag time ass fucking of the bent slut. He is open to the hilt as they rapidly switch off and tag time him, fucking as hard as possible with their bare tits swinging. He moans and can take no more but they keep on. Finally, he is turned and bound on his back and nipple torment from the two big reasted Dominatrixes begins in earnest.\nHoly shit Usually tosha the baddest pain slut around can take it but these tow bare breasted beauties are making him scream in pain from the nipple torment. Mistress Kiss focuses on his cock as Mistress Autumn torments his nipples. The Ladies alternate pain and pleasure with Mistress Kiss sucking his cock as Mistress Autumn torments him and then he gets to nurse Her big natural breasts as Mistress Kiss slaps the shit out of his cock. Now it is time for tongue service. Mistress Kiss introduces him to Mistress Autumn's pussy and they put his mouth to work below the gorgeous blonde.\nWith the taste of Mistress Autumn's ass on his tongue, cum slut tosha was positioned between Her long spread legs and made to eat Her ass some more. Now bent, Mistress Autumn had Her ass held wide open by Her partner Mistress Kiss. The Ladies swapped and the cum slut licked hard at Mistress Kiss until She orgasmed. Flat on his back and bound he soon found himself playing a game of guess whose pussy is on your face. Blindfolded and disoriented he guessed wrong and had his cock and balls beaten and shocked by the bare breasted babes.\nThe slave's balls were dancing as Mistress Autumn applied the violet wand. Mistress Kiss whipped his shaft and they continued their game of guess whose pussy is on your face. The cum slut was so disoriented he kept guessing wrong as they wiped their crotches on his face. His nipples and cock and balls paid the price as the two vixens relentlessly tormented him until he was almost unconscious. They decided to milk him out before he passed out and Mistress Kiss pulled big steams of cum from his cock out onto both their breasts. She kept jerking him, ruining his orgasm, and then they moved up over him and ordered him to lick his cum from their breasts.",
  "directors": [],
  "models": [
    {
      "name": "Cum Slut Tosha",
      "person_id": 61889
    },
    {
      "name": "Mistress Autumn",
      "person_id": 61810
    },
    {
      "name": "Mistress Kiss",
      "person_id": 61983
    }
  ],
  "release_date": "2019-04-26",
  "scene_id": 44551,
  "tags": [
    "Blonde",
    "Leather",
    "mixed",
    "Nipple Torment",
    "Nurse",
    "Pain",
    "Pain Slut",
    "slapper",
    "Slave",
    "Straight",
    "switch",
    "Tag Team",
    "thirdparty",
    "Violet Wand"
  ],
  "title": "Let It Out"
}