{
  "collections": [
    "TS Seduction"
  ],
  "description": "Dressed in all white, Kendall Penny walks into an FBI interrogation room. She’s been brought in to be questioned by Detective Tony Orlando about the recent death of a Mr. Boz. Detective Orlando sits her in front of a camera and presses record. He asks her questions regarding evidence found at the scene of the crime. Evidence bags that contain tools used for BSDM play. Tony, unfamiliar with the practice of BDSM, asks Kendall if she could explain. Kendall spreads her legs and gives Detective Orlando a sneaky peak of her hard cock up her short skirt. Detective Tony gets up from his chair and makes his way towards Kendall. She tells him to get on his knees and open his mouth. She spits in his mouth and puts her cigarette out on his tongue. She grabs him by the hair and shoves his mouth onto her hard cock. He takes her cock balls deep down his throat. She bends him over the chair, ships his ass with her belt, and shoves her fingers deep in his ass. Kendall sits him down in the chair and puts a latex hood over his head. She slaps his chest and puts clover clamps on his nipples. She stuffs her cock back in his mouth and fucks his face. She commands him to lick her feet and he drops immediately and licks her feet. Kendall places a blindfold over Tony’s eyes and torments him with a taser. On top of a dirty mattress she gets him on his back and cuffs his ankles to his wrists. She fucks his ass deep hard and raw. She flips him over into doggie and fucks his ass some more. She gets Tony in a reverse headlock and smothers his mouth and nose in her sweaty armpit while she jerks his cock. Her pheromones get him so turned on he blows his load all over himself. Kendall jerks her cock with her balls in Tony’s mouth and blows her sweet load all over his face.",
  "directors": [],
  "models": [
    {
      "name": "Kendall Penny",
      "person_id": 61838
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2019-08-06",
  "scene_id": 44559,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "Blowjob",
    "brunet",
    "Clover Clamps",
    "Cock Worship",
    "Feet",
    "Hood",
    "Kinky",
    "Latex",
    "Male Sub",
    "Role Play",
    "shaved",
    "Straight",
    "switch",
    "Taser",
    "Tattoo",
    "the chair",
    "top",
    "TS",
    "TS Fucks Male",
    "versatile",
    "white"
  ],
  "title": "Anal Instinct: Kendall Penny & Tony Orlando"
}