{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The lovely Lauren Phillips stands in front of an American Flag, reciting a Public Service Announcement about the importance of the First Amendment in porn. Federal Agent, Lance Hart enters her house and flashes his badge. He’s there to arrest her for lewd and lascivious behavior. Lauren turns on the charm and plays to Lance’s primal urges. She grabs his cock and tells him to just go with the flow. Lauren has a seat and tells Lance to take off her shoes. Lance gets to his knees and removes her high heels. He sniffs her soles through her stockings, and with Lauren’s instructions, works his way up her thighs. He removes her stockings and worships her feet, licking and sucking her toes. Lauren spreads her legs and tells Lance to lick her pussy. Lauren commands him to lick it exactly like she says and she cums on his face over and over again. Next, Lauren straps on her dildo and makes Lance gag on it, getting it wet and ready with spit for his ass. She shoves her dildo in his ass from behind and fucks him deep while her big beautiful breasts bounce. She turns Lance over and pegs his ass on his back with his legs spread and his dick hard. She jerks his cock while she fucks him and releases her grip just before he’s about to cum, denying him the pleasure of an orgasm until she’s ready to give him one. Lauren slaps Lance’s chest and stomach with a crop just before sitting on his face. She ties Lance up in rope bondage on his back and commands him to stick out his tongue, and she rides his mouth until she cums hard on his face. After that, Lauren teases the head of Lance’s cock with her pussy. She fucks herself with just the tip until Lance begs for her to please fuck him. Lauren fucks his cock, using it only for her pleasure, while Lance begs her to let him cum.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2019-07-02",
  "scene_id": 44555,
  "tags": [
    "Athletic",
    "BDSM",
    "Big Tits",
    "Bondage",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "High Heels",
    "Humiliation",
    "july 4th",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Public",
    "Pussy Eating",
    "Redhead",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "spit",
    "Straight",
    "switch",
    "toned",
    "versatile",
    "white"
  ],
  "title": "Lauren Phillips & Lance Hart: Freedom to Fuck"
}