{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Poor little Mason Lear is a slave who is kept locked in a dark cage by the super hot mistress Gia DiMarco. The only light this slave sees is when his master Gia uses him for her pleasure. She brings her slave out to play from one cage to another and quickly lets him know she is his mistress and his only purpose is to please her and satisfy her needs. She warms up her slave's mouth by making him worship her feet while he is helplessly caged. She makes him beg for her pussy but Gia has no intention of giving her slave any pleasure. She rubs her wet pussy while Mason can only watch. Gia then zaps her helpless little slave while he is caged with nowhere to run. Then she brings him out of the cage for some corporal punishment. She asserts her authority over him with a few spanks. Then she catches Mason stroking his own cock so she has no choice but to punish him with a few hits from the crop. Then she puts her nice round ass in his face and makes him lick her up and down until she orgasms. This little slave likes to please his master so he begs to be fucked in the ass. Gia gives him a nice hard pounding with her big strap on to put him in his place. Then she uses his cock for her pleasure, riding it until she cums all over it. This poor slave is ready to bust his load but Mistress Gia has no plans of giving this slave any pleasures. He begs to cum but Mistress Gia already got what she wanted. After cuming over and over Gia locks this poor slaves cock in a chastity and is left denied. No pleasure for this house slave.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Mason Lear",
      "person_id": 60275
    }
  ],
  "release_date": "2019-07-16",
  "scene_id": 44556,
  "tags": [
    "Athletic",
    "BDSM",
    "black hair",
    "Bondage",
    "bottom",
    "Brunette",
    "Cage",
    "Caning",
    "CBT",
    "Chastity Play",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "master",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "The House Slave: Gia DiMarco Brings Mason Lear Out to Play"
}