{
  "collections": [
    "TS Seduction"
  ],
  "description": "Aubrey Kate stars as a blonde bombshell theater diva suffering with an inept assistant Piece Paris. Pierce is super hot, but he can't keep up with Aubrey's demands. Aubrey's already in a bad mood today after her gross and handsy director cuts her monologue so when Pierce tells her lunch will be delayed Aubrey is pissed. After Pierce makes several stupid comments insinuating her hotness invites harassment, she decides to harass him. Aubrey has Pierce take her shoes off and give her a foot massage. She shoves her stocking clad feet in his mouth to shut him up and notices Pierce has a raging boner. She demands Pierce gets naked - if he wants to keep his job that is. Once he's naked, Aubrey has him do a twirl so she can see what this stud has to offer. Pierce gets on his hands and knees at Aubrey's command and kisses her feet. Unable to stop himself, he sniffs them. They smell so good! But Aubrey catches him and tickles him mercilessly before giving him a firm spanking. Then she swallows his huge cock, savoring every inch. Pierce can't believe this is happening right now. Ms. Kate is so hot and her mouth feels like heaven on his cock. She has him turn around so she can taste his ass. Pierce moans as her tongue probes his asshole and yelps as she slaps his balls. Trembling, Pierce tries not to fall over as his boss has her way with him. Finally, he is ordered to service her cock. Pierce swallows it whole, taking her hard shaft and balls in his mouth. Aubrey moans in delight, finally she's found a use for this idiot! She pushes her hard cock into Pierce's ass and gives him a good hard pounding before having him blow her and taste his own ass. Pierce is getting sloppy and Aubrey scoops up some of that spit from his mouth and drops it into her own. Next, she continues fucking his ass before stuffing her whole fist into his slutty asshole. Pierce moans as Aubrey fists him and sucks his cock at the same time. Finally. Ms. Kate allows him to cum. Pierce blows his load and watches as Ms. Kate brings herself to orgasm. She tastes her own glorious cum before lounging back and reminding Pierce to go get her lunch. Honestly, does she have to everything herself?!",
  "directors": [],
  "models": [
    {
      "name": "Aubrey Kate",
      "person_id": 51491
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2019-07-23",
  "scene_id": 44558,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Ass To Mouth",
    "big dick",
    "Blonde",
    "Blowjob",
    "brunet",
    "Cock Worship",
    "Deepthroat",
    "Facefucking",
    "fake boobs",
    "Feet",
    "Foot Worship",
    "Lingerie",
    "Male Sub",
    "Muscle",
    "muscular",
    "Role Play",
    "shaved",
    "Spanking",
    "spit",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "Tickling",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Dick Deep Diva: Aubrey Kate takes advantage of Pierce Paris"
}