{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Slutty nurse Cherie DeVille relishes every opportunity to torment her captive patients, particularly TS sex slave Ella Hollywood. Ella is strapped to a bed with leather medical restraints 24/7. Cherie spends her days abusing her bound whore-toy all the while pretending she's giving her the care she needs. Ella is repeatedly humiliated and coerced with barbaric procedures to make her feel helpless. Cherie slowly and methodically clips Ella's hair making what was once pristine and beautiful, distorted and hideous. Instead of feeding her, Cherie smears scalding hot-sauce all over the red ball gag that is leveraged into Ella's mouth. Cherie squeals with delight as Ella's entire body convulses and winces with pain as her toes and feet are abused with brutal bastinado. Cherie is so enthralled by the process of hurting her prisoner that she sadistically convinces the resident doctor to keep Ella locked up for extended long term care. But it is all a rouse. After giving Ella her daily sponge bath of freezing water with a putrid rag, Cherie makes the mistake of temporarily releasing one of Ella's arms for her shackles. While Cherie is not looking she snatches a key and hides it in her mouth. As soon as Cherie leaves the room Ella releases herself and jumps Cherie, quickly overwhelming her and tying her to a bed. Now the tables are turned and Ella wastes no time seeking her long-awaited revenge. She starts by stripping Cherie naked and then abusing her body with electrocution play. Using a violet wand, Ella shocks and probes every inch of Cherie's helpless and exposed body, especially her perky and erect nipples and her greedy cunt hole. Tired of listening to Cherie's pathetic cries for mercy, Ella jams her massive cock into Cherie's mouth, making her gag and drool from the rough blow job and face fucking. Cherie is overwhelmed by Ella's dick and deep throats it and spews spit all over her giant tits. Ella then tosses Cherie onto the bed and begins to fuck her tight pink pussy with reckless abandon. Cherie's eyes roll back as her toned and perfect ass gyrates from the hammering. She begs to taste Ella's cum and her wish comes true Ella spews it all over her face and ass. Panting and thinking that her punishment is over, Cherie asks Ella if she will be let go. Ella laughs and tells Cherie, \"You're not going ANYWHERE.\"",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Ella Hollywood",
      "person_id": 61985
    }
  ],
  "release_date": "2019-06-17",
  "scene_id": 44553,
  "tags": [
    "Ball Gag",
    "Blonde",
    "Blowjob",
    "Cock Worship",
    "Doctor",
    "drool",
    "fake boobs",
    "Feet",
    "Gag",
    "Leather",
    "Nurse",
    "Pain",
    "Role Play",
    "shaved",
    "Slave",
    "spit",
    "Straight",
    "switch",
    "tea2020",
    "toned",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Violet Wand",
    "white"
  ],
  "title": "Nightmare Nurse: Ella Hollywood Fucks Nurse Cherie DeVille"
}