{
  "collections": [
    "TS Seduction"
  ],
  "description": "Jessica Fox is a no-nonsense lady, who doesn’t take shit from anyone. When Colby Jansen comes into her bar after making trouble the night before, she tells him she’s had enough. It’s now time for him to pay for the mess he made. She fucks his ass and his mouth, she flogs him, spanks him and paddles his feet. And in the end, she turns this troublemaker into her own little fuck bitch. Colby first walks into the bar unaware that he was such a mess the night before, but Jessica already has his photo pinned to the wall as a customer who’s been 86’s from the joint. But he refuses to leave, and pours himself a drink. Jessica’s having none of this shit, so she decides to take payment from him in a variety of ways. First she makes him strip, prodding him on with a zapper. Then she ties him to a fuck box and flogs his ass and paddles his feet, giving him the proverbial spanking he deserves. She unties him, then orders him to suck her rock hard cock. Jessica kicks back, gives him orders, and delights in Colby’s wet, hungry mouth as he sucks her sweet dick. She starts thrusting upward into his mouth, face-fucking him until she’s ready to slide into his tight hole. She puts Colby on his knees and truly fucks the bad bar patron. Jessica doesn’t hold back, slamming Colby’s ass deep and hard. She ultimately puts him on his back and jerks his dick while she slams his hole. She pounds him relentlessly, until he’s about to cum. Colby shoots his load on himself, while at the same time Jessica pulls out of his fucked hole and douses him with her cum. She feeds him both loads, mixed together, which he enthusiastically slurps from her fingers.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Colby Jansen",
      "person_id": 34457
    },
    {
      "name": "Jessica Fox",
      "person_id": 17013
    }
  ],
  "release_date": "2019-07-09",
  "scene_id": 44557,
  "tags": [
    "Anal",
    "big dick",
    "blond",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Feet",
    "Hairy",
    "Latinx",
    "Male Sub",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "the wall",
    "toned",
    "top",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "white",
    "Zapper"
  ],
  "title": "You're 86'd: Jessica Fox Fucks Muscled Troublemaker Colby Jansen"
}