{
  "collections": [
    "Bound Gods"
  ],
  "description": "In a dark silent dungeon, tied up in full restrictive rope bondage and eyes blinded, straight stud Alex Killian has no clue what is in store for how he will serve and worship his master today. This is Jacen Zhu’s dungeon today and he will receive gratitude for the pain he delivers. Dressed in full leather, black muscle stud Jacen Zhu looks over his obedient submissive. He is Master Koga and he is in control today. Starting with a brutal spanking, Alex screams in pain as his master controls him. Thank you master. Jacen moves to the flogger and beats the hell out his willing obedient submissive. But, where is the gratitude. Every time Alex forgets to thank his master for the pain, Jacen goes harder and harder. Alex’s huge cock hangs hard with every hit. The screams fill the dungeon as Alex begs his master for mercy and more pain. Suspended by chains upside down, it’s time for Alex to worship his master Zhu. Jacen’s huge rock hard cock is swallowed by Alex. Rammed down his throat and gagging, Alex is made to take every inch. But that’s not all Jacen demands to be worshipped. It’s time to worship his master’s leather gloves. Going back and forth from deep throat cock sucking to glove worship before the real tests begin. Tied up in rope bondage with his legs up and ass out, Alex takes a brutal fucking machine. His ass is stretched wide open and gaping for his master’s pleasure. But Jacen demands more and brings out the electric zapper and torments his submissive’s ass while getting rammed by the machine. Jacen fists Alex while the fucking machine continues to blast away. Alex gapes and prolapses for his master and is ready for a deep fucking. Tied up again in rope, Alex takes his master’s hard cock deep in his hungry asshole. Fucking and slapping, Alex goes back and forth between screaming pain and deep pleasure. Finally it’s time to take his master’s load. Alex opens wide for Jacen’s huge cumshot. Then Alex is made to drain his huge cock all over his master’s boots and worship every drop off his master’s leather.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alex Killian",
      "person_id": 62000
    },
    {
      "name": "Jacen Zhu",
      "person_id": 61943
    }
  ],
  "release_date": "2019-05-23",
  "scene_id": 44569,
  "tags": [
    "Anal",
    "BDSM",
    "Black",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "Chains",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Gaping",
    "Gay",
    "gloves",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Muscle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Straight",
    "Straight Stud",
    "Stud",
    "Submission",
    "Suspension",
    "Zapper"
  ],
  "title": "Yes Master Koga: Jacen Zhu Dominates Submissive Stud Alex Killian"
}