{
  "collections": [
    "Bound Gods"
  ],
  "description": "Master Sebastian Keys is back and ready to discipline an unruly house! He closes horny leather hooded fuck gimp Dominic Pacifico in a coffin before turning his attention to new boy Shane Jackson. Shane is shy but tough and ready for his inspection. He stands tall as Sebastian pulls his nipples and inspects his muscles. He drops to all fours for his anal inspection and holds his ass open as Sebastian pushes plugs in increasing size in his hole. Sebastian’s leather clad fingers run over Shane’s entrance, probing the tight muscle there. Shane moans as various plugs fill him and Sebastian flogs and spanks his ass red. Lastly, Sebastian puts an anal hook in him and leaves him to clean the plugs after instructing him not to open the coffin. But hearing the coffin rumble as he’s sucking each plug clean makes Shane curious. He edges closer and closer to the coffin and just as he’s about to open it, it springs open. The gimp is loose and it wants to fuck! The gimp grabs Shane and pulls him onto his cock. Shane resists but each time the gimp pushes its cock into Shane’s mouth, Shane can’t help but get hard. He gags on the gimp’s rock hard cock as the gimp’s hips piston in and out of his hungry slave whore mouth. The gimp pushes him down on all fours, spanks his ass, and sinks his hard cock into Shane’s stretched out hole. Shane knows he should try to get away, but he’s no match for the gimp. His hole gets plundered as the gimp throws him over the coffin for another round of pounding. Suddenly, Sebastian returns! And now everyone is going to get punished. Sebastian suspends Shane in rope, gags him, and puts clothespins on his sensitive nipples. He orders the gimp to fuck Shane hard as he flogs both slave and gimp. Shane cries out as the sensations intensify. His hole fucked open by the gimp, he begs for a load of cum all over his face. The gimp cuts hard and then is sent away. Shane is brought down to the floor, blows his load, and sucks his Master’s gloves clean. Just another day in the dungeon.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Shane Jackson",
      "person_id": 61987
    }
  ],
  "release_date": "2019-05-09",
  "scene_id": 44567,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "dungeon",
    "Gay",
    "Gimp",
    "gloves",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Submission",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "The Slave, His Master, and Their Gimp"
}