{
  "collections": [
    "TS Seduction"
  ],
  "description": "For the first time on TS Seduction, the roles are reversed and these beautiful TS ladies find themselves bound, blindfolded and submissive. Today, Casey Kisses is excited to expand her horizons, so she dives right in. We find her patiently waiting for her blue jean-wearing Daddy, Pierce Paris. Each of Pierce’s lingering touches drives her wild. Pierce crops, smacks, and flogs Casey’s gorgeous tits and tender thighs. He decorates her tits with clothes-pins and continues to crop and flog her. Casey moans with each impact, baring her teeth and growing hungrier and hungrier for her Daddy’s cock. But Daddy gets his turn first. He rips off Casey’s shorts and pulls down her panties to reveal her long fat cock. He swallows it to the base, savoring every inch of his girl’s pretty cock. Casey moans, throwing her head back, as her Daddy’s wet mouth pleasures her. Next, Casey is on her knees in bondage. She begs for her Daddy’s hard cock and Pierce is more than happy to oblige. Casey takes as much of Daddy’s fat cock in her mouth as possible. She’s never as happy as when Daddy is filling her holes with cock. She slobbers all over his cock, and then begs to get fucked. Pierce sinks his big dick into Casey’s ass. His thrusts come hard and fast, and each one brings Casey closer and closer to cumming. Her cock leaks pre-cum as she gets rammed by her Daddy. Determined to fuck the cum out of his girl, Pierce pounds Casey’s hole in doggy before flipping her over on her back. Casey licks her lips as she watches Pierce’s muscles rippling as he fucks her. Seeing his girl so perfectly fucked, Pierce pulls out and swallows Casey’s cock. He gives her a sloppy messy blow job, bringing her closer and closer to the edge. Finally, he pulls away and Casey cums all over her belly. Satisfied, Pierce blows a fat load all over Casey’s perfect face. Cum streaks run down Casey’s face as she cleans off her Daddy’s cock.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2019-07-02",
  "scene_id": 44560,
  "tags": [
    "Anal",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Crop",
    "Facefucking",
    "Facial",
    "Gag",
    "Male Fucks TS",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "tea2020",
    "top",
    "TS",
    "white"
  ],
  "title": "Daddy's Girl: Casey Kisses submits to Pierce Paris"
}