{
  "collections": [
    "TS Seduction"
  ],
  "description": "Kayleigh Coxx is a gorgeous blonde, with a beautiful ass, perfect tits, and a big dick. Dominic Pacifico can't wait to get his hands on her, tie her up, flog her, face fuck her and pound her ass, all while she strokes her own thick cock. He enters to find her tied up and gagged, arms bound behind her back. He starts by teasing her, playing with her tits and cutting off her panties to get as her tight pink hole. He lifts her into a full suspension, and flogs her ass as she moans and pouts through the ball gag. He removes the gag, only to shove his thick dick into her throat. Kayleigh's fully restrained, so she has no choice but to such Dominic's hard cock. He face fucks her, spins her around and flogs her ass again. Dominic lets her down out of the suspension, then puts her over his knee to spank her ass bright red. While Kayleigh's ass stings, Dominic orders her to suck his cock, to get it good and wet, and ready for her asshole. She sucks him like a cock-hungry slut as he fucks her throat again, then puts her on her knees and slides into her sweet pink hole. Dominic fucks her deep and hard and she takes every inch. He pulls out so he can slide that ass-flavored cock in her mouth, then pumps it back into her ass. Kayleigh can't hold back and she shoots her load as Dominic fucks her. He then rolls her over and uses her as his fuck toy, solely to get off. He unloads on her smooth ass then makes her suck his cum-soaked dick clean.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Kayleigh Coxx",
      "person_id": 61277
    }
  ],
  "release_date": "2019-07-30",
  "scene_id": 44561,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Ball Gag",
    "big dick",
    "black hair",
    "Blonde",
    "Blowjob",
    "Cock Worship",
    "fake boobs",
    "Flogging",
    "Gag",
    "Latin",
    "Male Fucks TS",
    "master",
    "muscular",
    "Paddle",
    "Role Play",
    "smooth",
    "Spanking",
    "Straight",
    "Suspension",
    "Tattoo",
    "toned",
    "TS",
    "unshaved",
    "white"
  ],
  "title": "Kayleigh Constrained: Kayleigh Coxx Serves Her Master Dominic Pacifico"
}