{
  "collections": [
    "Bound Gods"
  ],
  "description": "Jason Collins is an unscrupulous doctor with a twisted side. When Micah Martinez arrives in need of help with his sex addiction, Jason suggest a new, unorthodox treatment. Micah doesn't know it yet, but he's about to be wrapped up, tied down, flogged, face-fucked, and ass-pounded with Jason's huge fat cock, all under the guise of getting his own thick hard dick under control. Micah arrives, nervous and unsure about sharing his problem with Jason. But Jason assures him he's a doctor and has seen it all before. Having earned his trust, Micah opens up, and talks about his sex addiction. Jason proposes an unorthodox treatment, and when Micah gives his unwitting consent, the therapy begins. Jason immediately subdues his patient, and wraps him in cellophane on the examination table. Micah's immediately hard, getting his big solid dick lubed up and jerked off by his doctor. Jason plugs him into an electric cock-milking device that works Micah's cock to the brink of cumming. But Jason's not ready to let Micah have his release. He yanks the device off him punches his chest with impact play, then whips out his own huge fat cock and face fucks his patient. Micah's bound to the table face-down as Jason simultaneously flogs his super hairy ass. The flogging is intense and relentless, but Micah continues with the therapy, sucking and choking on Jason't giant cock. The treatment continues when Jason shoves an electric butt plug into Micah's whipped ass. By now Micah's experienced a great deal of pain and pleasure, and it continues when Jason pulls the plug from his hole, spreads him with a speculum, then sits him down on his huge fucking dick. Micah rides his doctor with a fervor, taking that thick fucker deep in his incredibly hairy hole. Jason jerks him off and milks his fat load from his balls, then puts Micah face-down on his own cock. Jason unloads his hot cum into his patient's mouth as it runs down the thick shaft. Micah's had his treatment, but Jason insists that a case this extreme needs repeated attention.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jason Collins",
      "person_id": 61577
    },
    {
      "name": "Micah Martinez",
      "person_id": 61856
    }
  ],
  "release_date": "2019-05-16",
  "scene_id": 44568,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Choking",
    "Corporal Punishment",
    "Doctor",
    "Domination",
    "Flogging",
    "Gay",
    "Hairy",
    "Humiliation",
    "Male Sub",
    "master",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Speculum",
    "Submission"
  ],
  "title": "The UnorthoDoc: Jason Collins Hits Micah Martinez With BDSM Therapy"
}