{
  "collections": [
    "Everything Butt"
  ],
  "description": "Penny Pax and Jane Wilde are attending Kenzie Taylor's Anal Academy. They sit at their desks in class, ready for their final anal exam. Before Professor Taylor shows up, the two have some nasty words with each other about who is the bigger slut on campus. Kenzie enters the room and yells at the girls to stop bickering at each other. The exam begins and Kenzie tells them to get on their knees in front of her and take her panties down only using their mouths. Kenzie tells them to lick her asshole and she judges who can do it better. Penny licks Kenzie's ass with the full length of her tongue while Jane watches, impatiently waiting her turn to tongue Kenzie's hole. Kenzie tells Jane to get on her desk and Jane quickly lays down on the desk and Kenzie sits on her face, smothering her nose and mouth with her asshole. Penny and Jane both lick her asshole while Kenzie uses an Hitachi on her clit and cums hard on their faces. Next, Penny gets bent over the school desk and Kenzie gets a big metal toy and pops it in and out of Penny's asshole while Penny licks Jane's ass. Jane, with her ass in the air, gets her ass filled with a clear acrylic toy, giving her big gapes. Kenzie puts matching purple butt plugs in each of their asses and face-fucks them with her strap-on until both butt-plugs come shooting out of their asses. They both get strap-on fucked in their asses deep and hard. After that, Kenzie gets huge gapes out of Jane's ass with a gigantic acrylic toy and Penny tongue-fucks her gaping hole. Jane fucks Penny with the slink while Kenzie masturbates in front of them with a vibrator. Finally, Kenzie gets five fingers inside Jane and five inside Penny and they both cum hard and lick their juices off of their Professor's hands.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Jane Wilde",
      "person_id": 61147
    },
    {
      "name": "Kenzie Taylor",
      "person_id": 59531
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2019-06-14",
  "scene_id": 44576,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Tits",
    "Blonde",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Petite",
    "shaved",
    "slim",
    "slink",
    "Smothering",
    "Straight",
    "switch",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Anal Academy"
}