{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Victoria Voxxx is ready to celebrate her 4th of July bbq with her two friends. Dressed in a tight bikini she brings a celebratory cake and party favors over. Starting off with a dance she shows off her tight figure to her friends who are no longer interested in cake! Shaking her ass gets everyone ready to start this party, and there is no better way than with fireworks. Just as she is about to light up, three handsome buffed firefighters break into the scene and demand to know what is going on. There is a fire ordinance in place and they are putting a stop to this. Victoria must be punished for this insubordination. Thrown to the ground by her neck, the fighters start to deliver a brutal punishment with their cocks. They each shove their hard cocks down her ready throat, before the put her mouth on her two friend's cocks. Everyone is going to get to celebrate Victoria today. Next they fully bind Victoria in rope bondage and throw her in the pool. What bbq isn't complete without a pool party. The men take turns fucking her mouth and her pussy as she is fully at their will. She is dunked in the water repeatedly as she is passed around the group. The men take her inside and tie her up again. They all take turns fucking her ass, because her pussy is shut and bound with clothespins. The men shock her with electric zappers and her screams tighten her asshole around their hard cocks fucking her with deep anal. They rip off the clothespins and start pounding all her tight holes. They slap her face and pussy which gets her begging for more. They lick her pussy and asshole and get her screaming with orgasm. Finally it's time to get Victoria airtight. They each take turns filling all her holes with huge rock hard cocks double penetration. Slapping and pounding and fucking away, she rolls her eyes back in ecstasy. She begs them all for cum. More and more cum. She takes it all on her face and begs for more.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Rod Jackson",
      "person_id": 62024
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-06-26",
  "scene_id": 44574,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Brutal Punishment",
    "Clothespins",
    "Corporal Punishment",
    "Double Penetration",
    "foreskin",
    "Gangbang",
    "july 4th",
    "Latin",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Pierced Nipples",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Straight",
    "Stud",
    "Tattoo",
    "toned",
    "top",
    "white",
    "Zapper"
  ],
  "title": "Out With A Bang: Victoria Voxxx's Firework Party Busted on 4th of July"
}