{
  "collections": [
    "Everything Butt"
  ],
  "description": "Step-mom London River gets the time of her life when she catches step-daughter Casey Calvert having phone sex in a room full of dildos and wild sex toys. Casey is talking dirty on the phone decked out in a super hot sexy outfit with a black leather corset, see thru net top showing her cute natural tits and thigh high stiletto platform boots when London shows up unexpectedly with a housewarming gift. She can’t believe her daughter has stooped so low to be doing this kind of thing for money but Casey is having a great time being a strong sexy independent woman living on her own and now she is going to show her step mom how she’s been missing out all these years by making London her Secret Buttslut. Casey props one leg up on the counter and spreads her ass cheeks wide so London can get in there for some introductory ass licking. Then Casey takes her step moms clothes off and reveals London’s huge tits and voluptuous bod and fingers her step moms ass, she likes it. Ms Calvert slides the stiff metal dildo into London’s ass and fucks her while she vibes her clit with the Hitachi and she cums hard. Now with a big strap on dildo London gets a deep throat fucking to get that cock all nice and slippery. Casey commands London to flip over with her butt high in the air and Casey fucks her juicy ass until it gapes. London has never experienced such things before and she can’t get enough of this hot action. On her side with legs spread wide open Casey fucks her ass some more with that thick cock until London gets off real good. Then London mounts Casey’s dick in reverse cowgirl and rides it hard until she is moaning in pleasure and having lots of orgasms. The fun isn’t over yet! There are so many toys to play with and London is excited to try them all and get her ass stretched wider than shes ever known. First Casey stuffs a giant clear acrylic butt-plug in her stepmom’s ass and brings her to an intense orgasm while choking her and rubbing her pussy. Then finger by finger Casey inserts her whole fist in to London Rivers ass and fist-fucks her until she is screaming in delight. London’s ass can take a lot it turns out so next she gets the really long flexible rubber slink stuffed way up her ass until she cant help herself from cumming. Now on all fours Casey inserts a smooth silver ball into London’s tight asshole and she swallows it right up and then pushes it out. Finally its Casey’s turn to get some ass lovin’ pleasure from her step daughter. Casey smothers London’s face with her curvy ass while London licks her asshole and tries to breath. And then she fucks Casey’s butt with the stiff metal dildo in a few different positions until Casey cums hard. From ass to mouth they both lick the dildo clean knowing they will be Secret Buttsluts forever!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2019-06-28",
  "scene_id": 44577,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Ass To Mouth",
    "bottom",
    "Brunette",
    "buttplug",
    "Choking",
    "Corset",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Hitachi",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaved",
    "slink",
    "smooth",
    "Straight",
    "Strap On",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "Secret Buttsluts"
}