{
  "collections": [
    "Families Tied"
  ],
  "description": "Petra Blair is the picture of chastity and devotion, obediently cleaning the convent and trying to conceal her girlish crush on Father Cooper, the head Priest. Father Cooper is a\nhandsome and affable man, who generously took her into the convent from out of the witness protection program. Petra claims she came to the church for a new start from her\ncriminal past, but she shudders with desire when the Priest lays his hand on her knee.\nHer newfound life comes crashing down when her slutty big titted step-mother Lily Lane\ncomes into the convent looking for her wayward daughter. She wants Petra to testify on\nbehalf of her father in court, but Petra steadfastly refuses to lie for her family anymore.\nDistraught, Petra seeks the council of Father Cooper, who suggests she try burning out\nher sinful past the old fashioned way; with a heavy handed spanking over his desk. As\nLily confesses her sins in sordid detail she is beaten pink, then red. Father Cooper loses\nhimself eventually, pulling her panties off and fucking her right on his desk, but only\nafter thoroughly flogging her and stuffing her mouth with his fat cock. Sister Petra is\ndismissed from his office with soaking wet panties and a deep red ass.\nLily Lane tries a new approach, bribing Father Cooper with $20,000 to excommunicate\nPetra. Father Cooper can barely contain his joy when he reveals he is actually an\nundercover agent assigned to her family’s case. Lily is handcuffed, tied up in chains,\nand has her big tits clamped tightly with metal. Still fighting and cussing, Lily gets her\nwhore face fucked roughly and has her chained cunt cropped red. Her swollen pussy is\nvibed until she gushes with squirt. Stirling then takes his time fucking her gorgeous ass\nand pussy, switching between them freely while she denied all orgasms.\nPetra discovers Lily gagged in metal stocks in Father Cooper’s office, and is invited to\nhelp Stirling interrogate her bitch step-mother. Petra is more than happy to participate in\nLily’s sexual humiliation and punishment. Riding her mother’s face and pulling clamps\noff her body, Petra talks a torrent of shit to Lily. Lily can’t talk back, but just groan with\norgasmic pleasure as she gets plowed by Stirling and has Petra’s cunt ground against\nher face. Petra takes complete control of Lily with a leash and collar, using her as a sex\ntoy while she works out 6 months of sexual chastity on Stirling’s cock. Both women ride\nreverse cowgirl and suck his cock like good obedient sluts.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Petra Blair",
      "person_id": 61946
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-06-21",
  "scene_id": 44573,
  "tags": [
    "Athletic",
    "Big Tits",
    "bottom",
    "Brunette",
    "Chains",
    "Collar",
    "fake boobs",
    "Family Roleplay",
    "Flogging",
    "foreskin",
    "Humiliation",
    "Latinx",
    "other hair color",
    "shaved",
    "slim",
    "Spanking",
    "Stocks",
    "Straight",
    "Tattoo",
    "white"
  ],
  "title": "Father Issues"
}