{
  "collections": [
    "Men On Edge"
  ],
  "description": "Outside the dungeon, Sebastian Keys sees leather stud Devin Trez. Quickly Sebastian seizes the moment and grabs Devin into his dark dungeon. Taken, Devin is bound in ropes and blindfolded. His leather stripped away. This black muscle dom will learn what it feels like to submit today. Muscle Stud Dominic Pacifico is ready to torment his new toy. Unable to resist, Devin is stripped and his huge uncut cock is exposed. The two men marvel at this monster cock which gets harder and harder with every stroke. Dominic takes the whole cock in his mouth which edges Devin closer and closer to shooting his fat load. Devin's huge hanging balls are aching and begging to cum, but each time is denied. Sebastian pulls out the cock sleeve and Devin's cock can barely fit in it. Devin screams in agonizing pleasure. The men deny his cock's release. Dominic further torments Devin by slapping his huge cock. Next Devin is fully restrained with rope on a throne. The men worship his body and cock again. Intense suction nipple clamps are applied and get Devin screaming. A cock head sleeve attached to a vibrator freaks out Devin and gets him begging to cum. The men deny him again and again, until Devin's balls are aching to explode. A huge load covers the floor with hot cum and Sebastian gets to work agonizing his aching sensitive uncut cock with the vibrator, before the two of them perform a brutal endurance tickling.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Devin Trez",
      "person_id": 61805
    }
  ],
  "release_date": "2019-07-09",
  "scene_id": 44571,
  "tags": [
    "bbc",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Bondage",
    "dungeon",
    "Edging",
    "Gay",
    "Leather",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "muscular",
    "Nipple Clamps",
    "Oral Sex",
    "Rope Bondage",
    "Slapping",
    "Stud",
    "Tickling",
    "Uncircumcised",
    "Vibrator"
  ],
  "title": "Taken and Edged: Leather Dom Devin Trez Submits to Dominic Pacifico"
}