{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Stunning superstar Jasmine Jae is turning in for a relaxing night at home. Her full curves barely fit into her tight lingerie. This busty model gets into bed and innocently falls fast asleep. In no time, 5 strangers break into her home. These filthy criminals are ransacking her apartment while she sleeps. Looking for anything they can get their hands on, Jasmine finally is startled awake. Going to the kitchen to see what the noise is, she is frightened by the site of five handsome strangers in her home. She screams as they grab her and hold her down. She begs them to let her go and agrees to do anything they want to her. The gang bang guys whip out their cocks and begin to shove it down her tight throat. She gags and gasps with each deep throat blowjob. She screams with pleasure and pain and she is tossed around between each man. Now it's time to tie her up. Bound in rope the men fuck her wet pussy. Each taking turns while another fills her mouth. Her giant boobs are bound in rope as well, and the men fuck those huge tits. After her pussy is stretched open, the men suspend her in more bondage and go to town on her ass. Deep anal gets her moaning with her ballgag in her mouth. Two holes at a time isn't enough for these hooligans and they throw her on the bed and stuff her air tight. DP'd over and over again, she screams and moans shaking the walls with orgasm. She is given a Hitachi and commanded to cum. After each man fucks all her holes again and again, they shoot their thick heavy loads all over her face.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "JJ Graves",
      "person_id": 62008
    },
    {
      "name": "Jasmine Jae",
      "person_id": 59210
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    }
  ],
  "release_date": "2019-06-12",
  "scene_id": 44575,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "british",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "fake boobs",
    "Gangbang",
    "Hitachi",
    "Lingerie",
    "mixed",
    "muscular",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "takedown",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "The Home Invasion starring Jasmine Jae"
}