{
  "collections": [
    "Men On Edge"
  ],
  "description": "Jeremy Spreadums has hit the jackpot big time! He’s lifted a bunch of casino chips and has a couple hours to kill before skipping town. Thinking he’s made a clean getaway, he decides to take a nap. Little does he know, casino muscle Sebastian Keys and Dominic Pacifico are hot on his trail. They catch him sleeping, string him up, and cut his clothes off. Jeremy struggles to get away from his captors but they overpower him. He promises he’ll never steal again, but Sebastian and Dominic aren’t satisfied. They decide to teach Jeremy a lesson – fuck with the house and get fucked! Jeremy cries out as they squeeze his sensitive nipples and smack his cock. He can’t shield himself from their blows and soon his cock starts to get hard. Laughing at the pervert they’ve caught, Sebastian ties up Jeremy’s balls and Dominic deep throats his cock. Jeremy can’t believe this is happening. His cock is leaking and he’s so close to cumming he could burst. Every tug on his balls makes him harder and harder. And feeling Dominic’s talented mouth on his cock and his wet tongue on his balls is driving him wild! But his captors aren’t done with him yet. They blindfold him and stuff him from both ends. Dominic fucks his mouth with a dildo before sliding his own rock hard cock into Jeremy’s mouth. Jeremy takes every inch of Dominic’s fat cock while Sebastian fucks his ass with a vibrating cock and strokes his cock. Jeremy wants to cum so badly he’s shaking, but he’s at the mercy of his sadistic captors. When Dominic starts licking his feet and sucking on his toes, Jeremy can’t hold it any more. He cums hard and then gets tickled until he screams! Maybe he’ll think twice before he robs a casino again. Maybe.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jeremy Spreadums",
      "person_id": 61296
    }
  ],
  "release_date": "2019-06-11",
  "scene_id": 44572,
  "tags": [
    "BDSM",
    "black hair",
    "Blindfold",
    "Bondage",
    "Couple",
    "Dildo",
    "Edging",
    "Feet",
    "foreskin",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "muscular",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling",
    "white"
  ],
  "title": "The House Always Wins: Casino Thief Gets Caught and Fucked-With"
}