{
  "collections": [
    "Banana Jacks"
  ],
  "description": "CUCKOLD WIFE has hubby in chastity, teasing him with the keys, She can always get her way. She comes home with a surprise for him and makes him close his eyes. She brings in another man has him lay on the bed and tells hubby, that the only way he’s going to get out of chastity is if He makes Frank cum. Wife is just going to relax and let hubby do all the work. SHE’S GOING TO MAKE HIM GAY. While She puts her pussy down next to Franks cock, She makes hubby give him a blow job. If hubby doesn’t make her friend happy, Hubby’s cock stays locked up and he never gets to cum. Her boyfriend Frank gets to suck on her big tits, while they both laugh at hubby sucking cock. Wifey plays with her pussy and cums, while Frank gets his cock sucked, but they both ignore Hubby’s cock, Frank fucks Hubby’s Face. He slaps hubby’s face with his dick. Cuckold Wife makes hubby’s mouth wide open to catch all the cum. Frank cums all in his mouth and they make him swallow it all. Then Cuckold Wife takes care of her little boy Husband, by smothering him under her pussy, while he is madew to Jerk off for her. He gets to cum. She makes him eat a second cum load and them slaps his sensitive cock to make it shrink so it can be returned to Chastity.",
  "directors": [],
  "models": [
    {
      "name": "Frank Towers",
      "person_id": 61990
    },
    {
      "name": "Les Moore",
      "person_id": 52202
    },
    {
      "name": "Mz Berlin",
      "person_id": 14228
    }
  ],
  "release_date": "2019-05-02",
  "scene_id": 44585,
  "tags": [
    "Big Tits",
    "Bisexual",
    "blond",
    "Blowjob",
    "brunet",
    "Chastity Play",
    "Curvy",
    "Facial",
    "fake boobs",
    "Femdom",
    "Fetish",
    "foreskin",
    "Gay",
    "High Heels",
    "muscular",
    "Redhead",
    "shaved",
    "Slapping",
    "Smothering",
    "Straight",
    "Swallow",
    "switch",
    "Tattoo",
    "Partner Studio",
    "white"
  ],
  "title": "Making Hubby Bi"
}