{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Lucky, lucky you. You’ve found yourself at the base of Mistress Ashley Paige’s red hot thigh knee boots. You’ve been waiting for so very long for this moment. She’s feeling quite generous today and tells you to release yourself from that tiny, tight little cage you’ve been trapped in. Pull that rock hard cock out, and let’s see how hard and how fast will you cum for her. You don’t get to cum until she says so, so be good. Now spit in your hand, get it wet, and rub just the tip. She takes her bright red glove and begins to pet her red latex pussy as she tells you how to stroke your dick. Stroke just the tip, grab it and stroke it and rub it like you’ve been begging for her sweet, juicy lips. But too bad for you, you get nothing, not until she cums. Don’t go too fast, get right to that edge and don’t go over it. Now put your cock in your hand and pay close attention. Mistress Ashley Paige pulls out a shiny vibrator. “You see this beautiful little vibrator here, it brings me more pleasure than you ever could.” So pay close attention as she makes herself cum so hard and so deep and keep yourself right at the edge of your orgasm because she’s nowhere near ready to let you have that sweet release. She plays with her pussy and strokes her clit with her vibrator, telling you to match every stroke with your hand on your cock. She tells you to stroke faster, bring yourself close, make it drip as she fingers herself with her red latex glove and vibrates her clit bringing herself closer to her own orgasm. As she fucks herself she doesn’t let you forget that the vibrator performs better and makes her wetter than you ever could. She knows you are dying to taste her sweet creamy pussy juice that’s all over those latex gloves, but you can’t and you never will. Now keep stroking and watch as she cums hard all over the couch with her legs shaking in those red shiny knee highs. She’s grabbing at her perfect tits trapped in her latex cage bra as she licks the air with pleasure and squeezes the vibrator between her thighs as she cums even harder. You’ve never made a woman do that have you? No, we didn’t think so.",
  "directors": [],
  "models": [
    {
      "name": "Ashley Paige",
      "person_id": 61984
    }
  ],
  "release_date": "2019-05-03",
  "scene_id": 44588,
  "tags": [
    "Big Tits",
    "Bondage",
    "Boot",
    "Cage",
    "Chastity Play",
    "Cuckolding",
    "Ebony",
    "Edging",
    "Femdom",
    "Fetish",
    "gloves",
    "Hitachi",
    "JOI",
    "Kinky",
    "Latex",
    "Lingerie",
    "masturbation",
    "Nylons Stockings",
    "POV",
    "Role Play",
    "Solo Female",
    "spit",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "Vibrator"
  ],
  "title": "Kinky JOI: Latex Clad Goddess"
}