{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "There are only a few porn sluts that can hand our level of play we offer here at Sexual Disgrace. We definitely love to see them endure multiple orgasms and enjoy their submission. Fetish Network presents Asian porn slut Mena Li. She’s introduced to our trusty sybian fucking machine, a delightful surprise for all of our sex slaves. Li knows it quite well. This time around in rope bondage, she’s kept sat on the fucking machine, wrists tied spead apart to her side, neck kept in place her hair. Mena finally meets her Master with a flip of a switch and the constant vibration of the sybian. She struggles immediately to contain herself from the all the orgasms it’s causing. Her Master pulls her hips down onto the sybian, clit pulsed with intense vibrations, making her ride it. He makes her gag on his cock, penetrating her throat deep and rough. He loves watching the spit fall from her mouth. That usually makes his sex slaves cum harder. She’s doing well so far. Next, he brings her down onto the floor in the doggy style position, giving him full access to her pussy and mouth for face fucking. Her Master inspect his sex slave’s pussy and asshole, pleased to see pretty pink. Li has learned how to be an obedient sex slave, following every order, taking every inch of cock, rough and deep, begging for forgiveness for being a dirty slut. Her Master goes back and forth from mouth to pussy, pussy to mouth, using her spit as lube and making her clean his dick of her cum. He even shoves her panties in her mouth as he fucks her face. He makes her moan and scream like a good whore should, pounding her in. He even smacks her tits, ass and face a bit. Mena is ready for more domination.",
  "directors": [],
  "models": [
    {
      "name": "Joey",
      "person_id": 61472
    },
    {
      "name": "Mena Li",
      "person_id": 53759
    }
  ],
  "release_date": "2019-05-03",
  "scene_id": 44586,
  "tags": [
    "Asian",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Choking",
    "Deepthroat",
    "Domination",
    "dungeon",
    "Facefucking",
    "Fetish",
    "Gag",
    "master",
    "mixed",
    "multiple orgasms",
    "natural boobs",
    "PIV",
    "Rope Bondage",
    "Rough Sex",
    "Sadism",
    "shaved",
    "Slapping",
    "Slave",
    "spit",
    "Straight",
    "Sub",
    "Submission",
    "switch",
    "Sybian",
    "Tattoo",
    "Partner Studio",
    "toned",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Mena Li Endures the Sybian Fucking Machine & Rough Rope Bondage Sex"
}