{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Derek and Tanner, new boyfriends, arrive at a house they've been invited to for the weekend, where the host is absent. They find a message telling them to make themselves at home, and also letting them know that the house is magic. After getting beers from the fridge, they start making out. Derek is clearly the dominant in the relationship, and even when he starts giving Tanner head, he grips Tanner's wrists and forcibly holds them behind Tanner's back. Tanner responds submissively, and happily sucks on Derek's fingers before going down on Derek himself. After a few minutes they stop playing to check out the house.\nUpstairs, All the doors are locked. They go back downstairs to the living room, where they find a blazing fire and a big locked trunk. Derek finds the key, but when Tanner goes for it Derek teases him, slaps him, and orders him to take off his boots first. Tanner does so and worships Derek's feet, licking and kissing and sucking on them. Finally, Derek puts the key in Tanner's mouth and has him crawl over to the trunk, which they open, and find filled with fetish and bdsm gear: rope, cuffs, hoods, floggers, gasmasks, camos, more. Derek grabs some rope, jumps Tanner and despite the other boy's protests and fierce struggles, succeeds in hogtying him. Derek now makes love to bound Tanner, who responds passionately. The scene fades to the two guys asleep in front of the fire, Tanner still hogtied. Derek goes to take a piss, leaving Tanner alone and squirming. The trunk lid begins to move up and down. The lid opens and Marcelo Reeves rises beautiful and powerful from inside.",
  "directors": [],
  "models": [
    {
      "name": "Derek Palmer",
      "person_id": 61993
    },
    {
      "name": "Tanner",
      "person_id": 61992
    }
  ],
  "release_date": "2019-05-07",
  "scene_id": 44592,
  "tags": [
    "BDSM",
    "Blowjob",
    "Bondage",
    "Deepthroat",
    "Feet",
    "Fetish",
    "Gay",
    "Rope Bondage",
    "takedown",
    "thirdparty"
  ],
  "title": "Objects of Desire: A Weekend in the Country - Arrival"
}