{
  "collections": [
    "CFNMEU"
  ],
  "description": "Milos Ovcacek is visiting an office to talk about a photoshoot. The girl interviewing him mentions that it might be of an erotic nature. Milos is not sure, but asks for some details. The girl begins asking him questions and then gets on with the casting. Milos stands and removes his tee shirt, then he takes his shorts off and is naked before her. The girl stands and begins to feel his body. She reaches down to feel his big cock too, telling him that he has a good body. She turns Milos around and rubs his ass. She wants to check that ass more and bends him over to spread his cheeks. That ass looks so hot as she inspects the tight hole. Milos says he will do anything and the girl has an idea. Milos sits on the sofa and wanks himself as the girl removes her top. She moves to the sofa as he keeps pulling on his cock, and she rubs his body. Then she leans over and begins sucking the big cock, as it gets rock hard. Milos moans as the girl works on his cock. The cock is massive but the girl sucks it well. She sucks it a lot and then spanks that big dick before taking a whip. Milos wanks himself, standing up, as she flicks the whip at him and clamps his nipples. Milos kneels on the sofa, showing his ass and the girl ties his hands. Then she starts whipping that sexy ass. Next she takes a dildo and shoves it deep into Milos waiting hole. It goes all the way in and he moans, but takes it well. She reaches under and wanks his big cock as she fucks his ass with the toy. She pulls the toy out and inspects the ass before shoving a much bigger and thicker dildo deep into the hole. That hole is really stretched as she fucks the toy deep inside. Milos feels his ass being fucked as she also wanks on his cock. Then she turns him over, with his legs up and keeps fucking the hot ass and wanking his dick. She says she will fuck him with a strapon, but Milos needs to piss. So she stands him up so that he can release the piss into a jug. Then she kneels him on the sofa again and fucks him hard with her strapon. She turns him over and keeps fucking his hot hole as Milos wanks himself until he cums. Audition over she promises to let him know about some work.",
  "directors": [],
  "models": [
    {
      "name": "Milos Ovcacek",
      "person_id": 61997
    },
    {
      "name": "Zmirnena Pritelkyne",
      "person_id": 61727
    }
  ],
  "release_date": "2019-05-09",
  "scene_id": 44601,
  "tags": [
    "Anal",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Dildo",
    "Edging",
    "Femdom",
    "Flogging",
    "Handjob",
    "High Heels",
    "Kinky",
    "Lingerie",
    "Male Sub",
    "masturbation",
    "Nipple Clamps",
    "Nipple Torment",
    "Pegging",
    "Straight",
    "Strap On",
    "thirdparty",
    "top",
    "Vibrator",
    "Whipping"
  ],
  "title": "Casting"
}