{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "You've made it to Mimosa's hotel room on time but that's not enough to redeem your sorry ass. Unlucky for you, your troubles have only just begun, You see, you're about to get a taste of your own medicine and it sure doesn't taste good. The fact that you thought for one second that anyone would want to see your pathetic dick, that they would want a picture of it sent to them without warning, shows that your brain is even smaller than your cock. Mimosa is not having it. But not only that, she's gone and figured out all the contact information of your coworkers, family, and friends. How would they feel about seeing your disgusting little member? Huh? They'd probably vomit. Just imagine your boss opening their inbox to see your disgusting dick and balls? Do you think you'd have a job for much longer? Mimosa doesn't. So today she's going to strike a deal with you. In order to get out of this little situation you've gotten yourself into you're going to take out your cock and do whatever she says. Now spit on it, get it nice and wet and start stroking. Mimosa's delicious breasts are exposed and she's ready to show you with a dildo just how to work your puny little dick. She begins to slide the dildo in and out of her mouth, her luscious lips gripping the shaft of the dildo, her spit drips all over it. She rubs the spit in with her hands all the way up and down in a stroking motion that you are to mimic. And while you stroke you will look her in the eye and say, \"I am so sorry for being a piece of shit.\" And stroke harder and harder as you repeat these phrases over and over until they sink into your dull skull. Mimosa now leans back and pulls up her skirt. She begins to slide the dildo deep into her pussy. Her clit ring is shining as she tells you how good the dildo feels inside of her, how it pleases her more than you ever could, and how you'll never get the chance to prove her wrong. Now stop, just watch, don't touch your cock, just watch she fucks herself. She just loves to tease you while she plays with her big titties knowing just how much you'd love to touch yourself, how much you ache to touch her. Now she gives you permission to stroke your cock again but now she's going to film you. That's right Mimosa is now fucking herself with one hand and with the other hand filming you masturbating so that she has even more leverage. She laughs at your attempts to prove yourself as you stroke harder and faster. And whatever you do, you better not fucking cum or your grandma will be getting a surprise email with that stupid penis of yours inside.",
  "directors": [],
  "models": [
    {
      "name": "Mimosa",
      "person_id": 57584
    }
  ],
  "release_date": "2019-05-09",
  "scene_id": 44602,
  "tags": [
    "BBW",
    "black hair",
    "Bondage",
    "Cuckolding",
    "Curvy",
    "Dildo",
    "Femdom",
    "Fetish",
    "Kinky",
    "masturbation",
    "Pierced Pussy",
    "POV",
    "Solo Female",
    "Straight",
    "thirdparty"
  ],
  "title": "Kinky JOI: Blackmailed"
}