{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When Penny refuses Tommy’s attempts to reconcile their failed marriage, she is drawn into a trap of captivity, sex and Tommy’s obsessive quest to re-kindle their love. Mr Pistol believes he and Penny are to be together forever and he thinks he can fix what went wrong with their marriage. So naturally he puts pretty Penny in a choke hold, ties her up to a wooden cross and gives her a deep throat sloppy face fucking to remind her what she is missing. Penny’s big natural tits glisten with spit and slobber as Tommy’s hard dick pounds her wet mouth hole. Tommy ties the Hitachi to Penny’s pussy and drives her crazy with buzzy vibrations while he simultaneously disciplines her with the crop and sucks her sensitive nipples. Next Penny is tied up tight on all fours with her back arched and both holes exposed ready for action. A little bit o’ flogging, caning, cock sucking and then Tommy fucks his ex-wife’s puffy pussy deep and hard making her moan with pleasure. Then just like old times Tommy drives his cock into Penny’s tight ass and fucks her out and she is loving it. He lets Penny taste her ass by stuffing his dick in her mouth and then he fucks her some more. Finally we find Penny on her back in full rope bondage with her legs spread wide and her slutty holes begging for attention. Tommy punishes her with the flogger then fucks her pussy and ass back and forth while he vibes her clit until she is out of her mind in ecstasy. She cums hard and begs for Tommy’s hot load which he pops all over her fucked out pussy. Ahh, relationship all fixed–together forever!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-06-21",
  "scene_id": 44607,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Ball Gag",
    "BDSM",
    "Big Natural Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "Caning",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Flogging",
    "Hitachi",
    "Humiliation",
    "Latinx",
    "natural boobs",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "spit",
    "Straight",
    "Submission",
    "switch",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Anal Alimony"
}