{
  "collections": [
    "Sex And Submission"
  ],
  "description": "When check fraudster Zoe Sparx gets into trouble with the law, she faces jail time unless she can convince cheap lawyer Stirling Cooper to take her case and save her ass. Zoe puts up a fight once she hears what Stirling wants, but she's willing to pay the price to avoid prison. As the night progresses, Zoe gives up all her holes and her dignity. First, Zoe is stripped to only her high heels, gagged and tied spread eagle to Stirling's desk. She squirms as Stirling flogs her tits and stomach. Zoe is embarrassed that each hit from the flogger makes her wetter and wetter. When Stirling attaches clover clamps to her nipples, Zoe cries out in pleasure and pain. Stirling loves hearing Zoe's cries and tugs on the clamps as he stuffs his cock into her mouth. Zoe eagerly swallows his cock down, gagging on it as drool leaks down her face. Then Stirling clamps Zoe's pussy open, leaving her clit exposed to the vibrator Stirling keeps in his desk. Zoe arches off the desk, pulling at her restraints as she tries to get away from the vibe. It feels so good, Zoe can't help cumming and squirting all over Stirling's desk. Displeased his slut forgot to ask for permission, Stirling pushes the vibe firm against Zoe's clit, making her promise to ask for permission before she cums next time. Zoe screams, promising she'll do better next time. Next, Zoe is tied on all fours. She cries out as Stirling fucks her mouth and crops her cute ass. After using her mouth, Stirling starts stretching Zoe's cunt. Zoe squirms as he fingerfucks her before driving his hard cock into her wet hole. Zoe moans as Stirling thrusts get deeper and deeper. It feels so good, she can't help but cum again without permission. To punish his disobedient charge, Stirling fucks Zoe's ass with a glass dildo and then continues to fuck her cunt as the same time. All the stimulation is driving Zoey wild. She begs Stirling not to stop, desperate for a hard fucking. Stirling flips Zoe over and continues fucking her, switching between her pussy and ass as Zoe screams in pleasure. She promises she'll be good as Stirling pounds her holes. Zoe keeps cumming and squirts all over. Satisfied his boon has been met, Stirling makes Zoe suck on his balls as he blows his load all over her face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    },
    {
      "name": "Zoe Sparx",
      "person_id": 62035
    }
  ],
  "release_date": "2019-06-28",
  "scene_id": 44609,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Clover Clamps",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "drool",
    "Flogging",
    "foreskin",
    "High Heels",
    "Humiliation",
    "other hair color",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Squirting",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Legal Counsel: Zoe Sparx Trades Holes For Legal Representation"
}