{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Busty, blonde, and drop dead gorgeous MI6 agent Katy Jayne has a plan, and that's to get in and get out of the American Embassy without getting caught. For janitor Charles Dera, today is just another Sunday, but when he hears noise coming from an office upstairs, he knows something is fishy. He catches Katy in the act, follows her to her car, and apprehends her before she can leave. Katy decides to go along with Charles' questions, but things take a turn for the worst when he uncovers the documents she's taking and subjects her to an invasive strip search. Katy has had enough of this treatment, but Charles won't let her leave. Something about this feisty Brit makes Charles rock hard and a little in love. He ties her to her car, clamps her tits, and tries to get information out of her pretty little mouth. When Katy refuses to divulge any personal information, Charles decides to strike a bargain. He'll let her go if she gets him off. Grudgingly, Katy opens her mouth to suck her captor's cock. Charles groans as he feels Katy's wet mouth close around him. Katy woks his cock, taking it deeper and deeper down her throat. Next, Katy is tied bent over a desk. She can'y move and still refuses to answer questions. Charles spanks and whips her cute ass as Katy moans in delight. She loves the smart smacks that make her bottom nice and warm. As the hits intensify, Charles gives her a choice -- more impact or going for a ride on his big cock. Katy chooses cock and gets a hard pounding from 100% born and bred American cock. Finally, Katy is on her back, tied with her meaty cunt exposed. Charles thrusts his cock into her and Katy cries out. Here's what she's really been aftter, the deepest hardest fuck in America. Charles makes Katy say the pledge of allegiance as he fucks her, but he can't get her to swear loyalty to his country--only his cock.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Katy Jayne",
      "person_id": 62077
    }
  ],
  "release_date": "2019-07-04",
  "scene_id": 44608,
  "tags": [
    "BDSM",
    "black hair",
    "Blonde",
    "Blowjob",
    "body builder",
    "bottom",
    "british",
    "Corporal Punishment",
    "Domination",
    "Humiliation",
    "july 4th",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "American Cock: US Janitor Catches British Spy Katy Jayne"
}