{
  "collections": [
    "Sex And Submission"
  ],
  "description": "The beautiful Ashley Lane is a stunning natural blonde with an insatiable taste for dark pleasures. Her partner in crime Mr. Pete just pulled off a huge heist and scored a big take. These two were sitting pretty, but someone took the cash! Mr. Pete suspects it was his back stabbing partner Ashley. Abducted and tied up in restrictive rope bondage. Gagged and left alone in a dark shed, Ashley tries to escape. She wiggles her tight body but has no luck being freed. Then Pete enters. It’s time to get Ashley to admit to stealing the cash. Pete pulls up Ashley’s tight red dress and starts spanking her round ass. He moves on to the crop and starts turning Ashley’s body red with stripes while a hitachi is on her pussy. Ashley endures one of the most brutal corporal punishments before she agrees to give Pete one last blow job. Pete pounds his hard cock down her throat for a deep throat cock sucking. But, that doesn’t work. Pete ties her back up and leaves her again. This time she was able to slip out, and low and behold she goes for the money! Finally free from Pete and with the take, she gets a phone call. It’s Pete. He found her. He ties her up in full restrictive rope bondage and gets back to work with the corporal. She screams sooo loud with each hit. Her body twisting and turning in the rope bondage. She begs for pleasure to go with her pain and Pete delivers and brutal deep fucking. Her wet pussy drips for his cock before huge squirting orgasms. Pete unloads his huge cum shot all over her.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2019-08-02",
  "scene_id": 44614,
  "tags": [
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Caning",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "foreskin",
    "Hitachi",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "Stud",
    "Submission",
    "Vaginal Penetration",
    "Whipping",
    "white"
  ],
  "title": "You'll Never Get Away: Ashley Lane is Restrained & Punished"
}