{
  "collections": [
    "FetishNetwork"
  ],
  "description": "Poor little Latina teen Gina Valentina is really not having a good vacation. She left her boyfriend after catching him cheating with some local trash. Now she’s got no money and no place to stay. She wanders into a bar and finds someone sympathetic, a kindly bartender who just happens to know a place that caters to girls in just her predicament. Gullible Gina gets whisked off to the seedy looking Hostelxxx by the brute Boris and quickly learns a harsh life lesson; nothing comes for free. If you wanna stay, you’re gonna have to work slut! After having her strip naked and thoroughly examining her smoking hot tiny nubile body, Sal the Innkeeper straps her to a wooden chair and leaves her as entertainment for a one of his valued customers. The customer takes poor little Gina on scary ride through the world of BDSDM, sexual pleasure and brutal rough sex. Using a variety of toys and devices he sexually teases and torments Gina before tossing her unto his dingy bed like a rag doll and savagely pounding her tight teen pussy into screaming submission. A whirlwind of positions and creamy orgasms later he treats his new toy to a big messy facial.",
  "directors": [],
  "models": [
    {
      "name": "Brick Danger",
      "person_id": 62005
    },
    {
      "name": "Gina Valentina",
      "person_id": 58814
    }
  ],
  "release_date": "2019-05-16",
  "scene_id": 44616,
  "tags": [
    "69 Position",
    "BDSM",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Breast Abuse",
    "Caning",
    "Choking",
    "Deepthroat",
    "dungeon",
    "Electrical Play",
    "Facefucking",
    "Facial",
    "Female Slave",
    "Hair Pulling",
    "Latex",
    "Leather Cuffs",
    "Lift And Carry",
    "Male Handler",
    "mixed",
    "Mouth Spreader",
    "natural boobs",
    "PIV",
    "Pussy Eating",
    "Rough Sex",
    "slim",
    "Small Tits",
    "Smoking",
    "Spanking",
    "Submission",
    "Tattoo"
  ],
  "title": "Gina Valentina Room and Bondage"
}