{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Ivy Lebelle sits at her desk at work staring at a broken fucking machine that sits on a table in the distance. Meanwhile, Small Hands just having been released from jail, is outside her business at the security gate. He walks into Ivy’s office and hands her a paper that explains that he’s been assigned to work there for a release program. Ivy tells him that his first job is to fix her broken machine. Small hands gets to work on the fucking machine. Next to the machine is a dildo that Small Hands attaches to it. He turns it on and the machine works. Proud of his achievement he calls over his boss, Ivy. She grabs the oscillating dildo and kicks him out for sexually harassing her. Small Hands grabs her by the neck and says he can’t go back to jail. On her knees in only her lacy panties and bra, her arms are outstretched, bound with rope to a wooden table. An Hitachi vibrator is nestled in a frog-tie on her right leg, pressed against her pussy. In her mouth a bright red ball-gag drips with drool down her big juicy lips. Small Hands pulls her bra down and rubs her spit all over her big tits. He takes out her ball gag and replaces it with his big cock. She sucks his cock and he fucks her mouth until Ivy’s tits glisten with drool. In the next scene, Ivy is on her hands and knees on top of a dirty mattress with her big round perfect ass in the air, presenting her pussy and ass for Small Hand’s big cock. Her wrists are bound together with leather cuffs and her waist and thighs are bound in black rope. Chains attached to leather ankle cuffs keep her feet from moving. He hits her with the flogger and tongue-fucks her asshole. He slides his big dick into her tight pussy and fucks her deep and hard. Ivy begs for him to fuck her ass and so he stuffs his meat inside her tight ass and fucks her until she cums. In the final scene, Ivy is bound in rope upright with her legs spread. Small Hands fucks her dripping pussy while his hands squeeze around her neck. He fucks her ass one more time, pounding it hard until he sprays his load all over her body.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Ivy LeBelle",
      "person_id": 60683
    },
    {
      "name": "Small Hands",
      "person_id": 59499
    }
  ],
  "release_date": "2019-07-19",
  "scene_id": 44610,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Tits",
    "black hair",
    "Blowjob",
    "Brunette",
    "Chains",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Domination",
    "drool",
    "Feet",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Leather Cuffs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "spit",
    "Straight",
    "Submission",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Idle Hands: Ivy LeBelle gets tied up and fucked by Small Hands"
}