{
  "collections": [
    "Device Bondage"
  ],
  "description": "Originally from the midwest, healing arts student Stacey claims her own curiosity brought her to DB. She is bisexual and likes rough sex. When she is with a woman, she prefers to be dominated, while with a man, she likes to \"rough them up,\" as she puts it. With her natural 34D breasts, Stacey is put through her paces. cyd has knowledge of many arts, although the healing type isn't one he's likely to draw on for Stacey.Stacey is hogtied on top of the bondage box with her head hanging over the edge. She's harness gagged, and [REDACTED] to arch her back, raising the level of discomfort and testing her limits. She sighs heavily, struggling as weighted clover clamps bite into her nipples. cyd allows her a brief bit of relief with a vibrator before taking up the cane to torment her stretched nipples, feet and ass. Finally, cyd inserts an asshook and rams her cunt with a dildo so hard she nearly heaves off the edge of the box.\nA minimal, but highly effective position follows, with Stacey on her back with all limbs wrapped around a pole. Stacey can only whimper through a spider gag as clamps are attached to her pussy and toes, holding her cunt wide open and vulnerable. Hot wax sprays all over her body from a spinning candle above. A vibrator hanging down brings her a screaming orgasm that leaves her heaving while the wax keeps pouring down.\nLast, Stacey is strapped to a pole, arms above. Her breasts are suctioned into the largest cylinders cyd can find. Painful clothespins are attached to her most sensitive flesh including her tongue. Stacey knows it's going to hurt when cyd rips the zipper off her in a violent pull. In the end she claims that her reaction to the torment was to get angry, which acted as a release to relieve the pain. A healing art indeed.",
  "directors": [],
  "models": [
    {
      "name": "Stacey Stax",
      "person_id": 12839
    }
  ],
  "release_date": "2007-05-02",
  "scene_id": 4461,
  "tags": [
    "BDSM",
    "Bisexual",
    "Bondage",
    "Clothespins",
    "Clover Clamps",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "Pain",
    "harness",
    "Rough Sex",
    "spider gag",
    "Straight",
    "Submission",
    "top",
    "Vibrator",
    "Zipper"
  ],
  "title": "A Healing Art"
}