{
  "collections": [
    "Sex And Submission"
  ],
  "description": "The young and bratty Jenna Clove has found herself in trouble and behind bars again. But, it’s this brats lucky day today, she’s been approved for release to a Halfway House. The Choice Recovery House greets her with bright open doors, but behind those doors lives a dark and dirty secret… Tommy Pistol. This old curmudgeon has rules and those rules come with severe punishments. Stripping Jenna down to nothing, her naked bare young body is searched for contraband. After her dirty pussy is checked out, it’s time for this little brat slut to learn some discipline. First comes out the floggers, then the gloves and hard ass spanking. Can Jenna Clove endure all this brutal punishment? Will she learn to obey these rules or get sent back to prison for more abuse. Her hands are cuffed behind her head and she endures a hard fingering and intense hitachi play which gets this dirty bird screaming. Next she is bound in rope bondage and takes more corporal punishment before Tommy takes what he really wants. A deep throat cock sucking and hard pounding fucking on his little play toy. He is intent on stretching out each and every one of her tight young holes. She begs him for anal, and he delivers a hard fucking to her ass. He clamps her pussy and tongue as she begs to cum before begging him for his hot load on her shaved pussy. Will this post-millennial jailbird learn these hard lessons today or get sent back to the slammer?",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Jenna Clove",
      "person_id": 62075
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-08-23",
  "scene_id": 44613,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brutal Punishment",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "Fingering",
    "Flogging",
    "gloves",
    "Hitachi",
    "Humiliation",
    "Latinx",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Spanking",
    "Straight",
    "Submission",
    "Vaginal Penetration"
  ],
  "title": "Halfway House Submission: Young Jenna Clove Endures Brutal Discipline"
}