{
  "collections": [
    "Sex And Submission"
  ],
  "description": "It’s the end of the world and beautiful blonde Dresden hasn’t seen a man in months. On a search for water and a place to rest, she stumbles onto the property of survivalist Charles Dera. Charles catches sight of Dresden out the window and likes what he sees. She may just have all the parts he needs. He corners her, grabs her by the throat, and gets his hands all over her young fertile body. Dresden tries to scream and asks her captor to please not hurt her. Charles grins, and asks her if she’s had any kids. When she replies in the negative, Charles knows what he must do. He brings her back to his cottage, ties her up on the floor, and flogs her tits. Dresden squirms in bondage, unable to escape this madman. But Charles soon makes it clear he’s not too interested in hurting her. His only interest is breeding her. Dresden is horrified at first, but once his words sink in, she can’t help feel aroused. She’s been alone for so long and her pussy is aching for a good fuck by a rock hard dick. She begs to suck Charles’ cock, and once granted permission, lavishes attention on his cock and balls. She takes his cock deep as he fucks her face and sucks his balls into her mouth, eager to show her captor how good of a breeding bitch she can be. Finally, Charles pushes his cock into her tight cunt. Dresden moans as Charles fucks her in doggy. She begs to cum, but Charles denies her every time. Then she’s tied in missionary with her legs spread. She cries out as Charles continues fucking her, making her take every inch of his cock. Once he can’t take the feeling of her cunt anymore, he cums on her pussy, before pushing the cum back into her with his cock and fucking her some more! Her cunt feels so good, he cums again and pushes it all back into her breeding hole. Maybe humanity has a future after all.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Dresden",
      "person_id": 58978
    }
  ],
  "release_date": "2019-08-09",
  "scene_id": 44611,
  "tags": [
    "BDSM",
    "black hair",
    "Blonde",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "Humiliation",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Inseminator: Charles Dera breeds eager blonde slut Dresden"
}