{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Krissy Lynn and Tommy Pistol had a rocky relationship. Now that it’s over, Krissy finds herself in trouble, so she goes to Tommy for help. But Tommy is fed up with her bullshit, and the lies she told to cover her cheating ways. But Krissy isn’t about to leave empty handed. She tries to steal from Tommy, but he catches her, corners her, and punishes her by tying her up, flogging her, and pounding every greedy fuckhole she has, especially her tight, perfect asshole. Krissy Lynn has met her Wreckening. Tommy first demands that Krissy take her tits out so he can manhandle them. He then moves on to the true punishment. He belts her wrists together behind her back and face fucks her. Krissy gags and chokes on his cock, getting spit all over herself. Tommy adds nipple clamps to add more pain to the punishment. He spanks Krissy, flogs her, mocks her and humiliates her. She grunts and pouts but it’s soon apparent that she’s getting off on every bit of it. Tommy puts a ball gag in her mouth then fucks her perfect, wet cunt. She screams and grinds on it, loving it and hating it at the same time. Tommy can tell she’s enjoying herself a little too much, so it’s time to move on to fucking her sweet ass. He shoves an asshook in her hole and puts a vibrator on her pussy, driving her over the edge of pleasure and humiliation. He also fucks her pussy at the same time, before working his cock straight into her ass. Krissy is a screaming ball of orgasms at this point, spitting and frothing all over the ball gag. But Tommy doesn’t stop. He puts her on her back, flogs her even more, and pounds her hungry asshole until he shoots his hot load all over her pussy. Krissy knows who her master is, now more than ever. The relationship is done, her conniving has backfired, and she lost.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Krissy Lynn",
      "person_id": 19730
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-07-26",
  "scene_id": 44612,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "fake boobs",
    "Flogging",
    "Gag",
    "Humiliation",
    "Latinx",
    "master",
    "Nipple Clamps",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "spit",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "The Wreckening: Krissy Lynn Pounded and Punished in Every Hole"
}