{
  "collections": [
    "Bound Gods"
  ],
  "description": "The lean and ripped Cody Winter returns for even more punishment at the hands of big, hairy, muscle daddy Jack Dixon. Cody’s humiliated, abused and wrecked by Jack, with spanking, flogging, an electrified ball crusher, and of course he’s face-fucked and ass-fucked by that huge fucking dick. In the end, Cody’s a fully used fuck toy, beet-red from his beatings and dripping in cum. Cody has been used by Jack before, so they get right to it with white-hot excitement. Jack orders Cody to strip, and Cody’s buck naked in an instant. Jack immediately throws Cody around and spanks his perfect ass. He swats him so much and so hard his ass is an angry red in no time. But Cody can take it and he wants more, even as he pouts and screams. Jack is a seemingly stoic dom, but his no-nonsense demeanor means there’s never any pretext, never any wasted time. He uses Cody to his liking, taking from him what he wants, when he wants it. He puts Cody on his knees and demands that he suck his giant dick. Cody struggles to get the whole thing in his mouth, but it’s the struggle that Jack likes. He insists Cody try harder, to swallow that whole cock. He then turns him around and swats his ass again. Then shoves his tongue deep in his hole, fully eating that ass, driving Cody wild. Jack’s then ready to get really serious as he slips on the black leather gloves. Cody’s blindfolded and bound on his knees, with his arms behind his back and an electrified ball crusher squeezing his balls and cock together. Jack increases the current and the pain, again and again, then flogs Cody’s ripped abs, tormenting his entire body with tingling and stinging pain. Jack eventually releases him from the rope, but binds him in leather belts, drips hot wax all over his body, face and tongue, then shoves his huge cock back in Cody’s mouth. Cody is so damn abused at this point, but Jack doesn’t let up. He flips Cody over and slams that sweet ass full of dick. He holds his little fuck toy by the belt bondage and pulls him back on his cock, fucking him hard as Cody screams through a ball gag. Finally, Jack puts Cody on the floor, to worship and suck his balls while he strokes his fat, wet cock. He shoots his hot load all over Cody’s face, then he finally lets him find release. Cody shoots his cum all over himself. It’s his reward for being so good to his master, for doing as he’s told, and for giving his body up to Jack to be used, abused, fucked, and flogged…and ultimately left wanting for more.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cody Winter",
      "person_id": 59548
    },
    {
      "name": "Jack Dixon",
      "person_id": 61576
    }
  ],
  "release_date": "2019-06-13",
  "scene_id": 44625,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "foreskin",
    "Gag",
    "Gay",
    "gloves",
    "Hairy",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "other hair color",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "Stud",
    "Submission",
    "Swallow",
    "Tattoo",
    "Uncircumcised",
    "unshaved",
    "white"
  ],
  "title": "Cody Winter Gets Thrashed and Fucked by Hairy Muscle Daddy Jack Dixon"
}