{
  "collections": [
    "Bound Gods"
  ],
  "description": "Tony Orlando stands trapped like a wild animal inside a tall metal cage, wearing only black latex shorts and a latex hood. His captor, Jason Collins saunter's into a brick room wearing blue latex pants with no shirt, showing off his tattoos and big muscles. Jason approches the cage and grabs Tony by the face. He slaps it, spits in his mouth, and tells him who's boss. Jason unlocks the cage and begins punching Tony repeatedly in the stomach while Tony says thank you and asks for more. Jason unzips Tonys tight black latex shorts and pulls out his hard cock. He attaches an electronic ring around Tony's cock and balls and sticks electronic pads to the bottom of Tony's feet and watches him writhe around as Jason turns up the electricity to full power. Jason sucks Tony's cock and slaps his chest with his bare hands. Next, Jason puts Tony in a vacuum sealed cube and slaps his ass with a leather paddle. Suspended in latex, Tony gets turned over onto his side and Jason gets to his knees to slide his big fat cock down Tony's throat and fuck it. After that, Jason straps Tony high up onto the outside of the metal cage and whips Tony's ass and back with a leather flogger until his pale skin turns pink. Finally Jason straps Tony inside the metal cage, suspended on his back with his legs spread and his asshole ready for his Master's big cock.. Jason pushes his fat cock into Tony's tight asshole and begins pounding it deep and hard. Tony enjoys Jason's giant cock so much that he blows a huge load all over himself while getting fucked. Jason sinks his cock one more time down Tony's throat and unleashes his load just before locking his captive servant back up again.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jason Collins",
      "person_id": 61577
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2019-06-27",
  "scene_id": 44627,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Cage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Gay",
    "Hood",
    "Humiliation",
    "Latex",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "other hair color",
    "Paddle",
    "Punching",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Submission",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "CAPTIVE: Jason Collins & Tony Orlando"
}