{
  "collections": [
    "Men On Edge"
  ],
  "description": "After conducting a building assessment, contractor Jacen Zhu gives his professional opinion to Sebastian Keys and Chance Summerlin. Their place is in need of a full remodel and it won’t be cheap. When Sebastian suggests a trade of some kind, Jacen refuses to accept. He needs cold hard cash. But Sebastian and Chance have other ways of making Jacen say yes. They grab him, and the boys grapple for dominance. Sebastian and Chance win the upper hand and soon Jacen is stretched out and tied atop a table. They gag him and cut his clothes off, revealing his rock hard cock. Jacen struggles to get away, but there’s no way he’s getting out of these ropes. Helpless, Jacen watches as Sebastian licks his armpits and toys with his nipples. He moans as Chance swallows his cock. His back arches up off the table as he fucks Chance’s wet mouth, seeking release. Next, Jacen is tied with his ass exposed. The boys start teasing his cock with a vibrating sleeve. When Chance starts teasing the head, Jacen is about to loose it. He begs to cum, but the guys aren’t done with him yet. They worship his beautiful feet with their mouths, and stretch open his asshole with a dildo. Jacen moans as the dildo breaches him. He can’t believe it feels so good, and it feels even better when Chance swallows his cock again. With a cock in his ass and mouth on his cock, Jacen is ready to blow, but every time he gets close, he is denied. The boys keep teasing him until finally they let him cum and he blows a fat load. Immediately they start tickling him and ask him again about cutting a deal. Jacen agrees as he thrashes around, unable to stop laughing as the boys’ fingers find all his ticklish spots.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jacen Zhu",
      "person_id": 61943
    }
  ],
  "release_date": "2019-07-23",
  "scene_id": 44629,
  "tags": [
    "BDSM",
    "Bondage",
    "Dildo",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling"
  ],
  "title": "A Deal's A Deal: Jacen Zhu Gets Taken Down and Edged"
}