{
  "collections": [
    "Bound Gods"
  ],
  "description": "Mason Lear is a tall, muscled young stud with a big, rock hard cock. He wanders into Dale Savage's dungeon, knowing he's there to serve, and knowing he's going to be punished, but unaware of exactly what's in store. Dale makes him suck his hard cock and fucks his ass while in restraints, and also employs flogging, cropping, electricity, impact play, a bar gag, and some good old fashioned discipline. When Dale first arrives, Mason is already standing at attention, at which point he knows to remove his clothes so his master can begin. When Mason is naked, and his ripped body is totally exposed, Dale starts by cropping him, and putting him in his place. He keeps Mason on his hands and knees and swats his ass and toys with his hole. He then turns him around to make him worship his cock through his leather pants. He lifts Mason up and plays with his sculpted body, punching his abs, smacking his chest, and groping his cock through his leather jock. Dale then frees that big dick from is constraints, jerking it and bringing Mason to the edge. His cock belongs to Dale, and he must do anything ordered of him. Dale jerks that cock some more, but denies Mason an orgasm, then shackles him to a leather, rotating wheel. Mason's blindfolded as Dale begins to use the electric, velvet wand on his body, sliding down his abs to his thick cock. He electrifies his dick, his cockhead, and his balls, then spins Mason onto his side and shoves his cock into his mouth. Mason sucks and chokes on that dick, as Dale orders him to focus on the head. He then props Mason back up and flogs him, still blindfolded so he can't anticipate a single strike against his body. Mason is flipped over so Dale can get at his sweet fucking ass. He uses an electrified paddle on him, causing Mason to scream like a bitch, before Dale shoves his hard cock into his ass and literally fucks him sideways. Mason is gagged and fully restrained. All he can do is grunt and moan and take the hard pounding, that thick daddy dick slamming in his ass. Ultimately, Dale releases Mason from his restraints and shoves his dick back in his mouth until he cums all over Mason's face. He stands Mason up, then works a hot fat load out of that perfect cock.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dale Savage",
      "person_id": 62015
    },
    {
      "name": "Mason Lear",
      "person_id": 60275
    }
  ],
  "release_date": "2019-06-06",
  "scene_id": 44624,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Domination",
    "dungeon",
    "Flogging",
    "Gag",
    "Gay",
    "Humiliation",
    "jock",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "Paddle",
    "Punching",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "white"
  ],
  "title": "Muscle Daddy Dale Savage Punishes Big-Dicked Mason Lear"
}