{
  "collections": [
    "Bound Gods"
  ],
  "description": "Naked and kneeling Sharok flogs himself before donning his leathers. Entering his dungeon, he picks up a zapper, and approaches a naked, collared, and caged Casey Everett. Casey is nervous to see his Master back and cries out at the zapper hits his sensitive thighs. Sharok pulls him out of the cage and locks him down on his back. Sharok wraps his lips around his boy's cock and presses his gloved fingers into Casey's mouth. Casey moans as he worships his Master's leather gloves. All he can taste is leather while Sharok primes his cock. But Casey's pleasure does not last for long. Sharok puts nipple clamps on Casey and attaches them to a pulley. He winds the device until the clamps on Casey's sensitive nipples are being stretched out in front of him. Casey screams as his nipples suffer. Sharok unzips his leather trousers and guides his hard cock into Casey's mouth. Casey takes every inch, gagging on his Master's cock as the clover clamps bite into his nipples. Next, Casey is suspended in rope bondage. Sharok flogs his abs and ass as Casey struggles helplessly. Casey cries out in pain, unable to escape the tails of Master's flogger. Finally Sharok sinks his cock into Casey's tight ass. He grips his boy's hips and gives Casey a hard pounding. Casey loves feeling his Master's fat cock stretching his ass open and begs for more cock. And he gets it! Sharok blindfolds Casey, ties his legs up in the air, and continues fucking Casey as he zaps him and smells his feet. He wraps his hands around Casey's throat and thrusts deeper and deeper into his ass with every stroke. Then he blows a fat load into Casey's open mouth before locking Casey's cock up and walking away.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Casey Everett",
      "person_id": 60450
    },
    {
      "name": "Sharok",
      "person_id": 62054
    }
  ],
  "release_date": "2019-06-20",
  "scene_id": 44626,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Cage",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Feet",
    "Flogging",
    "Gay",
    "gloves",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Nipple Clamps",
    "Pain",
    "Punching",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Suspension",
    "white",
    "Zapper"
  ],
  "title": "My God Sharok: Casey Everett Worships New Leather-Clad Master"
}