{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "We're excited to share this video, another great domination clip with an authentic submissive sex slave: Rose Red Tyrell. She's addicted to long and thick cock pounding her fuck holes rough and deep. She also loves anal sex. You should hear her brag about it. She truly is a dream come true and will gladly endure the constant orgasms she's given. Her new Master wants to explore his new slut's asshole in their first BDSM session together. She's cuffed to a crate on her back, creating easy access to both of her pink holes. The torment begins with a deepthroat blowjob, slaps used to make her take his dick the way he likes. She's a good whore. She gladly bobs her head on his meat, loving every drop of spit rubbed all over her face. His cock is lubed up and ready to wreck her pussy and ass. She did say she wanted a challenge. She's flipped over into the doggy position for more deep penetration. He's so impressed by her, he takes turns on Red's mouth and quivering pussy for intense rough fucking. He doesn't hold back, shoving every inch of his dick deep in. When he needs more spit, he makes her clean his dick off with her lips, tongue and throat. She's getting tired but takes it all. Her Master loves pulling out to see her asshole gaped and trembling.",
  "directors": [],
  "models": [
    {
      "name": "James Kickstand",
      "person_id": 48660
    },
    {
      "name": "Rose Red",
      "person_id": 53699
    }
  ],
  "release_date": "2019-05-16",
  "scene_id": 44623,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Chains",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Female Slave",
    "Hair Pulling",
    "High Heels",
    "Latin",
    "Leather Cuffs",
    "master",
    "natural boobs",
    "Nipple Torment",
    "PIV",
    "Redhead",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "spit",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "thirdparty",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "BDSM Slut Rose Red Tyrell Endures Rough Anal Sex"
}