{
  "collections": [
    "Men On Edge"
  ],
  "description": "It’s July 4th and Zak Bishop is getting ready for a BBQ party with some friends. Preparations complete, Zak dozes in the hot sun near the pool as he waits for guests to arrive. As he snoozes, Brodie Ramirez and Sebastian Keys peek over his wall. These two horny creeps are looking for some fun and Zak’s backyard looks as good a place as any to party on Independence Day. They sneak up on Zak and shake him awake! Zak is startled and ends up stripped and tied up in his own pool. He struggles to get away, but once Brodie starts sucking on his cock, the only thing Zak has on his mind is cumming. Brodie jerks his cock, and teases it with his devilish tongue. Zak begs Brodie to suck him off, but Brodie has other plans. He and Sebastian push a fuck sleeve down on his cock and Zak almost blows his load then and there. He thrusts his hips in it’s fleshy tightness, desperately seeking release, but Brodie pulls it away at the last minute, leaving his hard cock aching for more. Next, they tie him up inside and stuff his mouth full of hot dogs. Mouth full of meat, Zak is helpless as Brodie strokes his cock and sucks his toes. He trembles all over as he gets closer and closer to cumming, but the festivities are not over yet. Sebastian grabs the flag pole and shoves it in his tight asshole. Zak moans around the hot dogs in his mouth, drool pooling on the counter as the two strangers fuck his hole and smack his ass red. Finally, they flip him over and jerk him off. Zak blows a huge load all over himself. Brodie and Sebastian dress up his weiner with a bun and condiments, and leave him there, tied up for his party guests to find.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Zak Bishop",
      "person_id": 61162
    }
  ],
  "release_date": "2019-06-25",
  "scene_id": 44628,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "drool",
    "Edging",
    "Gay",
    "Humiliation",
    "july 4th",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling",
    "white"
  ],
  "title": "Holiday Hole: Zak Bishop Gets Stuffed On The 4th of July"
}