{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Maya Kendrick loves stories. That's why she's taken a publishing job with the demanding and cold Ms. Lianna Lawson. Ms. Lawson is never happy with Maya and can't even remember her name. When Lianna demands Maya stay late at work reading a borderline pornographic and bondage themed manuscript, Maya can't help but draw comparisons to her relationship with her boss. Exhausted after a busy day of keeping Ms. Lawson happy, Maya falls asleep at work and wakes up tied to a bed, clad in latex, with her hot boss flogging her! Maya never imagined a flogger would feel so nice, but each hit with the flogger makes her pussy wetter and wetter. Soon, Ms. Lawson is spreading her ass to get a good look and taste of her pretty pussy. Maya moans as Ms. Lawson fingers her hungry cunt. She cums hard as her boss plays with her pussy and is soon put to work! Maya worships Lianna's latex skirt and her perfect ass. Lianna moans as Maya's eager tongue laps at her asshole, and soon spins around to let Maya suck her cock. Maya devours her boss' hard cock, sucking it until Lianna decides to fuck her. Maya moans as Ms. Lawson's cock pushes into her tight cunt. She gets pounded by her boss and screams in delight as her boss takes her pussy and her asshole. But when Lianna mispronounces her name yet again, Maya has had enough. She pushes Lianna off her and decides it's time to give her boss a taste of her own medicine. Maya straps on a hard cock and fucks Lianna ass hard! Lianna moans as Maya fills up her ass and gives her a good deep dicking. She didn't know Maya had it in her! When Maya starts fucking her with a glass dildo, Lianna cums hard all over her latex gloves.",
  "directors": [],
  "models": [
    {
      "name": "Lianna Lawson",
      "person_id": 62014
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2019-08-26",
  "scene_id": 44639,
  "tags": [
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cock Worship",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Flogging",
    "gloves",
    "Latex",
    "natural boobs",
    "Role Play",
    "shaped",
    "slim",
    "Straight",
    "switch",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Caged Heat: Maya Kendrick turns the tables on her boss Lianna Lawson"
}