{
  "collections": [
    "TS Seduction"
  ],
  "description": "Many women these days are finding themselves with a calling to the cloth. Their lives are full of sin and desire and a holy guidance has called them to repent. The stunning Natalie Mars has found herself in this dire situation. A life of sin has her repenting and praying. However her carnal desires and wicked thoughts are taking control again. Father has noticed and is here to cleanse her of this filth. Dressed in tight latex religious habit and veil sister Natalie Mars prays and prays, begging to understand this guidance, but father has another punishment in mind. A brutal corporal punishment is delivered on Natalie's tight body. Flogging, caning, bible spanking, electric zapper, turns her soft white skin bright red. Father uses the bible to punish her tight ass. Her cock in chastity takes a flogging which gets her screaming and thanking the lord. Sister Natalie is stripped naked except for her latex veil and is tied up in restrictive rope bondage. Father continues to punish the lord into this sinner. It's now time to fuck the carnal desires right out of her. Starting with a chocking, sloppy deep throat cock sucking, Natalie spits and gags all over Father's rock hard cock. Next is a brutal ass fucking. Natalie's tight asshole takes a deep anal pounding by Father as she licks and worships his boots. His hands around her neck as he chokes the sin right out of her. This holy sister is truly saved.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "H3ll4SL00tz",
      "person_id": 61686
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2019-07-16",
  "scene_id": 44633,
  "tags": [
    "Anal",
    "Blowjob",
    "Bondage",
    "Boot Worship",
    "Brunette",
    "Caning",
    "Chastity Play",
    "Cock Worship",
    "Corporal Punishment",
    "Flogging",
    "Latex",
    "Male Fucks TS",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Slapping",
    "slim",
    "Spanking",
    "Straight",
    "Tattoo",
    "TS",
    "white",
    "Zapper"
  ],
  "title": "Thank You Father: Sister Natalie Mars Suffers for Her Desires"
}