{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Beef cake Draven Navarro eagerly arrives to interview for Cherry Torn's personal assistant. Draven hopes to make a good impression and starts listing his qualifications. Cherry sizes Draven up instantly. He's another stupid ass kissing, annoying man who's only good for one thing, her amusement. She makes Draven strip in front of her so she can get a good look at his body. She runs her hands along his toned chest and pinches his nipples hard. Draven moans as Cherry tells him she can see exactly why Todd down the hall recommended him. He's a hunk of eye candy, a slab of meat, too stupid for office work but perfect to use as a toy. Cherry tells Draven to get on his knees and kiss her shoes. Draven eagerly complies, running his tongue over her shiny black heels. He takes off her shoes upon command and worships her stocking clad feet. Cherry laughs as she stuff her feet in his mouth and makes Draven choke on them. Then she takes Draven over her knee and gives his perfect bubble butt a firm spanking. Draven squirms in her lap, kicking his feet, as Cherry lays into his ass. Next Draven is tied in rope bondage. Cherry crops his ass, thighs, and chest as Draven moans. Cherry knows what sluts like Draven crave. She pushes her cock into his tight asshole and fucks him as Draven thanks her profusely. Once she's had her fill, she binds him in leather, puts a long zipper down his front, and rides his face. She cums hard and then decides it's time to test out his cock. She laughs as she slides onto it, watching as Draven struggles to keep still. Draven writhes beneath her as Cherry rides his cock to orgasm. He screams as Cherry rips the zipper off his tender skin. Draven begs to cum but Cherry isn't having it. Every time he gets close, she pulls away. Finally, she lets him blow his load and feeds it to him. She leaves him on the floor of her office as she goes back to work.",
  "directors": [],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Draven Navarro",
      "person_id": 59640
    }
  ],
  "release_date": "2019-10-08",
  "scene_id": 44638,
  "tags": [
    "BDSM",
    "Big Tits",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "High Heels",
    "Humiliation",
    "Leather",
    "Male Sub",
    "mixed",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "shoe licking",
    "shoe worship",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Tattoo",
    "toned",
    "white",
    "Zipper"
  ],
  "title": "Office Boy: Cherry Torn's New Stupid Beefy Boy Toy"
}