{
  "collections": [
    "TS Seduction"
  ],
  "description": "Dressed in all latex, the beautiful Chelsea Marie has Pierce Paris naked and on his knees. He licks Chelsea’s hard cock through her tight red latex skirt. She sits down and kicks her feet up onto her black leather couch and tells Pierce to worship her feet. He takes off her high heel shoes to lick, suck, and sniff Chelsea’s toes. Paris tries his best to put her whole foot into his mouth. She has him lie on the floor, on his back, and she squishes and stomps on his big cock with her bare feet. Next she has him get on all fours and repeatedly punches him in the balls, stroking his cock in between the punches. She shoves both of Pierce’s balls in his own asshole, grabs his hard cock and punches it. She pulls out her cock and Pierce reacts quick to please his Mistress. He deep throats her big cock while she slaps him in the face with her latex gloved hands. After that, she takes her latex covered hand and shoves her whole fist inside Pierce’s asshole and fucks him wrist deep. Still on his hands and knees, Chelsea grabs his cock from between his legs, bends it towards her face, and sucks his fat dick from behind. She slides her cock into Pierce’s ass and fucks him deep and hard, slapping her own asshole with his cock while she fucks him. She pulls her cock out and shoves Paris’ balls back into his own asshole. She shoves her cock back in and fucks his ass with his balls still inside. She flips him over to fuck Paris with his legs spread and she fucks the cum right out of him. So turned on by seeing his fat load, Chelsea cums all over Paris’ cock and balls.",
  "directors": [],
  "models": [
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2019-09-03",
  "scene_id": 44636,
  "tags": [
    "Anal",
    "Bareback",
    "big dick",
    "Blonde",
    "Blowjob",
    "brunet",
    "Cock Worship",
    "Feet",
    "Fisting",
    "Latex",
    "Leather",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Role Play",
    "shaved",
    "Slapping",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "tea2020",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Sexual Chemistry: Chelsea Marie Tops Pierce Paris"
}