{
  "collections": [
    "TS Seduction"
  ],
  "description": "New Girl, Ella Hollywood is bound in rope bondage, standing with one leg suspended and her arms tied behind her back. She’s wearing a fence-net body suit and a latex corset with a bright red ball-gag in her mouth. With her cock already hard, she waits for her Dom, Sebastian Keys to come have his way with her. She was caught pleasuring her cock and Sebastian is punishing her for being a greedy whore. He spanks her ass and explains what she’s done wrong. He pinches her pierced nipples and slaps her tiny tits. He jerks her hard cock and then gets on his knees and sucks it. Sebastian whips Ella’s hard cock with a leather flogger. He turns her around flogs her ass and back. He puts the flogger down and picks up a violet wand; an electric glass toy that electrifies the skin when dragged across it. He turns it on and drags it down Ella’s tits and it buzzes and sparks. The glass wand makes its way down to her ass and Sebastian turns it off and slides it inside her hole. He flips the switch back on and blue sparks shoot out of her asshole. Her eyes get wide and she screams as Sebastian fucks her with the electrified glass. In the next scene, Ella is on all fours on top of a leather padded box. She pleasures Sebastian’s cock and he slaps her ass while he fucks her face. He tells Ella to turn around and he rips a hole in her fence net suit to get access to her pretty little asshole. He shoves his cock inside of her and fucks her hard. He turns her over and fucks her asshole while he strokes her aching dick. She cums hard from the hard fucking and Sebastian shoots a fat load on her tits and cock.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Ella Hollywood",
      "person_id": 61985
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2019-08-13",
  "scene_id": 44632,
  "tags": [
    "Anal",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Corset",
    "foreskin",
    "Gag",
    "Latex",
    "Leather",
    "Male Fucks TS",
    "natural boobs",
    "Pierced Nipples",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "tea2020",
    "top",
    "TS",
    "versatile",
    "Violet Wand",
    "white"
  ],
  "title": "Sluts Get Fucked: New Girl Ella Hollywood Fucked by Sebastian Keys"
}