{
  "collections": [
    "TS Seduction"
  ],
  "description": "Gorgeous Model Natassia Dreams shows up for a job her agent booked for her. Dressed in tight latex dress, her curves are perfectly accentuated and her feet in high heels show off her arches. When she arrives, this place isn't what she signed up for. This dump doesn't even have a vanity or makeup artist. What is she supposed to do, and this creep is leching on her big time. Well she is a professional and will do the job she is being paid for. The artist Jonah Marx gets to work, wasting her valuable time. She demands to see this masterpiece. What is this garbage! That's it, she has had it. She strips this loser down naked and bends him over her knee. He needs to be taught a lesson and hard corporal ass spanking is where this begins. After his ass turns bright red, it's time for him to kiss her ass. She strips naked and exposes her perfect round ass and tight asshole. He goes to town eating that ass. She turns around and shoves her rock hard cock down his throat next. Throwing him on the floor they go at it in 69, she takes his hard cock down deep throat. After getting hard and wet, she flips him over and pounds his ass. Deep anal fucking gets Jonah rock hard and ready to shoot a huge load all over Natassia's huge tits. But, not before Natassia covers his face in cum. Now that is a masterpiece.",
  "directors": [],
  "models": [
    {
      "name": "Jonah Marx",
      "person_id": 51893
    },
    {
      "name": "Natassia Dreams",
      "person_id": 16310
    }
  ],
  "release_date": "2019-08-20",
  "scene_id": 44635,
  "tags": [
    "Anal",
    "Athletic",
    "Black",
    "Blowjob",
    "bottom",
    "Brunette",
    "Cock Worship",
    "fake boobs",
    "Feet",
    "High Heels",
    "Latex",
    "Male Sub",
    "muscular",
    "Role Play",
    "shaped",
    "Spanking",
    "Straight",
    "Tattoo",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "The Sketch Artist: Model Natassia Dreams Punishes Pathetic Creep"
}