{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "There you are, lucky pet. Your Mistress Robin Ray has a surprise for you, she knows you’ve been very eager to see her. She parts her legs to reveal a long dildo hanging from her strap-on harness. She’s dressed head-to-toe in shiny latex with a corset gripping her perfect body but all you can look at is that giant cock. It’s a little sad just how much smaller your own dick is in comparison to Mistress Robin’s. And now, you’ve gone ahead and begun to stroke your pathetic excuse for a cock without permission! Bad boy. Now watch as Robin strokes her cock and do exactly as she says, make your hands exactly like hers as you rub your puny dick. That’s right stroke it nice and slow to feel every little bit of sensation. Now that Robin is watching you watching her she can’t decide if you like her or her cock more. She realizes your hungry for her cock and that you can’t fucking wait to get your mouth on it. You’ve been outed as the little whore that you are, a cock hungry whore. Now she’s gonna make you say it while you stroke your dick, “I’m a cock hungry whore”. Just imagine you’ve got the tip of her cock in your mouth , just the tip, and that you’re swirling your tongue around just the head of her dick. Now, let’s see how far you can slide Robin’s cock down your throat, a little? Or a lot? Don’t you just love the taste of her cock? Remember to keep it nice and wet as you suck it. Keep going, good. Stroke a little faster now. That’s good. It turns Mistress Robin on so much to watch you suck cock. Before you know it you’re going to be begging, day and night, to suck her cock over and over again. The only thing that you can do to make her happy is sucking cock. Still stroking her thick long dick she goes on about how much feeding her cock to you is the only thing that makes her happy and therefore your only purpose in life is to be a cock hungry whore. And if your mouth goes dry while you’re sucking her cock she’s going to shove her dick so deep down your throat that you’ll fucking choke on it.",
  "directors": [],
  "models": [
    {
      "name": "Miss Robin",
      "person_id": 61370
    }
  ],
  "release_date": "2019-05-16",
  "scene_id": 44631,
  "tags": [
    "Big Toy",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Chastity Play",
    "Corset",
    "Cuckolding",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Femdom",
    "Fetish",
    "JOI",
    "Kinky",
    "Latex",
    "Leather",
    "natural boobs",
    "POV",
    "harness",
    "Straight",
    "Strap On",
    "Partner Studio",
    "white"
  ],
  "title": "KINKY JOI: Robin Ray's Blowjob Training"
}