{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Completely naked and suspended with black rope and leather wrist cuffs, Rick Fantana waits at the mercy of his Mistress Kara’s hand. Kara, looking very dominant in her fishnet stockings, short black skirt, and long black latex gloves, takes her time to torment her submissive. She explains to him that she’s owns him. She punches his chest and squeezes his cock and balls. Kara makes him taste his own pre-cum through his ball-gag. She puts him in a headlock and squeezes his neck. Mistress Kara attaches a tens unit to Rick’s thighs and turns up the voltage. Rick moans through the ball-gag from getting electrified. Kara places a Sybian machine underneath Rick’s ass and lowers him onto it as he gets zapped from the tens unit. His asshole gets lowered onto the dildo attachment on the Sybian and once its deep in his ass, Kara turns the power on. She makes him fuck it as she hits him with a riding crop while laughing and humiliating him. Next, Mistress Kara uses black rope to strap Rick to a device that keeps him secured in a doggie-style position. Kara holds a flogger in each hand and whips Rick’s ass until it turns pink. Kara wears her strap-on with a huge dildo dangling from it, ready for Rick’s ass. After she finishes flogging him, Kara makes Rick suck her dildo to get it nice and wet for his asshole. She shoves her fat dildo deep into his ass and fucks it. Next, Rick is on his back with his legs spread with a dildo gag in his mouth. Kara shoves five big metal anal beads up his ass. She teases his cock then sits on his face and fucks the dildo-gag. She smother’s his face with her ass and pussy while she fucks the dildo-gag. She uses an Hitachi vibrator pressed on her clit and cums hard while Rick starves for air below her. As a reward for good behavior. Kara rips out the anal beads and fingers his asshole while she jerks his cock, sending his load flying into his own face as he cums.",
  "directors": [],
  "models": [
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Rick Fantana",
      "person_id": 59599
    }
  ],
  "release_date": "2019-07-30",
  "scene_id": 44637,
  "tags": [
    "Athletic",
    "BDSM",
    "Bondage",
    "brunet",
    "Brunette",
    "CBT",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "gloves",
    "Hitachi",
    "Humiliation",
    "Latex",
    "Leather",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "Slave",
    "Straight",
    "Sybian",
    "Tattoo",
    "Tens Unit",
    "Vibrator",
    "white"
  ],
  "title": "Mommy's Little Fucktoy"
}