{
  "collections": [
    "Hogtied"
  ],
  "description": "Kate begins in a brutal predicament tie with all of her weight resting on her knees. Her hands are box tied behind her, and her ankles pulled up to ensure she is balancing on her knees. A gag is shoved into her mouth, then multiple nipple clamps are added to each nipple. This is more than enough for the average model, but The Pope insists on making her suffer more by adding weights to the clamps. Then he starts the impact with a blunt thud like pain, just like she said that she enjoyed. Next, we have Kate in a side suspension with one leg all the way up to open her honey hole for everything that he has in store for her. He begins by caning her clit, then moves around to other sensitive places. Her feet, legs, ass, and nipples all get the cane before he moves back to her clit for more suffering. Next, her outer labia is clamped and then spread wide and taped to her leg. A dildo is shoved inside of her pussy, and then a vibe is added to make this slut orgasm uncontrollably. In the final scene, she is face down and her ass in high in the air. The impact begins, and we see her body shake every time he strikes her with his flogger. After several minutes of severe beatings, she is fucked and vibed again into multiple orgasms before he finally leaves her alone.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kate Kennedy",
      "person_id": 61558
    }
  ],
  "release_date": "2019-07-03",
  "scene_id": 44654,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "multiple orgasms",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "Weights",
    "white"
  ],
  "title": "Kate Kennedy is Brutalized in Extreme Bondage and Made to Cum"
}