{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "The beautiful blonde bride to be Ella Nova looks stunning in her wedding dress that her husband's best friend Rob Piper just brought over. But, Rob also brought over the rest of the groomsmen. It's tradition amongst these boys for the 5 of them to fuck each other's fiancee's before the special day. Today it's bride slut Ella Nova's turn. Stunned by what Rob Piper just told her, the other men come in the room and forcefully overcome Ella. She screams and begs with the men to let her be a pure bride, but this isn't how the family works. Her broken heart feels dead with the thought of how she will fuck each of these hard men for before her special wedding day. The men tear off her dress and use it to blind fold her. Each of them shove their hard cocks down her deep throat. She gags and begs and begs for them to stop and then begs for more! They tie her up in restrictive rope bondage and continue to fuck the slut bride. Suspended in rope bondage they each take turns fucking her wet pussy and tight asshole. The deep anal gets her screaming and gagging on cocks. They slap her tits and she begs for more domination. The men throw her on the bed and fuck her air tight. Hard huge cocks in her ass, pussy and mouth. They all fuck her soo hard with double penetration she cums on all of them. She begs them to paint her face white for a traditional wedding and each thick man drains their cocks full of cum all over her face. This will be a special day to remember.",
  "directors": [],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2019-07-24",
  "scene_id": 44659,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blindfold",
    "blond",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Double Penetration",
    "Gangbang",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Bride Slut: Ella Nova Takes 5 Hard Cocks Right Before Her Wedding Day"
}