{
  "collections": [
    "Hogtied"
  ],
  "description": "Gina Valentina begins in a standing position with her arms box tied behind her. She has been here before and knows what to expect, but that doesn't lighten the blow at all. She knows exactly what The Pope is capable of doing, and that has her a little on edge. He enters and goes straight for her nipples, which has Gina wincing in pain as he squeezes them. Her flesh falls prey to his leather flogger and hands as he inflicts pain and suffering on our little Gina. The Pope then ties one of her legs up to the rig so that he can enjoy her sweet pussy and not be disturbed by her trying to close her legs. Next, he adds a stocking over her head, which is then tied up too. Now she is completely helpless, and The Pope assaults her pussy with finger banging and a magic wand. She begs for him to stop and screams at the top of her lungs when he makes her cum even more. Next, we have Gina in a hogtie suspension with her arms held out with bamboo. She has to endure nipple torment, as well as bastinado until she can no longer take the pain. Her\npussy is vibed until she can no longer handle her orgasms. Next, we have her on the floor with one leg tied to a wooden column, and the other pulled as wide as we could get them. Her arms are stretched and restrained away from her body, and now The Pope can have his way again. He enters with his cat-o-nine tails and wreaks havoc on her flesh with unforgiving strikes that instantly turn bright red. Next, there is the cane, and Gina cannot stop screaming in agonizing pain. Before he finishes with her, he fucks her pussy and throat to overload her even more. The day still isn't over for our little slut, because The Pope is not going to stop until Gina is completely wrecked. She is tied to the rig and sat atop the sybian. He turns it up quickly, and we get to see Gina succumb to her orgasms.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Gina Valentina",
      "person_id": 58814
    }
  ],
  "release_date": "2019-07-18",
  "scene_id": 44655,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "mixed",
    "natural boobs",
    "Nipple Torment",
    "Pain",
    "Rope Bondage",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "Sybian",
    "The Pope",
    "top",
    "Vaginal Penetration"
  ],
  "title": "Brazilian Slut Gina Valentina Endures Brutal Torment in Bondage"
}