{
  "collections": [
    "Device Bondage"
  ],
  "description": "We begin with Hadley in a sitting position with one leg pulled up and the other pulled down. Her arms are spread at her sides and held in place with leather straps tightly fastened to a metal pipe. A bright red gag keeps her mouth open as the drool pours out like a slow waterfall. She writhes around in anticipation at what The Pope has up his sleeve. He begins by applying nipple clamps that are tied to the pipe. Next her pussy gets some attention from the crop before he puts his fingers inside of her hungry pussy. Orgasms pour out of her faster than the drool from her mouth. Next Hadley is put in a pile driver position with her wrists locked in metal shackles, and her ankles held in place with metal traps. The Pope makes his entrance and this time he has a cane in his hand. He begins to warm her flesh with the cane, when suddenly we see Hadley smile as he strikes her pussy. The pussy torment continues, along with more caning of her body, and then to her feet. He goes back and forth between pleasuring her pussy and tormenting it with the cane. Next he fucks Hadley’s mouth and her pussy, making her cum uncontrollably. Her eyes roll back into her head from all of the orgasms she is made to have. Ultimately she’s face down on the floor with a wooden wedge insisting that her ass stay up and her pussy exposed. She is blindfolded and then he uses the zapper to toy with her. The vibe is brought back out and this time The Pope spanks her as she builds up to her final orgasms. Hadley is finally allowed to cum, and she explodes with ecstasy as her pussy cums over and over again.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Hadley Mason",
      "person_id": 60241
    }
  ],
  "release_date": "2019-08-22",
  "scene_id": 44650,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "drool",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Nipple Clamps",
    "Straight",
    "Submission",
    "The Pope",
    "white",
    "Zapper"
  ],
  "title": "Playful Creature: Hadley Mason"
}