{
  "collections": [
    "Device Bondage"
  ],
  "description": "Whitney Wright is a hot brunette, with a perfect ass, beautiful eyes, and a gorgeous body all-around. We find her in a standing position, with a ball gag shoved in her mouth, and her body wrapped in a straitjacket chained to the ceiling. In this position, all she can do is squirm when The Pope enters and begins assaulting her exposed ass with the flogger. The sudden whipping seems to surprise Whitney, and she appears hesitant at first, but she dives in fully, taking the beating beautifully. She’s spanked in between floggings, until her ass is a brilliant shade of red. She gets her wet pussy teased just a bit, before the crop comes out. At this point her pussy is utterly wet. Her bare legs and her sweet cunt get cropped and slapped, while she pouts and squirms, though she does her best to remain in place. Soon, the real torment begins. The Pope cracks out the vibrator and holds it against her sensitive clit while finger fucking her. Whitney can hardly contain herself as the orgasms come one after the other. She lifts her feet off the floor, briefly finding herself completely suspended in the straitjacket. Whitney is then put into another position, chained to the ceiling again, but also bound to a wooden table by pipe bondage. She has clamps and clothespins attached to her sensitive nipples, and punishing rubber bands wrapped around her feet. The Pope snaps the rubber bands to send shocks of pain through her body, while the clamps and clothespins give pain to her upper body. She’s then subjected to the vibrator yet again, eliciting even more orgasms as she revels in the pain and the pleasure. The confusing signals drive her wild as she begins bucking like a bronco with every orgasm. Whitney is then placed on her back with her ankles in pipe bondage, held high with her legs spread wide. Her fully exposed, naked, beautiful body is flogged hard, her nipples are pinched and tormented, and her clit is worked hard as her pussy is fucked with a dick-on-a-stick. Whitney can hardly contain her reactions at this point, especially when the vibrator is applied to her clit once again. Whitney becomes a thrusting, cumming pile of orgasms, squirming on all the toys and implements The Pope uses on her. She has overcome that initial hesitation, and has exposed herself as the sexy little pain slut we always knew she was.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Whitney Wright",
      "person_id": 61018
    }
  ],
  "release_date": "2019-10-03",
  "scene_id": 44653,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Bondage",
    "Brunette",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Feet",
    "Fingering",
    "Flogging",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "Petite",
    "Rope Bondage",
    "slim",
    "Spanking",
    "Straight",
    "Straitjacket",
    "Submission",
    "The Pope",
    "Vaginal Penetration",
    "Vibrator",
    "Whipping",
    "white"
  ],
  "title": "Whitney Wright: Sexy Slut Begs to Suffer in Grueling Bondage"
}