{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Our newcomer Giselle Palmer begins with a sensual strip tease. Soon after, she show us more of her all natural body, and she is breathtaking. She slides her panties off to the side, and we get to see her pussy as she starts to masturbate with the magic wand. Her legs spread wide as she she gets comfortable and lets multiple orgasms escape her pussy. It's now time for the first machine and Giselle is a little nervous, but she's also very excited about what is about to happen. She settles in and we slide the machine into her pussy. The speed slowly increases and we start to get a smile from her as it slides in and out of her. She adds a vibe to the equation and the orgasms start to pour out. Giselle cannot\nbelieve that a machine can make her cum so hard. Next we have her standing above the\nCrystal Palace, so she slides the dildo inside of her pussy and we begin the next scene. We\ndon't waste any time getting the machine up to speed to start ripping orgasms out of\nher. Her knees grow weak, but that doesn't stop her pussy from cumming over and\nover. She finally has had enough and has to sit down from all of the orgasms. In the final\nscene we have her on her back and this time with the most powerful machine that we\nhave. We get started and ramp up the speed to her limit, and the orgasms come just as fast. We fuck our newcomer as hard and as fast as we can until she can no longer take it to ensure total satisfaction.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Giselle Palmer",
      "person_id": 60276
    }
  ],
  "release_date": "2019-07-31",
  "scene_id": 44656,
  "tags": [
    "Blonde",
    "Curvy",
    "Dildo",
    "Machine Dildo",
    "multiple orgasms",
    "natural boobs",
    "Straight",
    "The Pope",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Fresh Meat: Giselle Palmer Cums Repeatedly on the Machines"
}