{
  "collections": [
    "Device Bondage"
  ],
  "description": "There are certain days when it’s clear that you’ve found a model capable of handling everything you throw her. This is one of those days. And Keira Croft is one of those models. Keira is standing with her wrists and neck in steel traps and she is gagged. The Pope is very aware of what type of slut he has at his disposal, and he plans to use her to her full potential. He begins with testing her with brutal nipple torment, and we see her wince from the pain, then her eyes roll back and she smiles from the sensations. Her ass is spanked and her pussy starts to drip, then the flogger is introduced and she is beaten in a devastating manner. There is more torment before she is made to cum, and when she does, she squirts all over the floor. Next, Keira is in a doggy type position with her elbows on the floor and her ass high up in the air. Now it’s time for some caning, and The Pope makes sure that she knows how sadistic this little device is. He uses it on her legs, tits, rib cage, and her feet. Then he cracks out the knitting needle and shows her pain that she was unaware even existed. He then finally attacks her pussy with a dildo shoved deep inside of\nher, and she reciprocates with more squirting orgasms. The final scene begins with Keira\non her back with her legs spread wide. The Pope remembers that she said she loved\nbreath play, so he obliges her with a plastic bag. The rest of the day is spent controlling\nher breath and pushing her limits.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Keira Croft",
      "person_id": 62001
    }
  ],
  "release_date": "2019-09-05",
  "scene_id": 44651,
  "tags": [
    "BDSM",
    "Bondage",
    "Cage",
    "Caning",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "dungeon",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "Nipple Torment",
    "Pain",
    "Pain Slut",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope"
  ],
  "title": "Keira Croft: Pain Slut Gets Destroyed & Squirts Everywhere"
}