{
  "collections": [
    "Hogtied"
  ],
  "description": "Alexis Tae is young and very eager to have The Pope use her. She starts out with a huge grin, and she's so happy to be here that the smile never leaves her face. We begin with Alexis in a standing position with her hands box tied behind her. The Pope enters and inspects his new toy as she helplessly squirms under him. Her smile shows her enthusiasm, but it also conveys her anxiety about what's to com. She is spanked and slapped, and her nipples are tested, to see exactly what makes her squeal. The flogger turns her flesh a bright red, and the clamps on her nipples makes her grin even more. When The Pope adds more rope to the mix, making her totally helpless, and imposes orgasms on her, her smile starts to fade, replaced by pure excitement and ecstasy. Scene two opens on Alexis and her amazing ass. She is in a single point inverted suspension, designed to accentuate her perfect butt. A full out assault is launched on her ass with spankings and floggings, then she is rotated and her front side gets the same treatment. At this point The Pope is wondering what this beauty looks like with a huge cock in her mouth in this position. Alexis' throat and pussy get fucked mercilessly and the orgasms pour out of her. The final scene begins and our little slut is in a complex ground tie, leaning toward a partial suspension. A few more pieces of rope are added and then the bastinado begins. At this point Alexis is still smiling, but when The Pope introduces her to his needle, we finally see her suffer without a smile. This only makes her pussy wetter. After this excruciating pain, the final orgasms are ripped from her pussy. She's a sweaty mess by the time The Pope has finished with her, but this little slut has suffered beautifully.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Alexis Tae",
      "person_id": 62033
    }
  ],
  "release_date": "2019-08-01",
  "scene_id": 44652,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "Pain",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Alexis Tae's First Time Being tormented in Grueling Bondage"
}