{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Today’s the day Jenna Clove has prepared for. Every cock she’s taken and all the hours of training have led her here. She sits naked and collared before her Master and his friends, ready prove she deserves to keep that collar. Johnny Goodluck introduces his slut to his friends and commands her to present her body. Soon Jenna is on her knees surrounded by five horny men and their hard cocks. She takes the first cock in her mouth and two more in her hands, eager to prove she’s a good slut. The boys take turns fucking her pretty face as Jenna struggles to satisfy them all. She gets spit on and manhandled and she cums hard as they finger fuck her wet cunt. Then she’s tied on her knees as the boys continue to fuck her face and play with her pussy. Her mouth gets used by everyone and soon the boys turn their attention to her other holes. She’s tied in pile driver as Johnny and his friends take turns stuffing her cunt. Jenna loves being fucked full of cock and getting fucked so good makes her scream and beg to cum. With permission, Jenna cums hard over and over again as the boys fuck her before they decide it’s time to double stuff this slut. They stretch open Jenna’s pussy and ass on their cocks and soon Jenna is airtight, with a cock in each of her holes. She cries out as their cocks pound every hole, making her a messier, sloppier slut by the second, as she begs for more and squirts all over herself. They continue plowing her open and ripping orgasms from her cunt and ass as she screams in delight. Finally, she gets five fat loads all over her face. This good slut gets to keep her collar… for now.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Jenna Clove",
      "person_id": 62075
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    },
    {
      "name": "Rod Jackson",
      "person_id": 62024
    }
  ],
  "release_date": "2019-07-10",
  "scene_id": 44660,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Collar",
    "Corporal Punishment",
    "Double Penetration",
    "foreskin",
    "Gangbang",
    "master",
    "mixed",
    "muscular",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Slave",
    "spit",
    "Straight",
    "Stud",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "The Good Slut: New Slave Jenna Clove Gets Stuffed Airtight"
}