{
  "collections": [
    "Families Tied"
  ],
  "description": "Angel Allwood is a hot blond MILF determined to teach her teen stepdaughter how to work hard and bring home a paycheck. She brings her petite little ditz of a daughter in to work at her office for dominant Mr. Rob Piper. Angel has been serving Rob Piper on the side as a voracious submission slut for years and promises him that having Zoe working as an intern for the summer won't reduce office productivity or Rob's access to her gorgeous ass.\nAngel is wrong on one count: Zoe is ultimately hapless, and within the first 30 minutes in the office has misplaced papers, spilled coffee on the reports, and treated Mr. Piper with great disrespect. Angel places Zoe on filing duty and marches back into Rob's office to convince him to give Zoe one last chance by offering to take punishments for her stepdaughter's misdeeds. There is a lot to pay for, and Angel finds her big tits clamped tightly and her ass in the air for a severe and brutal paddling. With her juicy ass red with welts, Angel begs to serve Rob's cock, but he isn't done yet, cropping, flogging and spanking her until she cums rubbing her own cunt like a whore. Thrown on her knees, she sucks his huge cock lustfully and offers her wet pussy for a deep fucking on his desk. Orgasming with his cock in her tight snatch isn't enough for Rob, so he handcuffs her ankles and wrists together in a helpless doggy position so he can take his time ravaging her ass with a punishment anal fucking. Electro zapped, and made to cum; Angel grovels and begs to orgasm with his dick deep in her ass.\nAfter all that punishment, Angel walks into reception to find Zoe lazily sifting through files with the phone off the hook and the office a mess. Fed up, Angel hauls her ungrateful daughter around the office, spanking her ass pink and making her clean up her mess for once. Zoe is placed face down in her paperwork and has her ass beaten until she cums promising to be a good girl. That isn't enough for Rob, and when he finds them, he throws her on the waiting room couch and flogs her tiny tits while Angel fucks her with a huge dildo. Zoe is an impatient little bitch, and cums without permission, prompting suction cup torment on her nipples and clit. With her mouth stuffed full of cock and a vibrator pressed on her engorged and punished clit. Zoe orgasms and screams thank you to her mother. Zoe isn't out of the woods yet and endures further humiliation and training at the hands of Angel while Rob waits to see if she deserves a load on her face and a second chance. Zoe gets her Mommy off with an expert pussy licking, and squirts all over the floor, but fails to earn Rob's respect and must wait on the ground, begging like a dog while Angel gets all the dick and eventually shares some hot cum with her undeserving stepdaughter.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Angel Allwood",
      "person_id": 52348
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Zoe Sparx",
      "person_id": 62035
    }
  ],
  "release_date": "2019-07-19",
  "scene_id": 44664,
  "tags": [
    "big dick",
    "Big Tits",
    "Black",
    "black hair",
    "blond",
    "Blonde",
    "bottom",
    "Curvy",
    "Dildo",
    "fake boobs",
    "Family Roleplay",
    "Flogging",
    "Humiliation",
    "MILF",
    "muscular",
    "Petite",
    "shaved",
    "Spanking",
    "Squirting",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Bring Your Squirting Step-Daughter to Work Day"
}