{
  "collections": [
    "Everything Butt"
  ],
  "description": "In lavender lingerie, holding a bejeweled butt-plug in her ass, Ella Nova hurriedly cleans the bathroom at the request of her Stepmother, Dana DeArmond. She gets on her hands and knees to scrub the floor when her Stepmother stomps in. Dissatisfied with the job she’s been doing, Dana takes Ella and bends her over the countertop and spanks her ass hard. She pulls Ella’s panties down and lifts one of her legs up onto the counter, exposing her pussy and bejeweled asshole. Dana tugs on the butt-plug, pulls it out, and tells her that her punishment will be taken out on her asshole. She grabs a double ended acrylic toy and plunges it in and out of Ella’s hole, getting little gapes. Dana grabs a Bad Dragon dildo and shoves it down her own throat, covering it in her spit just before ramming it into Ella’s warmed up asshole. She fucks Ella’s ass with it while she presses an Hitachi vibrator onto her Stepdaughter’s clit and lets her cum. Dana lifts her dress and smothers Ella’s face with her ass and makes her lick her crack from the bottom to the top. Dana puts the vibrator to her own clit while Ella licks her asshole and cums hard with Ella’s face buried in her big beautiful butt cheeks. Next, Dana straps on a huge dildo the size of her own arm. Ella gets on her hands and knees and her Stepmother slowly pushes her big cock inside Ella’s asshole. She fucks Ella deep in her ass and Ella cums hard while getting fucked. After that, Dana shoves a rainbow colored cone plug in Ella’s ass. She pulls it out and sticks her whole hand inside Ella’s ass. She fist-fucks Ella’s hole until she cums hard and after Dana licks Ella’s big gaping asshole. After that, Dana wishes to punish her asshole even more and so Ella gets on her back and receives two extra large anal beads inside her stretched out hole. Finally, Dana shoves the entire Slink toy up Ella’s ass and clean it out with a water enema.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Ella Nova",
      "person_id": 51866
    }
  ],
  "release_date": "2019-07-12",
  "scene_id": 44661,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Blonde",
    "bottom",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Dragon Dildo",
    "Enema",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "Lingerie",
    "natural boobs",
    "other hair color",
    "shaved",
    "slink",
    "spit",
    "Straight",
    "Strap On",
    "Tattoo",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "I'm Sorry, Step Mommy!"
}