{
  "collections": [
    "CFNMEU"
  ],
  "description": "Dusan Polanek stara in this Dream Set CFNM, which was suggested by Kris. His sexy cleaning lady is busy dusting, bending over and showing off her underwear as Dusan peeps through the open door. He rubs himself as he watches. Reaching into his jeans Dusan gropes himself, then he releases his rock hard cock and starts to wank. That cock is so hard and nice and thick as he wanks it. Releasing his cock he starts to take a video on his phone, of the sexy cleaner. Suddenly she notices what he is doing and insists that he shows her the video. She decides he needs punishing, so she makes Dusan strip and then take over the cleaning. He kneels on the sofa, dusting, as the girl videos him and spanks his sexy ass. Then she sits him down and wanks his dick. She lets Dusan wank it too as she videos him. Then he has to raise his legs and show her his ass the the tight hole. She tells him to finger his ass. When he refuses she threatens to call the police, so he succumbs and fingers his tight hole. She makes him finger it deep and then the girl takes a toy and shoves that deep into Dusan's ass. She fucks his ass as he wanks his cock. She has him turn over onto his knees and fucks that ass some more with the dildo. She also spanks his sexy ass as he moans. Standing him up she then plays with his cock and balls for a while before making him bend again so that she can fuck him with a strapon. His ass gets a deep fucking from her rubber cock, in two positions. As he is fucked Dusan has to wank his cock. Then she lets him sit up and she wanks him until he lets go a nice big cumshot. He refuses to eat the cum so the girl scoops it up and rubs it all over his mouth.",
  "directors": [],
  "models": [
    {
      "name": "Dominantni Sestra",
      "person_id": 62032
    },
    {
      "name": "Dusan Polanek",
      "person_id": 62031
    }
  ],
  "release_date": "2019-05-23",
  "scene_id": 44674,
  "tags": [
    "Anal",
    "Blindfold",
    "Blonde",
    "CBT",
    "CFNM",
    "Dildo",
    "Femdom",
    "Male Sub",
    "masturbation",
    "Pegging",
    "Role Play",
    "Straight",
    "Strap On",
    "thirdparty",
    "Uncircumcised",
    "Voyeur"
  ],
  "title": "Voyaeur"
}