{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Your boss Mona Wales has had it with your lack of ability to get anything done. Now you're in her office receiving a scathing evaluation and are at risk of being fired from her company. She decides to strike a deal with you. She gets out a measuring tape to see how long your penis is and is shocked and disgusted by what you have going on. At first she offers severance pay to the tune of one month per inch of your dick. Looks like the first offer is about as useless as that thing between your legs. There's barely anything to measure at all and it's so tiny she doubts your ability to push any cum out. If you can manage to blow your load with your teeny, tiny pathetic excuse for a cock, Mona will let you keep your job. The size of it when it's fully hard is laughable so she's not counting on it. She decides to give you some motivation and strips down until there's nothing left on her bare body but her high heels.Now you're staring at your boss' amazing tits and her pussy perched on the edge of her desk. She turns around letting her boobs fall forward and bends over to show you her perfect ass and legs. She asks if you're embarrassed to stroke your micro cock as she teases you with the tempting view of her asshole and cunt. She continues to berate you, criticizing the way you masturbate and laughs at you putting a finger in your ass. Now she instructs you to lick your dirty finger as you stroke your minuscule dick. Why can't you just cum already? Why? Is it because you're a fucking loser? Is it because nature didn't want you to reproduce? Is it because your pitiful bit of meat you've mistaken for a cock is too small to even stroke? That's right, keep stroking. Remember your job is at stake and up until this point your entire life has been a cascade of humiliating disappointments. This is your final chance to prove you're not a complete and utter failure. You have 10 seconds to cum for her, make it count.",
  "directors": [],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2019-05-23",
  "scene_id": 44679,
  "tags": [
    "Blonde",
    "Bondage",
    "Cuckolding",
    "Femdom",
    "Fetish",
    "High Heels",
    "Kinky",
    "masturbation",
    "POV",
    "Role Play",
    "Straight",
    "thirdparty"
  ],
  "title": "KINKY JOI: Brutal HR Review"
}