{
  "collections": [
    "Lakeview Entertainment"
  ],
  "description": "Mistress Alexis makes Her 63 minute debut as this newly minted Dominatrix takes great satisfaction from using slave sean for Her twisted pleasure. She loosens up his tight asshole with fingers, speculum and blow up plug and then has Her way for the first time fucking a man up the backside. Her enormous strap-on is buried as Her huge breasts jiggle. Her seemingly never ending legs then stroll up to sean fastened down tight and She proceeds to spit down his throat and utterly dominate him as She fucks him in strict bondage. Her talented mouth removes the load from his balls and deposits the whole thing back down his throat to finish his training. Long legs stroll into the scene as slave sean is bent over the kneeler, hands fastened behind his back. Mistress Alexis wants to fuck him with Her strap-on. This will be the first time She has taken a man up the backside and the 25 year old smiles as She puts Her eight inch high heel directly on his pulsating asshole. She snaps on some black rubber gloves and starts inserting lubed fingers into his tiny asshole. She gets him fairly loose and then smiles as She pushes a very cold speculum into his hole. She spits into his asshole several times, pulls the speculum out and replaces it with an inflatable vibrating ass plug. With the plug humming in his ass She moves in front of him and makes him strain his neck to lick Her wet pussy. With the vibrating plug stuck in his ass, slave sean does his best to clean Mistress Alexis' pussy as She laughs at his predicament. She swings one long leg off the chair and spanks his ass with a round paddle, making him beg to be fucked up the ass. With Her big strap-on in place, Mistress Alexis grins and moves in front of the bound submissive, making him suck Her rubber cock. With the taste of Her pussy still in his mouth, he complies immediately, getting his face cock slapped for his enthusiasm. She moves behind him, leans in and realizes Her goal; slave sean squirming as his asshole clutches at the business end of Her cock. Mistress Alexis is in heaven with slave sean moaning as Her huge strap-on is buried up his tight little asshole. She paddles his ass and gyrates Her hips to get him to squeal even more. Filling a man's hole up has been Her dream for some time and now it is a reality and the happy smile of a sadistic woman plays on Her face for real. Her huge breasts swing free as She slams Her hips into him laughing at his suffering. She pulls out at the end and, in a humiliating finale, makes him thank and kiss the cock that tore his asshole up and say Her name. Now Mistress Alexis is in a red string bikini and seven inch platform heels to match. Slave sean is completely fastened down and She struts around him, finally settling in the toilet chair above his face. She uses him for a foot rest as She verbally abuses him and tells him what he is in for. Mistress Alexis' legs seem to go on forever as slave sean stares straight up at Her gaping pussy hole coming closer and closer to his face. She teases him, telling him She took a big wad of cum from Her boyfriend that morning, and tries to push it out into his mouth which is held wide open by the metal dental dam. She spits into his open mouth hole and then uses Her high heels on his cock. She ties his balls up very tight and strings them down and ties them off taut. She teases his tormented cock with Her mouth for a bit and then moves to ride his face. She holds his nose and smothers him as Her wet pussy covers his face. She face slaps him and enjoys queening his face and dominating Her bound captive. Mistress Alexis finishes face sitting and face slapping slave sean and spins around planting Her pussy on his face and sucking his cock into Her talented mouth. Even though his balls are tied and strung, his cock reacts and he gets hard instantly. She told him not to get so worked up and moves to use the violet wand to electrocute his turgid cock until it goes softer. She goes right back to sucking him to full attention and then swings around and fits his hard cock in Her tight pussy. She starts to fuck him, knowing his balls are in agony and he is suffering. This makes the big blonde excited and Her hips move rhythmically as She uses his cock to satisfy Herself.",
  "directors": [],
  "models": [
    {
      "name": "Mistress Alexis",
      "person_id": 61888
    },
    {
      "name": "Sean Spurt",
      "person_id": 21434
    }
  ],
  "release_date": "2019-05-24",
  "scene_id": 44684,
  "tags": [
    "Anal",
    "Anal Fingering",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "CBT",
    "cum kissing",
    "Dildo",
    "Dominatrix",
    "drool",
    "dungeon",
    "Electrical Play",
    "Facesitting",
    "Femdom",
    "Flogging",
    "Gaping",
    "gloves",
    "High Heels",
    "Leather Cuffs",
    "Mouth Spreader",
    "Nylons Stockings",
    "Paddle",
    "Pegging",
    "Pussy Eating",
    "Rope Bondage",
    "Slapping",
    "Slave",
    "Smothering",
    "Spanking",
    "Speculum",
    "spit",
    "Straight",
    "Strap On",
    "the chair",
    "thirdparty",
    "Violet Wand"
  ],
  "title": "Nice and Tight"
}