{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The stunning Noemie Bilas is tired and stressed at work, always under extreme pressure from her mean, commanding boss Sinn Sage. Noemie's up all night working in the office when she falls asleep at her desk. Sinn walks in on her snoozing away, and what follows is the epitome of a rude awakening. Sinn punishes Noemie for sleeping on the job and slacking off. She begins by slapping Noemie's perky tits and thighs. She then verbally humiliates her for being a failure. She undresses her and starts rubbing on her pussy until she's hot and wet. Sinn starts fingering her and teasing her, but not without reminding her of her repeated failures. But Sinn didn't plan on Noemie getting off on such mistreatment. Noemie can't help but to squirt all over. Still, Sinn doesn't let her squirt go to waste so she makes Noemie clean it up with her tongue. Noemie then finds herself in a rope suspension, in the perfect position to eat Sinns lovely pussy. But first Sinn gives her a little more punishment so she flogs Noemie's big juicy booty and perfect tits. Being the mean boss that she is, Sinn then adds clothespins to Noemie's body so she can flog them off, painfully, one by one. After punishing Noemie, Sinn puts her on the floor and uses Noemie's face for pleasure, she makes Noemie tongue fuck her until she has a nice big orgasm. Sinn then takes a big strap on and fucks Noemie's tight wet pussy. She adds clothespins to Noemie's beautiful tits, giving her more pain for her pleasure. Sinn fucks Noemie's pussy so good, Noemie makes a big wet mess again. Sinn then takes her big strap on cock and fucks Noemie in the ass good until she cums again. This mean boss gets one more explosive orgasm out of Noemie as she fingers her hard until she explodes. Noemie cums so good she wakes up only to realize it was all a dream.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Noemie Bilas",
      "person_id": 61398
    },
    {
      "name": "Sinn Sage",
      "person_id": 19154
    }
  ],
  "release_date": "2019-10-10",
  "scene_id": 44699,
  "tags": [
    "BDSM",
    "Black",
    "black hair",
    "Bondage",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Latin",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Pierced Nipples",
    "Pussy Eating",
    "Slapping",
    "Slave",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Hot Mean Lesbian Boss: Sinn Sage Takes Advantage of Noemie Bilas"
}