{
  "collections": [
    "The Training Of O"
  ],
  "description": "Applicant Profile\nAge: 28\nSign: Cancer\nHeight: 5'6''\nFears / Current Limits: Applicant suffers from claustrophobia and aquaphobia, and harbors a moderate fear of single tail whips. Very sensitive pussy, no whipping or hard slapping on that area.\nStrengths: Rough player, mature of mind, eager to submit and please. Claims to be a competent humiliation slut, enjoys marks, nipple clamps, face slapping and hair pulling. Claims to be an excellent cock sucker and has tendencies toward nymphomania.\nWeaknesses: Lacks focus, has diminished pain threshold, and generally lacks composure and discipline.\nExperience: Light Master/slave roleplay in real life, and has given excellent performances on several sites including sexandsubmission and wiredpussy.\nCurrent Status: Unowned submissive.\nInitial Observations: Applicant likes it rough. However, she does suffer from a tough reputation and fears an inability to live up to the corporal intensity of some of her past scenes. General impression is that she does possess a strong submissive side and seems eager to be on her knees.\nRecommendations: Strip her naked, chain her to a wall and interrogate her on fears, expectations and desire to serve. Whip her and grill her on her past experience while she performs grueling manual labors to test both her determination to train and her ability to maintain focus.\nGauge the depth of her greatest fears right away with the headbox and a bathtub full of water, establishing accomplishment as a basis for training in these areas. Compel her to masturbate under the whip, testing her ability to orgasm under duress and time constraints, then determine her potential as a cock sucker, spraying her face with semen and leaving her hungry for something hard in her pussy. Assign a mound of homework and journaling, deny her right to masturbate, then deliver her to her quarters for the night to reflect on her decision to train.\nExtra Studies: Write a two page essay on the role of service in BDSM.",
  "models": [
    {
      "name": "Julie Night",
      "person_id": 11190
    }
  ],
  "release_date": "2007-07-13",
  "scene_id": 4469,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Gimp",
    "hair pulling",
    "humiliation",
    "master",
    "nipple clamps",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "single tail",
    "slapping",
    "slave",
    "straight",
    "whipping"
  ],
  "title": "The Training of Julie Night, Day One"
}