{
  "collections": [
    "Whipped Ass"
  ],
  "description": "A battle for domination ends in an epic squirt storm! Ella Nova and Christy Love are two expert dominatrices awaiting a new male client. But they’re caught off-guard when the gorgeous Chanel Preston enters their dungeon instead. Chanel waves a big wad of cash in front of them, instructing the beautiful women that she wants them to battle among themselves, so she can to see who the secret submissive is. Ella balks, since she’s the domme in charge, but Christy’s excited, since the idea of topping her mouthy boss tickles her. Neither wants to submit, but they also don’t want to miss out on a big payday, so they agree to battle it out. First, Ella must get on all fours. Christy spits in her face, then sits on her face, demanding her boss taste her sweet wet pussy, and threatens to cum all over her. When it’s Ella’s turn, she makes Christy lick her black high heels, including the filthy soles. Christy groans and gags, but she can’t hide her excitement since her pussy is so damn wet. Ella pushes her toes into Christy’s mouth. She knows she has her co-conspirator right where she wants her, as she puts a vibrator on Christy’s pussy. As hard as Christy tries, she can’t help but cum all over Ella’s cunt. Chanel’s excited, but she’s not going to hand over her cash that easily. She wants to personally test both women. Ella and Christy find themselves with red ball gags in their mouths, holding buckets while sitting on vibrators. How long can they hold their arms outstretched while Chanel adds rocks to their buckets? Cold hard cash smells good to these sluts, so they refuse to drop their buckets even when Chanel hits them with a flogger. The vibrators feels so good on their pussies, they can’t help to grind on them, but no one is allowed to cum until they ask for permission. Chanel releases the gags so she can hear the loser beg to cum. Ella nearly drops the bucket once she’s hit with the zapper. She begs to cum but she only gets more of the electric current. She’s finally allowed to cum when Christy drops her bucket. She won’t get any money but Chanel promises Christy she will go home with a couple of stretched out holes. Chanel fucks little Chrisy’s wet and ready pussy as Ella sits on the loser’s face. Christy is persistently humiliated as she confesses her secret submissive desires. Ella fucks her ass with a strap-on cock, while Chanel has free access to her pussy and fingers Christy into an epic category 5 hurricane of squirt that drenches everyone.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Christy Love",
      "person_id": 61580
    },
    {
      "name": "Ella Nova",
      "person_id": 51866
    }
  ],
  "release_date": "2019-08-15",
  "scene_id": 44697,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Couple",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "High Heels",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "Secret Submissive: Chanel Preston, Ella Nova and Christy Love"
}