{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Kira Noir is studying hard for an upcoming university exam, while her roommate and popular cam-girl Lilith Luxe is having a loud fuck-fest downstairs with her favorite clients. Kira can’t get anything done with all the noise, so when Lilith comes into the living room to live-stream a sexy strap-on show, Kira confronts her. The lithe and oversexed Lilith doesn’t like seeing her friend so stressed, so she offers to help her. Kira is studying the impact of “negative stimuli” on the brain, so Lilith offers some real-world experience. She grabs Kira by the hair and bends her over her knee, spanking Kira’s tight, juicy ass until it turns a delicious, rosy pink. Kira is shocked, but she ultimately admits that her interest in the topic might be more than academic. She orgasms hard and begs for more as Lilith crops her thighs and fingers her sweet wet cunt. She uses a zapper on her to give Kira a lesson in the balance of pleasure and pain, then she fucks Kira deep in the ass in reverse cowgirl and missionary. Lilith licks up her sweet ass juices after shoving her entire fist into Kira’s beautiful gaping hole. Several days later, Kira decides to turn the tables on her roomie. She interrupts one of Lilith’s cam shows, handcuffs her and takes advantage of her. Lilith protests as Kira spanks her round, inviting ass, turning Lilith’s cheeks a bright pink before cropping her clit. Lilith may be surprised, but she loves it all and she screams for more! Placing a zipper up the length of Lilith’s long, enveloping thighs, Kira makes Lilith orgasm over and over before flipping her into doggy and fucking her deep in the ass. Kira thrusts her own fist into Lilith’s throbbing pink cunt, sending shocks of pleasure throughout her body. The intensity of the fist fuck causes Lilith to orgasm multiple times, as she squirts her sweet cunt juices high into the air.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Lilith Luxe",
      "person_id": 55114
    }
  ],
  "release_date": "2019-08-29",
  "scene_id": 44698,
  "tags": [
    "BDSM",
    "Black",
    "black hair",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gaping",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "toned",
    "Zapper",
    "Zipper"
  ],
  "title": "Roommate's Revenge: Kira Noir and Lilith Luxe Lesbian Switching"
}