{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Gia DiMarco hasn't seen the gorgeous blonde Julia Ann since she dominated her on Whipped Ass a few years ago, so she hasn't given much thought to the possibility that Julia might want to get a little revenge for the rendezvous. When they incidentally cross paths, Gia is polite and she apologizes for being so rough back then. But Julia believes in fate, and she's all too ready to take Gia into her hands to satisfy her erotic fantasies. She snaps a collar and leash around Gia's neck and tells the young woman to worship her feet. Gia obeys and then uses her tongue on Julia's sweet, slutty pussy. \"Did you like smacking me that day?\" Julia asks. Gia realizes that this is no ordinary session, and she's now at Julia's mercy. She's tied to a cross, panties cut away from her body, as Julia flogs her tits, tender thighs and her exposed, perfect pussy. A ball gag muffles Gia's screams, as Julia has fun fingering, biting, licking, sucking that cunt. Next Gia is shackled on top of a table, doggy style. Her round, naked ass is fully exposed. Julia spanks it until it's bright red, then smothers Gia's gorgeous face with her large tits. But this is all fun and games in comparison to what's to come, when Julia brings out the cane. Gia has such sweet feet, and revenge is sweet for Julia. She utterly torments those luscious feet, and Julia delights in Gia's cries. Finally, Julia fucks Gia with a huge strap-on cock, working that perfect pussy deep and hard, as Gia whimpers and moans with delight. Gia rides Julia's cock, orgasm after orgasm. After making Gia suck on her feet, Julia climbs on top of her sub, rubbing her pussy in Gia's face. Whether she likes it or not--and clearly she does--Gia is here to please her mistress, licking and tonguing her pussy until Julia is satisfied.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Julia Ann",
      "person_id": 32896
    }
  ],
  "release_date": "2019-09-26",
  "scene_id": 44701,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Paddle",
    "Pussy Eating",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Rendezvous With Destiny: Julia Ann Gets Her Revenge On Gia DiMarco"
}