{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Halloween is coming and the luscious Kayla Paige has a great Elvira costume to wear to her Halloween party. Before the festivities, she asks her friend London River to come over and help set up. But horny slut London ruins the party before it even starts when she arrives wearing the exact same costume. Kayla is so angry she tears off London’s wig and cuts off her dress, stripping London naked. London apologizes, but it’s too late. Kayla’s now so turned on by her rage energy and London’s curvy, sexy body, she can’t help but start playing with her. She loves London’s big tits and firm nipples. She pulls London over her knee for some spanking but instead squeezes and gropes her big ass. Kayla plunges her tongue deep into London’s back door, rimming her asshole. Kayla is so hot she tears off her own costume so London can lick her pussy. London does more than that as she worships Kayla’s feet and sucks her toes. Then Kayla confines London to a chair, tying her wrists and ankles above her head, exposing her pussy and ass to any and all manner of depravity. Kayla slaps and flogs London’s creamy thighs, slutty pussy and the tender soles of her feet. She uses a dick-on-a-stick to pound London’s pussy, and adds a vibrator to drive her crazy. A red ball gag keeps London from protesting. She cums again and again. She knows Kayla is not done with her. Next, London is tied doggy-style, with her ass at the perfect height for Kayla and her large strap-on cock. Kayla drills her deep, and enjoys seeing her friend tied up and unable to resist. As a result, London cums hard again, as Kayla pounds her ass. An exhausted London is released, falling flat on the floor. Kayla sits on her face and smother her. London gasps for air, but also loves this torment, as she eagerly licks her sweet pussy until Kayla cums damn hard. At last, Kayla’s good mood has returned, but London needs to find a new costume!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Kayla Paige",
      "person_id": 11734
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2019-10-24",
  "scene_id": 44703,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Ass",
    "Big Tits",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "halloween",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "Rimming",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Halloween Party Surprise: Kayla Paige Returns to Whipped Ass!"
}