{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The legendary beauty Isis Love is back and she brought a friend, the sexy Gia DiMarco. These two hot dommes find themselves in a dungeon reminiscing about the hot and sexy deeds of their past and how much fun they used to have dominating slave whores. Gia has a welcome-back gift for Isis so they can both relive some of those steamy moments. Gia calls on the house slave, Alex More, a hot sexy slave who is eager to please her masters. Gia and Isis waste no time with their slave as they warm her up with some corporal punishment. They start with slapping her titties and spanking her nice round booty. Then they humiliate this slave with clothespins on her tongue and a few on her breast. Gia then paddles the pins off her beautiful tits, one by one. After a little pain they make her eat Isis Love’s hot wet pussy while Gia flogs her nice ass. Isis then takes this little slave and gives her a few gut punches and titty slaps for failing to please her. These two masters of domination then suspend Alex upside down in a straight jacket. Unable to move or use her hands, Alex is in a perfect position to lick and eat ass. Gia puts clothespins on Alex’s pussy while Isis smothers Alex’s face with her nice big butt. After all the pain and punishment they decided to give the house slave a taste of pleasure. They vibrate Alex pussy, getting her close to orgasm, only to deny her. They bring the slave down so they can give her both pain and pleasure. Isis shares a vibrator with Alex while Gia slaps her titties. They finally let her have a big orgasm after a few denials. For the finale, Isis strap-on fucks Alex. She pounds both of her slutty holes with two big cocks, making her cum over and over again.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Alex More",
      "person_id": 61857
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    }
  ],
  "release_date": "2020-01-02",
  "scene_id": 44709,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "Pain",
    "Pussy Eating",
    "shaped",
    "shaved",
    "Slapping",
    "Slave",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Isis Love Returns: Gia DiMarco and Alex More Welcome the Goddess Home"
}