{
  "collections": [
    "Whipped Ass"
  ],
  "description": "The sexy and curvy Ryan Keely is ready to end her marriage. She hires expert divorce lawyer Helena Locke to find some dirt on her asshole husband. Helena gathers what she can, but also discovers Ryan's scandalous porn career on the internet. When confronted with documentation of her kinky, lurid sex acts, Ryan vows that she has rejected her scandalous, slutty ways and turned her life over to Jesus Christ. Helena explains that it will take more than just promises to make Ryan look convincingly squeaky clean, and decides to take advantage of Ryan's whorish history to get a little for herself. She demands that Ryan strip, nice and slow. Helena likes what she sees and wants a closer look at Ryan's beautiful ass for some OTK spanking. \"So many things I'm going to do to you,\" Helena promises. Ryan bares all for Helena. Helena's mouth latches on to Ryan's pussy driving her wild. She teases, torments and tickles Ryan's pussy with her tongue. There is more hard work ahead for poor Ryan. A red ball gag in her mouth, bound with rope and a spreader bar holding her legs wide open, pussy and ass exposed to Ms. Locke, who now wears a black strap-on dildo and is ready to give Ryan some hard pussy fucking. There will be no orgasms yes, or no movement at all. There are other holes Helena wants to explore. Helena fucks Ryan's ass driving her wild. A paddle stinging her thighs helps distract Ryan from cumming. This filthy whore likes to cum from a hard ass fucking. Ryan is punished on all fours with whip and the leather paddle. Her whipped ass turns bright red. She's then put into a rope suspension and reduced to a whimpering mess. Ryan submits to sucking Helena's toes and feet, licking every inch. Helena sits on her bound client, smothering her with her ass and compelling her to eat her wet, hungry cunt. Helena beats Ryan with a crop and flogger, and torments her feet with cropping and tickling. Helena is satisfied with Ryan's performance, but blackmail doesn't end with one payment, and they both know there will be more to come.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Ryan Keely",
      "person_id": 15370
    }
  ],
  "release_date": "2019-11-07",
  "scene_id": 44702,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Kinky",
    "Latin",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "OTK",
    "Paddle",
    "Pussy Eating",
    "Slave",
    "slim",
    "Smothering",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "Tickling",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Attorney Client Privilege: Helena Locke Blackmails Client Ryan Keely"
}