{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Sister Ashley Paige is a sexy latex nun who finds the beautiful Bella Rossi desperately praying for forgiveness for her dirty little sins. Sister Ashley takes matters into her own hands and punishes Bella for basking in her whorish, pussy-licking thoughts. Punishment starts with Bella’s hands and feet tied to a prayer bench where Sister Ashley is ready to make her repent. She starts with a little slapping and breath play. She makes Bella ask for forgiveness while she squeezes and slaps the sin out of Bella’s big juicy breasts, making Bella wish she’d prayed in silence. Ashley then smothers Bella’s face with her big juicy ass so she can get a taste of true forgiveness. Ashley then puts Bella to the test. She makes her pray while vibrating and playing with her wet pussy. Bella’s hot wet cunt is clamped and spread wide open. Bella tries to fight the punishment, but it’s so good that she just can’t help but cum hard and loud. Bella then finds herself tied up doggy style with an asshook in rooted in her tight hole. Ashley has Bella in the perfect position to flog her nice round butt. She continues to flog her as Bella prays, begging for forgiveness, as if she hasn’t earned it already. After getting Bella’s ass nice and red, Sister Ashley then grabs Bella’s head and makes her lick her nice wet cunt. She licks her pussy until she cums nice and hard. She continues her punishment with her big strap-on dildo. She fucks Bella hard, making her orgasm over and over. Then she fingers her with a vibrator and makes her cum again. Eventually, Bella is spent, with all of her sins orgasmed out. Or so she thinks. Sister Ashley has ordained that Bella’s penance has only begun, and she’d better see this little slut in church on Sunday.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ashley Paige",
      "person_id": 61984
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    }
  ],
  "release_date": "2019-11-21",
  "scene_id": 44704,
  "tags": [
    "BDSM",
    "Big Tits",
    "Bondage",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Latex",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaved",
    "Slapping",
    "Slave",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "Vibrator",
    "white"
  ],
  "title": "Lesbian Latex Blasphemy: Ashley Paige Whips the Sin Out Of Bella Rossi"
}