{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Cherry Torn is moving out of her building, so her hot friend Zoe Sparx offers to help. In the process, she confesses to Cherry how much she's going to miss her. Cherry feels the same, which is why she's been planning a little going away present for her friend. The unsuspecting Zoe is brought to Cherry's dungeon where Cherry lets her know what's in store. Zoe is going to be her little plaything. Zoe never imagined this would happen, but before she knows it, she's stripped naked and finds herself in Cherry's dominating grip. Zoe's enormously excited, because she's known to everyone as the little pleaser. Cherry plays with her ass, squeezing, probing, stretching and spanking it until it glows red. Zoe suspects she's in over her head, but she just can't resist her sexy, dominant friend telling her what to do, and using her for her own pleasure. Cherry ties her to a cross, and uses a crop on her sensitive feet, her tender thighs and dripping pussy. The entire affair, getting to control her neighbor after all this time, makes Cherry's own pussy soaking wet. Zoe's big nipples are an easy target for some hard metal clamps. She can barely manage the pain, but it's all worth it when Cherry slides down and works her pussy with her tongue. But more pain soon follows the pleasure. Zoe's tied up in a rope suspension, and she continues to take more and more abuse from the flogger. Once she's broken-in, Cherry cracks out the strap-on. Zoe's ankles are tied to her wrists, and her pussy and ass are wide open for anything. Cherry fucks Zoe's pussy, driving her strap-on cock deep inside. She then turns her attention to her ass, fingering it before pounding the strap-on inside. She fucks her friend missionary, then doggystyle, then she flips her on her head for a piledriver. Zoe's tight little ass takes it all. She cums hard in a crazy, sensory overload. To finish her off, Cherry sits on Zoe's face while Zoe hungrily sucks and eats that delicious, dripping wet pussy and tight puckered asshole. Cherry cums on Zoe's face, then it's back to business, packing her things. It's a going away present to top them all.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Zoe Sparx",
      "person_id": 62035
    }
  ],
  "release_date": "2019-09-12",
  "scene_id": 44700,
  "tags": [
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pain",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "The Little Pleaser: Zoe Sparx Submits to Sexy Neighbor Cherry Torn"
}