{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Sinn Sage is a hard-working gal living in the city. Laser-focused on her career and achieving success, Sinn doesn’t have a lot of time for friends or romance. So when she gets home from a long day at the office she treats herself to the finer things in life. She makes a quick phone call, and soon Jasmine Jae is at her door, ready to serve. Some folks order pizza. Sinn orders a hot piece of meat. Jasmine strips for Sinn and kneels at her feet. She removes Sinn’s shoes and sensually massages her feet. Jasmine licks everywhere, her soles and between her toes, and she sucks Sinn’s big toe, deep-throating it like a fat cock. Sinn slaps Jasmine’s big booty and runs her tongue between her ass crack. Jasmine is eager to pleasure her client, but Sage has very specific plans for Miss Jae. Bound by rope, Jasmine lies on her back, teased and tormented by a crop Sinn uses on Jasmine’s exposed naked pussy and breasts. After toying with her helpless slut, Sinn sits on Jasmine’s face. Jasmine knows just what to do, hungrily licking at Sinn’s panties, eager to get at her wet, pink pussy. Sinn rides Jasmine’s face to orgasm in a hot 69. Relaxed and energized, Sinn is ready for more kinky action. She first uses a vibrator on Jasmine, bringing the bound woman to an orgasm. Jasmine is still bound, with her arms tied behind her back, now on Sinn’s couch, face-down and ass-up, totally at the mercy of Sinn’s strap-on cock. Sinn pounds Jasmine deep into the couch, driving her hard into the cushions. Sinn then slides her cock into Jasmine’s ass, pounding it deep, filling her horny, slutty ass. Sinn has worked up a sweat today, a well-earned treat after a long day in the office.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Jasmine Jae",
      "person_id": 59210
    },
    {
      "name": "Sinn Sage",
      "person_id": 19154
    }
  ],
  "release_date": "2020-01-16",
  "scene_id": 44708,
  "tags": [
    "69 Position",
    "Anal",
    "BDSM",
    "Big Tits",
    "Bondage",
    "bottom",
    "british",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Foot Worship",
    "Humiliation",
    "Kinky",
    "Latinx",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "natural boobs",
    "Pussy Eating",
    "romance",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Jasmine From The Agency: Jasmine Jae Gives It Up to Sinn Sage"
}