{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Tis the season for giving. and on this jolly holiday the sexy Mona Wales has a very special surprise for the stunning Fox Acecaria. Fox comes home from a long day at work, excited to see what big surprise Mona has for her. She walks into the Christmas dungeon and finds a big gift for her to unwrap. Mona is just as excited to see her reaction, so they both rip open the sexy surprise. Fox is stunned to see that her gift is none other than the gorgeous and curvy Angel Allwood. Fox is so excited about her lusty gift that she decides she simply must to share it with Mona. The two of them bend Angel over, and give her some good spankings until her nice bum turns rosy red. Mona then grabs Angel by the hair and makes her lick her pussy. Fox makes good use of the implements in the Christmas dungeon, and begins to flog Angel's perfect, round booty. Mona then puts Angel on her knees and makes her lick Fox's pussy while Angel works her magic tongue on Fox. Mona places clamps on Angel's beautiful nipples for a little pain and pleasure. Fox then licks her sexy Angel's hungry cunt until its nice and wet, while Mona paddles Angel's thighs. Fox then uses her big strap-on dildo and pounds Angel's nice wet pussy. She fucks her to orgasm, while Mona puts clamps on Angel's nipples. Angel then gets fucked in the ass by Fox, while Mona makes her lick her foot. After fucking both of her holes, this special gift is ready to take two big dicks at the same time. Angel's holes get put to the test until she cums hard. Now that they gave her a good fucking, they make Angel take turns licking their pussies until they squeal with orgasms. After a good fucking they pour hot wax all over Angel's chest. They kiss over the candle for the best holiday a pair of dommes could ask for.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Angel Allwood",
      "person_id": 52348
    },
    {
      "name": "Fox Acecaria",
      "person_id": 61748
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2019-12-19",
  "scene_id": 44706,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "bottom",
    "christmas",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Hot Wax",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "white"
  ],
  "title": "Holiday Gift: Angel Allwood is Mona Wales & Fox Acecaria's Slutty Toy"
}