{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Beth McKenna feels pent up and sexually repressed, so she goes to see Lotus Lain, a sex therapist, specializing in alternative treatments. Beth admits to fantasizing about being tied up, and restrained, and having her control taken away. Lotus knows there is something more Beth is not admitting, and Beth has to admit she fantasizes about sexy women. Lotus reassures Beth she has a personalized plan for her which starts with Beth bending over on the table. This pent up prude wears fancy lingerie. Beth confesses she hoped something might happen during her session. Lotus first commands Beth to kiss and lick her shoes while she gets spanked. Lotus fingers Beth's tight little pussy and finds it's already dripping wet. Beth admits her desires for Lotus to fuck her, nice and deep. So Beth is tied in tight rope bondage and suspended from the office ceiling. Lotus offers her delicious pussy for Beth to lick and kiss and worship, but the tight bondage really makes her work for it. Lotus straddles Beth's head, riding her face, grinding her sweet cunt all over Beth's chin. Lotus needs that tongue deep in her ass, so that's where it goes next, right into that tight hole. While Beth works hard, Lotus pulls out a vibrator and brings herself to orgasm, as she encourages Beth to unleash her passion. Beth's then put on a bed, face-down and ass-up, her wet pussy open and exposed for Lotus to do her work, fucking her with a strap-on dildo. Since there can be no pleasure without some pain, Lotus whacks Beth's ass with a flogger while pounding her pussy. Lotus is now ready to explore the core of who Beth McKenna really is, as she slides her dildo deep into Beth's ass, making Beth her personal anal slut.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Beth McKenna",
      "person_id": 62393
    },
    {
      "name": "Lotus Lain",
      "person_id": 47027
    }
  ],
  "release_date": "2020-01-30",
  "scene_id": 44707,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "LezDom",
    "Lingerie",
    "mixed",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "Vibrator",
    "white"
  ],
  "title": "Open Up for Lotus: Sex Starved Cougar Pounces for Kinky Lesbian Sex"
}