{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Arabelle Rafael doesn't know what she's getting into when Dee Williams brings her to her kinky friend Ana Foxxx's workshop, to see her new 'bondage rack'. But Ana and Dee are super excited to show her how it works, so they immediately make her their subject. They strap Arabelle into it, nice and secure, with her wrists, chest, and ankles buckled to the steel frame. It's a bit intimidating, but Ana promises Arabelle that she's going to have a great time. The two women cut away Arabelle's dress and panties, exposing her, and subjecting her to an intense vibrator. Dee grabs the flogger and Ana uses a leather paddle on Arabelle's exposed ass. Arabelle would scream, but Dee has stuffed Arabelle's panties into her mouth. The women add nipple clamps to Arabelle's large natural breasts because more pain is always better. Ana smacks Arabelle's ass nice and red before letting Arabelle's breasts feel the sting of her leather paddle. Dee and Ana strap Arabelle to the floor, her legs tied wide apart. Arabelle's pussy is there for Ana to enjoy. Licking, kissing, slapping her tender regions. Arabelle's moans are stifled when Dee sits on her face. Dee's voluptuous ass smothers our helpless Arabelle. Arabelle must use her tongue to satisfy Dee or she won't be allowed to breathe. Meanwhile Ana stuffs Arabelle's ass with a metal butt plug. Jealous that Arabelle is getting all the fun, Ana switches with Dee and sits on Arabelle's face while using a vibrator to cum. Arabelle's tongue must work to please Ana in exchange for air. Now the women fuck Arabelle. Ana fucks Arabelle's pussy good and hard with a strap-on dildo. Dee flips Arabelle over doggy style to fuck her ass. Dee rides her good and hard and now with both holes juicy, lays on her back and pulls Arabelle down on her, impaling her butthole while her pussy is exposed to Ana's own strap-on. Ana commands her visitor to ride the DP. Arabelle is filled up completely, and spent. It looks like Ana's bondage rack has done its job!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    },
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2019-12-05",
  "scene_id": 44705,
  "tags": [
    "BDSM",
    "Big Tits",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Kinky",
    "Leather",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Paddle",
    "Pain",
    "Petite",
    "Pussy Eating",
    "rack",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "Vibrator",
    "white"
  ],
  "title": "Kinky Workshop: Ana Foxxx & Dee Williams Strap-On DP Arabelle Raphael"
}