{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Emma Hix is a sex kitten who has decided to make her Kink debut with Fucking Machines, with the added treat of being tied up! She begins with a seductive strip tease that leads into a mind blowing orgasmic event. Her knees become weak and she slides down into a squat, but never stops masturbating. Emma's on a mission to cum as many times as possible today, and she's not taking that lightly. After multiple orgasms from the vibe, and her fingers penetrating her pussy, she is ready to see what the machines can do. We begin with her standing over the crystal palace with her hands pulled high above her head in leather cuffs. The fucking begins and this little slut suddenly falls in love and can't believe that she is getting so much pleasure from a machine. Next she is seated in a big leather chair with her hands tied and her pretty mouth filled with a big red ball gag. We give\nher a vibe to use and the flood gates open up! We crank the machine all the up and she just can't stop cumming. The third scene begins with her on her back, shackled to the floor in a spread-eagle. The intruder slides between her legs and the fucking begins. We power fuck her with everything we have, and blow her mind with orgasms that she will never forget. It seems that Emma has found her happy place and is satisfied, but we are not. We show her the Sybian, and sit back as she controls the orgasms for the rest of the day.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Emma Hix",
      "person_id": 59561
    }
  ],
  "release_date": "2019-09-11",
  "scene_id": 44713,
  "tags": [
    "Ball Gag",
    "Blonde",
    "Bondage",
    "bottom",
    "Gag",
    "Leather",
    "Leather Cuffs",
    "Machine Dildo",
    "multiple orgasms",
    "natural boobs",
    "shaved",
    "slim",
    "Straight",
    "Sybian",
    "Tattoo",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Emma Hix: Sex Kitten Tied and Machine Fucked Into Oblivion"
}