{
  "collections": [
    "Hogtied"
  ],
  "description": "We’ve had our eye on the gorgeous Alina Lopez for quite some time. She told The Pope she didn’t want him to hold back on her, but to treat her like every other pain slut that comes through that door. So Alina is gonna get what she asks for! She starts bound to a column in a standing position, eagerly awaiting the torment to come, with her hands tied behind her back. The Pope begins tormenting her pussy and her tits, then immediately starts flogging her. She begins to relax, enjoying the unexpected strikes against her skin and the fingers on her cunt. She has clothespins put all over her torso, running up and down her breasts and stomach in a threatening zipper. It’s then connected to a roped pendulum she has to hold between her teeth. If she lets go, the whole thing drops and the zipper is ripped from her body. The Pope works her hungry cunt, paired with a vibrator. Alina suffers the pleasure and the fear of letting go, but ultimately can’t keep it up. The orgasms are too intense, so her jaw drops open and the zipper is torn from her. Multiple sensations reverberate through her body. In the next scene, she’s suspended upside down with her legs spread and her arms bound behind her back. Her wet pussy is totally exposed and accessible, so the Pope takes full advantage, working it and making her cum, flogging her hot body, the fucking her cunt with a dick on a stick. The sensations are overwhelming as Alina cums like a slut, thrashing and screaming in the bondage. She’s then put in a partial suspension, face down over the floor. There’s breath control, nipple clamps, bastinado, and orgasms so powerful that Alina begins to drool and cry. This is the most intense shoot that she’s ever experienced, and we get to see her at her most vulnerable, and at her strongest!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Alina Lopez",
      "person_id": 61837
    }
  ],
  "release_date": "2019-10-10",
  "scene_id": 44715,
  "tags": [
    "BDSM",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "drool",
    "dungeon",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "Vibrator",
    "Zipper"
  ],
  "title": "Alina Lopez: Tormented in Extreme Bondage and Made to Cum"
}