{
  "collections": [
    "Hogtied"
  ],
  "description": "Harmony Wonder is eager to try new things. She wants to explore her sexuality, so she's here to do a shoot with The Pope. It may not be most peoples first choice, but let's see what happens, shall we? Harmony begins in a standing position with her hands box tied behind her, then in comes The Pope. Her facial expression betray her sudden uncertainty about her decision to let this deviant sadist put his hands all over her body. One of her legs is pulled up to provide easy access to her sweet pussy, but she keeps trying to block The Pope, so he eventually puts her into a full suspension so she cannot resist. Harmony begs for him to stop, but he's not even close to being finished with his new toy. The orgasms pour out of her little pussy as he presses the vibrator firmly against her clit while he finger bangs her. The next scene begins and Harmony is bent over in a doggy position with her neck tied to her legs. Her arms are pulled up into a strappado, and her elbows are tied together to ensure total helplessness. Clamps and weights are added to her nipples, and then her ass is spanked. Next her face is fucked and then her pussy, and the orgasms continue to pour out of her. In the final scene Harmony is on her back with her legs spread. The Pope doesn't waste any time getting to work on her sensitive feet. He administers brutal bastinado until she cannot take any more. She has begged him to stop all day, but when the final onslaught of orgasms begin, she can only moan in ecstasy.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Harmony Wonder",
      "person_id": 62043
    }
  ],
  "release_date": "2019-08-29",
  "scene_id": 44716,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Facial",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Nipple Clamps",
    "Petite",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "Vibrator",
    "Weights"
  ],
  "title": "Harmony Wonder: 19 Year Old Tormented and Cums in Grueling Bondage"
}