{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "You came here to cum didn’t you? Well you’re just gonna have to wait. That’s right. You wait to cum until Chanel cums. And only when you’ve been patient and obedient will Chanel grant you permission to cum. You’re gonna sit here at her feet, gazing upon her gorgeous body in that tight white dress, and you’re gonna have to last long enough for her to decide that you’re worthy of even having the slightest orgasm in her presence. Do you think you can handle it? Do you think you can handle not blowing your load while she slowly peels away at the hem of her dress revealing her perfect pussy? She spreads her legs and begins to tease you as her fingers dance along the ridges of her pussy lips. She knows you would just love to jump right in but you can’t, you just get to look. But she does want you to touch yourself while she rubs her pussy. And that as you stroke your cock you’re imagining being deep inside of her. Her fingertips are just barely touching her wet little hole as she demands you wait to cum while you stroke faster and faster. She knows you want it and that you’re getting so excited. That you would just love to stick your cock deep inside of her and stretch her pussy out. Chanel grabs a vibrator and begins rubbing and vibrating her cunt with her legs spread right in your face. She tells you over and over again how much she knows you want it, that you want to fuck it so badly. You just gonna have to keep jerking that cock, “because I always cum first,”. She moans and tells you over and over again how’s she’s gonna get her little pussy off while you jerk your cock. And how you’re gonna watch and wait and keep jerking. Her breath quickens and her moaning intensifies while she cums. Do you think you can cum now? No, she’s not gonna cum just once. She’s gonna cum over and over again and make you watch.",
  "directors": [],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    }
  ],
  "release_date": "2019-05-30",
  "scene_id": 44710,
  "tags": [
    "Bondage",
    "Brunette",
    "Cuckolding",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fetish",
    "Hitachi",
    "JOI",
    "Kinky",
    "masturbation",
    "MILF",
    "POV",
    "slim",
    "Solo Female",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "Vibrator",
    "white"
  ],
  "title": "KINKY JOI: Chanel Preston Always Cums First"
}