{
  "collections": [
    "Hogtied"
  ],
  "description": "Lacy Lennon is curious about BDSM and all that comes with it. She wants to expand her sexual horizons so today she will do so with The Pope. He doesn't want to scare her off, so he begins with a basic hands above her head standing position. A red gag is put in her mouth and the transition begins instantly. Lacy falls right into the submissive role as if she's done it a hundred times already. Her submission is as real as it gets, and it's clear by her facial expression that she's a natural. The pain comes from spankings, floggers, and clothes pins on her nipples, and she takes all of it in stride. When the orgasms begin, we get to see the true slut emerge and it's a sight to behold indeed. The next scene starts with Lacy in a hogtie suspension, and The Pope enters and rubs her pussy to calm her before the next dose of suffering starts. Once he has used a crop to turn her flesh a nice shade of red, he moves around to her face and administers breath control. She stays fixed on him and every word he utters to make sure that she is pleasing him. After toying with her, he brings in a didlo and fucks her face, then her pussy until she is overcome with orgasms. The final scene has her on her back with her legs spread and the rest of her body pulled in every direction to ensure discomfort. The Pope tells her that this is the moment that she has been building up to. This is the scene where the pain comes, and there will not be any stopping until he sees fit. The pain continues into the orgasms, but then the final torment comes from nonstop orgasms. It's very clear that Lacy has had enough, but this is not her choice any more, but rather his. He is the captain of this ship, and the ride isn't over until he says so. In a move to keep her trust he actually unties one of her hands to give her some comfort while he finishes what he started. He uses her until there is nothing left to give, and then he finally leaves her in a puddle of her own juices.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lacey Lennon",
      "person_id": 62053
    }
  ],
  "release_date": "2019-08-15",
  "scene_id": 44714,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Facial",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Pain",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Fresh Meat: Lacy Lennon is Tied, Tormented and Made to Cum"
}