{
  "collections": [
    "Device Bondage"
  ],
  "description": "Cheyenne is a total badass. She's strong and determined, and nobody fucks with her, unless she wants it. And today she wants to suffer in bondage. She begins on her knees, on top of a box, bound with leather straps, her hands in leather cuffs, and her ankles locked in steel traps. The Pope enters with his flogger, and starts the assault on her flesh with such force that it quickly turns her skin a bright red. Every time he inflicts pain on Cheyenne, she flexes her muscular body and shows us her exquisite definition. She is finally rewarded with multiple orgasms that have her flexing all over again. Next, Cheyenne is put face-down and ass-up, with her wrists and ankles locked in steel shackles that render her completely helpless. This time the implement of torment is a riding crop, and every visible inch of her skin is abused. She may have lots of muscle, but that doesn't mean The Pope can't find a weak spot to prey on. Cheyenne is given all of the torment she can handle, when she suddenly finds herself cumming with imposed orgasms. In the\nfinal scene Cheyenne is on her back with her arms pulled out to her sides, and her\nmuscular legs pinned against her body leaving her helpless. The Pope begins by\ncontrolling her breathing before moving on to some brutal bastinado. He overwhelms her with non-stop orgasms while fucking, vibing, and fingering her slutty pussy. Cheyenne has gotten what she wanted, and then some.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    }
  ],
  "release_date": "2019-09-19",
  "scene_id": 44718,
  "tags": [
    "BDSM",
    "body builder",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Leather Cuffs",
    "Metal Bondage",
    "multiple orgasms",
    "Muscle",
    "muscular",
    "natural boobs",
    "Pain",
    "shaved",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "The Pope",
    "top",
    "white"
  ],
  "title": "Cheyenne Jewel: Body Builder is Restrained in Diabolical Devices"
}