{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Kimber Woods is a really naughty girl, and she wants to show us just how naughty she is by doing all of the things that make her horny. She begins with a quick strip tease that leads to her shoving her panties in her mouth, because, well, that’s what she likes. She makes herself cum over and over by fingering and vibing her pussy with every bit of energy she has. The next scene begins and Kimber has requested a ball gag. We know this isn’t a bondage shoot, but this is what makes her horny, and who are we to say no? She lies back and the machine slowly begins to slide in and out of her wet, hungry pussy. The speed increases and Kimber’s overcome with orgasms and begins to squirt all over the dungeon. In the next scene we flip her over to show off her magnificent ass. The machine starts to ramp up and Kimber begins to almost vibrate with ecstasy. Her juicy booty bounces as she vibrates, and her back glistens with sweat, because the slut is working for every orgasm she gets. Next, Kimber is on her side in a spoon type position when the fucking begins. She can’t believe she’s cum so much, and we continue to fuck her until her pussy has finally had enough. But we are not satisfied yet, so we throw in one more scene and break out the sybian! That’s right, it is the SYBIAN! When all is said and done, we can finally claim that our naughty girl Kimber Woods has been properly fucked.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kimber Woods",
      "person_id": 54178
    }
  ],
  "release_date": "2019-09-25",
  "scene_id": 44712,
  "tags": [
    "Ball Gag",
    "Brunette",
    "dungeon",
    "Fingering",
    "Gag",
    "Machine Dildo",
    "natural boobs",
    "shaved",
    "Straight",
    "switch",
    "Sybian",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Kimber Woods: Our Naughty Girl is Back and Hornier Than Ever"
}