{
  "collections": [
    "Device Bondage"
  ],
  "description": "Nikki Knightly is nervous about her day with The Pope. It’s been a while since she’s been in his hands, so she’s understandably hesitant. She begins in a standing position with her neck, wrists, and ankles locked in place with steel stocks. The Pope eases her into the day with some sadistically sensual groping before he subjects her to any pain at all. But when the pain comes, it comes, and so does she. Nikki has sexualized all of it, and when she’s all bound up, she’s in her happy place. The imposed orgasms begin and she presses her ass back against The Pope, just to feel her captor’s touch. We next find Nikki in the scavenger’s daughter. She has struggled so much that she is exhausted by the time The Pope enters, but he takes no mercy on her and goes straight to work on that beautiful, fuckably body. He uses her like a little toy that he can discard whenever he’s done with her, and she loves the feeling of being taken and used. The Pope uses electrical devices to toy with her before issuing more orgasms that have her twisting and writhing in a futile attempt to escape his clutches. Nikki’s resistance exhausts her, but The Pope continues, relentlessly, putting her on her back with steel shackles holding her wrists and ankles firmly to the table. She feels the sting of more flogging, before she’s made to cum even more. By the end of the day, Nikki is so overwhelmed that she doesn’t know what to do. Submission is not only her only option, it’s her deepest love.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Nikki Knightly",
      "person_id": 58427
    }
  ],
  "release_date": "2019-10-17",
  "scene_id": 44720,
  "tags": [
    "BDSM",
    "black hair",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "shaved",
    "Stocks",
    "Straight",
    "Submission",
    "Tattoo",
    "The Pope",
    "toned",
    "white"
  ],
  "title": "Nikki Knightly: Girl Next Door Gone Goth is Bound and Tormented"
}