{
  "collections": [
    "Bound Gods"
  ],
  "description": "Ace Rockwood has a voice so deep and commanding, there's nothing a sub wouldn't do when ordered. And Ace orders everything he wants from his unsuspecting submissive, Seamus O'Reilly. Ace is dominant in every way, and he doesn't need to scream at his subs to get them to do what he wants. He merely speaks, and upon hearing that deep dark voice, they obey. He subjects Seamus to cropping and flogging, and makes him choke and gag on his giant dick. He fits Seamus with a bar gag to silence his screams as he pounds his little ass with that huge, hard cock. And in the end, used and abused, there is no doubt this little fuck slave is entirely his. We begin with Seamus welcoming Ace to the house as a new dom, but Ace quickly dismisses the pleasantries and makes Seamus is personal slave. He slaps him, inspects his ass, and uses the chain around his neck to put him where he wants him to be. He crops him and flogs him while ordering him to hold his feet off the ground. He then blindfolds Seamus and ties a rope around his neck, anchored to the floor behind him. Submissively rigged, Seamus then chokes down Ace's thick, enormous cock. He coughs and gags on it, but he continues to serve as ordered, even as Ace hangs weights from Seamus' balls. Later, Seamus is fully suspended with his ass presented and a bar gag in his mouth. Ace grips him hard and slams his fat cock deep inside his little hole. Seamus is often a willing submissive, but this pounding is rough even for him, and his ass is left open and wrecked. Once Seamus is fully owned, Ace shoves a glove into his mouth and shoots his thick cum all over it, then slides his fat cock into Seamus' mouth beside the glove. He finally allows Seamus to cum, and makes him slurp the massive load off his boot. Welcome to the house Master Rockwood.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Ace Rockwood",
      "person_id": 62055
    },
    {
      "name": "Seamus O'Reilly",
      "person_id": 51523
    }
  ],
  "release_date": "2019-07-11",
  "scene_id": 44734,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "Boot",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Flogging",
    "Gag",
    "Gay",
    "Hairy",
    "Humiliation",
    "Male Sub",
    "master",
    "Redhead",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Sub",
    "Submission",
    "Tattoo",
    "unshaved",
    "Weights",
    "white"
  ],
  "title": "Huge-Dicked Dom Ace Rockwood Reigns Over Seamus O'Reilly"
}