{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The Upper Floor hosts its filthiest BDSM orgy yet, and this time it’s saddled with two untrained submissive sluts. Victoria Voxx is a gorgeous masochistic bottom who sexualizes suffering. Her sister trainee Zoe Sparx aspires to be the queen of extreme, arriving on The Upper Floor ready to degrade herself for cock and grovel at the feet of our attendees like a little fuck piggy. Both sluts are tied up with tight metal nipple clamps and ball gags and ordered to struggle out of their rope bondage, rip off their nipple clamps and suck the first hard cock they can crawl to. It sounds easy, but once Aiden Starr and Stefanos lay into the trainees’ tender exposed flesh with floggers and trap their pussies with Hitachis the game gets much harder. Victoria makes it out first and throws herself on Rob Piper’s cock eagerly. She is commanded to pull off her own clover clamps in order to stay on the cock and orgasms from the pain. Zoe stands by drooling and whimpering until she is allowed to lick some balls and rub her cunt. To see which servant deserves Rob’s cock in her ass, Stefanos arranges a competitive reverse cowgirl ride. Victoria rides that cock with athletic enthusiasm, even holding her orgasms like a good girl. Zoe meanwhile is thrown on the floor and has her hungry cunt beaten until she comes from the pain to the applause of our amused house guests. However, when it’s Zoe’s turn to ride the cock, she can barely keep a decent stroke going and begs to cum like an undisciplined slut. Clearly, she is the loser and is placed on clean up duty while Victoria treats herself to a magnificent anal fucking, cumming from the giant cock in her ass and the brutal whipping of her tits.\n\nOur guests have worked themselves into an orgiastic frenzy and are swapping partners for blowjobs and other perverted fun. Lovely girls are caned and suspended in rope shibari, while others offer their asses for spankings and fucking. Our most perverted couple Rodeo Kitten and PO are back, and enjoy a rousing scene of whipping, bondage, and pussy torment. Rodeo Kitten suffers beautifully as her sadistic Master lays red whip lashes down on her lithe body while she holds a crystal dildo in her cunt. Her Master rewards her with a quick fucking, but soon throws her on the floor under his boot and commands her to get herself off with her own hand in front of the entire party. She is then brought to her feet and has a bucket clamped to her pussy lips so that she may collect change from the crowd. Zoe is caught sneaking around the party rubbing her neglected pussy. Stefanos gives her a pep talk, explaining that all she has to do is clean up the room, offer the house guests orgasm assistance, and keep a smile on her face while she does it. He then hands her a Hitachi and walks off as she begins to pleasure the first dominant lady to ask for it. It’s not long before Rob finds Zoe and grabs her hungry pussy for himself, fucking her into the tits of a very horny houseguest. Stefanos comes over to admonish and flog her, but in the end Zoe is so amusing, trying to clean and serve and get fucked, that he lets her get run around the room by Rob. Pounded in a doggy position in the middle of the party Zoe manages to keep her tray steady and is thus allowed to cum on a cock finally. Stay tuned for the second half of this party!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    },
    {
      "name": "Zoe Sparx",
      "person_id": 62035
    }
  ],
  "release_date": "2019-07-12",
  "scene_id": 44732,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "Boot",
    "bottom",
    "brunet",
    "Brunette",
    "Clover Clamps",
    "Corporal Punishment",
    "Couple",
    "Dildo",
    "Discipline",
    "fake boobs",
    "Feet",
    "Female Slave",
    "Hitachi",
    "Humiliation",
    "Latinx",
    "master",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Oral Sex",
    "Orgy",
    "Pain",
    "Pierced Nipples",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "Whipping",
    "white"
  ],
  "title": "Orgy of BDSM Players Train Anal Submissives to Fuck and Serve"
}