{
  "collections": [
    "Bound Gods"
  ],
  "description": "Damon Heart is shackled in chains, trapped in Dominic Pacifico’s dungeon, and he’s been locked down for quite a while. The problem is, he can’t keep his filthy, backtalkin’ mouth shut. Until he does, Dominic has decided that the little prick is going to get regular floggings, throat fuckings, and ass poundings. He’ll be humiliated and tormented until he shuts the fuck up and takes his punishment. The scene opens with Damon in chains, blindfolded. Dominic arrives, and immediately the backtalk from Damon begins. Again. Dominic has had enough. He rips off Damon’s underwear and gags him with it, slapping him. He then gives Damon an intense flogging, winding up for an ultimately powerful two-handed strike. But Damon keeps talkin’ back, so Dominic keeps dishing out the brutality. He repeatedly uses the zapper on him, shocking him repeatedly, all while Damon is still blindfolded. But Dominic’s not done with this smart-ass fucker yet. He ties him up and subjects his cock to a good hard cropping. He then attaches brutal little claw clamps to his nipples while he toys with his cock. He lets Damon down and makes him suck his thick dick, throat fucking the mouthy slave. Finally he puts Damon in a partial suspension, with his left leg up, perfect for fucking that tight ass. He slams Damon’s hungry hole, then fucks his mouth through a spider gag. Dominic blows his hot load all over his slave’s face, then chains him up and leaves him there to think about what his backtalk has given him. In Dominic’s absence, her jerks his cock and shoots a fat wad of cum on the concrete floor. But Dominic returns, angry that his little fuck toy just came without permission. He uses the zapper again, tormenting a spent, beaten and fully-fucked Damon.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Damon Heart",
      "person_id": 62074
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    }
  ],
  "release_date": "2019-07-18",
  "scene_id": 44739,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Chains",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Flogging",
    "Gag",
    "Gay",
    "Humiliation",
    "Latinx",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Slave",
    "spider gag",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "unshaved",
    "white",
    "Zapper"
  ],
  "title": "Backtalker: Dominic Pacifico Beats Down Damon Heart's Foul Mouth"
}