{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "This was the first of three shoots we did on a trip to the Peak District the other week, a beautiful national park nestled between Manchester and Sheffield, pretty much where the Midlands meet the North of England. We needed to get out of Essex and have a bit of a road trip and blow the cobwebs out of our heads; we had a list of Northern lasses who wanted to whip out their cracks and get them plundered for all the world to witness; it was a win-win, ladies and gentlemen. And on the day Summer joined us it was Valentine's Day so we thought we'd play true to the spirit of things, especially considering her hubby loves handing her over to other guys to fuck and was getting a real kick out of P having her because he'd been a fan of him for so long.\nThe good doctor P brutally rams his penis in and out of her slutty-mummy-cunny to breathless applause from the thankful slag, as well as doing a few other things to her such as spanking her and choking her and making her squirt and shooting his dairy into her gob and making her drink it. It's a wrap, it's nothing less than the scarlet strumpet deserves, and it's another poptastic production from the UK's premier purveyors of punishment porn (in fact, the only ones) - the Chalkwell Chucklers themselves, Messrs P White and A Baxter!",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Summer Ray",
      "person_id": 62060
    }
  ],
  "release_date": "2019-06-05",
  "scene_id": 44737,
  "tags": [
    "Athletic",
    "big dick",
    "Big Natural Tits",
    "Blonde",
    "Blowjob",
    "brunet",
    "Choking",
    "Collar",
    "Doctor",
    "Fingering",
    "foreskin",
    "High Heels",
    "masturbation",
    "MILF",
    "Nylons Stockings",
    "PIV",
    "Spanking",
    "Squirting",
    "Straight",
    "Sub",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Summer Ray is a 33-yr-old wife from Lancashire and nymphomaniac."
}