{
  "collections": [
    "Bound Gods"
  ],
  "description": "Lukas Tyler stands outside behind a building, dressed in a camouflage military uniform, checking his phone. Walking up from around the corner comes Jack Dyer, looking tough in leather gloves, leather chaps over denim, and tall leather boots. Jack shakes Lukas’ hand and tells him thanks for his service and wishes him a happy Fourth of July. They begin talking about Lukas’ military background and Jack immediately doesn’t buy his bullshit story. Guilty of stolen valor, Jack subdues Lukas and brings him inside. There, Jack puts Lukas face down on the ground and ties him up in rope bondage with three different colors of rope…red, white, and blue. Lukas’ arms are bound behind his back with rope that connects to his boots. Jack takes a seat at his throne and takes down Lukas pants. He crops Lukas’ bare ass mercilessly until his pale ass turns bright pink. He makes Lukas lick his leather boots and Lukas licks them clean and even buffs them with his beard. He strips Lukas naked, ties his hands behind his back, and takes out his flogger. Jack whips his ass repeatedly and Lukas screams though a ball gag. Jack plays with Lukas’ asshole with his leather gloved hands. He takes out the ball gag and replaces it with his pierced hard cock and gags him with it. He face-fucks Lukas until droll pours out of his mouth. Next, Lukas is tied up on his back, blindfolded with a clothespin zipper across his torso, spreader bar between his knees, getting fucked. Jack fucks his ass deep and hard and rips the zipper from his body. He fucks him even harder and gets up to cum down Lukas’ throat.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jack Dyer",
      "person_id": 62058
    },
    {
      "name": "Lukas Tyler",
      "person_id": 62057
    }
  ],
  "release_date": "2019-07-04",
  "scene_id": 44733,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "gloves",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "white",
    "Zipper"
  ],
  "title": "Yankee Doodle Daddy"
}