{
  "collections": [
    "TS Seduction"
  ],
  "description": "Foxxy has had Sherman Maus captive for a very long time. Proving loyalty to her and serving only to please her for so long, today Sherman may finally earn himself a leather collar. Foxxy tells him that if today's session goes well, he'll be able to ditch the metal chain that he's had around his neck. Sherman lies on the ground wearing only a leather jock. Foxxy crouches down next to him and slaps him a bit with a a leather paddle. She peels back his leather jock and starts paddling his big hard cock. Foxxy stands above him and lifts her short skirt up over her big juicy round ass and sits on his face, grinding on it while he licks her hole. She spins around and shoves her cock in Sherman's mouth and twerks her ass with her cock deep down his throat. She teases his cock, biting and sucking it until he's just about to cum but doesn't let him. She lifts his legs and spanks his bare ass with her leather paddle. Foxxy gets naked and sinks her hard cock into Sherman's asshole and fucks it deep. She takes her cock out of his hole and slides both of her hands in and out of it and then finally one entire fist. She fucks his slutty ass with her fist and his dick gets even bigger. For the grand finale, in order to earn his collar he must take Foxxy's biggest dildo up his ass. She grabs a dildo about the width of a fire hose and as long as her arm and puts Sherman on his hands and knees. He backs onto it like a pro and his hungry slutty ass eats the whole thing. He turns over onto his back and takes the enormous toy even further up his ass and Foxxy gets so turned on by the site that she cums hard, blowing her load on his cock. She finishes him off with her hand and makes him eat his own cum.",
  "directors": [],
  "models": [
    {
      "name": "Sherman Maus",
      "person_id": 62063
    },
    {
      "name": "TS Foxxy",
      "person_id": 20055
    }
  ],
  "release_date": "2019-10-01",
  "scene_id": 44747,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Anal Stretching",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Collar",
    "Dildo",
    "fake boobs",
    "jock",
    "Latin",
    "Leather",
    "Male Sub",
    "Paddle",
    "Role Play",
    "Straight",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Maus Trap: TS Foxxy Rewards Her Loyal Servant, Sherman Maus"
}