{
  "collections": [
    "Men On Edge"
  ],
  "description": "Welcome Vincent O'Reilly to Men on Edge! Vincent has a hot body, a beautiful smile, and a gorgeous monster cock. He enters the studio eager to start the day and stands still as Sebastian Keys ties him up. While Sebastian winds the rope around his body, Dominic Pacifico rubs up against Vincent. Dominic sinks to his knees and mouths his cock through his clothes. Once Vincent is tied with a spreader bar between his ankles, they cut off his shirt revealing a toned chest. The outline of his beautiful hard cock in his briefs looks too good to resist. Dominic runs his hands along the length of it, teasing it with his hands and mouth as Sebastian plays with Vincent's sensitive nipples. Everything feels so good, Vincent fucks into Dominic's hand, his moans growing louder and louder. Sebastian gags him, muffling his slutty cries. They continue to edge him as Vincent gets more and more worked up. Dominic sucks his cock as Sebastian places nipple suckers on his chest. They use a thick masturbation sleeve on his fat cock. Soon Vincent is begging to cum, but Sebastian and Dominic have more in store for this eager boy. Next, Vincent is blindfolded and bound. Unable to move or see, Vincent is helpless Dominic sucks on his feet and Sebastian teases his cock head with a vibrating sleeve. Vincent moans, trembling in bondage. Then they spread his ass cheeks and push in a dildo. Vincent groans as it slips inside him, and once it starts vibrating in his ass, Vincent about ready to burst. He begs to cum as Sebastian fucks his tight ass as Dominic swallows his cock deep. Dominic pushes his fingers into his boy's ass as he continues to suck his boy's big cock. Desperate to cum, Vincent pleads and pleads to cum. Finally, Dominic grants Vincent release and Vincent shoots a big fat load.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Vincent O'Reilly",
      "person_id": 62160
    }
  ],
  "release_date": "2019-08-20",
  "scene_id": 44743,
  "tags": [
    "BDSM",
    "Bondage",
    "Dildo",
    "Edging",
    "Feet",
    "Gay",
    "Male Handler",
    "Male Sub",
    "masturbation",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling",
    "toned"
  ],
  "title": "Sir, Daddy, and Boy: Vincent O'Reilly Serves the House"
}