{
  "collections": [
    "TS Seduction"
  ],
  "description": "Welcome fresh-faced beauty Andylynn Payne to Kink for her first porn shoot! Today she has an appointment with Dr. Wolf Hudson, on order from the Dean. Dr. Hudson has heard all about Andylynn. She’s been caught masturbating in the nurses’ office and sending lewd videos to the faculty. But as cute and sexy as Andylynn is, Dr. Hudson isn’t sure she’s as bad as she claims to be. Before he can administer any corrective treatment, he has to know for sure if she really is a bad girl, so he makes her prove it. He takes Andylynn over his knee and delivers a firm spanking while laying down the rules for their time together. He has her strip and tell him all the dirty things she’s done while he flogs her. Andylynn moans as the flogger strikes her ass. She shares her fantasies with the Doctor and tells him how much she loves cock. She sinks to her knees and takes his cock in her mouth. She swallows every inch to prove to Dr. Hudson she’s as bad as they come. Next, Doctor puts her on her back and crops her tits and feet. Andylynn loves feeling the sting of the leather on her skin. Soon, Dr. Hudson is sinking his cock into Andylynn’s luscious ass. Andylynn smiles and moans as Dr. Hudson gives her a rough fucking and spits in her mouth. She loves the way his cock fills her up and is soon begging to cum. Dr. Hudson gives her permission to cum if she can do it with his cock in her ass. Andylynn blows her load all over her belly and then begs for the Doctor’s cum. He pulls out and cums all over her. He pushes his hand through their combined spunk on her belly and wipes it all over her face before instructing her to clean off his fingers. Andylynn eagerly takes his fingers in her mouth and sucks them clean. When Doctor instructs her to come back tomorrow, Andylynn eagerly agrees, eager to please and continue her treatment.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Andylynn Payne",
      "person_id": 62076
    },
    {
      "name": "Wolf Hudson",
      "person_id": 14471
    }
  ],
  "release_date": "2019-09-10",
  "scene_id": 44746,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "black hair",
    "Blowjob",
    "braces",
    "Cock Worship",
    "Crop",
    "Doctor",
    "Facefucking",
    "Feet",
    "First Porn Shoot",
    "Flogging",
    "foreskin",
    "Latinx",
    "Leather",
    "Male Fucks TS",
    "OTK",
    "Role Play",
    "Rough Sex",
    "Spanking",
    "spit",
    "Straight",
    "TS",
    "unshaved"
  ],
  "title": "The Good Doctor: Bad Girl Andylynn Payne Visits Dr. Wolf Hudson"
}