{
  "collections": [
    "Men On Edge"
  ],
  "description": "Dillon Diaz is a muscled stud who loves to have his dick sucked and his ass played with, which makes him perfect for several rounds of edging with Sebastian Keys and Chance Summerlin. Dillon puts his fate in their hands as he's tied up, blindfolded, gagged and suspended, and his fat dick gets worked, sucked and edged, again and again until he finally blows his thick load. Dillon starts blindfolded, with his upper body in bondage, tethered to the ceiling, and his ankles bound to the floor. His mobility is restricted and his vision blocked, so he can't easily wrestle away, or even know what's coming, which makes the hands on his body and mouth on his cock even more intense. Chance slurps on his hard dick while Sebastian adds nipple suction cups, then brings in the cock stroker. Chance works and sucks Dillon's cock, bringing him to the edge, before tickling him...for the first of three times. They then return to working that fat dick, jerking him off and letting him thrust in a futile effort to cum. Sebastian and Chance then turn their attention on his beautiful ass. They shove a fucking machine up his hole and let it fuck him as Chance again takes his dick in his wet, hungry mouth. After another orgasm denial, Dillon is suspended on his back, again tethered to the ceiling by multiple ropes. He's got a bar gag in his mouth and his wrists and ankles restrained, so once again he's a slave to the whims of his masters. They tease him with another cock stroker, bringing him to the edge and then pulling him back. Tickling him again on his feet, which drives him utterly wild. They shove a butt plug up his perfect ass, worship his feet and cock, and then intently get to work making that dick of his ready to cum. This time they go right over the line, working his cock to the point of no return. Dillon's been edged like crazy, so when he shoots he can barely contain his moans and screams. Sebastian torments his sensitive cock head, then they tickle him a third, and most excruciating time. Dillon gets a full workout, from head to dick to toe, then back to that dick. He has a blast doing it, and Sebastian and Chance have a blast making it happen.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    }
  ],
  "release_date": "2019-08-06",
  "scene_id": 44744,
  "tags": [
    "BDSM",
    "Bondage",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Orgasm Denial",
    "Prostate Stimulation",
    "Rope Bondage",
    "Slave",
    "Stud",
    "Tickling"
  ],
  "title": "Dillon Diaz Perpetually Rigged to the Ceiling, Suspended and Edged"
}