{
  "collections": [
    "Bound Gods"
  ],
  "description": "Colby Tucker is back and at the mercy of director Sebastian Keys! He’s blindfolded and chained to the wall with his hands cuffed to his thighs. Wearing leather pants, a black tee, and heavy black boots, Sebastian arrives ready to see what this tough slut can take. He slaps Colby’s beautiful chest, and punches Colby’s stomach. Colby grunts with the impact, his torso turning a rosy red under Sebastian’s masterful hands. Next, Sebastian adorns his chest with clothespins. Colby squirms as Sebastian runs his hands along them and flicks them up and down. Sebastian now tends to Colby’s rock hard cock. He smacks it, and Colby yelps in pain. Colby tries to close his legs, but Sebastian commands him to keep them open or else he’ll earn more smacks for disobedience. Next, Colby is suspended from all four of his limbs. Sebastian spanks and flogs his tight ass, taking time in between hits to taste it. Colby moans as Sebastian’s wet mouth closes around his asshole. As his beating continues, Colby tries to pull himself up to avoid the hits, but there’s nowhere to go. Then he’s put on his knees to service his Master. He swallows Sebastian’s cock, worshiping every inch. Sebastian pulls out the violet wand and runs it along Colby’s chest. Colby shivers as the electric wand rakes across his skin and makes its way to his asshole. He moans as Sebastian pushes it and fucks him with it. Next, Colby is put in metal and rope bondage as Sebastian fucks him. Unable to move, Colby moans as Sebastian plunders his tight hole before blowing his load all over his ass. Unable to resist, Sebastian licks his cum off his boy’s perfect bottom. Finally, Colby blows his load all over Sebastian’s leather boots and licks it all up.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Colby Tucker",
      "person_id": 61945
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2019-08-01",
  "scene_id": 44741,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "switch",
    "Tattoo",
    "the wall",
    "versatile",
    "Violet Wand",
    "white"
  ],
  "title": "Tucker Bound: Colby Tucker Used and Abused by Sebastian Keys"
}