{
  "collections": [
    "Bound Gods"
  ],
  "description": "Chance Summerlin stands completely naked, arms outstretched, tied to the wall with rope. With his balls and hard dick wrapped in rope bondage, he waits blindfolded for his Master, Sharok. Sharok enters the scene, muscles bulging through an all red latex bodysuit. He spits in Chance’s mouth and slaps his chest with his bare hands. He crops Chance’s ass hard and Chance screams, begging for more. Sharok turns him around and crops Chance’s balls repeatedly. After that, Sharok sets Chance’s dick free from the ropes and tells him he has ten seconds to get his dick hard and he’ll get a reward. Chance quickly gets his dick hard before the ten seconds is up and Sharok makes good on his deal and sucks Chance’s cock. While he’s down there, he places multiple clothespins around Chance’s nutsack and continues blowing his cock. Sharok ties Chance’s hands behind his back, bends him over, and takes his blindfold off. He puts a spider-gag between his teeth. He grabs Chance’s head and pulls it down to his hard dick and fucks his gaping drooling mouth. Sharok takes the spider-gag out of his mouth to better hear Chance scream as he gets hit with the flogger. Sharok wales on Chances ass, repeatedly flogging him until his ass turns bright pink. Next, Sharok ties Chance to an old reclining chair with rope. His legs are spread completely open in the splits, and his hands are tied to his sides and secured to the chair. Sharok gets a white cloth and places it over Chance’s face and begin’s pouring water over it. Chance wiggles and gasps from under the wet cloth and before Chance can catch his breath, he sticks his dick in his mouth and fucks his throat. He rams his hard dick into Chance’s presented asshole. Sharok gorilla fucks his ass hard and fast and blows his fat load all over Chance’s face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Chance Summerlin",
      "person_id": 60103
    },
    {
      "name": "Sharok",
      "person_id": 62054
    }
  ],
  "release_date": "2019-07-25",
  "scene_id": 44740,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gag",
    "Gaping",
    "Gay",
    "Humiliation",
    "Latex",
    "Latinx",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "the chair",
    "the wall",
    "white"
  ],
  "title": "Bad Little Fucker"
}