{
  "collections": [
    "Bound Gods"
  ],
  "description": "Vincent O’Reilly is an adorable, sweet, sexy guy with a beautiful, round ass and big, fat cock. He’s never been tied up before, so today his master Jacen Zhu breaks him in. He ties him up, slaps him around, stuffs his ass with an electric butt plug, flogs him and fucks him. Jacen is a sexy muscled dom, who can’t wait to get started breaking Vincent in, so he wastes no time. He walks in on Vincent, finding him tied up and ready. His hands are bound behind his back and he’s tethered to the ceiling. Jacen inspects his new toy, who writhes in anticipation, hungry to get smacked around, face-fucked, and ass-slammed. Jacen uses a brutal paddle on him, smacking his torso with stinging impact. He lubes up Vincent’s cock and strokes it, driving Vincent wild with pleasure, but then the paddle comes out and Jacen smacks that dick around with it. Vincent actually gets off on this, so Jacen turns up the intensity. He smacks his ass and buries his face in it, opening him up for what’s to come. He then slides an electric plug up Vincent’s sweet hole and cranks up the juice. Vincent continues to writhe with both pleasure and pain, as Jacen continues to enjoy his tied up little fuck toy by face-fucking him. Vincent devours it, swallowing that cock and choking on it with abandon. Jacen pulls the plug out of Vincent’s hole, and slides his cock into that sweet, hungry ass. He puts Vincent on his back, cracks out the flogger and swats his fucked ass, then shoves his cock back inside and gives him a good hard pounding. Jacen shoots a giant load all over Vincent’s greedy mouth, and as a final humiliation, he feeds it to him.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jacen Zhu",
      "person_id": 61943
    },
    {
      "name": "Vincent O'Reilly",
      "person_id": 62160
    }
  ],
  "release_date": "2019-08-15",
  "scene_id": 44742,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Choking",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Paddle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "unshaved",
    "white"
  ],
  "title": "Training Day: Newbie Vincent O'Reilly is Taught the Ropes by Jacen Zhu"
}