{
  "collections": [
    "CFNMEU"
  ],
  "description": "Kolja Muskanec is gagged, and his hands are shackled high above his head. He is wearing just his army boxers and is soon joined by a sexy colleague. She has a whip and starts to flick at Kolja’s body with it. Taking some clamps, she attaches them to his nipples and pulls on them. Kolja moans as he feels it and then the whip lands on his hot body again. His underwear is pulled down, exposing his sexy ass and his soft cock. The girl keeps whipping on his ass and thighs. Then she takes hold of Kolja’s cock and wanks it a little, feeling it start to swell. She then oils his body and then returns to wanking his cock until it is rock hard. She keeps up the whipping and clamps his balls too. His bulbous headed cock stands proud, and the girl uses a vibrating toy against his balls and along the length of his sensitive cock. She moves him re-arranging his shackles so that his legs are up. She starts to fuck his ass with a vibrator, making Kolja moan. Then he screams as a thicker one goes in that ass. That is then replaced with another, that goes in nice and deep. With the hole opened nicely, a dildo on a stick is shoved deep into his ass. It fucks him hard as he keeps up his moaning. The girl moves Kolja onto his knees so that she can fuck him with her strap on. She releases Kolja from his shackles and the gag and oils his body before wanking his thick cock again until it shoots his stringy, creamy load. Then she lets Kolja go off to the shower to clean up.",
  "directors": [],
  "models": [
    {
      "name": "Kolja Muskanec",
      "person_id": 62061
    },
    {
      "name": "Lucy Vojak",
      "person_id": 62062
    }
  ],
  "release_date": "2019-06-05",
  "scene_id": 44745,
  "tags": [
    "Anal",
    "bit gag",
    "Bondage",
    "brunet",
    "Brunette",
    "CBT",
    "Dildo",
    "dungeon",
    "Edging",
    "Femdom",
    "Flogging",
    "Gag",
    "Hitachi",
    "Leather Cuffs",
    "Male Sub",
    "Muscle",
    "Nipple Clamps",
    "Nipple Torment",
    "Pegging",
    "Straight",
    "Strap On",
    "Suspension",
    "Partner Studio",
    "Uncircumcised",
    "Vibrator",
    "Whipping"
  ],
  "title": "Sexy soldier Kolja Muskanec is given a hard time by his colleague."
}