{
  "collections": [
    "My Dirtiest Fantasy"
  ],
  "description": "It wouldn’t be everyone’s idea of a fun time, but for young Caspar who comes from Sweden, the notion of being totally restrained on his back with his arse exposed for any other guy to do what they like to it is something that turns him on big time. All the more so because he can’t actually see who it is who’s giving his ass the attention! Cue the entrance of three very horned up fuckers who are literally dying to give this young perv a totally sordid workout; first rimming his right little pucker, and then taking it in turns to fuck the little whore. Not content, they then proceed to give him an enema of piss, before returning to a good old-fashioned fuck. Just seeing the young chap laid out in all his glory, unable to see what’s going on but clearly loving every fucking minute of it, is enough to get you churning out a heavy, appreciative load. But for those who like to see fresh-faced twinks getting totally humiliated, the sight of this lad then having a bucket load of fresh piss poured all over his face, via a plastic pipe, will surely be too much to bear. In short, a totally perverse, no-holds-barred escapade that quite literally pushes acceptability to a new shamelessly piss-soaked level! Beautiful!",
  "directors": [],
  "models": [
    {
      "name": "Alex Roman",
      "person_id": 61045
    },
    {
      "name": "Alexis Clark",
      "person_id": 62065
    },
    {
      "name": "Casper Ellis",
      "person_id": 60731
    },
    {
      "name": "Dominique Kenique",
      "person_id": 62064
    },
    {
      "name": "Kevin Brandon",
      "person_id": 62071
    }
  ],
  "release_date": "2019-06-11",
  "scene_id": 44750,
  "tags": [
    "Bareback",
    "Bear",
    "black hair",
    "brunet",
    "Enema",
    "foreskin",
    "Gay",
    "Piss Play",
    "Rimming",
    "Partner Studio",
    "Twink",
    "white"
  ],
  "title": "Sexy Twink Gets Group Fisted and Pissed On RAW"
}