{
  "collections": [
    "Lakeview Entertainment"
  ],
  "description": "This slut starts out underfoot of Mistress Tangent, Mistress Ivy and Mistress Kate at the famous Den in Phoenix Arizona. He has come in on a Saturday night and these three are looking for someone to play with and use. The energy is crackling as they soften him up under their high heels and then make them kiss each of their asses in turn to thank them for the torment. He becomes their human spittoon as Mistress Kate ties up his cock and balls. Intense CBT mixed with humiliation, spitting and ass worship as it looks like he in for more than he bargained for with these three vixens.\n\nMistress Ivy has him kissing and licking Her ass while Mistress Tangent’s well manicured fingers squeeze his bound balls. Mistress Kate busies Herself holding his head and they all spit down his throat multiple times. Three gorgeous Pro Dommes in full swing on the hapless male. Mistress Kate torments his taint and balls with the razor sharp pinwheel as the three continue to challenge his pain threshold. Spit flies and his cock and balls are tormented to the limit before he is moved on top of the cage where they begin nipple and cock torment. The beautiful Mistress Ivy straddles his face and smothers him. As he struggles Mistress Tangent and Mistress Kate work over his sensitive bits. Mistress Ivy removes Her thin black panties and orders him to worship Her asshole as Her partners clamp his cock and balls after Mistress Tangent ties Mistress Ivy’s panties to his shaft. Mistress Kate goes after his balls with the pinwheel as Mistress Tangent works the shaft and nipples with the clamps, all the while Mistress Ivy is smothering him under Her bare pussy and ass.\n\nWith his cock bound clamped and being jerked by Mistress Tangent and Mistress Kate using the pinwheel and slapper on his balls, he tries to struggle but Mistress Ivy’s bare ass is attached to his face and he can only siggle and take their punishment. They laugh and scream with amusement. Then the three use him as their spittoon. Mistress Tangent holds his mouth open wide and they drool buckets of spit into him and make him hold it in his mouth before swallowing on command. Mistress Tangent switches places with Mistress Ivy and drops Her bare pussy onto his face after stuffing the panties into his mouth. This is brutal Pro Domme smother as Her partners work non-stop on his cock and balls She wiggles Her perfect ass and denies him breath. Mistress Ivy jacks his cock in Her gloved hand to try and get it hard as Mistress Kate torments his balls and then they flip him over and Mistress Kate is the first to put Her strap-on on as Her partners hold his ass open and lube it up before finger after finger penetrates his hole. Mistress Tangent has a clear spanker She uses to warm up his ass while he rears up to suck Mistress Kate’s cock.\n\nThe other two encourage him to suck and deep throat Mistress Kate’s big rubber cock as She jams it down his throat. They slide him down the table so his head is back and Mistress Kate face fucks him while Mistress Ivy and Mistress Tangent enjoy watching and tormenting him to take it further down his throat. Mistress Kate crawls up on top of him to face fuck him as the other two put their strap-on’s on and congregate by his ehad to lube him with spit. They try and jam all three of their cocks into his mouth at once, laughing with delight. Mistress Kate stands over him and they all spit into him again and again.\n\nMistress Kate takes a final spit down his throat and then relinquishes Her spot between his legs to Mistress Ivy whose favorite sport is strap-on. She idly yanks his cock like taffy and then fucks him while Mistress Tangent stuffs his mouth full of Her cock. Mistress Ivy uses the vibrator on his useless prick and Mistress Ivy holds his legs up and makes him Her bitch. They move the hapless submissive to the swing where Mistress Kate takes the first crack at his ass as Mistress Tangent and Mistress Ivy work over his cock and fuck his face. Mistress Tangent tag teams Mistress Kate and uses Her hand on him and then fucks the hell out of his ass while Mistress Ivy fucks his face and Mistress Kate keeps his balls in torment. Three gorgeous Pro Dommes having a splendid time using a male together.\n\nMistress Tangent fucks the swing bound slave as Mistress Ivy face fucks him and then they switch so that Mistress Ivy can jam Her cock back into his supple hole. Mistress Kate applies the nipple clamps again and replaces Mistress Tangent to face fuck him as Mistress Tangent torments his cock, balls and nipples then they all rotate once again and Mistress Kate drills his ass. They twirl him around on the swing laughing and having a grand time with him. Mistress Ivy decides She wants Her wet swollen pussy on his face and clamps Her slender thighs around his head as Mistress Tangent fucks him. Mistress Kate climbs on top and applies the pinwheel to his cock and balls. You can barely make out the suffering slave trapped in the clutches of these three beauties. Mistress Tangent takes some final fucking and then they slow a bit and Mistress Kate leisurely sticks Her cock in them as they assess what is left of the submissive. At the end he is moved to the St. Andrews Cross where Mistress Ivy and Mistress Tangent are whipping him.\n\nMistress Tangent applies nipple clamps to his sensitive nipples as Mistress Ivy flogs him. They stand side by side and beat his thighs as he suffers for the mon the cross. Mistress Kate gathers some pins and approaches as they whip, bending low to start tormenting his balls and cock with the pins. Some great stern CBT as all three focus their attention on his cock and balls. Mistress Tangent steps back and whips him some more and then Mistress Ivy uses the violet wand to make him suffer for their amusement. She changes attachments after using the electrics on his cock head and goes after his balls and shaft as Her partners fingering his nipples and flog him some more. Mistress Ivy and Mistress Tangent do a dual flogging to end the session with a very happy, very exhausted submissive hanging on the cross.",
  "directors": [],
  "models": [
    {
      "name": "Mistress Ivy",
      "person_id": 62070
    },
    {
      "name": "Mistress Kate",
      "person_id": 62069
    },
    {
      "name": "Mistress Tangent",
      "person_id": 61815
    },
    {
      "name": "Slave",
      "person_id": 62068
    }
  ],
  "release_date": "2019-06-07",
  "scene_id": 44756,
  "tags": [
    "Anal",
    "Cage",
    "CBT",
    "Clothespins",
    "Clover Clamps",
    "Collar",
    "Dildo",
    "drool",
    "dungeon",
    "Facesitting",
    "Facefucking",
    "Femdom",
    "Fingering",
    "Flogging",
    "gloves",
    "High Heels",
    "Hood",
    "Humiliation",
    "Lingerie",
    "Mask",
    "mixed",
    "Nipple Clamps",
    "Nipple Torment",
    "Paddle",
    "Pain",
    "Pegging",
    "Pussy Eating",
    "Rimming",
    "slapper",
    "Slave",
    "Smothering",
    "spit",
    "Spit Roast",
    "Straight",
    "Strap On",
    "Suspension",
    "switch",
    "Tattoo",
    "the cross",
    "Partner Studio",
    "top",
    "Vibrator",
    "Violet Wand",
    "Whipping"
  ],
  "title": "Triple Terror"
}