{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The second half of our BDSM swinger soiree opens with Victoria Voxxx hanging in a painful shibari ball tie with her ass ripe for fucking by Rob Piper. Zoe Sparx has her petite body placed in a painful endurance squat holding weighted buckets. Both sluts must hold their orgasms until they learn the house rules. This is no small feat when surrounded by sadistic perverts that want to see both whores punished. Victoria takes her anal fucking like a good little sex toy while Zoe sweats and pleads and eventually degrades herself enough that the party-goers teach them the rules of the House. Reciting the rules through their screams, both submissive sluts earn a barrage of brutal orgasms to the delight of the perverted swingers around them. Zoe is finally granted some cock, and grovels on her knees swallowing as much as she can. She is such a greedy little bitch that Rob takes pity on, and fucks standing in the middle of the crowd while Stefanos beats her for not waiting her turn. The crowd is alive with wild sexual energy. Some guests have brought a fucking machine and rail a beautiful female guest with a freshly beaten ass while she cums uncontrollably. Shibari suspensions and swinger sex games fill the room with the sounds of sensual delight and enthusiastic blowjobs. It has come to Aiden Starr's attention that Victoria Voxxx has never submitted to a woman. Aiden wastes no time in putting Victoria to the test in a pile driver bondage position, whipping her swollen clit and asshole with cruel conviction. Victoria owes her for all the dick she has gotten that evening, and Aiden will take her payment in pain. Tight metal clover clamps are placed tightly and pulled off again and again while Victoria has more pain orgasms than she thought possible. Aiden breaks her wide open, shoving both her hands in Victoria's ass and pussy, plunging her tight whore holes until she is shivering with orgasm overload. Made to grind out one more orgasm by humping Aiden's boot, Victoria finally gets into a stressful back-bend and licks Aiden's pussy until her Mistress is satisfied. Stefanos calls the whole party together again and demands that both submissives prove their worth in their fields of specialty: pain and humiliation. Victoria is clamped with a gigantic zipper that stretches from her collar down to her pussy lips and waits gracefully to have it torn from her flesh. Through this, she still manages to orgasm and recite the rules with aplomb. Zoe proves her use as a fuck piggy, squirting again and again on Rob's cock for the the amused house guests. Once the party-goers have voted, both sluts will receive a hot load of cum, and perhaps a collared position with The Upper Floor.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    },
    {
      "name": "Zoe Sparx",
      "person_id": 62035
    }
  ],
  "release_date": "2019-08-09",
  "scene_id": 44771,
  "tags": [
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "Boot",
    "brunet",
    "Brunette",
    "Clover Clamps",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Humiliation",
    "Latin",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Petite",
    "Pierced Nipples",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Swingers",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "Whipping",
    "white",
    "Zipper"
  ],
  "title": "Masochistic Anal Sluts Suffer and Squirt For BDSM Party"
}