{
  "collections": [
    "CFNMEU"
  ],
  "description": "Milan Pokorny is in for a medical check-up. The sexy nurse who is going to examine him has some questions first; then she tells Milan to remove his shirt. She checks his back and then listens to his chest. She continues the examination, checking eyes, neck, and mouth. Then she tells Milan to remove his jeans too and to lay on the table. The nurse presses on his belly and then lowers his underwear a little to feel more. She massages the belly area and then removes Milan's underwear. His cock seems to be stiffening and lays on his belly. The nurse takes some lotion and rubs his groin area, her fingers rubbing against the swollen cock. That cock gets even harder, and she takes hold of it and slowly wanks it. Then our naughty nurse leans forward and takes the cock in her mouth. She sucks and wanks that cock a while. Then she moves Milan to the exam chair, with his legs in the air. That way she can insert the scope into his tight ass to check it out. The scope stretches his tight hole then is removed. The nurse slides a gloved finger into the hole and gently fucks it. The finger works into the tight hole, and a second one goes in too. Then she says she needs to go deeper. She works the fingers in as far as she can and then removes them to probe with something else. A dildo is pushed into Milan's hole, going deep. The nurse fucks his ass with the dildo as she also wanks his rock hard cock. Then she removes the dildo and shoves a different one into that hot ass. She wanks his big cock too and then removes the dildo and pulls on his ass cheeks to check the open hole. Having loosened that hole she moves onto more. The nurse puts on a strapon and has Milan suck on the rubber cock. Then she lays him over the table and shoves her rubber dick deep into his ass. She fucks him a while and then lays on the table so Milan can slide his ass over the strapon. He rides in and wanks his cock. Then as the examination comes to an end, Milan lays on the table and wanks himself until he delivers a squirting cumshot.",
  "directors": [],
  "models": [
    {
      "name": "Dominantni Sestra",
      "person_id": 62032
    },
    {
      "name": "Milan Pokorny",
      "person_id": 62101
    }
  ],
  "release_date": "2019-06-19",
  "scene_id": 44798,
  "tags": [
    "Anal",
    "Anal Stretching",
    "Big Natural Tits",
    "Dildo",
    "Male Sub",
    "Medical Fetish",
    "Nurse",
    "Oral Sex",
    "Pegging",
    "Squirting",
    "Straight",
    "Strap On",
    "thirdparty"
  ],
  "title": "Medical Check Up: Milan Pokorny"
}