{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "The gorgeous Mona Wales knows full well how the BDSM lifestyle is a clear path to sin. She is completely over that life and has started a new Intervention Business to help those still participating in that dark world. Tonight she has been hired to abduct and deprogram the stunning Korra Del Rio. Deep asleep in her bed and dreaming filthy perverted thoughts, Ruckus breaks in and abducts this beauty. Back in the dark deprogramming room, Ruckus gets to work on Korra who is fully restricted and gagged. The only true way to rid a person of these filthy desires is through bondage and discipline. With a violet wand, Ruckus begins to shock Korra with screaming pain. But soon, those screams turn in to pleasure. This procedure is too much for Ruckus and Mona Wales must do the work herself. Korra is restrained to a bed when Mona arrives. Mona understands the Korra must learn trust to break free of these desires, but the tables are turned. Korra grabs Mona by the throat and begins to unleash all her filthy pervert desires. Removing Mona's clothes and revealing her tight body and beautiful tits. Korra can't help herself and begins to dominate Mona. Rubbing her pussy and slapping her tight ass. Korra goes down on Mona for pussy eating which gets Mona screaming. Mona takes out Korra's rock hard cock and goes to work. Deep throat cock sucking like Korra has never felt before gets her ready for more. Mona takes a deep pounding by Korra and screams in orgasm and begs to be covered in Korra's perverted cum. This procedure starts at 25 thousand dollars and we can start tonight!",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2019-07-29",
  "scene_id": 44816,
  "tags": [
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cock Worship",
    "Discipline",
    "Dominatrix",
    "foreskin",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "Role Play",
    "shaped",
    "Slapping",
    "slim",
    "Straight",
    "switch",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Violet Wand",
    "white"
  ],
  "title": "Twisted Intervention: Korra Del Rio Turns the Tables on Mona Wales"
}