{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Arabelle has had a long day. She's ready to get home and relax with her submissive Corbin Dallas. She calls him into the house and has him take off her shoes and massage her feet. She wiggles out of her tight skirt and lets Corbin worship her perfect ass. Corbin is so happy his Mistress is home and eagerly buries his face in between her cheeks, kissing and licking every inch of glorious flesh. Corbin gets so caught up, he starts touching his cock without permission. And Arabelle is none too pleased when she catches him in the act. She was hoping to use Corbin to relieve some stress and fuck her bad day away, but now it looks like he needs to be punished. She has him lie down as she berates him for his selfish action and teases him with what their afternoon together could have been. She grinds her pussy against his hard cock and smothers him with her big tits. Corbin moans under the glory this magnificent goddess. Arabelle then takes him over her knees and delivers a firm spanking that has Corbin harder than ever. She has him present his asshole and pushes her long fat cock in all the way to the base. Corbin moans as his Mistress' cock fills his hungry greedy hole. Arabelle fucks Corbin as he professes his gratitude for being graced with her cock. Once his hole is stretched out, Arabelle gloves up and pushes her entire fist in his asshole. Corbin moans as Arabelle fist fucks his gaping hole while masturbating. Finally, she allows him to lick her pussy before sinking onto his rock hard cock. She rides his cock for her pleasure, taking everything she wants from his body. Then she commands him to fuck her. Corbin pushes into her sweet cunt and fucks her just the way she likes. Each stroke brings Arabelle closer and closer to orgasm. Once she's had her fill, she has him jerk off into her hand and feeds it to him. Afterward, she sends him to the bathroom for more fun.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Corbin Dallas",
      "person_id": 51921
    }
  ],
  "release_date": "2019-08-13",
  "scene_id": 44815,
  "tags": [
    "Athletic",
    "BDSM",
    "Big Tits",
    "black hair",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Gaping",
    "gloves",
    "Humiliation",
    "Male Sub",
    "mixed",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Piss Play",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "unshaved",
    "white"
  ],
  "title": "Even Good Boys Fuck Up: Arabelle Raphael Teases and Punishes Slave"
}