{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Dr. Natalie Mars has created Charlotte Sartre to study the advancement of human sexual growth. Though various nodes placed throughout Charlotte’s body, Dr. Mars is able to experience the same sensations as her Charlotte. But every experiment comes with some set backs and today Charlotte is having trouble with her anal node. Dr. Mars wastes no time in getting Charlotte undressed and ass up on her metal lab table. She probes Charlotte’s ass with her fingers before using several metal plugs to stretch her anal cavity, so she may peer inside. After visually examining Charlotte’s anal cavity, Natalie decides it’s time to try and reboot the system using electricity. She places anal beads with an electric current in Charlotte’s ass. Charlotte moans as the beads pulse inside her. Next Natalie decides they better try a bigger toy. Charlotte takes a thick electro dildo in her ass, but the problem persists. If Charlotte’s anal node is functioning properly, perhaps it’s the one in Dr. Mars that needs to be reset. With Charlotte’s ass filled, Dr. Mars inserts an electro plug into her own ass to test that theory. She moans as the plug fills her up and leans over to make out with Charlotte. At last it becomes clear that Dr. Mars needs her own anal node reset. She commands Charlotte to restrain her and reset her node. Charlotte obeys, restraining Natalie and kneeling down to fist Natalie’s ass open. Natalie moans as Charlotte fist fucks her hole and stretches it open. Nodes reset, Natalie and Charlotte must test their link. Charlotte deep throats Natalie’s cock before Natalie bends her over the table for a hard pounding in doggy and then missionary. Natalie nips at Charlotte’s legs, and licks and bites her sensitive feet. Charlotte loves getting fucked and rides Natalie before Natalie pushes her on her back and fucks her hard before cumming all over her belly.",
  "directors": [],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2019-09-09",
  "scene_id": 44817,
  "tags": [
    "Anal",
    "black hair",
    "Blowjob",
    "bottom",
    "Brunette",
    "Cock Worship",
    "Dildo",
    "Electro Plug",
    "Feet",
    "natural boobs",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "Tattoo",
    "tea2020",
    "toned",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Lab Rats: Anal Orgasms with Natalie Mars and Charlotte Sartre"
}