{
  "collections": [
    "Divine Bitches"
  ],
  "description": "With a face covered in bandages, naked from the waist down, and lying on a hospital gurney, Jonah Marx appears to be unconscious. Nurse Dee Williams comes to check his vitals and slaps him in the face, waking him up suddenly. Confused, Jonah finds himself strapped to the hospital bed by his wrists and ankles. He can’t remember what happened. Nurse Williams reminds him that he’s been in a terrible accident and Jonah isn’t sure that she’s telling the truth. She insists that she must cane his thighs to test the feeling in his legs. She grabs her cane and whips him from his thighs up to his chest, leaving red stripes across his body. She applies surgical clamps to Jonah’s nipples and then four of them onto his sack. Nurse Williams rolls a pinwheel slowly across Jonah’s cock and he yells in agony. She wheels him out to the middle of the floor in a wheelchair and makes him suck her huge amazing tits. She dumps him on the ground, gets naked, and makes him lick her pussy from behind. She scolds him for not showing enough gratitude and kicks him repeatedly in his nuts. She smothers his face with her pussy and he says thank you when he’s allowed air. She gets him on all fours and fucks his ass deep and hard with her strap-on while hitting his back with a riding crop. She jerks his cock and he blows his load and Nurse Williams collects his semen in a vile. Unhappy with the volume, she jerks his sensitive dick back to being hard and climbs on top, shoving his dick into her pussy. She makes him fuck her from the bottom and humiliates him for his failed performance. She turns around and sits on his face and makes him lick her pussy until she cums.",
  "directors": [],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Jonah Marx",
      "person_id": 51893
    }
  ],
  "release_date": "2019-09-10",
  "scene_id": 44814,
  "tags": [
    "Athletic",
    "Bareback",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Foot Worship",
    "Humiliation",
    "Male Sub",
    "Medical Fetish",
    "natural boobs",
    "Nurse",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Role Play",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Straitjacket",
    "top",
    "white"
  ],
  "title": "Nurse Williams: Dee Williams Dominates Patient Jonah Marx"
}