{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Realtor Lotus Lain is excited. Her client, TS Foxxy, seems to be enjoying the house she’s showing her. TS Foxxy is interested is the house, but not as much as she is in the beauty before her. As Lotus shows her the rooms, Foxxy has only one thing on her mind, and her flirtation makes it known. Lotus is flustered by Foxxy’s come-ons, but Foxxy is obviously smoking hot and Lotus really doesn’t mind the attention, even as Foxxy opens her blouse and exposes her lacy bra. Lotus is ready to make a deal today, so she and Foxxy start negotiating. Foxxy says she’ll sign if that means she’ll get Lotus too. Turned on as Foxxy woman-handles her over the couch, Lotus eagerly agrees. Foxxy gives Lotus a spanking and then leans in to sniff her pussy. Lotus moans as Foxxy bites, kisses, and licks her inner thighs. Foxxy removes her panties and spits on Lotus’ pussy before leaning in to lavish it with licks. She uses her fingers to coax Lotus to the brink of orgasm, before pulling back and having Lotus undress her. She commands Lotus to her knees and pushes her glorious ass into Lotus’ face. Lotus buries her face in Foxxy’s ass, licking Foxxy’s perfect asshole. Next, Lotus takes Foxxy’s cock in her mouth. Foxxy loves seeing Lotus’ big eyes looking up at her as she fucks her mouth. Drool leaks out of Lotus’ mouth as Foxxy makes her take every inch. Once they’re both undressed, Foxxy slips her cock into Lotus’ cunt and gives her a hard pounding in doggy. Lotus moans, clenching around Foxxy’s cock. She loves the way Foxxy’s cock feels inside her and cries out as Foxxy pummels her hole. Then they flip into missionary to continue fucking. Foxxy slaps Lotus’ breasts and fills her mouth with fingers. Lotus cums hard as Foxxy fucks her just right. Finally, Foxxy blows her load all over Lotus.",
  "directors": [],
  "models": [
    {
      "name": "Lotus Lain",
      "person_id": 47027
    },
    {
      "name": "TS Foxxy",
      "person_id": 20055
    }
  ],
  "release_date": "2019-09-23",
  "scene_id": 44818,
  "tags": [
    "Big Ass",
    "Black",
    "black hair",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Deepthroat",
    "drool",
    "Facefucking",
    "fake boobs",
    "Latinx",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Rimming",
    "Role Play",
    "shaved",
    "slim",
    "Smoking",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration"
  ],
  "title": "Prime Real Estate: Lotus Lain Goes the Extra Mile For TS Foxxy"
}