{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Jet Setting Jasmine sits at her leather throne looking gorgeous and powerful. Graveling at her feet in a latex hood is Tony Orlando. She makes him clean her black high heeled shoes with his tongue and so he licks them clean including the soles. Jasmine tells Tony to remove her shoes and worship her stocking covered feet. He sniffs and licks them and she shoves them in his mouth. Next he's told to remove Jasmine's stockings and he does it slowly and continues licking her now naked feet and sucks her toes. Jasmine shoves both of her feet into his big mouth. She makes him remove his leather jock and she presses her toes against his cock and scolds him for producing pre-cum without permission. She feeds it to him with her feet and he tells her he's sorry. She commands him to sniff and to lick her underarms and as he does, she traps his nose and mouth in there, gets him in a headlock and squeezes. In the next scene, Jasmine wields a giant dildo attached to her strap-on. She has Tony bent over a leather padded cage in a black straight jacket, with a blindfold covering his eyes and a ball gag in his mouth. She flogs his ass with a flogger in each hand and after his ass turns pink, she slides the huge dildo into his asshole and fucks him deep. Jasmine puts Tony on the floor with his ass in the air. She slides on latex stockings, lubes them up and shoves almost her whole foot into Tony's ass. He backs up onto his Goddess' foot, trying to fit the heel in, and she takes her foot out and makes him clean it off with his mouth for being such a greedy slut. Next, Jasmine has Tony on his back, on top of a padded table, covered in layers of plastic wrap, unable to move. She cuts a hole, made only for his cock and pulls it out. She lubes up a sounding rod and shoves it deep down Tony's urethra and fucks his pee hole with the metal rod. After that, she relieves her full breasts on to Tony's face, squeezing them and showering him with her breast milk. He frees one of his hands to jerk off and cums while them warm milk rains from his Goddess.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Jet Setting Jasmine",
      "person_id": 59795
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2019-08-27",
  "scene_id": 44813,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Black",
    "black hair",
    "Blindfold",
    "Bondage",
    "brunet",
    "Cage",
    "CBT",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "Hood",
    "Humiliation",
    "jock",
    "lactation",
    "Latex",
    "Leather",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "Sounding",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "versatile",
    "white"
  ],
  "title": "Yes Goddess: Jet Setting Jasmine and Tony Orlando"
}