{
  "collections": [
    "Everything Butt"
  ],
  "description": "Joanna Angel crawls across the floor on her hands and knees as Luna Star pulls the leash attached to the collar around Joanna's neck. Luna lifts her tight black dress and out pops her big beautiful bare ass. She grabs Joanna's head and shoves it into the crack of her sweet ass and Joanna licks Luna's asshole as Luna grinds on Joanna's face. Luna gets a double-sided metal toy and slides it into Joanna's hungry asshole. She flips Joanna over and spreads her legs. Luna grabs a clear acrylic toy and pops it in and out of Joanna's hole. Luna lifts Joanna up into a jackhammer position, folds a double-ended dildo in half, and double stuffs Joanna's pussy and ass and fucks her with it. Next, Luna grabs a \"dick-on-a-stick\" with a huge dildo attached to the end of it and plunges it deep into Joanna's asshole and swirls it around like a spoon in a witches cauldron. With Joanna's ass back in the air, Luna gets a big clear glass graduated toy and starts working into Joanna's stretched hole and fucks her with it up to the third ripple. After that, Luna bends Joanna over a padded saw horse and strap-on fucks her asshole deep with her fat cock. Luna gets The Slink and slides it inside Joanna's asshole right to the hilt and Joanna cums hard with a vibrator while Luna fucks her with the strange long toy. Next up for Joanna's stretched out hole is a large black graduated cone, and Luna gets it as far as Joanna can take it. Luna gets jealous of Joanna's asshole getting to have all the fun so Luna shoves a big clear butt-plug up her own ass and twerks her pussy and ass on Joanna's mouth until she cums. After that, Luna makes Joanna fuck her in the ass with all of the toys that Luna had used in hers.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Joanna Angel",
      "person_id": 61458
    },
    {
      "name": "Luna Star",
      "person_id": 58678
    }
  ],
  "release_date": "2019-08-23",
  "scene_id": 44837,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "black hair",
    "Brunette",
    "buttplug",
    "Collar",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "Latin",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaved",
    "slink",
    "Straight",
    "Strap On",
    "switch",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Hot Anal Sluts"
}