{
  "collections": [
    "Everything Butt"
  ],
  "description": "Chloe Cherry is an orderly at the Anal Asylum. It's her job to let the anal whores out of their cages from time to time and give them their anal therapy. Today she releases patient Lexi Lore. When Lexi's cage door opens, she wriggles out feet first wearing a leather straight jacket with her perfect perky pierced titties exposed, and a ball gag in her mouth. First Chloe takes Lexi's ball gag out and lifts up her lab coat. She puts one leg up, spreads her bare ass and tells Lexi to start licking. Lexi shimmies over and shoves her tongue way up Chloe's ass and tongue-fucks her pretty hole. After that, Chloe gets a double-ended acrylic toy and stuffs it in Lexi's ass with the big side. Chloe makes Lexi's ass gape but wants to stretch it even more so she grabs an even bigger glass toy and fucks Lexi's ass with it, getting even bigger gapes. Chloe wants to go even bigger so she gets a fat dildo and plunges it in and out of Lexi's asshole until it opens up nice and big. Finally Chloe gets a big metal, hollow butt-plug and leaves it in Lexi's ass while she lets her press a vibrator against her clit and cum. After that, Chloe gets her strap-on and attaches a fat dildo to it. She tells Lexi she only fucks the good girls and slides it in her ass and fucks her deep. She flips her over and fucks Lexi's ass with her legs spread and Lexi cums hard with Chloe's cock buried in her ass. With Lexi looking like she's having too much fun, Chloe wants Lexi to play with her ass now. Chloe gets up on the exam table, ass in the air, completely naked, and Lexi shoves a big metal dildo inside her ass and fucks her with it while Chloe presses a vibrator against her pussy. After that, Chloe gets a big pink double-ended dildo and shoves it inside both of their asses and position themselves ass to ass. Before returning Lexi to her cage, Chloe gets on her back and has Lexi slide the slink deep inside her ass and cums hard with a vibrator.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Lexi Lore",
      "person_id": 61958
    }
  ],
  "release_date": "2019-08-09",
  "scene_id": 44838,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Ball Gag",
    "Blonde",
    "buttplug",
    "Cage",
    "Dildo",
    "Dominatrix",
    "Feet",
    "Gag",
    "Gaping",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "slim",
    "slink",
    "Straight",
    "Vibrator",
    "white"
  ],
  "title": "Anal Asylum: Chloe Cherry and Lexi Lore"
}