{
  "collections": [
    "CFNMEU"
  ],
  "description": "In a scorching CFNM scene, we have Mirek Madl as he visits the clinic. The sexy doctor is soon examing Mirek’s chest and then his back with her stethoscope. She has Mirek do some bending to test his back. Then she tells him to strip and lay on the table. She examines his groin, feeling his balls and then his cock. All seems ok there, so she has Mirek move to the exam chair, with his legs in the stirrups. This gives access to his ass, and the doctor gloves up and inserts a finger into the tight hole. She keeps checking the hole, pushing two fingers deep inside. Mirek’s hand hides his cock as she works his hole. The cock is getting hard, and the doctor notices, telling Mirek not to be shy. He rubs his cock as the doctor goes to fetch a dildo. Then she shoves it into Mirek’s hot ass, opening it wide. She also takes hold of Mirek’s rock hard cock and wanks it, as she fucks his ass with the dildo. Then she goes to fetch a bigger dildo as Mirek wanks himself. He laughs when he sees the size of the dildo, thinking it won’t fit in his ass. But it does and is soon really stretching his hole. The dildo fucks him deep as the doctor wanks his cock. Then she moves Mirek back onto the table and starts to suck on his throbbing dick. She sucks it really well and then moves him, bending him over to fuck him with her strapon. He works Mirek’s ass so well, spanking it too. She lays on the table and has Mirek sit on her rubber cock. His own dick stands proudly as the rubber dick fucks him. Then she has Mirek lay down for more fucking as he wanks himself to a big, creamy, cumshot.",
  "directors": [],
  "models": [
    {
      "name": "Dominantni Sestra",
      "person_id": 62032
    },
    {
      "name": "Mirek Madl",
      "person_id": 62122
    }
  ],
  "release_date": "2019-07-03",
  "scene_id": 44842,
  "tags": [
    "Anal",
    "CFNM",
    "Dildo",
    "Doctor",
    "gloves",
    "Handjob",
    "Male Sub",
    "Medical Fetish",
    "Pegging",
    "Spanking",
    "Straight",
    "Strap On",
    "Partner Studio"
  ],
  "title": "A Visit to the Doctor: Mirek Madl"
}