{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "After some time experiencing performance issues, you've decided to seek out professional help from a sexy therapist, Mia Little. She specializes in a method of sexual healing that will extend the time from when your cock gets hard, to edging over and over again, and finally to an orgasm unlike any you have ever experienced. She begins her jack off instruction by telling you to grab your cock and start stroking it. Once it grows she rewards you with her spit as lube, letting a spitty wad fall out of her mouth for you. Her red panties and thigh high stockings are visible as she sits on her couch, instructing you to grab the head of your dick and stroke your shaft with your hand. \"Keep stroking. Keep stroking like you are fucking me and you want me to feel good,\" she continues to instruct you as she touches her clit through her panties. While you masturbate, she decides to entice you with by stripping off her dress to reveal her perfect tits and pierced nipples. She keeps telling you to stroke it and then makes you stop when you're close to cumming. No blowing your load yet, not until she tells you to. She wants to edge you, again and again, no matter how badly you want that orgasm. Your condition is improving, so she stands up and turns around to climb on to the couch and show you her ass. She feels her booty, spreads it, and talks about your nose pressed into her ass like she's facesitting and smothering you. Bouncing her ass in your face she tells you over and over again to hold it. She pulls her panties aside to show you her bare pussy and her cute, little asshole. Now she's going to put you to the test to see if you can hold your cum while she cums. She lies down on the couch, presses a vibrator onto her dripping cunt, and tells you that you are not allowed to stop stroking your dick. With her legs spread wide, she licks her fingers and slides one into her wet pussy. She cums hard on the vibrator while you edge for her like a good boy. Now that she's completed her orgasms you're rewarded with a 15-second jack off countdown. Don't waste any time because it's your job now to exercise perfect control over your penis with this explosive orgasm that you've worked so hard to achieve.",
  "directors": [],
  "models": [
    {
      "name": "Mia Little",
      "person_id": 51496
    }
  ],
  "release_date": "2019-07-04",
  "scene_id": 44845,
  "tags": [
    "Asian",
    "black hair",
    "Bondage",
    "Cuckolding",
    "Edging",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fetish",
    "Hitachi",
    "Kinky",
    "Pierced Nipples",
    "POV",
    "shaped",
    "Smothering",
    "spit",
    "Straight",
    "switch",
    "thirdparty",
    "toned",
    "Vibrator"
  ],
  "title": "KINKY JOI: Orgasm Consultant"
}