{
  "collections": [
    "Families Tied"
  ],
  "description": "Joanna Angel is a hot hipster babe with a hunky new boyfriend, Ramon Nomar, who just moved into her apartment. But Ramon has brought in more than just boxes: he also has baggage in the form of a bratty teen step-daughter, Hadley Mason. When Ramon announces Hadley will be coming to visit them in the city, Joanna has reservations, but nothing could prepare her for what’s to come. Hadley waltzes into her apartment with her disgust barely concealed on her beautiful face. Spoiled to the core, Hadley demands alone time with her step-daddy, then tries to get into his pants, in an effort to rekindle their illicit sexual history. Ramon pushes Hadley off, claiming that their previous fling was a mistake, but Hadley persists in her seductions, playing the brat and putting her round ivory ass in the air for a beating. Ramon is unable to contain his urges and delivers a savage spanking, paddling, and flogging, leaving her plump teen ass bright red and hot to the touch. Hadley knows just how to play her daddy and crawls on her knees to suck his cock and rub her hungry pussy while making innocent eyes at him. Ramon falls for none of it, giving her another strict flogging, and throwing her over the bed for a rough fuck with the electro zapper to maintain good behavior. The next day, Joanna is aghast when she finds sex toys in Hadley’s bed. She calls her in for a little talk. Hadley can hardly wait to taunt Joanna with the truth about her and her daddy, but to her surprise Joanna immediately reacts with a disciplinary approach, spanking her ass and smothering Hadley’s smug face with her pussy. Joanna spends the afternoon teaching Hadley who the real woman of the house is, using the only language she will understand: sexual punishment and humiliation. Hadley is made to lick Joanna’s pussy and ass, then squirt all over the floor like an untrained house pet. Her sensitive pussy is cropped, and her huge tits paddled until Ramon comes in and finds them. Joanna invites him to join in teaching Hadley a lesson, and together they deny her cock, while Joanna greedily gobbles it down and sits on Hadley’s face. Sucking dick and riding Ramon in reverse cowgirl, Joanna squirts all over Hadley’s delighted face, then makes her clean it up herself with her greedy tongue. Ramon traps Joanna in a tight rope shibari tie, places clamps on her tender labia and tits so that they bounce as he fucks Joanna in the ass. Joanna screams in pleasure and pain, begging for the clamps to come off, but instead she gets a zapper and a flogging. After a thorough anal fucking, Ramon removes the clamps so he can better enjoy both her holes, switching between them as he pleases, and causing her pussy to squirt. His little slut step-daughter is tied with a\nhitachi and made to watch him fuck his new fiance while she is denied his cock. Hadley whines and cums, but eventually decides to be a good girl and begs for Joanna to get his hot load instead of her like a polite guest should.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Hadley Mason",
      "person_id": 60241
    },
    {
      "name": "Joanna Angel",
      "person_id": 61458
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2019-08-02",
  "scene_id": 44859,
  "tags": [
    "black hair",
    "brunet",
    "Brunette",
    "Family Roleplay",
    "Flogging",
    "Hitachi",
    "Humiliation",
    "muscular",
    "natural boobs",
    "Pain",
    "Smothering",
    "Spanking",
    "Straight",
    "Stud",
    "toned",
    "white",
    "Zapper"
  ],
  "title": "How to Cuckold Your Teenage Step-Daughter"
}