{
  "collections": [
    "Device Bondage"
  ],
  "description": "A member, Provost, posted on the web site message forums requesting that cyd divert some of his attention to tormenting the feet models that pass through the site.\n\ncyd decides to fill the request, and when Calico arrives for her shoot, cyd traps her limbs in rigid steel restraints. Her ankles are locked in place with her dainty feet sticking straight up in the air. Strips of leather attached to her big toes pull down painfully, stretching out and immobilizing her bare and sensitive soles.\n\nWhat happens after that is a long, long list. Rubber bands, caning, tickling, sharp wooden sticks, paddles, whipping, scraping, etc., etc., etc.\n\nThough Calico’s feet are punished non-stop, the rest of her body does not escape. A latex breath control hood with a tiny hole in it combined with a tight metal collar makes her keep her breathing slow and measured lest she suffocate herself by breathing too fast. cyd makes the predicament unbearably awful by slapping her hard over and over in all the most tender and sensitive places on her body - the soft flesh of her inner thighs, her armpits, the tops of her breasts and elsewhere until her skin is bright red with angry looking welts.\n\nCalico shows extreme self control, mentally mastering her body and getting herself to breathe in a controlled manner. For this display, cyd rewards her with a vibrator, allowing her powerful orgasm after orgasm until her legs are shaking and spasming from coming so hard.",
  "directors": [],
  "models": [
    {
      "name": "Calico",
      "person_id": 11592
    }
  ],
  "release_date": "2007-05-16",
  "scene_id": 4485,
  "tags": [
    "BDSM",
    "Bondage",
    "Caning",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fetish",
    "Fingering",
    "foot fetish",
    "Handler",
    "Hood",
    "Humiliation",
    "Latex",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "Redhead",
    "shaved",
    "Slapping",
    "slim",
    "Squirting",
    "Straight",
    "Submission",
    "Tickling",
    "Vibrator",
    "Whipping",
    "white"
  ],
  "title": "Dainty Feet"
}