{
  "collections": [
    "Families Tied"
  ],
  "description": "Casey Calvert is trying to recover from a recent divorce in her step-sister’s house, but she finds herself entangled in a web of sex, lies, and bondage between her little sister Joseline Kelly and her psychotic brother in law, Derrick Pierce. Casey is vulnerable to Derrick’s come-ons after learning her sister is cheating on him, but soon finds her empathy has landed her in a leather strait jacket and under interrogation by Derrick about his wife’s affair. Derrick switches from friendly to psychotic in an instant, cropping Casey’s fair skin dark red, zapping her exposed pussy, and beating her perky tits until he gets the truth about Joseline. But Casey won’t give her sister up that easily, so she winds up on her knees being face-fucked and flogged. She’s released from Derrick’s cock for a chance to answer his questions, but then stuffed full of dick again when she refuses. Eventually Casey gives Joseline up, only to find she is past the point of return; Derrick has no plans to let her go. Instead her throws her over his work bench and fucks her tight pussy while she screams and struggles to get out the strait jacket. Her struggle is fruitless, and she cums unwillingly on his dick again and again as he pounds her. Joseline walks in to find Casey caught in strict bondage and her husband’s cock down her throat. As she accuses them of fucking behind her back Derrick quickly grabs her, handcuffs her, and turns her accusation of cheating back on her. He relentlessly flogs Joseline’s ass until she confesses to her cheating. As the sisters quickly turn against each other, Derrick takes turns using each of their mouths while continuing to beat Casey’s soft tits and Joseline’s bright red ass. Derrick finally rams his cock into Joseline’s pussy while tormenting her tender clit with a zapper, making her scream in terror. Casey looks on in horror, only to have Derrick’s cock, dripping in her sister’s pussy juice shoved into her mouth. But Derrick isn’t done with his wife yet, and shoves his big cock into Joseline’s tight ass. He gives her a relentless anal pounding, only pausing to shove his cock directly into Casey’s resistant mouth. With both girls now fully submitting to his desires, Derrick puts Casey into strict bondage, with her arms drawn behind her as she is pulled up onto the toes of one foot. He fucks her hard as the rope digs into her and Joseline watches from below and teases her sister. Eventually this bad behavior gets her in trouble and her face is pushed into her sister’s helpless ass, and she is made to lick, while she is beaten and fucked from behind. The trio spend the\nrest of the day with Derrick using the girls in whatever way he wants, fucking Casey in her ass and pussy in doggy and missionary while her face is buried in her sisters pussy, then making Joselyn ride him in reverse cowgirl while she cums over and over again on his dick.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Joseline Kelly",
      "person_id": 58721
    }
  ],
  "release_date": "2019-08-16",
  "scene_id": 44860,
  "tags": [
    "Athletic",
    "Bondage",
    "bottom",
    "Brunette",
    "Double Anal",
    "Family Roleplay",
    "Leather",
    "natural boobs",
    "other hair color",
    "shaved",
    "slim",
    "Straight",
    "Tattoo",
    "toned",
    "white",
    "Zapper"
  ],
  "title": "Sisterly Secrets Land Casey Calvert In Double Anal Trouble"
}