{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Stunning natural blonde Candice Dare is ready to workout at this creepy gym! Her tight gym clothes accentuate her strong curves and perky tits. She starts her workout with some stretches and squats before moving onto the broken treadmill. She is really working up a sweat and an appetite. Lucky for her the gang bang crew also frequents this gym. The men arrive and get to work pretending to work out. This catches Candice’s eye and she thinks five cocks, 3 holes, and 2 hands is the perfect workout. She lines the men up and is stunned that they are all already rock hard and ready for deep throat fucking. She takes each man deep in her mouth for a sloppy wet blowjob. This gym slut wants more and the men know how to deliver. Rope bondage. Candice is shocked again, when did this gym becoming a climbing gym and where did this rope come from. She is tied up in full restrictive rope bondage and the men all take turns fucking her wet squirting pussy. She screams with orgasm as the huge cocks tear her up. The men want more and begin to stretch out her asshole. Deep pounding anal gets Candice sweaty and happy. It’s time to fill this gym slut up airtight. The men take turns with double penetration as her pussy and ass are stretched out. Her mouth and hands go to work. It’s finally time for her protein shake, but this slut has a pregnancy fetish and demands the men fill all her holes up with cum. She takes an anal creampie, pussy creampie, pussy drenched in cum, face covered in cum, and finally a protein shake in her mouth. This gym gets five stars!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Candice Dare",
      "person_id": 54536
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Rod Jackson",
      "person_id": 62024
    }
  ],
  "release_date": "2019-08-07",
  "scene_id": 44861,
  "tags": [
    "Airtight",
    "Anal",
    "Anal Creampie",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Creampie",
    "Curvy",
    "Double Penetration",
    "Fetish",
    "foreskin",
    "Gangbang",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Squirting",
    "Straight",
    "Stud",
    "top",
    "white"
  ],
  "title": "Gym Slut: Candice Dare Works Out All Her Holes with Sweaty Gang Bang"
}