{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Kendra Heart is a fresh new face to Kink.com but is no stranger to rough kinky sex with multiple men. In fact she lives to get fucked. In her first scene with Kink.com she gives it everything she’s got to prove to everyone that she’s worthy of being the best submissive slut there is. It starts with Kendra wearing only a black leather straight jacket. She is led by a leather leash and collar by Rob Piper who brings her over to introduce her to four of his friends, and their dicks. They take out their big dicks and Kendra’s eyes get big and she immediately drops to her knees. She sucks their cocks with gusto and gets covered in her own drool from deep-throating their massive meat. They spit on her, fuck her face, and she just keeps begging for more. They get her completely naked on all fours on top of a square platform with wheels and they chain her ankle and wrist cuffs to the corners. They take turns fucking her pussy while another guy fucks her face in a hot spit-roast. They switch to fucking her ass and she takes all five guy’s cocks deep inside. The guys get her down and anchor her pussy to one of their dicks while the rest of them take turns fucking her face and her ass hard in an airtight double-penetration. They flip her over and spread her legs. With a cock anchored deep in her ass, they all fuck her pussy deep and hard. Kendra begs for their cum and so they bring her to her knees and one by one they paint her face and her tits with their loads, and she gives all of their cocks sweet kisses and tells them thank you.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    },
    {
      "name": "Kendra Heart",
      "person_id": 62127
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2019-08-21",
  "scene_id": 44863,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Collar",
    "Corporal Punishment",
    "Double Penetration",
    "drool",
    "foreskin",
    "Gangbang",
    "Kinky",
    "Leather",
    "mixed",
    "muscular",
    "Role Play",
    "Rough Sex",
    "shaved",
    "spit",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Kendra Heart: Take My Holes, Please"
}