{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "All-natural blonde, Sophia Grace has a secret hunger. Most days it takes all of her will-power to suppress her wanton and carnal desires, but today she gets to let it all out. Sophia is drawn in and manhandled by Mr Pete, who uses and abuses her any way he wishes. She finds herself stripped naked and restrained in rope bondage while standing spread eagle in the middle of the room. Mr Pete quickly begins to crop her and flog her. Her perky small tits glow red from the impact play, and the burning sting is palpable. Sophia begins to pant and tremble as she revels in the thrill of being in over her head. Her dom shoves a hitachi onto her exposed clit and carefully edges her to an orgasm. She starts to cum, but Mr Pete pulls back and laughs, then walks away, relishing the denial. Before she can recover, Sophia is tossed to the floor with her arms tied behind her back. Kneeling, she is instructed to open her mouth wide. She pretends to look innocent and unaware about what’s about to happen, but she knows that a massive cock is about to be shoved down her unwilling throat. The dom quickly unleashes a punishing face-fucking, and Sophia gags and chokes from the deep throating. Gasping for air, she begs for more as a vibrator stimulates her tight, pink pussy. Next she’s tied on a table with one leg yanked in the air so her pussy is exposed and ripe for plucking. Mr Pete wastes no time and jams his fat dick into her tight fuck hole. He fucks her relentlessly, to the point where Sophia’s eyes roll back in her head from the maddening pleasure. Mr Pete is immensely pleased with Sophia’s devotion to the dick, so he finally allows her to cum. Her body convulses from the ecstatic release. To finish her day, Sophia is tied in a doggystyle position with her head shoved to the floor. Her master quickly renews his onslaught on her swollen and sensitive cunt, and jams his cock right back into her back door. Sophia wants more and begs to cum over and over as she’s power fucked. She is permitted to orgasm one last time, just as Mr Pete blows his load all over her perfect, round ass.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Sophia Grace",
      "person_id": 58792
    }
  ],
  "release_date": "2019-09-02",
  "scene_id": 44873,
  "tags": [
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "Crop",
    "foreskin",
    "Hitachi",
    "master",
    "natural boobs",
    "Rope Bondage",
    "shaved",
    "slim",
    "Small Tits",
    "Straight",
    "Stud",
    "Sub",
    "switch",
    "Vibrator",
    "white"
  ],
  "title": "Sophia Grace: All-Natural Blonde Power Fucked in Rope Bondage"
}