{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "With a ball gag in her mouth, completely naked, standing on the tips of her toes, Kate Kennedy is bound in rope bondage. Her thighs are tied together and her arms are bound behind her back to rope that leads up to the ceiling. Derrick Pierce creeps up from behind and tells Kennedy that he's only there to please himself and use her body like an object. He grabs a flogger and starts hitting the backs of Kate's legs and ass. He turns her around and flogs her tits hard, and the loud slaps from the leather connecting to flesh reverberate in the room. Derrick gets an Hitachi vibrator and presses it against Kate's pussy. Just before she's about to cum, he takes the vibrator away. Derrick gets behind Kate, pulls his pants down, and shoves his hard cock into her tight pussy. He fucks her hard and deep, using her hair and her throat for leverage. In the next scene, Kate is bound again in rope with her ass in the air. Derrick flogs and spanks Kate's ass until it turns a pretty pink shade. He edges her pussy with a vibrator and finally lets her cum after denying her for so long. After she cums hard, he shoves his cock in her pussy and fucks her good. Derrick walks over to her face and shoves his cock in her mouth. He fucks her throat, getting his dick covered in her spit and ready for her ass. He pounds her ass hard like a pile-driver and she cums on his cock. In the final scene, Kate is bound on her back, this time with her legs spread and her pussy also spread wide open with clothespins and string. Derrick canes the bottoms of her feet and her spread-open pussy. He puts nipple clamps on her tits and pulls them as he vibes her pussy. He fucks her ass hard and sprays his load all over her pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Kate Kennedy",
      "person_id": 61558
    }
  ],
  "release_date": "2019-09-16",
  "scene_id": 44874,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "Blonde",
    "Bondage",
    "Clothespins",
    "Feet",
    "Flogging",
    "Gag",
    "Hitachi",
    "Leather",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Rope Bondage",
    "Spanking",
    "spit",
    "Straight",
    "Sub",
    "Tattoo",
    "Vibrator",
    "white"
  ],
  "title": "Worthless Fucking Whore: Kate Kennedy is Used and Abused by Derrick Pierce"
}