{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Mackenzie Moss is finally settling into her new law office after having worked day and night with her husband, Derrick Pierce to get it finished. Derrick surprises her with lunch and she tells him how grateful she is for all of his help and hard work. She tells him that as a reward to him, she wants to role-play a scenario where he puts a ski mask on, breaks in, overpowers her, and has his way with her, sexually. She tells him that she wants to be tied up and fucked, slapped and choked. Not surprised at all about the request, Derrick laughs and grabs her tight. He tells her that it sounds like fun and that it'll happen when she least expects it. Later in the day, when Mackenzie enters her house, she notices an open window and some things have been thrown on the ground. She grabs a nearby candle holder as a weapon and creeps around the house. Suddenly a man dressed in all black, wearing a ski mask grabs Mackenzie and wrestles her to the leather couch where he strips her naked and ties her up with rope, on all fours. First he whips her back and ass with a leather flogger. After that he spanks her bare ass repeatedly until both cheeks are thoroughly pinked. He takes his pants down and shoves his hard cock in Mackenzie's mouth and fucks it until her mouth and his cock is dripping with drool. Derrick shoves his hard, spit-covered dick inside Mackenzie's tight pussy and fucks it deep and hard. In the next scene, Mackenzie is tied up in rope bondage on her back with one leg up in the air. A black ball gag muffles her requests to be set free. Derrick applies nipple clamps to Mackenzie's petite tits. He licks her pussy and bites her thighs while he pulls on the clamps and she cums hard. He shoves his cock in her pussy and fucks her petite frame sideways, nearly splitting her in half. After he coats her pretty face with his load, they have a laugh and wonder what they'll think of next.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Mackenzie Moss",
      "person_id": 62135
    }
  ],
  "release_date": "2019-09-20",
  "scene_id": 44878,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Couple",
    "Domination",
    "drool",
    "Gag",
    "Humiliation",
    "Kinky",
    "Leather",
    "Mask",
    "Nipple Clamps",
    "other hair color",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "spit",
    "Straight",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Intruder: Kinky Couple Role-Play a Burglar Break-in Scenario"
}