{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Mr Pete's a little obsessed with his former classmate Chloe Cherry. He's always wanted to go on a date with her, but it's never happened, for some strange reason. Time has passed, but he's only grown more obsessed. Now he's gonna get that date, one way or another. Mr Pete ties up Chloe, straps her down and has his way with her by face fucking her, flogging her, cropping her, then fucking her tight wet pussy and her slutty, hungry asshole. He takes her to an empty classroom and starts in right away, flogging Chloe and cropping her. He puts a vibe on her pussy and eats her sweet hole, prepping her for the best part of the date, yet to come. Once she knows what she's in for, he shoves his thick cock into her mouth and face fucks her. He doesn't hold back, instead thrusting deep into her throat, over and over, while she gags and chokes on it like a pro. He may never have been on a date with her, but he knows Chloe's a cock whore who wants dick in every hole. When her throat is thoroughly fucked he flips her over and fucks her from behind, slamming her pussy and her ass until she doesn't know which way is up. He turns her over and keeps fucking her, using a vibrator on her to push her way over the top. When he's done with her, he leaves her there, so he can follow up with another round. Because he knows she wants it.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2019-09-13",
  "scene_id": 44876,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "foreskin",
    "Humiliation",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Straight",
    "Stud",
    "Submission",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Date Delayed: Mr Pete Finally Gets Some Private Time With Chloe Cherry"
}