{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Stunning blonde Lexi Lore in her red lingerie is working the cam girl scene. Her admirers tip top dollar for her private shows. Today Seth Gamble is in for what he desires. Lexi strips naked and turns her vibrator on her tight pussy. The camera gets it all for Seth to see. But, today Seth isn’t interested in just this video. After Lexi has a huge orgasm on cam, she discovers Seth hasn’t paid up. He has the money IRL and demands she comes and gets it. Arriving at Seth’s fancy ass house she discovers the money amongst some kinky toys. However, the money is fake. WTF. Seth appears and shows her the real wad of dough. He offers her double for what he desires. She declines, but next he says triple. What does he want for all that cash. Everything! He grabs her by the neck and throws her down. She is stripped naked and tied up in rope bondage fully restricted. Her mouth gagged with a ball gag, no one can hear her scream. Seth goes in on the corporal punishment. Flogging, caning, whips. You can feel the pain he delivers, but he also brings the pleasure. The Hitachi comes out and she is made to cum. Seth then rams his hard cock down her deep throat as she gags for air. Seth flips her over and continues the punishment before he fucks her hard in deep. Her ass turns bright red as Seth switches to her tight asshole. Deep anal gets her screaming. Seth flips her over again and gets the nipple clamps out. Her sensitive nipples can barely take the pain. Finally Seth unloads his huge load all over her shaved pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Lexi Lore",
      "person_id": 61958
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-08-30",
  "scene_id": 44875,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "Caning",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Lingerie",
    "muscular",
    "Nipple Clamps",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "Submission",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Everyone Has Their Price: Lexi Lore Gives it All Up for Dirty Money"
}