{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Voluptuous, sexy Skylar Snow needs an attitude adjustment and boy does she get it when Tommy Pistol gets his crazy, kinky hands on her. Inside a dark dank dungeon Skylar is spread eagle strapped to St. Andrew's cross. Nipple clamps dangle from her big natural tits as she wiggles around in the tight bondage that holds her. Mr. Pistol doesn't waste any time when he arrives and immediately begins flogging and caning her sensitive skin turning it bright pink. It stings but it feels so good, just what she was hoping for. To keep intensifying things Tommy squeezes a clamp onto Skylar's exposed clit and teases her with the Hitachi until she cums and squirts. Next she is on all fours tied up in rope bondage. Tommy slaps her curvy ass around and then stuffs his cock in her mouth for some hot and messy throat fucking. Skylar can take that dick deep making so much wet slippery spit. Then after she polishes Tommy's cock with her mouth he gives her the caning of her life leaving dark red, symmetrical 'train tracks' all over Skylar's butt. With a butt-plug prepping her ass for what is to come Tommy fucks Skylar's slutty pussy deep and hard and it drives her crazy. She licks the cum off Tommy's dick and then he fucks her tight ass going back and forth between both holes. Tommy stuffs a red rubber tunnel plug in Skylar's ass and fucks her through it making her writhe and moan and then makes her clean it off. Now on her back tied up tight in bondage with one leg pulled up to expose her holes Tommy plays with her pussy and slaps her with a clear acrylic paddle which makes her scream in pain but also gets her pussy wet and ready for Tommy's cock. With her tits bouncing around Tommy vibes her pussy and pounds both her whore holes until she has a squirt fest! She squirts a geyser again and again while Tommy laps it up and spits it back in her mouth until Tommy shoots his load all over her ass. Blissed out and smiling Skylar got the attitude adjustment she needed so bad!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Skylar Snow",
      "person_id": 60403
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-10-14",
  "scene_id": 44879,
  "tags": [
    "April Showers",
    "BDSM",
    "Big Natural Tits",
    "Blonde",
    "Bondage",
    "brunet",
    "Caning",
    "Corporal Punishment",
    "Curvy",
    "dungeon",
    "Flogging",
    "Hitachi",
    "Kinky",
    "Latin",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Paddle",
    "Pain",
    "Rope Bondage",
    "shaved",
    "slim",
    "spit",
    "Straight",
    "Sub",
    "switch",
    "toned",
    "white"
  ],
  "title": "Attitude Adjustment: Slutty Skylar Snow gets her ass flogged, caned and fucked"
}