{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Luna Lovely is a beautiful, brunette, BDSM pain slut of the highest order. Rarely do we see such a pretty young thing submit so fully and completely, but that is exactly what this anal pain piggy wants. She says it herself with an eager grin: she's here to, \"be used, abused and degraded as much as possible.\" So that's what she's going to get. Luna starts her day exposed and naked standing in the middle of the room with her arms yanked high in the air, compelling her to bend forward in painful strappado. Her handler for the day Seth Gamble cracks out the heavy leather flogger and beats her with it relentlessly. She moans and yelps and begs for more. And more is what this little slut gets. Seth pops a large metal butt plug straight up her tight little asshole, adding another layer of sensory pain to the bondage and floggings. She screams from the pain, but her yelps are quickly stifled when Seth shoves his solid cock down her throat. She chokes and gags from the face fucking, but she revels in it and loves it, even as she as spits all over herself. Still, Luna is hungry for more. She's tossed onto the floor in a doggie position that makes easy access to her sweet, ripe ass. Seth wastes little time and canes her feet, legs, and ass with a cruel switch, leaving stinging red welts on her thighs and calves. He slams his cock into her pussy and starts fucking her hard, as she pants and grunts and sweats like a little whore. Engorged by the rough sex, Seth then shoves his cock into her tight asshole and pounds his sex slave with full force of his muscled frame. To further humiliate Luna, he goes ass-to-pussy, switching back and forth between them. He then flips her over and ties her legs and arms together in a wide missionary position, and renews his brutal rough sex fucking both holes. Luna begs to taste his cum, so in one last fit of brutal pounding, Seth blows a massive load of seed all over her. Luna truly is his anal fuck pig.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Luna Lovely",
      "person_id": 62161
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-08-19",
  "scene_id": 44872,
  "tags": [
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Brunette",
    "Feet",
    "Handler",
    "Leather",
    "muscular",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Stud",
    "Sub",
    "switch",
    "white"
  ],
  "title": "Anal Pig: Luna Lovely Abused in Rough Sex and Brutal Rope Bondage"
}