{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Kinky lifestyle couple Whitney Wright and her man are planning out their next sexual adventure together. The stunning Whitney has some ideas after reading Abduction. A steamy chat between Tommy and her bring out ideas of a stranger invading her home while she is alone. Chasing her and taking her down as she screams for no and for him to stop. She will beg this stranger to let her go, but she truly desires more. He will tie her up and make her service him through pain and punishment. Slapping, corporal punishment, flogging, all turn Whitney's perfect ass red. Bound in tight restrictive rope bondage, she struggles but is unable to free herself. He tells her to suck his cock deep down her throat and demands that she doesn't use her teeth, until told. Her slobbery blowjob drips all over his hard cock. It's now time for this stranger, The Gas Man, to take what he really wants, all her holes. He will stretch and use them all for his desires. Tied up in full restrictive bondage, he starts with her tight wet pussy. Pounding her deep gets her screaming. He takes out her red ball gag and has her work on his cock more. She needs to get it wet and ready for her asshole. Tommy then takes her for deep pounding anal. She screams for him and begs him to cum all over her.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Whitney Wright",
      "person_id": 61018
    }
  ],
  "release_date": "2019-09-06",
  "scene_id": 44877,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Couple",
    "Crop",
    "Domination",
    "Flogging",
    "Gag",
    "Humiliation",
    "Kinky",
    "Latin",
    "natural boobs",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "slim",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Abduction Scenario: Kink Couple Acts Out Extreme Home Invasion Fantasy"
}