{
  "collections": [
    "Sex And Submission"
  ],
  "description": "The bright eyed and perky Elle Voneva has known all her young life that she is dedicated to healing the planet through her crystals. Today is the day to start that business and she makes her way to see the load officer. She has been envisioning this day and she knows it will all go as planned. However Tommy Pistol has some concerns, Elle has no credit. Living off the grid has been an amazing life adventure but it is not what she needs for this load. She knows exactly what to do, cleanse the room of bad energy. With her stones in hand she gets to work vigorously cleansing the room. However, bang! Tommy is accidentally knocked out. Elle gets a plan, she knows how these things work. She ties up Tommy and gets out her tools to deliver a painful ultimatum to Tommy. Sign her load papers or he will regret it! This is ridiculous and no way to get a loan. Tommy breaks free and takes down Elle. She gets tied up in fully restrictive rope bondage and Tommy will teach this young hippie a lesson. Starting with the crop and flogger he turns Elle’s tight ass red. He spanks her body as she screams for him to not call the cops. He will get his way today, and fucks her tight wet tiny pussy while pulling her hair. Her mouth gets used to and huge slobbery spit trails flow off his dick as she is deep throated on his huge cock. Tommy uses the devices on her ass and she freaks out. He flips her over and fucks her again and even fucks her with the Hitachi. After she learns her lesson she begs for his huge cumshot all over her.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Elle Voneva",
      "person_id": 62226
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-09-27",
  "scene_id": 44884,
  "tags": [
    "Asian",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Hair Pulling",
    "Hitachi",
    "Humiliation",
    "Latinx",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "spit",
    "Straight",
    "Submission",
    "takedown",
    "Vaginal Penetration"
  ],
  "title": "Bad Credit: Elle Voneva Learns How Much It Costs to Get a Loan"
}