{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Busty Carolina Cortez is running from a bad situation. Her curvy body is falling out of her tight red dress and she runs down an alley. Searching for help she bangs on building in hopes for a shining light to save her. Uh oh, it's Mr. Pete's bondage dungeon. As she is begging him for help, she notices all the leather cuffs and bdsm toys. What is this place? Completely forgetting everything going on, she is intrigued and turned on by Mr. Pete's manly presence and BDSM experience. He offers to show her what this life is all about. In leather cuffs she is bound and on her knees, ready to serve her daddy. Mr. Pete slaps her face and huge tits before sticking his huge hard cock down her throat. Her sloppy wet blowjob gets Daddy Pete turned on. He brings out the flogger and crop and works on her round ass getting it red. She is thirsty for more and he takes her to his bedroom. Tied up tight in rope bondage he continues with the corporal punishment. This newcomer can take a beating with the cane. She smiles and thank daddy, begging for more. He whips her before he fucks her wet pussy. He spits in her face and mouth and slaps her tits again. He fucks her soo hard she squirts and cums all over the room. Please daddy, fuck my ass she says. He rams his hard cock right down her hole. Deep anal gets her screaming. He crops her pussy and gets is puffy and red and ready for his cock again. He fucks her, she screams, he unloads his huge load all over her. Mr. Pete saves the day!?",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Carolina Cortez",
      "person_id": 62228
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    }
  ],
  "release_date": "2019-10-11",
  "scene_id": 44886,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Caning",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Domination",
    "foreskin",
    "Humiliation",
    "Leather Cuffs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Straight",
    "Stud",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Yes Daddy, Fuck My Ass: New Girl Carolina Cortez Submits to Mr. Pete"
}