{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Charlotte Sartre is suspended in rope and eager for the day to begin. Seth Gamble enters and tells Charlotte she'll get what she wants--to be choked, punched, and fucked in the ass--if he gets what he wants. Charlotte eagerly agrees and gets cropped, flogged, and caned all over her body. She screams with each impact and thanks Seth for every hit. Seth pulls her head down on his cock and fucks Charlotte's wet mouth until she gags. Then he gives her what she's been begging for, his rock hard cock. Charlotte moans as his cock enters her cunt. Seth sets a brutal pace that has Charlotte begging to cum. Seth reminds her of their deal and Charlotte agrees, cumming hard. Seth attaches clover clamps to her nipples and fucks her to more orgasms as Charlotte screams in pain and pleasure. Next, Charlotte is tied on her knees with her hands behind her back. Seth uses multiple floggers to give Charlotte that thuddy impact she craves. But those aren't the only toys Seth will be using today. For each flog, Seth gives Charlotte sharp strikes with long dragon's tail and a cane so he can hear her pretty screams as her skin turns rosy red. Charlotte moans as Seth then begins fucking her again. He switches between fucking her pussy and ass. She screams as every inch of his cock gets swallowed by her holes. She loves getting ass fucked and begs to cum over and over again. Seth punches her ass as he fucks it, giving this pain slut exactly what she wants. He fills her pussy with his fingers while he fucks her ass so both her holes are filled. Next, Charlotte is bound on her back with her legs spread. Seth canes her thighs and feet, places closepins on her tongue and her bottom lip, and continues to fuck her. He takes her pussy first and then makes her clean his cock and balls off with her mouth. Charlotte moans as she tastes herself and continues to get fucked. She screams as the vibrator touches her sensitive pussy. Seth smirks and continues fucking Charlotte's cunt and ass. Charlotte cums hard over and over again as she gets fucked with Seth's hand around her throat. Finally, she begs for his cum and gets a fat load all over her body. She rests back, sated. Charlotte got exactly what she wanted and so did Seth.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-09-30",
  "scene_id": 44880,
  "tags": [
    "Anal",
    "big dick",
    "black hair",
    "Bondage",
    "bottom",
    "brunet",
    "Caning",
    "Clover Clamps",
    "Crop",
    "Deepthroat",
    "Facefucking",
    "Feet",
    "Fingering",
    "Flogging",
    "Gag",
    "muscular",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Rough Sex",
    "shaved",
    "Small Tits",
    "Straight",
    "Stud",
    "Sub",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Quid Pro Quo: Charlotte Sartre Fucked and Beaten in Bondage"
}