{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Cadence Lux is a bona fide slut to the core. She wants it all. All the dick. All the pain. All the bondage. All the orgasms. And she’s willing to do whatever’s ordered of her in order to get it. She submits utterly to Charles Dera, who uses her for his own purposes. Fucking her in full suspension, flogging her, face-fucking her and tormenting her with a vibrator on her pussy while he fucks the orgasms out of her one after the other. Cadence begins in a hunched, fetal position, fully suspended in rope, with her mouth and pussy exposed for dick. Charles teases her a little, spinning her around, then slides his cock hard cock into her throat, then straight into that desperately hungry cunt. Cadence moans out like a total whore as that dick penetrates her, and she doesn’t let up. As she gets fucked and slapped and beaten she turns into a puddle of fuck meat, eager to take everything she’s given. Clamps are put on her nipples and tethered to the ceiling while she rides Charles’ dick, but she wants that fucking so damn bad she works through the intense pain. She gets put through the proverbial ringer, left sweating and wrecked as Charles uses her to get off. Just as he blows his huge load all over her fucked cunt, she cums and squirts all over his cock. Cadence is the perfect definition of a slut, and we want to see more.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    },
    {
      "name": "Charles Dera",
      "person_id": 59597
    }
  ],
  "release_date": "2019-10-28",
  "scene_id": 44881,
  "tags": [
    "black hair",
    "Blonde",
    "body builder",
    "Bondage",
    "Flogging",
    "natural boobs",
    "Pain",
    "shaved",
    "Straight",
    "Sub",
    "Suspension",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "Vibrator",
    "white"
  ],
  "title": "Cadence Lux: Cock Hungry Slut Takes A Greedy Beating From Charles Dera"
}