{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Maya Kendrick wants a hardcore beating and Derrick Pierce is just the man to bring it!\nTied up and strapped to spreader bars Maya is about to get the punishment she craves. First the flogger to get her warmed up, Derrick whips his little pain slut on the stomach, tits and ass turning her skin hot pink. He puts nipple clamps on her perky tits and straps a vibrator between her legs and she begs to cum but she is not allowed until Derrick says so. She cums hard and then Derrick leaves the Hitachi vibrating on her sensitive pussy. Next Maya is on all fours gagged and tied up tight in bondage ready for anything. Derrick fucks her cunt with his fat cock making her whimper and moan and then stuffs his dick down her throat for some wet and sloppy face fucking. With his slippery spit covered cock he fucks her other hungry whore hole and she loves it in her asshole. She can't get enough, the more Derrick pounds that ass the more she needs it. After getting fucked real good Derrick's dirty little whore is happy to clean her ass off his cock. Tied down on her back with legs pulled up straight Maya gets the cane on her shaved pussy, her nipples, tender thighs and anywhere else that makes her scream. Derrick fingers her wet pussy making her squirt all over his hand. With a clothespin on her lips to keep her quiet Derrick drives his hard cock deep inside her pussy and fucks her cunt and chokes her until she thanks him excessively for using her and making her feel so good. He goes back and forth between her slutty holes fucking her ass and pussy giving her several orgasms until Derrick shoots his load all over her. What a Perfect Afternoon!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2019-11-11",
  "scene_id": 44882,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "Caning",
    "Curvy",
    "Domination",
    "Hitachi",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Pain",
    "Pain Slut",
    "shaved",
    "spit",
    "Straight",
    "Sub",
    "Tattoo",
    "Vibrator",
    "white"
  ],
  "title": "Maya Kendrick gets her whore holes fucked and flogged in bondage"
}