{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Blonde Russian beauty Natasha James is on a first date with Derrick Pierce. She loves the way he kisses her and holds her, but something isn't quite landing for her. Derrick can tell something is up and checks in with his date. Natasha tells him that she has a fantasy she can't get out of her head. She wants to be abducted and used brutally. Derrick reassures her her fantasy isn't out of the ordinary and tells her to contact him if she wants to make her fantasy a reality. Natasha does, and late one night as she walks to her car, Derrick creeps up on her. Natasha screams as Derrick throws a bag over her head, zip-ties her wrists and ankles, and throws her into the car. Natasha soon finds herself stripped naked and tied down with her ass up. She struggles as Derrick emerges from the shadows to admire her petite body. He runs his hands over her ass and spreads her pussy open to find that she's already wet. He flogs her cute ass until her cheeks are a rosy pink before commanding her to open her mouth. Natasha eagerly opens her mouth and takes Derrick's hard cock down to the base. She looks up at him through her lashes as he fucks her mouth. Soon he's ready to try out her other holes and slips his cock into her cunt. Natasha moans as he fucks her cunt hard and is soon begging him to fuck her ass. Derrick pushes his cock into her eager asshole and Natasha cries out with the sensation. She loves getting fucked in the ass and takes every inch of his hard cock. Next, Natasha is tied on her back with her legs spread. Derrick crops her breasts and sensitive pussy before taking her tight pussy again. Natasha loves the rough way Derrick fucks her and goes wild as Derrick fucks her ass and plays with her pussy. She begs for his cum and gets a fat load all over her pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Natasha James",
      "person_id": 62227
    }
  ],
  "release_date": "2019-10-18",
  "scene_id": 44885,
  "tags": [
    "Athletic",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Corporal Punishment",
    "Domination",
    "Humiliation",
    "other hair color",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Abduction of Natasha James: Petite Russian Blonde Bound and Fucked"
}