{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Daya Knight's been getting kinky with her husband, Charles Dera, and she's ready to push it further with a home invasion fantasy. She has no idea what's in store for her, or even if it'll happen, until one afternoon she's set upon, tied up, and she gets way more than she bargained for. Charles doesn't hold back, and turns a simple fantasy into an afternoon of domination, obedience, bondage, flogging, slapping, cropping and deep, hard pussy fucking. Daya cums harder than she's ever cum before when Charles takes over and takes full advantage of her. Charles arrives at home unannounced, and immediately takes down Daya. He ties her up on the floor, and silences her with a ball gag, so he can tell her what she's going to do for him, and how he's going to use and abuse her, the way he knows she secretly desires. He toys with her big tits, pinching and tormenting them, he slaps them around and shoves his rock hard cock in her mouth. He uses Daya however he pleases, keeping her bound in rope as he teabags her beautiful face with his balls. He humiliates her in every way, before putting her on her knees and flogging her. Completely tied down, he teases her works her sensitive clit. She gets moments of intense pleasure, then intense punishment, then Charles' solid dick shoved into her tight pussy. He fucks her hard, and she loses herself in that raging fuck. But Charles doesn't give her everything all at once. He holds back, ready to give her more dick later if she obeys him. He ultimately puts a vibrator right on her ultra sensitive clit which makes her wail with pleasure and over-stimulation, then shoves his cock in that slutty pussy at the same time, plowing her and making her cum like the whorish pain slut she is. She completely surrenders to him as he makes her his little bitch, fucking and smacking her, making her pussy cum like crazy, before dousing her cunt in a huge load of cum.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Daya Knight",
      "person_id": 62225
    }
  ],
  "release_date": "2019-10-04",
  "scene_id": 44883,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "black hair",
    "Blowjob",
    "body builder",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Ebony",
    "Flogging",
    "Gag",
    "Humiliation",
    "Kinky",
    "Nipple Torment",
    "Pain",
    "Pain Slut",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Breaking And Entering: Daya Knight's BDSM Home Invasion Fantasy"
}