{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Gia DiMarco is a gorgeous, tattooed, perfect beauty, with a devious smile to match. One look at her and you know she can give as good as she gets. And today she gets her hungry pussy fucked hard and deep by the machines. Gia begins in muted, subtle dress, but when the strip tease begins, she exposes her true self, wrapped in bright red, slutty bra and panties. She clicks on the vibrator and immediately loses herself in the pleasure of self satisfaction. Soon she’s squirting, as her pussy begins to lose control. We bring in the first machine and slide it into her\nprimed, hungry cunt. Gia’s restrained in leather belt bondage, holding her legs together, which also happens to keep them spread wide. She lies back in the chair while the machine slams her pussy, and her squirt builds up around her ass. She begs for the machine to go faster, so we power fuck her like only we can do. But even after multiple orgasms, Gia’s still not satisfied. So we bend her over our wooden wedge which puts her ripe, round ass on full display. Who wouldn’t want to fuck that sweet pussy, raised up in the air for such easy access! Her wrists are bound together behind her back with the belt, so she can hold her ass open for a truly deep power fuck. Her moans and pouts tell us exactly how this raging fuck feels in her soaked cunt. In the final scene, Gia is standing against a wooden column, with her wrists restrained by medical cuffs, and a matching collar around her delicate neck. Gia knows exactly how she likes to get fucked, so she’s not afraid to beg for the machine to go faster or slower, and when it fucks her just right, the orgasms explode from her. Ultimately she’s got the machine slowly fucking that plowed pussy her while she presses a vibe tightly against her clit. Her final orgasms are powerful, squirting, and soaked.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    }
  ],
  "release_date": "2019-10-09",
  "scene_id": 44899,
  "tags": [
    "Bondage",
    "bottom",
    "Brunette",
    "Collar",
    "fake boobs",
    "Leather",
    "Leather Belt",
    "Machine Dildo",
    "multiple orgasms",
    "shaved",
    "Squirting",
    "Straight",
    "Tattoo",
    "the chair",
    "toned",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Gia DiMarco: Queen Bee is Tied Up and Machine Fucked"
}