{
  "collections": [
    "Hogtied"
  ],
  "description": "Joseline Kelly is a cute little slut, and she's ready for some extreme punishment. So here she is, on the set of Hogtied with The Pope. She starts in a standing, spread-eagle position, completely exposed to The Pope's will. He gropes her tits and fondles her pussy, and she already can't get enough. He flogs her, and we can now see hints of her nature as a pain slut when she can't help but smile. She's blindfolded, which immediately ramps up the exhilaration for her, since she can no longer see and has no idea what's coming. To her surprise The Pope sneaks in a vibrator, and immediately she's on the path to nonstop orgasms. Joseline is beyond excited, cumming like a whore. She's then put into a traditional hogtie suspension. Weighted clamps are applied to her nipples, and another set is added to her wet pussy. He stretches that sweet cunt out, pulling on the chains and the clamps. She can't help but smile when one of the clamps slips off her nipple, because the pain of the sudden release can't be ignored. The Pope puts the clamp back on, then works more orgasms out of that perfect pussy. In the final scene, Joseline is face-down and ass-up. She's flogged and punched, then rapped with a cane as The Pope administers bastinado. Ultimately he rips even more orgasm from her pussy until she can no longer hold herself upright, and then collapses.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Joseline Kelly",
      "person_id": 58721
    }
  ],
  "release_date": "2019-09-26",
  "scene_id": 44897,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blindfold",
    "Bondage",
    "Brunette",
    "Chains",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "multiple orgasms",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Punching",
    "Rope Bondage",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "Vibrator",
    "Weights",
    "white"
  ],
  "title": "Joseline Kelly: Pain Slut Surrenders to Bondage and Domination"
}