{
  "collections": [
    "Hogtied"
  ],
  "description": "Gia DiMarco is a sexy Kink icon who has done it all. But she hasn't had time to submit, get tied up, and tormented in quite a while. Today that story will change, and it will change quickly. The Pope is the only man she will submit to, or allow to torment her and have his way with. Gia knows that returning to Kink means she'll have to give it all up, and she does it like only she can. She begins tied to a wooden column with her wrists, ankles, body, and neck tethered tightly with rope. The Pope enters, adds more rope around her mouth, then begins to torment her body with floggers. The leather strikes her flesh, and Gia falls right back into her place as a submissive. He then covers her body in strikes from a cane that cover here from her tits all the way down to her feet. Next, Gia finds herself in a lotus type\nsuspension. The Pope enters and gags her, then turns her and pulls her into his sadistic\narms as he begins to spank her ass. Gia's cropped for a bit before he turns his attention\nto her pussy. Once he has gotten all of the orgasms that he wants from her, he\nadministers some nipple torment before leaving her there. In the final scene we have Gia\non her back like a good little whore. The cane is brought back in and the torment\ncontinues on her tits, legs, and pussy. Then The Pope attacks her feet with a nasty\nbastinado session that includes the cane, the crop, and his needle. The orgasms become\nmore of the torment as he plays with every aspect of pain and pleasure. This shoot is why\nGia will forever be a legend at Kink.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    }
  ],
  "release_date": "2019-09-12",
  "scene_id": 44896,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "fake boobs",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Nipple Torment",
    "Pain",
    "Rope Bondage",
    "shaved",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Gia DiMarco is Back! Grueling Bondage And Mind-Blowing Orgasms"
}