{
  "collections": [
    "Hogtied"
  ],
  "description": "Victoria Voxxx needs no introduction, as she is fast becoming one of the baddest bitches at Kink. She's been through hell, was a trailblazer in the multi-part Kink feature \"School of Submission\" and now she's back for even more. She's as tough as they come, and The Pope now knows exactly what to do to make his little slut suffer the way she wants and needs it. She begins in a seated position on a chair with her legs tied spread and a rope collar around her neck. She lets out a big smile when The Pope enters, and grabs the rope around her neck and pulls it tight. He ties a 12-pound bowling ball to the rope looped around her neck, and then moves on to add clothes pins to her body. It's time for target practice with Fluffy, the big bad dragon tail. This vicious implement is what makes Victoria purr like the slut that she is. Anyone else would wince and buckle, but this badass bitch craves it as only The Pope can give it to her. Her flesh quickly becomes striped with bright red marks from the strikes of Fluffy. The sting is downright fucked up, but it also makes her orgasms more intense. Throw in some heavy punching while she cums and she gets some of the most intense orgasms we've seen from her. The next scene begins and Victoria\nis in a single-leg futo, a.k.a. a single-knee suspension. This is as intense as it looks, and Victoria is right at home in this position. Her other leg is tied to her hands behind her back, and then the bowling ball is tied around her neck again. Her flesh is smacked to heighten the already pulsating red, and then she's overwhelmed with non stop orgasms. The final scene puts Victoria in an extremely vulnerable position. She's prepped for waterboarding, and this has her nervous as hell. She's seen The Pope do this to other models, and she wants her turn, but even her ironclad confidence is a bit shaky. This may be a decision\nthat she regrets later, but for now, she's ready, and it's time. The Pope starts with her, and he takes his time. He knows it can't be rushed, so Victoria can have the full experience. And once she's had enough, she's nothing more than a puddle of slut left in the middle of the floor. Even after the shoot, during the closing interview Victoria is so overwhelmed by her day she has to cum one last time, and masturbates herself into an orgasmic fit!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-10-24",
  "scene_id": 44898,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Boot",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "Extreme Torment",
    "Fingering",
    "Handler",
    "Humiliation",
    "Latin",
    "natural boobs",
    "Pierced Nipples",
    "Punching",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "toned",
    "Vaginal Penetration",
    "Water Boarding"
  ],
  "title": "Victoria Voxxx: EXTREME Torment, Brutal Bondage and Waterboarding!"
}