{
  "collections": [
    "Families Tied"
  ],
  "description": "Luna Rival is a French exchange student who’s been moping around her step uncle’s house for weeks. She’s bored with her studies and just wants to get fucked and sent back home to France. So she’s refused to go to school, and instead, she spends her time tanning and flashing her perky tits at the neighbors. Her uncle, Tommy Pistol, is sexually frustrated, so when she comes onto him for the hundredth time, he finally accepts her taboo advances and hate fucks her bratty little mouth. Pinned down on the pool furniture, he makes her beg for the attention she craves, throat fucking her and tormenting her cute little nipples with clamps. Luna is in for a real ride when Uncle Tommy ties her up in the pool house and zaps her vulnerable little clit while her cunt is spread wide with wooden clamps. Gagged and drooling, Luna begs to cum, but her uncle is done listening to her whine, so he just fucks her pussy and mouth as he pleases, spinning her tightly bound body in the ropes. Once her bratty ass is spanked a deep red and her pussy is punished properly, Tommy presses a vibe on her trapped cunt, delivering brutal squirting orgasms that make her scream and unwittingly haul herself up into a quivering, full suspension. Luna’s aunt, Helena Locke, hears a bit of noise from the yard, so she comes up to take a look. There she sees her husband fucking Luna. Helena always wants her piece of that action, and now she suspects she can get it. She waits for Luna to come back in the house, where she traps her in a lie and bends Luna over for a serious OTK spanking. Luna is tied in tight shibari hobble bondage and she’s made to please her aunt’s horny cunt with a vibe. Luna drools helplessly in the ring gag, and has no way to refuse her uncle’s hard cock when he joins in, or Auntie Helena’s wet pussy. Helena enjoys her husband’s cock while Luna laps at her clit and begs for more fucking. Helena straps on a huge dildo and they both tag team Luna’s tight holes. Double vag, anal, and double penetration drive Luna into a heavy set of squirting orgasms, which she pays for by servicing both her aunt and her uncle until they have cum on her pretty face.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Luna Rival",
      "person_id": 60512
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-09-13",
  "scene_id": 44909,
  "tags": [
    "Bondage",
    "brunet",
    "Brunette",
    "Dildo",
    "Double Penetration",
    "Family Roleplay",
    "Gag",
    "Latinx",
    "natural boobs",
    "OTK",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "Suspension",
    "Tag Team",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Sexually Devious French Teen Gets Double Stuffed by Exchange Family"
}