{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Jillian Janson is a slender, gorgeous, eager young lady, excited about her first time on Fucking Machines, and ready to show us her insatiable slutty side. She has a perpetual smile during the interview, for she knows that her day is going to be filled with lots of mindless machine fucking and intense, nonstop orgasms. As she starts her striptease, her pussy is already pulsating and wet. She can't wait to finally press the vibrator firmly against her clit and start cumming. She takes her time, teasing us just the right way, enjoying our eyes on her as she excites herself and pleases herself, nice and slow. Once she feels the vibration, her eyes roll back in her head and she fills the room with her moans of ecstasy. Orgasms begin to escape her pussy, and she wants more, so she brings more. Every orgasm is stronger than the last, and she cannot seem to get enough. We eventually have to take the vibe away from her, so that we can slide one of the machines into her hungry cunt. The first machine slowly builds momentum inside of her pussy, getting her wetter and wetter. As the speed increases, so do her orgasms until she is virtually overtaken by them. Once the machine is at full speed her pussy becomes so wet that it's a struggle to keep the dildo inside of her. But that doesn't stop her from fucking the machines with everything she has. She rips through the day in different positions, fucking different machines, ultimately to watch her take everything we throw at her. Jillian literally can't get enough of the machines, and if allowed, we suspect she'd fuck them indefinitely.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Jillian Janson",
      "person_id": 58809
    }
  ],
  "release_date": "2019-10-23",
  "scene_id": 44900,
  "tags": [
    "Brunette",
    "Dildo",
    "Machine Dildo",
    "natural boobs",
    "slim",
    "Straight",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Jillian Janson: Sexy Young Slut is Machine Fucked for the First Time"
}