{
  "collections": [
    "TS Seduction"
  ],
  "description": "Draven Navarro is a happy slave to the gorgeous latex-clad bombshell Duchess Aspen Brooks. He watches from his cage as she fucks guy after guy, leaving him to look on longingly, horny and eager to get dicked down. As the hours pass, Draven falls asleep and gets startled awake by an angry and tired Duchess. She yells at him for falling asleep and commands he clean up her dungeon. Draven starts picking up discarded implements and garments, but when he notices a used condom his impulses get the better of him. He sniffs the condom, licking it, taking in the Duchess' taste and scent. At this moment, the Duchess returns and catches him being a horny slut! Draven fumbles out an apology, but the Duchess isn't hearing any excuses. She decides it's time to punish this wayward bitch boy. She grabs a short dragon's tongue and spanks Draven's chest, feet, and perfect bubble butt. Draven cries out, kicking his feet and apologizing profusely. The Duchess presses his face into her latex clad ass and smothers him before revealing her big hard cock. Draven eagerly swallows it, deep throating her cock for all he's worth. Next, the Duchess has Draven remove her stockings and worship her feet and legs. She giggles as Draven snakes his tongue between her perfect toes and lavishes them with attention. Then she takes Draven over her knees for a firm spanking. Draven squirms in her lap, gasping with every hit, and thanking her for punishing him. She spits in his ass and then makes him get on his hands and knees so she can get a taste. After a little bit of rimming, she slides her hard fat cock into his ass. Draven moans as her cock enters him. He loves how it fills up his ass. The Duchess gives this bitch boy what he craves, a hard pounding with her rock hard cock. Draven cries out as the Duchess pummels his ass. He cums while she fucks him, and then eagerly takes The Duchess' load on his face.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Aspen Brooks",
      "person_id": 59054
    },
    {
      "name": "Draven Navarro",
      "person_id": 59640
    }
  ],
  "release_date": "2019-09-17",
  "scene_id": 44919,
  "tags": [
    "Anal",
    "big dick",
    "Blowjob",
    "body builder",
    "bottom",
    "brunet",
    "Cage",
    "Cock Worship",
    "dungeon",
    "Facial",
    "Feet",
    "foot fetish",
    "Foot Worship",
    "Latex",
    "mixed",
    "OTK",
    "Rimming",
    "Role Play",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "Tattoo",
    "tea2020",
    "toned",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Draven and The Duchess: Aspen Brooks Punishes Horny Beefcake Slave"
}