{
  "collections": [
    "TS Seduction"
  ],
  "description": "Venus Lux is a slender beauty with a rock hard cock. She's been sent by her best friend to check on naughty, misbehavin' sub, Draven Navarro, to make sure he's not getting out of line. But Venus finds him having phone sex with some anonymous slut. So she decides Draven needs some correction. But he gets more than just a scolding and a slap on the wrist. Venus subjects Draven to a ton of cock sucking, a relentless ass fucking, along with paddling, humiliation, clothes pins, and a huge load of her cum shot all over him. Venus starts by reminding Draven of his place, that he's here to serve women in every capacity, not to philander around on his own. She gags him, cuffs him, and inflicts a little pain with a good ass-paddling, and clothes pins on his nipples, his cock and his balls. When she's confident he understands her, she tells him his next task is to worship her however she wants. He sucks her rock hard cock, slurping it down exactly how she demands. She then fucks this whiny little bitchboy, pounding his ass in multiple positions. She tells him he's not allowed to cum until she gives him permission, but he just can't hold it, and shoots his load all over himself. Venus smears his cum all over his face, then after a final, deep, hard pounding, douses him in a monster load of hot cum. After all this, she still isn't impressed with him, and leaves him there, filthy and humiliated.",
  "directors": [],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Venus Lux",
      "person_id": 41417
    }
  ],
  "release_date": "2019-10-15",
  "scene_id": 44923,
  "tags": [
    "Anal",
    "Asian",
    "black hair",
    "Blowjob",
    "body builder",
    "bottom",
    "brunet",
    "Cock Worship",
    "fake boobs",
    "Humiliation",
    "mixed",
    "Pain",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "Sub",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Quit Yer Bitchin': Venus Lux Tops Draven Navarro"
}