{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Casey Kisses sits tall on a wooden stool in a short red see-through negligee, holding a leather riding crop in her hand. Kneeling next to her, wearing a tall leather collar around her neck is the beautiful Kacie Castle who waits to be used, sexually by Mistress Kisses. Casey slaps Castle's tits with her riding crop and puts clamps on each of her perky nipples. Mistress Kisses commands Castle to turn around and present her ass to her. She turns around and Kisses crops Kacie's ass and then tells her to remove her high-heels and worship her feet. Kacie licks and kisses Casey's pretty feet and sucks on her toes. Casey tells her that she has something else she'd like her to suck on and spreads her long lovely legs. Casey whips out her big hard cock and Castle gets to work on it. She deep throats Casey's big dick and gets so turned on she begs to get fucked. Casey tells her she'll have to wait and licks Castle's pretty pussy. Then she fucks Kacie's pussy with a dildo while Casey sucks her toes. She slaps Kacie's pussy with a paddle and then gives her an Hitachi. She fucks her with the dildo and Kacie cums with the vibrator pressed on her clit. After that, Casey slides her big smooth cock inside Kacie's pussy and fucks her deep and hard. In the next scene, Casey has Castle get on top of her in reverse cowgirl and slides her cock inside Kacie's ass. Kacie bounces up and down on her Mistress' cock, pounding her own ass with it. Kisses wants to fuck her pussy some more so she has Castle get on all fours and she fucks her pussy doggy-style until she blows her load on Castles ass and licks it off.",
  "directors": [],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Kacie Castle",
      "person_id": 59236
    }
  ],
  "release_date": "2019-10-07",
  "scene_id": 44924,
  "tags": [
    "big dick",
    "Big Tits",
    "black hair",
    "Blowjob",
    "bottom",
    "Brunette",
    "Cock Worship",
    "Collar",
    "Crop",
    "Dildo",
    "fake boobs",
    "Feet",
    "Hitachi",
    "Kinky",
    "Leather",
    "natural boobs",
    "Paddle",
    "Role Play",
    "shaved",
    "slim",
    "smooth",
    "Straight",
    "Tattoo",
    "tea2020",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Mistress Kisses: Casey Kisses Kinky Sex with Kacie Castle"
}