{
  "collections": [
    "Bound Gods"
  ],
  "description": "Ace Rockwood returns to dominate another little bitch. This time it’s the muscled Dillon Diaz, who can barely contain his excitement at working with Kink again, and especially with taking whatever Ace decides to dish out. Ace hits Dillon with full a full suspension, a deep hard anal fucking, flogging, electro-paddling, machine fucking and face fucking. They start with Dillon backed against a wall while Ace takes advantage of him, establishing immediately that he’s going to do whatever he wants with this stud. He spanks him and paddles him, then shoves his face deep in his ass to get that hole ready for what’s to come. Dillon immediately slips into his submissive role, eager to please. Ace uses an electrified paddle to give Dillon a double dose of pain. He then suspends Dillon, completely upside down, with his hands ties behind his back. Dillon can only hang there and accept the hard sting of a flogger, before Ace shoved his massive cock into his throat. Dillon takes the face fucking deep and hard, getting that giant dick soaked with spit. Ace sucks Dillon’s cock at the same time, then spins him around to torment his hole with his tongue once again. Dillon is a good little bitch, thanking his master unprompted for the pain and pleasure. Ace then puts Dillon on his back with his lets held apart by rope, and shoves a fucksaw deep into his hungry hole. Dillon’s gagged, but his screams come through loud and clear as he’s machine fucked. Ace finally decides his toy is ready for a real dick. So he slams his beast into his hole and fucks him. That hole is ready, but it still stretches tight with that fat cock rooted in it. Ace slams Dillon hard while jerking his cock, then makes him cum. Then Ace stands above his fuck toy and shoots his fat load all over his face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Ace Rockwood",
      "person_id": 62055
    },
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    }
  ],
  "release_date": "2019-09-19",
  "scene_id": 44928,
  "tags": [
    "69 Position",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "bit gag",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Electrical Play",
    "Flogging",
    "fucksaw",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Paddle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "spit",
    "Stud",
    "Submission",
    "Suspension",
    "top"
  ],
  "title": "Dillon Detained: Ace Rockwood Makes Dillon Diaz His Little Bitch"
}