{
  "collections": [
    "TS Seduction"
  ],
  "description": "TS sub Allysa Etain is locked down in the stocks looking sexy with her black lacy bra, panties, garter belt with thigh high stockings and shiny red stiletto heels. Her bright red full lips are a stark contrast to the black and stainless steel mouth bit she wears. Allysa is a dirty slut who needs to get fucked and Mike Panic is the one to do it, but she will get no cock until she earns it. She is such a good girl, so willing to try to be the best she can for her master. First the crop comes out and pinks up Allysa's pale sensitive skin right away. Mike plays with her small natural tits and then sucks her nipples into two tight suction cups and it makes her writhe and moan. She is breathing heavy and scared but still so ready to please so she can get fucked. Mike reminds her she has to earn it and spanks then whips her with the flogger turning her little ass pink. After some intense corporeal punishment Allysa has earned her chance to get some of that hard dick she's been dreaming about. She sucks Mike's cock like a good girl taking it deep inside her mouth and gets it all wet and slippery. First Mike plays with her ass to get her warmed up. Fingers and then a partial fist slide in Allysa the slut's eager asshole. On all fours finally Mike fills her ass up with his hard dick and fucks her real good. She is so thankful and all this hardcore fucking drives her crazy she can't get enough. Mike chokes her while he fucks her ass and she is in heaven. He flips her over onto her back and with legs spread wide open Mike pounds her ass out until he shoots a superload all the way up to her face and then feeds his hot cum to this thankful dirty slut. Such a Good Girl!",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Allysa Etain",
      "person_id": 61050
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2019-10-08",
  "scene_id": 44920,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Crop",
    "fake boobs",
    "Male Fucks TS",
    "master",
    "Role Play",
    "shaped",
    "Stocks",
    "Straight",
    "Sub",
    "Tattoo",
    "toned",
    "TS",
    "white"
  ],
  "title": "Good Girl: Allysa Etain is a Dirty Slut Who Needs To Get Fucked"
}