{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Venus Lux is a virtual reality dominatrix for hire, running her own company where women can come to have their BDSM fantasies fulfilled. The sexy Riley Nixon has come for a session. She's bored in the bedroom, and longs for an experience where she can let go of the need to be in control. Venus takes charge, and guarantees that she can satisfy Riley in the virtual world. Once Riley puts on the immersive VR headset she is immediately transported to sadistic dungeon, tied mercilessly with her ass presented in the air at submissive attention. She has a ball gag in her mouth and she's bound in rope, while Venus flogs her relentlessly. Riley's big, round ass is at the mercy of Venus' whims. Drool oozes from the edges of her gag as the brutal impact play turns her butt a beautiful shade of pink. Venus then takes a leather riding crop and begins to attack Riley's feet. Riley hollers and screams and desperately tries to move her feet out of harm's way, but the rope bondage is tight and inescapable. Riley is then tossed to the floor and Venus jams her rock-solid cock down her throat. Riley gags and chokes from the relentless face fucking. Between coughs and drool she begs her master to fuck her pussy. Next Riley's put on the couch and Venus jams her cock deep into Riley's wet, hungry cunt. She slams Riley with such aggression that the couch skids across the room. This only makes Venus hungry for more holes. So she squeezes her dick into Riley's tiny asshole. Riley can't stop cumming as a hitachi is put on her swollen clit. As Venus fucks her into utter submission, Riley begs to taste her cum. Venus obliges her by blowing a massive load all over Riley's huge natural tits. Fully satisfied, Riley relaxes. She hears a voice, \"how was your experience\" and she immediately snaps out of her fantasy. She removes the headset, surprised to return to reality, but still glowing from her virtual rendezvous.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Riley Nixon",
      "person_id": 59619
    },
    {
      "name": "Venus Lux",
      "person_id": 41417
    }
  ],
  "release_date": "2019-10-21",
  "scene_id": 44925,
  "tags": [
    "Asian",
    "Ball Gag",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "Cock Worship",
    "Crop",
    "Dominatrix",
    "drool",
    "dungeon",
    "fake boobs",
    "Feet",
    "Gag",
    "Hitachi",
    "Leather",
    "master",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Digital Dominatrix: Venus Lux Dominates Riley Nixon in Virtual Fantasy"
}