{
  "collections": [
    "TS Seduction"
  ],
  "description": "Daisy Taylor is a willing sub to her new Lord. She is ascending to the next level of divine devotion by proving her unyielding subservience and commitment to Master H3ll4Sl00tz who delights in sensual earthly pleasures and kinky sexual hedonism. Dressed in virginal gauzy white and a delicate crown of flowers Daisy is on her knees chained, shackled and surrounded by candles for her ritualistic initiation. But things aren’t delicate for long when Sl00tz rips off Daisy’s little shirt to reveal her perfect breasts. He orders her to lay over his knee for a spanking to get her warmed up. Now gagged and chained to the ceiling Daisy is taken to the edge with teasing and denial as Lord Sl00tz strokes her hard cock and feels her tits and reminds her that he is the one and only. Flogging, spanking and more hot edging ensue. On the bed sexy Daisy crawls over to her Master and sucks his hard dick getting it all wet and slippery. He jacks Daisy’s cock while she licks his ass until finally they fuck. On all fours with arched back and ass up high Daisy takes Lord Sl00tz’s cock deep inside her ass and he fucks her good. He flips her over into missionary and with her legs spread wide and tits bouncing Daisy gets her ass fucked into submission and she loves it so much she cums. Then she mounts her Masters cock and rides it all the way home until H3ll4Sl00tz shoots his load up her ass impregnating her with his divine seed. This is Daisy’s very first Kink and BDSM shoot and boy is it hot!",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Daisy Taylor",
      "person_id": 62155
    },
    {
      "name": "H3ll4SL00tz",
      "person_id": 61686
    }
  ],
  "release_date": "2019-09-24",
  "scene_id": 44921,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Cock Worship",
    "Edging",
    "Flogging",
    "Kinky",
    "Male Fucks TS",
    "master",
    "Role Play",
    "Spanking",
    "Straight",
    "Sub",
    "Submission",
    "TS",
    "white"
  ],
  "title": "Daisy's Devotion: Daisy Taylor Gives In And Gives It Up"
}