{
  "collections": [
    "TS Seduction"
  ],
  "description": "Fierce and fiery Kendall Penny is tough badass southern woman who craves to be roughly taken and put in her place by a real man. She doesn’t know if pretty built blonde Pierce Paris is up to the challenge. He flogs her ass and back as she taunts him and tells him her even her Daddy hits harder. Unfazed by her goading, Pierce cuts off her panties and shoves them in her mouth. He slaps her tits, spanks her ass, and continues working on Kendall’s flesh, setting a pace that eventually leaves her in tears. Kendall sobs and giggles, enjoying the cathartic release that comes with the pain. Next, Kendall is tied down spread eagle. Pierce edges her slowly until Kendall is begging to cum. Unfortunately for her, Pierce has other plans. He crops and zaps her sensitive thighs until she’s squirming in bondage. He rips off her stockings, takes off her heels, and exposes her feet. He canes and zaps them as Kendall yelps in surprise. Then he puts Kendall on her knees. She looks up at him through her lashes as she swallows inch after inch of his fat cock. She gives him a sloppy and wet blowjob, drooling on herself as she chokes on his cock. Finally, Pierce gives Kendall the rough fucking she craves. He pushes his fat cock into her ass and gives her a deep pounding. Kendall cries out as Pierce fucks her into the mattress. She loves being full of cock and fucked hard and rough. Pierce manhandles her onto her back, lifts her legs up, and drives his cock right back into her hungry hole. Kendall screams as Pierce fucks her just right. Finally she cums hard and Pierce follows, blowing his load all over her beautiful cock.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Kendall Penny",
      "person_id": 61838
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2019-11-05",
  "scene_id": 44922,
  "tags": [
    "Anal",
    "big dick",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "Cock Worship",
    "Feet",
    "Male Fucks TS",
    "muscular",
    "Pain",
    "Role Play",
    "shaved",
    "southern",
    "Straight",
    "switch",
    "TS",
    "white"
  ],
  "title": "Southern Sass: Kendall Penny Submits for the First Time!"
}