{
  "collections": [
    "Bound Gods"
  ],
  "description": "Pierce Paris is not about to let his stepbrother Vander Pulaski tie the knot with his beau. Pierce remembers all the nights they spent together and he’s not going to let Vander forget the bond they share. Dressed in leather pants, leather gloves, leather boots, and a leather harness, Pierce ties his brother up in his wedding tux and blindfolds him. Vander can’t believe Pierce is doing this today of all days. He struggles in bondage and ties to convince Pierce to let him go so he can get married. Pierce is upset that his stepbrother would even dream of pledging himself to a monogamous relationship with someone who is not Pierce. All those shared blow jobs meant something to him, and he’s not about to let his stepbrother ruin their family. He rips off Vander’s clothes and flogs his brother’s chest, ass, and cock. Vander yells for Pierce to stop, but he can’t stop the smell and sting of his brother’s leather on his skin from turning him on. Next Pierce ties Vander to mattress springs. He hangs weights from Vander’s balls and climbs up on the mattress to fuck Vander’s mouth. Vander doesn’t want to at first, but he has no choice but to take every inch of his stepbrother’s monster cock in his mouth. Then Pierce puts nipple clamps on Vander’s sensitive nipples. He hooks up the clamps to a tens unit and sends electric waves pulsing around Vander’s nipples. Vander squirms, and cries out as Pierce kneels down to swallow his cock. Pierce loves the taste of his brother’s cock. Vander continues to protest so Pierce decides he needs more punishment. He puts Vander in another suspension with an o-ring gag and canes his ass, thighs, and sensitive feet. Vander screams as Pierce decorates his thighs with lovely red stripes. His toes curl as Pierce canes his feet. Then, Pierce sinks his cock into Vander’s ass. Vander moans as Pierce fucks him relentlessly. Finally, he jerks his brother off with leather gloves and then comes all over his brother’s face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Pierce Paris",
      "person_id": 56974
    },
    {
      "name": "Vander Pulaski",
      "person_id": 61944
    }
  ],
  "release_date": "2019-08-29",
  "scene_id": 44929,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Caning",
    "Corporal Punishment",
    "Domination",
    "Electrical Play",
    "Electro Clamp",
    "Family Roleplay",
    "Feet",
    "Gag",
    "Gay",
    "gloves",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "muscular",
    "Nipple Clamps",
    "harness",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Submission",
    "Suspension",
    "Swallow",
    "switch",
    "Tens Unit",
    "Weights",
    "white"
  ],
  "title": "For Better or For Worse: Stepbrothers Fight and Fuck Before Wedding"
}