{
  "collections": [
    "Families Tied"
  ],
  "description": "Kira Noir is the perfect student, and a willing submissive to her professor, Ramon Nomar. She gives as much effort and thought to her drooling blowjobs and athletic anal sex as she does to her studies. When Mr. Nomar's bratty step-daughter Kacie Castle enrolls in the school, Kira is challenged to keep Kacie engaged with her schoolwork, while keeping her kinky relationship with Ramon a secret. When she is first assigned as Kacie's tutor, Kira pouts and is reprimanded by Ramon with a caning, flogging, and predicament scene in leather bondage. Kira comes around to embrace her duties as a mentor and is allowed to rub her slutty pussy all over Ramon's shoe, cumming on her knees. She is then thrown on the desk and fucked in both her ass and pussy. Shivering with anal orgasms, Kira promises that Kacie will pass all of her exams. That promise is easier said than done; Kacie makes constant attempts to escape her studies, and at one point outright spits on Kira's face, leaving Kira little choice but to pin her down and spank her bitch-ass bright red. Kira gets into the fun of the discipline and grabs a cane and strap-on, lighting up Kacie's thighs and ass with a swift and brutal caning, followed with a lesbian anal assault on Kacie's gaping asshole. Kacie loves every second of her study session, rubbing her cunt and taking her beating and fucking with orgasmic pleasure. She is quick to kneel down and lick Kira's perfect asshole and cunt until Kira has an orgasm of her own. Professor Nomar shows up to check on Kacie and finds her covered in cum and red cane strips. Seeing this, he realizes he cannot export the labor of discipline onto Kira, and must take control of both his step-daughter and his student. Both girls are flogged and made to serve Ramon's cock while he zaps them for their wrong answers on the exam. Kira is thrown into a tight shibari back-bend with her mouth trapped against Kacie's wet pussy. Kacie is made to hold her study manuals to avoid further pain from the tight clothespin zipper biting into her perky tits. Both young women are commanded to not cum, and to hold their positions as Ramon torments and tests their will with a fucking and a zapper. When Kacie earns her way out of the zipper she howls with pain, but she also cums on Kira's face like a little whore. Both girls show Ramon they are willing to be good submissives, sharing his cock and riding him reverse cowgirl with all their holes.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2019-08-30",
  "scene_id": 44926,
  "tags": [
    "Athletic",
    "Black",
    "black hair",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Caning",
    "Discipline",
    "Family Roleplay",
    "Flogging",
    "Gaping",
    "Kinky",
    "Leather",
    "Lesbian",
    "muscular",
    "natural boobs",
    "Pain",
    "shaved",
    "Straight",
    "Strap On",
    "Stud",
    "Tattoo",
    "toned",
    "white",
    "Zapper",
    "Zipper"
  ],
  "title": "Submissive Step-Daughter Seduces Her Daddy's TA"
}