{
  "collections": [
    "Bound Gods"
  ],
  "description": "Brian Bonds is suspended from his ankles with his wrists tied behind his back. He's had a busy weekend at Dore Alley and he's back in the studio eager for more. Leather Daddy Jack Dyer enters decked in leather. Jack's ready to see what Brian's made of and how loose his hole is after a full weekend. He zaps Brian and commands him to worship his heavy black boots. Brian eager uses his tongue on much leather as he can reach. Jack brings him down to the floor into a half suspension and begins to flog his back and ass. Brian yells as the flogger strikes his flesh. He struggles to continue licking Jack's boots. Once Brian's skin is a rosy red, Jack pushes a leather-gloved finger into Brian's hole. Brian squirms, trying to get Jack's finger deeper. Next, Brian is blindfolded on his knees with his arms tied to a post. He swallows his Daddy's pierced cock, drool leaking from his mouth. Jack laughs as Brian chokes on his cock. Seeing how eager this pig is for cock, Jack moves to Brian's ass and pushes his cock in. Brian moans as Jack fucks him hard and deep. His cries increase as Jack drips wax all across his ass and lower back. Next, Brian is gagged, tied on his back, with his legs up. Jack continues to pound his greedy hole as Brian begs for more and more. He's so grateful to be full of his Daddy's hard cock. Jack spits on Brian's face, kissing him, and slapping him. Brian is eager for every hit. Finally, Jack cums all over his face and makes him clean his cock off. Now it's time for Brian to finish cleaning Jack's boots. Brian licks along the length, getting the leather shiny with his spit. Upon command, he removes his Daddy's boot and sniffs his feet. He removes his Daddy's sock and worships his Daddy's bare foot. Brian licks, kisses, and sucks on every inch of flesh as he jerks his cock. With permission, he cums all over the floor. Jack wipes up Brian's mess with his foot and shoves it back in Brian's slutty mouth. Brian licks it clean, nuzzling his Daddy's foot as he snorts. He is one happy well fucked pig.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brian Bonds",
      "person_id": 33737
    },
    {
      "name": "Jack Dyer",
      "person_id": 62058
    }
  ],
  "release_date": "2019-08-22",
  "scene_id": 44927,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "Boot",
    "Corporal Punishment",
    "Domination",
    "drool",
    "Feet",
    "foreskin",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "spit",
    "Submission",
    "Suspension",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Pig Whore: Brian Bonds Gets Beat & Worships Daddy Dyer's Boots, Feet"
}