{
  "collections": [
    "Men On Edge"
  ],
  "description": "Newcomer to KinkMen, Sherman Maus is a handsome hung stud. His major league cock is rock hard and can't even fit in his pants. Tony Orlando is shocked by how huge this stud is, but is determined to take every inch of that monster down his throat and edge that cock til it turns blue. Sebastian Keys brings out the rope and elaborately ties up Sherman in full restrictive rope bondage. A red ball gag muffles his screams for pleasure. Sebastian continues his devious plan and attaches a leather ball stretcher to Sherman. His long and low hangers get tugged before a boot is tied on. Sherman screams in pain as his nuts are stretched as far as they can go. He can't help the pleasure of getting a deep throat cock sucking from Tony and begs to shoot his load. Tony denies him and takes out a an ultimate cock sleeve. Sherman's monster penis can barely fit. This thing truly is a major league bat ready for swinging. Sebastian hoists Sherman into the air for a full suspension as Tony continues to pleasure and deny the hung stud. After fully stretching out Sherman's sack it's time to stretch out his hole. Giant monster dildos are easily swallowed by Sherman's hungry asshole. He takes a deep anal pounding by those beasts as Tony continues to work on his cock. Denied and edged over and over again, Sherman creeps closer and closer to a full load orgasm. Will the men let him shoot, or will he be tormented til the very end. Sherman endures an intense endurance tickling before the very end.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Sherman Maus",
      "person_id": 62063
    }
  ],
  "release_date": "2019-09-17",
  "scene_id": 44932,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blindfold",
    "Bondage",
    "Boot",
    "Dildo",
    "Dragon Dildo",
    "Edging",
    "Gag",
    "Gay",
    "kink-pov-gay",
    "Leather",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Pain",
    "Prostate Stimulation",
    "Rope Bondage",
    "Stud",
    "Suspension",
    "Tickling"
  ],
  "title": "DRAGON'S EDGE: Newcomer Sherman Maus Gets Balls & Asshole Stretched"
}