{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Take a good long look at these long legs in those lovely stockings. Mistress Gia has had a long day standing on her sweaty feet with her toes crammed into those shiny black heels. Don’t you just wish you could smell those sweaty, stinky toes and run your tongue along those high arches? All you get to do is imagine the aroma because you haven’t earned the privilege of being able to worship those perfect feet. Mistress Gia’s little plaything knows exactly how to worship her and that’s why it is allowed to be in her presence, kissing and licking her feet. But you, you just get to sit there and watch as your bulge begins to grow. Gia knows your dick is getting harder and she knows just how badly you ache to suck on her toes and run your hands and face all over her sheer stockings. You’re getting harder as she pulls out her perfect tits, her beautiful breasts looming over her plaything. You better not touch your cock, not until she tells you to. That’s right, just sit and watch. Gia’s footslut removes her shiny, patent leather black pumps and works it’s way up her gorgeous legs. Maybe if it does a good job, he’ll get to smell her pussy, but you, no not you, you just get to look and sit on your hands. He moves up her body, worshipping every inch of her until he meets her pussy. It starts to nuzzle her panties, and she wraps her legs around its neck in pleasure as it begins to bury its face in her pussy. Sniffing all the sweet aromas in her pussy Gia knows that you don’t just want to sniff her feet and her pussy, but also her juicy ass. Watch as her slave gets to bury its face in her ass, rubbing its nose between her ass and pussy and letting its tongue glide over her cute little asshole. It buries its face in her ass and is only allowed to breathe the air she gives it. Unless she gives permission, it is made to breathe in her pussy and is practically drowning in the sweet aromas coming from her delicious ass. Now she’s going to reward her obedient foot slave by giving its cock a nice rub down with her pretty feet. Watch as her cute toes stroke its rock hard dick, up and down, while she toys with you. She instructs you to rub your dick but don’t get too excited because that’s all you’re ever gonna touch, is that thing between your legs. You’ll never come close to touching Mistress Gia. Now she bends now to reward he foot slave by stroking its cock. It gets harder and harder and moans with pleasure. She loves letting you know just how much pleasure you’re missing with her mouth, hands, and feet by demonstrating on her slaves cock just how fast to stroke your own. Then she gets greedy and demands her footslut to cum. while it fucks the space between her pretty feet. It pumps harder and faster until it explodes hot sticky cum all over her feet just as its told.",
  "directors": [],
  "models": [
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2019-08-15",
  "scene_id": 44936,
  "tags": [
    "Athletic",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Cuckolding",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fetish",
    "foot fetish",
    "Foot Worship",
    "High Heels",
    "Hitachi",
    "Kinky",
    "Leather",
    "shaved",
    "Slave",
    "Sniffing",
    "Straight",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "KINKY JOI: Filthy Pig Worships her Feet"
}