{
  "collections": [
    "Men On Edge"
  ],
  "description": "Ace Rockwood gets tied up for the first time ever in Men on Edge! Decked out in sexy leather gear Ace is ready for some hot new experiences under the capable hands of Sebastian and his willing slave. After getting tied up and blindfolded Sebastian teases Ace's cock which is carefully concealed inside the leather pouch he is wearing. A masked slave peers out from inside a cage nearby licking his chops awaiting the thrills of sucking Rockwood's big cock. Sebastian strokes Ace's dick until he starts moaning and leaking pre-cum. This is off to a good start as Sebastian takes Ace to the edge for the first of many times today. With little suction cups tight on his nipples Ace is having so many new amazing sensations. Sebastian slides the fleshlight onto his fat cock and it barely fits inside. He jacks him off sending Ace into a new pleasure zone but just when Rockwood wants to blow his load off comes the fleshlight driving him crazy. They have a long way to go before he gets to cum. This cock needs to be sucked and it aint gonna suck itself so Sebastian unleases the slutty little slave to do the deed. He fills his mouth with Rockwood's massive dick and chokes and gurgles and stretches his throat out to get it nice and deep inside. Sebastian guides the slaves head up and down back and forth polishing Ace's cock and getting him all worked up. But no coming! Not yet. Next Ace is gagged and strapped down on his back so he can't go anywhere. Slave boy plays with his balls and sucks his big ass dick voraciously while Sebastian licks and sucks Rockwood's sensitive feet. Sebastian vibes his dick with the Hitachi taking him to the edge once again. Rockwood is ready to burst moaning and begging to cum but\nhe is denied once again until Slave boy sucks Rockwood's cock to the point of no return and finally Ace shoots his hot sticky load and all is right with the world.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Ace Rockwood",
      "person_id": 62055
    }
  ],
  "release_date": "2019-09-03",
  "scene_id": 44931,
  "tags": [
    "BDSM",
    "Big Ass",
    "Bondage",
    "Cage",
    "Edging",
    "Feet",
    "Gay",
    "Hitachi",
    "Leather",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Slave",
    "Tickling"
  ],
  "title": "Into the Ropes with Ace Rockwood"
}