{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Your beautiful girlfriend Bella Rossi is extremely unsatisfied with you and it’s been a long time since you’ve been able to get her off. But she’s found someone special who knows how to press all the right buttons. Meet Fox, a hot lesbian who’s ready to make Bella Rossi cum. Bella explains just how good Fox’s touch is while Fox can’t take her hands off of Bella’s delicious curves. Her hand begins to rub Bella’s pussy and she slowly teases Bella’s nipples out of Bella’s tight black dress. With one long lick, Fox starts to suck on Bella’s big plump breasts. “Are you touching your cock? Get your hand off your cock”. You see it’s time for you to pay attention and see just how a woman’s body wants to be touched. Bella instructs you to wait and watch while Fox begins to lick Bella’s pussy. Bella’s clit ring beams as Fox’s tongue gets her pussy nice and wet between her thigh high stockings. Fox takes off her shirt and with their tits pushed together grabs Bella’s big bubbly ass. Ok fine, you can touch your pathetic cock, but you can only touch it while watching Fox please Bella and get used to the fact that you’re never gonna touch Bella again. They continue to sensually touch and please one another while they lie on the bed. Fox’s nice ass trapped beneath a sexy lacy thong she eats Bella’s pussy to her heart’s content. Now that Bella’s found her replacement for you, you just have to sit there and stroke your cock while she moans deeply with each orgasm that Fox gives her. Don’t you dare stroke your penis faster than she licks her pussy, this is a learning experience for you. Don’t you want to know just how to make a woman cum? Pay attention.",
  "directors": [],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Fox Acecaria",
      "person_id": 61748
    }
  ],
  "release_date": "2019-08-08",
  "scene_id": 44935,
  "tags": [
    "Big Tits",
    "Bondage",
    "Cuckolding",
    "Curvy",
    "Femdom",
    "Fetish",
    "Fingering",
    "JOI",
    "Kinky",
    "Lesbian",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "white"
  ],
  "title": "KINKY JOI: Lesbian Cuckolding with Bella and Fox"
}