{
  "collections": [
    "Bound Gods"
  ],
  "description": "Welcome Franco Nunez to Bound Gods! Franco is new to Kink and eager to worship Leather God Sharok. Dressed in leather, Sharok awaits the arrival of new boy Franco. He has Franco strip and walks over to inspect his body. Franco sinks to his knees and takes Sharok's leather gloved finger into his mouth, sucking on it. Sharok laughs and pushes Franco's face into his leather codpiece. He spanks Franco's ass and attaches multiple weights to Franco's balls before walking across the room to his chair. He takes a seat and commands Franco to come and get his cock. Franco looks up and notices the candles suspended from the ceiling dripping hot wax directly onto his path. As he crawls to Sharok, the wax drips from above onto his body. He hisses as the wax hits his skin but continues forward. Finally, he reaches his Master and is rewarded with a collar. Sharok weaves rope through his boy's collar and up through a tie point on the ceiling. He gives it a tug, causing Franco to jerk backwards, and then commands Franco to suck his cock. Franco strains against the rope, trying desperately with his tongue reach his Master's cock. Unable to reach it on his own, he begs Sharok to let him taste his cock. Sharok laughs and gives the rope slack. Franco eagerly swallows Sharok's cock, worshiping every inch of flesh he can get his mouth on. Next, Franco is blindfolded, bound, and in chastity. Sharok flogs his back and ass before flipping him around, clamping his nipples, and flogging his front. Franco moans with every hit of the flogger. It feels so good, Franco cries out as he struggles to get hard in his cock cage. After flogging his boy, Sharok gags him and suspends him in rope with his hole exposed. He slides right in and gives his boy a good hard pounding. Franco's body arches with each thrust. His head falls back and his body quivers as he lets go entirely and lets Sharok use his ass. Finally, Sharok cums all over his boy's face and lets him clean up his cock.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Franco Nunez",
      "person_id": 62156
    },
    {
      "name": "Sharok",
      "person_id": 62054
    }
  ],
  "release_date": "2019-09-05",
  "scene_id": 44930,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Cage",
    "Chastity Play",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gay",
    "gloves",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Predicament Bondage",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Submission",
    "Weights"
  ],
  "title": "Franco Gets FUCKED: New Slave Flogged and Fucked by Sharok"
}