{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Helena Locke has been working all day in her patent leather pumps and sheer nylon stockings. She knows you're just aching to worship her feet and to sniff all the aromas swirling between her toes. She takes her hand and guides your eyes up and down her beautiful stocking-clad legs. You're getting visibly excited, and she giggles. She knows you want to smell her feet so badly. Just imagine how pleasurable it would be to take in the smell of her sweaty feet mixing with the smell of the stockings. She keeps rubbing herself and shifts to spread her legs and show you her pussy through her stockings. She tells you that if you're really good she'll let you cum as a reward. She keeps touching herself and then pulls her foot out of the high heel to show you her toes. She spreads her toes and instructs you to put your hand on your cock so that every time you take a deep breath to smell her feet you're also taking a deep, long stroke down the shaft of your cock. She pulls her hand toward her and then slides her fingers into the crease behind her knee. It's so sweaty. She keeps fingering the slippery spot between her leg and calves and tells you to keep stroking your dick. Make it nice and hard for her, that's right keep stroking. Now she's going to let you take your face and sniff in between her thighs. As you stroke you're getting closer and closer to her delicious cunt. Feel the texture of the stockings against your face as she holds your head with her knees. She rubs her pussy and then turns to show you her ass. The seam of her stockings is aligned with her ass crack while she rubs her juicy cheeks. Do you think you'll be able to sniff her asshole without cumming? Helena doesn't seem to think so. Just keep stroking and try your best not to explode. Now she's going to give you a countdown while she alternately flexes and points her perky toes. 3, 2, 1 now cum. Good boy.",
  "directors": [],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    }
  ],
  "release_date": "2019-08-01",
  "scene_id": 44934,
  "tags": [
    "Bondage",
    "Brunette",
    "Cuckolding",
    "Feet",
    "Femdom",
    "Fetish",
    "Fingering",
    "Kinky",
    "Leather",
    "natural boobs",
    "Straight",
    "thirdparty",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "KINKY JOI: Worship Helena's Sexy Feet"
}