{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "It appears that you’ve found yourself in the presence of the lovely Cherry Torn and Sophie Monroe. These gorgeous mistresses are sitting before you in almost matching bodysuits except Cherry is showing just a little bit more skin than Sophie who will be taking the reigns today. They begin by welcoming you, both knowing very much that you’re here to please them and to prove yourself. You want to be a good girl, don’t you? They begin to caress each other, pulling out their luscious tits and touch each other’s nipples. Sophie points out that Cherry’s nipples are perfect as she teases the tip of her nipple with her long feminine nails. Cherry and Sophie both begin to touch themselves, Cherry with her hands on her pussy, teasing it just beneath her one-piece while Sophie strokes her own tits. They instruct you to be a good girl and strip for them, nice and pretty. Go ahead, stand up, and strip. Now that you’re naked, they want you to sit down and show them that perfect pussy of yours. “Look at that clit,” Sophie says, “the things I would do to that, flick it, bite it, lick it, vibrate it if you’re really good.” But, Cherry loves to deny little pets like you. Sophie gets behind Cherry and begins grabbing her breasts. Now Sophie tells you to pinch your nipples and massage your tits until you feel your pussy glisten. Sophie plunges her fingers into her mouth and tells you to do the same. Then with her other hand, puts two fingers in Cherry’s mouth and makes her suck on them. Now with Cherry still feeling her pussy and Sophie with a vibrator in her hand Cherry begins to slide her panties to one side and pulls upward to tug at her dripping cunt. Sophie instructs as Cherry demonstrates and you are to follow their directions exactly. Now take your finger and rub your clit in circles over and over again. “Now when she does cum, we expect you will, too” Sophie says as she bends down to press the vibrator against Cherry’s clit. She stops suddenly to make you thank them. Say “Thank you Mistress” and then Sophie grabs a vibrator herself because she wants to cum as well. So now Cherry and Sophie are both writhing with vibrators buzzing hard on their clits. Now Cherry tells you, “don’t you dare fucking cum without permission.” The intensity builds, and both of them are moaning, getting closer and closer to their edges. Sophie lets hers out, followed by Cherry with waves and waves of rolling orgasms. Now, precious little pet, Sophie gives you a countdown and tells you to do whatever it takes to get to your orgasm. Are you ready to be a good girl?",
  "directors": [],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Sophie Monroe",
      "person_id": 20940
    }
  ],
  "release_date": "2019-09-12",
  "scene_id": 44938,
  "tags": [
    "Big Tits",
    "Bondage",
    "Brunette",
    "Cuckolding",
    "Femdom",
    "Fetish",
    "Hitachi",
    "JOI",
    "Kinky",
    "Lesbian",
    "natural boobs",
    "other hair color",
    "shaved",
    "slim",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Kinky JOI: Lessons for the Lady"
}