{
  "collections": [
    "Carmen Rivera"
  ],
  "description": "The stretch limo rolls up at the Hardcore Party at Berlin's Insomnia Nightclub. It's PARTY TIME!\nLady Carmen has brought along some of her favorite guests for this epic orgy to be, including super slutty FitxXxSandy, muscle goddess Mistress Tigress, Frank (and his tattooed butt,) and many willing slaves. The 'fuck-crowd' gathered at the bar get things started with FitxXxSandy, as she always does, not being able to get her mouth full enough of the excited slave cocks present. Frank was filled with lust, having seen the scene unfold, while Lady Carmen was, too. Surprisingly, Lady Carmen used her world-famous dildo-fucking skills right there, taking one of FitxXxSandy's sluts and bending them over the bar to be thoroughly used for arousing penetration. Now feverish in his enthusiasm, Frank, and his tattooed butt, were soon strapped into his gyn chair, ready, willing, and wanting to be stretched to pleasure by XXL anal toys!\nIn the midst of what was slowly becoming a sultry crowd of people dancing, fisting, and fucking, Frank was being anally invaded by Lady Carmen. Our attention now turns to Mistress Tigress, the beautiful Black power-domme, who describes herself as \"your dream come true and your worst nightmare.\" Tigress took a slave between her legs, crushing the breath from him with the exquisite power of her well-developed thighs and legs. Later, Tigress' slave was bound and looking very helpless. Lady Carmen emerged, having left Frank in orgasmic bliss, saw this, and was impressed by Tigress' work. \"A dildo should be in the ass of this slave, too, Carmen thinks as while Mistress Tigress has him locked between her legs, Carmen delivers a phenomenally pleasurable pounding that proves that it's the muscles of the Mistresses that do it all.\nFitxXxSandy is not to be denied upping the ante for the festival of lust that the night has become. Surrounded by slutty slaves, the cock meat circus surrounding her begin to lustfully take all of her holes, in every way, with great energy. Most wild of all, the two slaves who give her a double penetration, stuffing their hard cocks deep into her wet and horny pussy. They finally soak Sandy's tits in their hard-earned, thick, and heavy shots of cum. The slaves, taking notice of the palace of depraved pleasure that the club has become, sleeplessly disappear into the night of Berlin.",
  "directors": [],
  "models": [
    {
      "name": "Carmen Rivera",
      "person_id": 60339
    },
    {
      "name": "Chris \"Schock\" Cock",
      "person_id": 60356
    },
    {
      "name": "FitXXXSandy",
      "person_id": 62169
    },
    {
      "name": "Frank The Butt",
      "person_id": 62168
    },
    {
      "name": "Mistress Tigress",
      "person_id": 62164
    },
    {
      "name": "Mr P",
      "person_id": 62170
    },
    {
      "name": "Mr. White",
      "person_id": 62166
    },
    {
      "name": "Object T",
      "person_id": 62167
    },
    {
      "name": "Snake Dave",
      "person_id": 62165
    }
  ],
  "release_date": "2019-07-19",
  "scene_id": 44950,
  "tags": [
    "big dick",
    "Big Toy",
    "black hair",
    "CBT",
    "Crop",
    "Cub",
    "Dildo",
    "Double Penetration",
    "Facesitting",
    "Facefucking",
    "fake boobs",
    "Fisting",
    "foot fetish",
    "Foot Worship",
    "German",
    "Latex",
    "Muscle",
    "natural boobs",
    "Orgy",
    "Slave",
    "slim",
    "Spit Roast",
    "Straight",
    "thirdparty",
    "white"
  ],
  "title": "Power Pussy at Insomnia Night Cub"
}