{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Penny Barber is everyone's favorite Taboo Fetish MILF. She's a tall Brunette with big lactating tits and\nstrong legs that can crush any creature who dare to step into her trap. Mickey Mod is a studly Ebony man\nwith BBC that will make you submit to it just by looking at it. Mickey has some training in Hapkido and is\nconfident that his abilities on the Mat will dominate over Penny Barber who seems to be a one-trick pony.\nPenny likes to pull guard which in Evolved rules, is not great since it does put her shoulders on the mat\nfor a pin which gives favor in the Judge's eyes to her opponent who is able to Pin her. However, Penny\npulls guard and uses her giftwrap move to hold her opponent, sweep him and generall have her way with\nhim. Mickey has really good stregth and he's really great at being a pervert so he is able to get some\ngreat moves on Penny. He has a good strategy for the match. When Penny gets \"penalties\" on him, he\neats her pussy good in order to get her close to orgasm. He knows that if he can get her to cum in the 3rd\nround, he will get an instant victory and be able to dominate her. After 3 hard fought rounds, the winner\nis announce to take their prize. The winner spanks the loser, and rubs their feet all over them. The\nwinner fucks the loser good and hard until Penny is cuming over and over then Mickey finally cums and\nshoots his hot load deep into mommy's pussy with an incredible creampie ending.",
  "directors": [],
  "models": [
    {
      "name": "Mickey Mod",
      "person_id": 19623
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    }
  ],
  "release_date": "2019-07-23",
  "scene_id": 44957,
  "tags": [
    "bbc",
    "big dick",
    "Black",
    "black hair",
    "Brunette",
    "Creampie",
    "Ebony",
    "Feet",
    "Fetish",
    "MILF",
    "natural boobs",
    "shaved",
    "Straight",
    "Tattoo",
    "thirdparty",
    "white",
    "Wrestling"
  ],
  "title": "\"Mommy\" MILF Penny Barber takes on BBC"
}