{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Kate Kennedy is married. She’s happy. But she has a fantasy, a dark fantasy she can’t share with her husband. Her fantasy involves a dark room, rope, and being at the mercy of five men. She’s tied in strict bondage, unable to move as five men advance, pulling out their hard cocks in preparation. Soon, they’re all over her. Pressing fingers and cocks into her mouth, telling her to keep her mouth open, and to tell them how much she wants their cocks. Kate asks for their cocks as they take turns ravishing her mouth. Kate takes cock after cock, gagging on them as they fuck her face. She eagerly swallows each cock and screams for more cock. Next, she’s suspended in rope bondage. Then men crowd in on her from all sides and soon she’s got a cock in her mouth and one in her cunt. She moans as cocks slide in and out of her holes. They smack her ass and spit on her face as her holes swallow their cocks. They fuck her ass and make her a messy sloppy slut. They spin her around in bondage, so she can taste the cocks that were in her cunt and her ass. Soon she’s begging for them to fill all her holes so they bring her down, they stuff her airtight. Kate loses track of how many times they double stuff her holes. She cries out as they fuck her relentlessly and manhandle her into different positions. She screams as they slap her face and fuck her pussy, ass, and mouth over and over again. Once they’ve had her fill, they bring her to her knees and give her five fat loads all over her face. Covered in cum, spit, and lube, Kate is one happy slut.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Kate Kennedy",
      "person_id": 61558
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-09-04",
  "scene_id": 44968,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "Facefucking",
    "foreskin",
    "Gangbang",
    "Latinx",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slapping",
    "spit",
    "Straight",
    "Stud",
    "Suspension",
    "Swallow",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "Kate Kennedy Gets DP'd and Stuffed Airtight"
}