{
  "collections": [
    "Everything Butt"
  ],
  "description": "Ana Foxxx, Kira Noir and Jane Wilde! Need I say more? Three super hot babes star in this weeks lesbian psychodrama role play where the girls are \"pitted\" against each other with their anal skills to prove their love to Ana. Who loves her the most? Who will Ana choose to keep as her number one fuck toy? When Jane shows up at Ana's place Kira is already there flirting with Ana on the bed. Jealousy and a chance to win Ana over kick in and the great Anal Fuck Off begins! They pull Ana's little top off and tongue her nipples getting her all turned on. Ana has a butt plug in her ass and the girls play with it sliding it in and out of her tight asshole and licking it clean. Each of them determined to fuck Ana the best they each take turns pleasing her with butt toys, pussy licking and hot tender kisses on her lips and her asshole. A long metal dildo glides in and out of Ana's firm ass until she cums hard and the girls clean it off voraciously. They are all getting along pretty good so now it's Kira's turn to get some action and boy do these lovely ladies give it to her. First while Ana vibes Kira's pussy Jane drives her petite fist right up her asshole and it drives her to crazy town. Then Ana gives her a good ass fuckin' with a fat blue strap on cock while Jane slaps and chokes her. More fisting please! Jane fills her butt again with a fist and then they try to fill her up with an even bigger butt plug. Can they get it in? And then little Jane Wilde gets big treatment from Ana and Kira, first they fuck her ass with a glass dildo to warm her up. Then they stuff an even bigger toy in her but and Jane goes Wilde. Jane is famous for her top notch gaping, her ass just gapes like no other. She wiggles and writhes as Ana and Kira fuck her, lick her ass and get her off again and again. Who wins in the end? The Anal Fuck-Off delivers some hot hot hot girl girl girl action! Wow!",
  "directors": [],
  "models": [
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    },
    {
      "name": "Jane Wilde",
      "person_id": 61147
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    }
  ],
  "release_date": "2019-09-06",
  "scene_id": 44969,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Black",
    "black hair",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Fisting",
    "Gaping",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Petite",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "toned",
    "top",
    "white"
  ],
  "title": "Anal Fuck-Off: Ana Foxxx, Kira Noir, Jane Wilde in Lesbian Psychodrama"
}