{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "When bratty blonde property manager Sophia Grace tells her tenant's unruly house guests to get the hell out, things take a turn for the best, and suddenly its a Gang Bang! Sophia happens to be hot and horny on this very lucky day when 5 big dudes decide to have their way with her. Let the blowbang begin! Down on her knees, Sophia is hungry for cock! With a dick in each hand and cock way down her throat she sucks each and every one of them voraciously. Soon enough all her clothes are off, revealing her tall sexy athletic build. All this dick sucking makes Sophia horny, and she begs to get her holes stuffed in every way possible. Bound with rope, Sophia gets her first long hard cock deep inside her slutty pussy. Legs spread wide she invites one meaty cock after the other to fuck her cunt and she loves it! Then she begs to get some dick deep in her tight little ass, and these dudes deliver! All tied up she can't do anything but take it in whatever hole they want to fill, and she will take it however she can. Two dicks at the same time please. Double penetration is her dream today. One in her pussy and one in her asshole while jacking two cocks with her pretty hands. This greedy, cock slut cant get enough! She excitedly takes it in her ass and pussy from behind, missionary, reverse cowgirl, mermaid, grinding and bouncing on 5 thick dicks until all those pounding cocks make her cum again and again until each one shoots a fat hot load all over her face.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Sophia Grace",
      "person_id": 58792
    }
  ],
  "release_date": "2019-09-18",
  "scene_id": 44967,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "foreskin",
    "Gangbang",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Cock Slut Landlord: Sophia Grace Gets Holes Stuffed With 5 Big Dicks"
}