{
  "collections": [
    "The Upper Floor"
  ],
  "description": "In this conclusion of The Upper Floor’s finest Summer Soiree Orgy, Joseline Kelly has gotten herself in deep trouble. This silly cock slut had promised Aiden that she would do her a favor in exchange for a prompt on the House Rules. Mistress Aiden Starr only ever wants one small favor: to be fist-deep in a whore’s pussy. She starts by flogging Joseline’s beautiful body a bright red, while making her recite the rules over and over again, and then makes the move for Joseline’s cunt. Aiden works her whole fist in that wet, hungry pussy and has Joseline orgasm and scream for the amusement of the guests. Next, Aiden takes a massive dildo to Joseline’s tight pussy, fucking her good and then having her stretch her mouth over a giant cock, creating some quiet for once. Stefanos is concerned that Kira Noir seems to be very focused on getting her holes fucked and is losing her focus on service to the orgy and our esteemed BDSM swinger crowd. Kira is handed a vibrator and told to go give orgasms to at least three guests before she’s allowed any more cock. Stefanos pursues Kira with a flogger to drive the point home on her bright pink ass. Kira readily finds three beautiful women in the crowd being fucked with a fucking machine, engaging in nipple torment, or being held fast by their master while Kira holds the vibrator to their trapped clits. All the guests find Kira very pleasing, and summon Donny over to fuck her pussy before them. Kira holds fast to her duties, drawing one final orgasm out of a guest as she is rammed from behind on all fours by Donny’s massive cock. The party is inspired by Kira, and lights up into all sorts of sexual mischief. Latex submissives take strict canings and suck cock, while one lesbian Mistress hooks her submisive up to a very devious looking suction machine. Mr. Kilt You gets Foxhole stretched out in a tight shibari stress position and takes his time single-tailing her, using her pretty mouth, and edging her towards a painful orgasm. Other guests play in rope suspension, or enthusiasticly fuck on the furniture. Joseline is sent crawling over to fetch Kira and Donny, but Kira shrieks and begs to keep the cock, going so far as to sit on Donny’s dick and push her underling away. Aiden isn’t having any of it, so she calls them both over for a punishment spanking before Kira is to be fucked in the ass and beg for forgiveness from the party goers. Stefanos is secretly pleased that Kira has reconnected with her selfish sluit side, and allows her some orgasms before hauling her off the cock and putting Joseline to the test. Can she gets her tits zapped, resist cumming on that giant cock in her pussy, and recite the rules? Watch to find out.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Joseline Kelly",
      "person_id": 58721
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2019-10-11",
  "scene_id": 45005,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Dildo",
    "Discipline",
    "Edging",
    "fake boobs",
    "Female Slave",
    "Flogging",
    "Humiliation",
    "Latex",
    "Lesbian",
    "master",
    "mixed",
    "natural boobs",
    "Nipple Torment",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Suspension",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Slutty Teen Trained to Serve Orgy by Submissive Anal Queen Kira Noir"
}