{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The Upper Floor is back to training eager anal whores in service to hard cocks, entertainment, and filthy fun. Aiden Starr and Stefanos have Kira Noir on hand to deliver a perfect example of submissive behavior. Kira is gorgeous, well mannered, knows her rules, always asks permission to cum, and will wait her turn for a ride on some dick. But her new trainee, Joseline Kelly, is another matter. Joseline’s back for her second time on The Upper Floor and she has only gotten wilder, hornier, more sex-hungry, and more orgasm-greedy! Kira is tasked not only with providing perfect service, but also in teaching Joseline the rules of The House before Kira can have any dick to ride.\n\nComplicating matters, Joseline is tethered to the ceiling in a partial shibari suspension. Even worse for Kira, a male guest is already fucking Joseline’s dripping wet cunt and causing her to orgasm repeatedly without permission. The crowd of BDSM swingers cheer and laugh as Kira frantically tries to teach Joseline the rules while being flogged, zapped, and made to hold a hitachi on both her and Joseline’s cunts. It seems hopeless for Kira as house guests try to feed Joseline house rules, but this chaotic little slut is too busy moaning to listen. Kira has nipple clamps torn off her tiny tits and is told to hold her orgasms. As she struggles and writhes on the floor, Aiden Starr gets a wicked idea and offers Joseline the chance to owe her a favor in exchange for a pass on the rules. Joseline’s curiosity gets the best of her and she agrees. Aiden cackles with delight and tells Kira she can steal the cock from Joseline. Kira sucks and fucks with lustful abandon, cumming multiple times on the floor to much applause. The party has developed many scenes of sexual depravity. There is plenty of paddling gorgeous women in latex, spanking reddening many asses, and a great deal of blow jobs. A beautiful woman in purple latex has another woman bound and is using a latex vacuum machine on her body in all sorts of perverted manners. Mickey Mod has found his play date for the night in Dresden, who urges him to keep spanking her perfect ass with bewitching eyes. Mickey gladly beats and fucks Dresden, taking special time to train her to take his cock ALL the way down her throat before throwing her on her back and fucking her tight pussy to orgasm. Kira has been given her reward for partially taming Joseline. She is tied tightly in rope with her gorgeous ass and pussy in the air, with a gentleman very interested in fucking her ass. She wiggles and moans best she can in the tight bondage, but Aiden reminds her to simply use her words to talk dirty and thank the man for anal so the whole party can hear it. Meanwhile Joseline is tied on a sybian vibrator. She’s made to finally learn her rules through positive reinforcement on her pussy, and negative reinforcement with many tight clamp zippers all over her beautiful body. Will Joseline finally learn the rules? Will Kira get nearly enough anal orgasms to make up for the challenge of Joseline? Join us for part two of this update to find out…",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Joseline Kelly",
      "person_id": 58721
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2019-09-13",
  "scene_id": 45004,
  "tags": [
    "Athletic",
    "BDSM",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Hitachi",
    "Humiliation",
    "Latex",
    "master",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Suspension",
    "Swingers",
    "Sybian",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Chaotic Cock Slut Steals All the Dick at the Summer Swinger Orgy"
}