{
  "collections": [
    "Everything Butt"
  ],
  "description": "Britney Amber is insatiable. Her unquenchable thirst for ass has her running through ass slave after ass slave. Today, she brings out the beautiful buxom strawberry blonde Skylar Snow to play. Skylar is eager to please her Mistress and ready to get her ass stretched wide open. She strips at her Mistress’ command and presents her luscious ass. Britney inspects her slave’s hole and presses a finger into it. Skylar moans as her Mistress fingers her asshole. But Britney only gives her a taste of what’s to come before she has Skylar on her knees and commands her to eat her ass. Skylar eagerly buries her face in between her Mistress’ cheeks and brings Britney to multiple orgasms with her tongue. Now it’s time to really get in Skylar’s ass. Britney teases Skylar with different toys until Skylar is squirming with pleasure. Her hungry asshole swallows each toy and Britney decides it’s time for a challenge. She straps-on a long fat cock. Skylar has never seen a cock so big. She can’t wait to get fucked by it. She sucks her Mistress’ cock, giving her a sloppy blow job. Once her dick is nice and wet, Britney slides her cock into Skylar’s ass. Skylar’s toes curl as her ass fills up with her Mistress’ dick. She moans as Britney gives her a deep anal fucking. After several orgasms, Britney breaks out bigger toys to stretch out her slave’s ass even more. Skylar takes each one, squirming as they push deeper and deeper into her ass. She fucks herself on a silicone fist while worshiping her Mistress’ beautiful breasts. She licks her Mistress’ cunt until Britney cums hard all over her face. Finally, Skylar takes the slink. She cums so hard that her orgasm pushes it out of her ass! Still trembling from her orgasm, she moans as her Mistress’ kisses her for a job well done.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Britney Amber",
      "person_id": 57340
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2019-07-26",
  "scene_id": 45007,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Tits",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "natural boobs",
    "other hair color",
    "shaved",
    "Slave",
    "slim",
    "slink",
    "Straight",
    "Strap On",
    "toned",
    "white"
  ],
  "title": "My Mistress Only Wants My Ass: Slave Skylar Snow serves Britney Amber"
}