{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Devoted slave Georgio has requested to be in the presence of hot Domme Ryan Keely. But is he worthy? In his first suspension Georgio is hanging upside down tightly bound in a plastic wrap cocoon with his little worm dick and balls exposed. Of course he is gagged so Ryan doesn't have to listen to his screeching and squawking, but he is dripping drool all over her clean floor and Goddess Ryan likes a tidy dungeon. So Georgio's first punishment is a good spanking with the paddle. Ms. Keely prowls around Georgio wearing super high black stiletto heels and a sexy black strappy bustier top with thigh high stockings and garter. She pinches his balls with clothespins and paddles his pale ass turning it rosy pink but he keeps making a mess with his filthy spit so Ryan makes him clean it off her favorite shoes. Man whore Georgio has a lot of training to do before he is a worthy slave. On all fours tied up and blindfolded Georgio's head is restrained in a heavy square frame so he can't move. Ryan crops his slutty ass and stuffs her big strap on cock in his mouth to get it wet and ready for fucking. She reveals her gorgeous breasts and slides her dick in Georgio's tight slave ass and fucks his hole but she grows sick and tired of doing all the work so next level of training: Worship the Goddess. Wrapped up tight in a straight jacket Lucky Georgio is worshiping Ryan's beautiful feet. She tears her nylons open and slides and wiggles her sexy toes all over his face making her moan and giggle with delight. If Georgio does a good job with her feet she might let him worship her ass. She soon grows bored so she tells him to tongue her asshole. The novice gives it his best and tries to please Goddess Ryan. She vibes her pussy with the Hitachi while he worships her legs, more on her feet and her curvy ass until she cums. Georgio has served fairly well today so she will allow him to cum--but only on the floor like a worm. Ms Keely asks Why do all men end up like this? Exhausted on their backs panting? She gives him ten seconds to jack off and cum which creates a huge mess so she pees all over this novice slut and leaves the room.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Papa Georgio",
      "person_id": 61743
    },
    {
      "name": "Ryan Keely",
      "person_id": 15370
    }
  ],
  "release_date": "2019-10-22",
  "scene_id": 45018,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "drool",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Hitachi",
    "Humiliation",
    "Latin",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Paddle",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "slim",
    "Spanking",
    "spit",
    "Straight",
    "Strap On",
    "Suspension",
    "top"
  ],
  "title": "The Goddess and The Novice: Ryan Keely Rules Over Papa Georgio"
}