{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Caged with a myriad of clothespins on his balls, Jay Wimp awaits the beautiful Domina Helena Locke. Domina Helena enters, clad in shiny tight red latex and thigh high boots. She’s heard Jay is tough and is ready to put him to the test. She bites his cock and zaps him all over his body, paying extra attention to his cock and balls. Jay yelps and squirms like the pathetic worm he is, unable to escape his Domina’s reach. Helena clamps Jay’s nipples and continues tormenting him with a crop and teasing him with her perfect ass. Too bad Jay is too pathetic to even fuck. Instead he’ll take the pain all men deserve. Helena removes the clothespins on his balls one by one, leaving Jay’s sensitive cock exposed to more zaps. Next Jay is bound with rubber bands around his thighs and feet. His legs are tied open and his ass is exposed. Helena spits all over his face before scratching and cropping his sensitive nipples. She punches his balls hard and canes his cock, thighs, and feet. Jay begs for more and screams as his Domina leaves lovely red marks along his thighs. Helena commands him to watch as she canes him and stretches the rubber bands to the limit. She has Jay tell her when to release the bands to prove how tough he is and makes him watch them snap back against his skin. Jay screams as the bands hit his sensitive flesh. Then Helena slides her dick into this sorry loser’s ass. Jay moans as Helena works the cock in and out of his hole. He’s her bitch today and she makes him repeat it out loud over and over as she stretches his cock and balls and continues to snap the bands around his thighs. Finally, Jay is blindfolded and bound on his back. Helena continues to zap him before sinking down onto his face. She squeezes him between her powerful thighs. She torments his sensitive cock and refuses to let him cum. All his cries are turning her on, and soon she cums on his face. When Jay begs to cum, Helena is disgusted. She punches his balls repeatedly, ruining his orgasm. She empties the candles in her dungeon all over his cock and balls, covering them entirely in wax as Jay screams. Then she beats the wax off with a crop and cane. Jay couldn’t be happier in his new life as Domina Helena’s bitch.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Jay West",
      "person_id": 53166
    }
  ],
  "release_date": "2019-09-24",
  "scene_id": 45015,
  "tags": [
    "BDSM",
    "black hair",
    "Bondage",
    "bottom",
    "Brunette",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Latex",
    "Male Sub",
    "mixed",
    "natural boobs",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "Slave",
    "Straight",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "There's Nothing Better Than Being Your Bitch: Helena Locke & Jay West"
}