{
  "collections": [
    "Str8Hell"
  ],
  "description": "Jirka Mendez is one scorching straight guy, and he loves nothing more than another hot stud to use. He has found the perfect guy in Lorenc Byro, who is a straight stud who is also a sex pig. He loves it any way he can get it. Jirka has Lorenc tied and shackled, with his legs wide apart showing off his ass. Lorenc’s dick is stiff too, and Jirka grabs it to give it a few tugs. Then he starts spanking one Lorenc’s ass, making him wriggle and strain against his shackles. Jirka grabs the dick again and goes down on it for a few seconds, biting it. Then he takes a whip and starts to beat on Lorenc’s hot chest, and thighs and ass. Lorenc moans and strains to avoid the whip, to no avail. Jirka then grabs the dick again and wanks on it. He parts the ass cheeks, inspecting the hole, and spanking the ass. He bites on Lorenc’s cock again. He keeps wanking and biting for a while then he takes some clothes pins and starts attaching them to Lorenc’s balls. Lorenc moans all the while as the balls have more pins added. Jirka wanks that big cock hard and fast as he plays with the balls. Then it attaches a clothespin to one of Lorenc’s nipples. He has him moaning louder as he bites the cock again. Jirka moves on to that sexy ass. He takes a dildo attached to a pole and shoves it deep in Lorenc’s ass. He fucks the ass with the dildo, as Loren continues to struggle and moan. Jirka’s fingers then start fingering that fuckhole, going as deep as they can. Next, he decides to move Lorenc so that he can suck Jirka’s stiff dick. Jirka wanks it and shoves it down Lorenc’s throat, making him deepthroat it. Lorenc takes the cock all the way, gagging on it and the saliva streams out of his mouth. Jirka makes the head down on his cock and fucks the mouth hard. Lorenc keeps gagging and gets the spit wiped all over his face. Jirka is then ready to fuck. He positions Lorenc so that his legs are in the air and shoves his throbbing cock deep into that fuckhole. Lorenc moans as Jirka really fucks him deep. He keeps up the fucking, and as he pounds the ass, Lorenc grabs his cock and starts to wank it. He keeps wanking until his dick dumps a big creamy load over his belly. Jirka is still fucking that hot hole and then changes position, bending Lorenc over and slamming into his ass again. The fucking gets harder and harder until Jirka is ready to blow. Lorenc’s moaning gets even louder as that dick slam into him. Jirka pulls out and wanks himself to dump his hot load all over Lorenc’s ass.",
  "directors": [],
  "models": [
    {
      "name": "Jirka Mendez",
      "person_id": 61062
    },
    {
      "name": "Lorenc Byro",
      "person_id": 62199
    }
  ],
  "release_date": "2019-07-31",
  "scene_id": 45020,
  "tags": [
    "Athletic",
    "Bareback",
    "brunet",
    "Deepthroat",
    "Dildo",
    "Fingering",
    "foreskin",
    "Gay",
    "Spanking",
    "spit",
    "Straight",
    "Straight Stud",
    "Stud",
    "Partner Studio",
    "white"
  ],
  "title": "Lorenc and Jirka RAW - DUTY BOUND"
}