{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Arabelle Raphael is set on destroying Marcelo today. He wants to push his limits but she wants him to regret ever coming to her in the first place so she starts the day off by covering his balls with lots of clothespins. Gagged and strapped down spread eagle with an asshook holding him in place Marcelo, a.k.a. trashcan is a helpless little worm who talks a big game about being a tough sub and Mistress Arabelle wants to be impressed. But she has her doubts. She gives him a good caning on his sensitive feet and reminds him about gratitude and thanking her for every little thing she does to him. Pathetic and screaming with each swat of the cane Marcelo wants to please his Mistress but he has a long way to go. Marcelo needs a lesson in manners so a hot red wax treatment might do the job. Arabelle drips the candle wax on his most delicate areas like his nipples, his balls and his limp dick. Oh, he is such a drama queen with all his hollering and shrieking. It’s very intrusive and takes up a lot of space and Arrabelle informs him that men already take up too much space so she tapes his mouth shut. She slaps his dick with a leather slapper but his yowling is so loud he breaks through the tape. Arabelle smothers his face with her big, beautiful breasts to shut him up some more. Now this is Mistress Arabelle’s time and she will do whatever the fuck she wants and Marcelo will thank her for it. Moving on into another position Marcelo is tied up like a bitch on all fours with his pitiful little ass exposed and ready to get fucked. Raven haired beauty Arabelle wears a huge, heavy, menacing strap-on dildo that she is going to use to fuck Marcelos ass up! She fucks his useless hole with her big cock and then she fists his ass until he seems to cum. OK enough of that, it’s time for Mistress Arabelle to get off. Is there any use for Marcello’s sad cock? Arabelle gets it good and hard and climbs on top to have her way. She vibes her clit with the Hitachi and grinds her sexy pussy all over this human dildo pleasuring herself until she cums. Mistress Arabelle decides it is OK for Marcelo to cum so she sits on his face and orders him to jizz all over her feet. Of course this pathetic loser has to clean up all the disgusting spunk off of her lovely toes so he licks it up and thanks her.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Marcelo",
      "person_id": 46090
    }
  ],
  "release_date": "2019-11-05",
  "scene_id": 45039,
  "tags": [
    "BDSM",
    "Big Tits",
    "black hair",
    "Bondage",
    "bottom",
    "brunet",
    "Caning",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Fisting",
    "foreskin",
    "Hitachi",
    "Hot Wax",
    "Humiliation",
    "Latinx",
    "Leather",
    "Male Sub",
    "mixed",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "slapper",
    "Slave",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "top"
  ],
  "title": "Arabelle's Trashcan: Arabelle Raphael Destroys Marcelo"
}