{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Chelsea Marie arrives looking smokin' hot for her date with girlfriend Cherry Torn. Excited for their night out on the town, Chelsea is dismayed to find Cherry isn't ready at all. Cherry promises to make it up to Chelsea and Chelsea knows what this means. She's in for another steamy night at home with her girlfriend. She kisses Cherry and then pulls open her girlfriend's bodysuit to reveal her luscious tits. She takes Cherry over her lap and delivers a firm spanking. Cherry squirms as her ass gets redder and her pussy gets wetter with each smack. Chelsea smirks and rubs Cherry's cunt until Cherry is close to cumming. She grabs a leather slapper and slaps Cherry's assn until it's bright red. Then she grabs Cherry's foot and starts sucking on Cherry's cute little painted toes. Cherry moans. She loves the way Chelsea makes her feel. Chelsea knows Cherry is just a huge slutty brat who needs a firm hand. She pushes Cherry down on her cock and Cherry swallows every inch. Cherry loves the way Chelsea smells and tastes, and Chelsea loves feeling her girlfriend's warm mouth on her dick and fucks Cherry's face until she chokes. She spreads Cherry open and pushes her cock into Cherry's eager cunt. Cherry moans as her girlfriend fucks her hard. Soon she's begging to cum and cums hard on Chelsea's rock hard cock. Chelsea flips Cherry into doggy and continues fucking her slutty pussy before taking Cherry's ass. Cherry's ass is so tight it drives Chelsea wild. She fucks Cherry brutally, relentlessly stretching out that tight hole until it swallows her cock. Receiving this hard anal pounding makes Cherry desperate to cum. Finally, Cherry worships Chelsea's gorgeous body until Chelsea cums hard. Cherry slurps up each drop of cum and meets Chelsea's lips for a kiss.",
  "directors": [],
  "models": [
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    }
  ],
  "release_date": "2019-11-18",
  "scene_id": 45041,
  "tags": [
    "Anal",
    "Blonde",
    "Blowjob",
    "Cock Worship",
    "Leather",
    "natural boobs",
    "other hair color",
    "Role Play",
    "shaved",
    "slapper",
    "slim",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Staying In: Chelsea Marie Punishes Girlfriend Cherry Torn"
}