{
  "collections": [
    "Str8Hell"
  ],
  "description": "Alan Carly has been left in a cage, with his wrists cuffed. He rattles the cage to try to release himself, which alerts Laco Meido and Peter Zuska. They come inot the room and start to torment Alan, releasing him from the cage and trying to make him eat his shirt collar. Then they pull out their hard cocks and push Alan to his knees to suck on them. He takes turns on each of the throbbing cocks, repeatedly sucking each one. Then Alan has his hands shacked above his head, as he he naked below the waist. Laco begins to play with Alan’s cock, sucking it to make it very hard indeed. Peter begins to kiss Alan as Laco keeps on sucking. Then Laco gets behind Alan and slips his cock into his ass. He fucks that hot ass as Peter smothers Alan’s mouth. Then Peter takes over the fucking, his rock hard cock going deep into Alan’s hot hole. They are enjoying that ass and take turns fucking it, getting it stretched nice and wide. Peter unloads his hot cum in that hole and then pulls the cheeks apart, working them until some of his juice is released. Alan s laid on his back and Laco shoves his cock back into that hole to fuck it again. Alan wanks his own hard cock as he takes Laco’s. His wanking gets faster and faster as Laco speeds up his fucking too. With that cock still deep in his ass Alan releases his hot cum. Laco keeps fucking hard and then pulls out to shoot his load over Alan’s balls. Then, having had their fun Laco and Peter put Alan, naked, back into his cage.",
  "directors": [],
  "models": [
    {
      "name": "Alan Carly",
      "person_id": 60753
    },
    {
      "name": "Laco Meido",
      "person_id": 61376
    },
    {
      "name": "Petr Zuska",
      "person_id": 60766
    }
  ],
  "release_date": "2019-08-08",
  "scene_id": 45047,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "BDSM",
    "black hair",
    "Bondage",
    "brunet",
    "Cage",
    "Collar",
    "foreskin",
    "Gay",
    "Hairy",
    "Leather Cuffs",
    "Spit Roast",
    "Partner Studio",
    "Threesome",
    "white"
  ],
  "title": "Petr, Alan and Laco RAW - DUTY BOUND"
}