{
  "collections": [
    "Bound Gods"
  ],
  "description": "It’s getting late and straight stud Brian Adams needs to get to his hard working job. He’s distracted by the radio as he hears an urgent broadcast. A criminal is on the loose, this man is armed and dangerous and should not be encountered. The police are searching for this wanted criminal. Brian has no time for this and heads off to work, but later that night there is a break-in at his home. On the run from the cops, Draven Navarro breaks into Brian’s home. Hoping to lay low for awhile and make a break from the cops. Brian isn’t going to have it and catches this lazy thief. After a brutal take down, Draven is tied up, gagged and blindfolded. His hands and hard cock bound in metal cuffs. Brian is determined to teach this lazy criminal a thing or two about hard work and hard pain. He delivers a brutal corporal punishment on Draven. The crop and paddle gets his ass bright red. Brian slaps Draven’s hard cock before biting it with his teeth. He stretches out Draven’s balls as he screams. It’s time for Draven to work harder. Tied up and suspended in rope bondage, Draven is made to hold a plank position as Brian works his ass with more leather tools. Hoisting Draven into the air, Brian makes him suck his rock hard cock. He blows his load on Draven before continuing the punishment. In a final bound position, Brian delivers a deep anal pounding as Draven is ball gagged and clothespins are painfully applied to his ass. After a long punishment, Draven is made to shoot his huge load.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Brian Adams",
      "person_id": 62230
    },
    {
      "name": "Draven Navarro",
      "person_id": 59640
    }
  ],
  "release_date": "2019-09-12",
  "scene_id": 45056,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "mixed",
    "Paddle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Straight Stud",
    "Stud",
    "Submission",
    "Tattoo"
  ],
  "title": "Captured Criminal: Hard Working Stud Gags & Punishes Wanted Thief"
}