{
  "collections": [
    "Bound Gods"
  ],
  "description": "Bound, eager, and aching Archer Croft is blindfolded awaiting the arrival of Leather Daddy Dale Savage. Clad in leather chaps, heavy boots, and leather gloves, Dale enters and inspects his boy's hard ripped chiseled body. He wraps a hand around Archer's throat and tells him to scream as loud as he wants because down here in the dungeon no one can hear them. Archer whines in anticipation eager for all his Daddy has in store for today. Dale kisses Archer roughly, spits on him, and then the day begins! Dale takes out Archer's hard cock in his gloved hand, stroking it while teasing his asshole. He lights three candles, two above Archer's shoulders and one he holds under Archer's cock. Archer moans as he feels the heat from the candle beneath his balls. He cries out as the candles above him drip onto his armpits. Dale begins to drip the wax down Archer's chiseled chest. Archer screams in pain as the wax builds on his skin. He begs for more and his Daddy happily obliges. Next, Archer is bound on the wheel. He's ready and willing to take anything for Daddy's dick. Dale flogs Archer's ass. As the intensity increases, Archer cries out for more, loving every lash. For taking all that pain, Dale rewards Archer with his cock. He spins the wheel so Archer is inverted and fucks his face. Archer swallows every inch, eager to please his Daddy and be a good boy. Dale spins Archer back upright and begins decorating Archer's stomach and balls with closepins. Archer's breathing increases as each pin pinches his skin. His Daddy pulls the ropes tied around the closepins tight, so each one is snug. He tugs on them, testing their hold as his boy yells out in pain. He asks Archer which pins hurt worse, but his boy loves them all. Dale chuckles and begins spinning the wheel. Archer screams as the closepins slowly pull at his skin as he spins around and around. One by one, the closepins pop off as Archer yells out, crying out for more. Next, Archer is laying with his back on a cage and with his limbs suspended. Dale works his fingers in and out of Archer's asshole, stretching him open. His big Daddy fists fill his boy's hole to the knuckles. He instructs Archer to push him out, and Archer obeys, showing off his rosebud. Now that his ass is open and loose, his Daddy slides his cock into his hole and fucks him good. Archer loves taking everything his Daddy gives him and moans as he gets fucked in bondage. Dale pushes away the cage, pulling Archer further onto his cock and into a full suspension. Archer cries out as his Daddy uses his hole. Finally, Archer is on his knees worshiping his Daddy's cock and balls. He laps at his Daddy's balls until his Daddy cums all over his face. His Daddy then instructs him to cum on his boots, lap it up, and bring all that cum to him. Archer eagerly obeys, shooting a hot fat load all over his Daddy's boots. He leans down, tasting his cum, and carefully sucks it all into his mouth. He gets up, carrying the load to his Daddy and they kiss, snowballing the cum back and forth.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Archer Croft",
      "person_id": 61844
    },
    {
      "name": "Dale Savage",
      "person_id": 62015
    }
  ],
  "release_date": "2019-10-03",
  "scene_id": 45059,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Cage",
    "Clothespins",
    "Corporal Punishment",
    "Crying",
    "Domination",
    "dungeon",
    "Facefucking",
    "Fisting",
    "Flogging",
    "Gay",
    "gloves",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "master",
    "Muscle",
    "Older/Younger",
    "Pain",
    "Pain Slut",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Suspension"
  ],
  "title": "As You Wish: Archer Croft Pushed Hard by Daddy Dale Savage"
}