{
  "collections": [
    "Bound Gods"
  ],
  "description": "Sebastian Keys neatly and quietly puts away his bundles of rope in his dungeon. Agent Pierce Paris, dressed in all black with a mask over his face and a motorcycle helmet on his head, silently descends from the ceiling and apprehends Sebastian Keys. He recognizes Keys as Agent 316 and Keys says he doesn’t go by that name anymore. Agent Paris tells him that he must submit to the collective and so he strips him naked, puts a ball-gag in his mouth, and hangs him upside-down by his boots. He kicks Keys in the chest with his tall leather boots and he swings back and forth like a pendulum. Paris spins him around and flogs Keys’ ass with one hand and zaps him with electricity with the other. He takes Sebastian down and dresses him in a leather straight-jacket and makes him get on all fours. Agent Paris flogs Keys’ exposed asshole and the bottoms of his bare feet. He picks Keys up and sits his bare asshole on a dildo that sticks straight out of a Sybian and makes him bounce up and down on it. Agent Paris sticks multiple medical clamps on Keys’ ball-sack as he reluctantly rides and enjoys the Sybian. In the next and final scene, Sebastian is suspended inside a metal cage by his straight jacket. Agent Pierce readies an electric butt-plug and slides it inside Key’s asshole and turns up the voltage. Once his ass is good and stretched out, Pierce whips out his huge cock and fucks Key’s asshole deep and hard until Key’s cock sprays his load all over the floor. After cumming in his face, Agent Paris tells Keys that the Collective is now ready for him.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Pierce Paris",
      "person_id": 56974
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2019-10-10",
  "scene_id": 45058,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Cage",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "dungeon",
    "Feet",
    "Gag",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "Mask",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "switch",
    "Sybian",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "Agent 316: Pierce Paris Makes Sebastian Keys Submit to Him"
}