{
  "collections": [
    "Bound Gods"
  ],
  "description": "In a skimpy black singlet, Mason Lear struggles in rope bondage. He stands on top of a wooden platform, arms bound behind his back to a large suspended wooden plank, ready for his Master. Colby Jansen creeps in. holding a leather crop. He runs his hands up and down Mason's body and spits in his mouth. Colby grabs Mason's balls through the singlet and pulls them hard and crops them repeatedly. Colby crops his legs and ass and makes Mason scream so Colby puts a ball-gag in his mouth to shut him up. He puts clothespins on Mason's nipples and more clothespins up and down Mason's body. He hits all of the clothespins off with the crop and Mason screams through the ball-gag. In the next scene, Mason is naked on all fours crawling to Colby who sits at his throne, jerking his hard cock. Mason wants to suck his cock but Colby shoves his head down to his leather boots and makes Mason clean them with his tongue. Colby shoves his fingers inside Mason's asshole while Mason licks his boots. After that, he shoves a metal hook up Mason's ass with a rope attached to the end of it. He pulls on the rope and guides Mason to his cock. Colby fucks Mason's face, shoving his entire cock down his throat. He picks him up by the hook and straps his arms to chains that secure to the ceiling. Now stranding with his arms trapped above his head, Colby hits him with two cat-of-nine-tails. In the final bondage predicament, Colby has Mason on his back with his legs partially suspended with black rope attached to pulleys. Colby hoists his ass up just to the height of his hard cock and sinks his meat deep in Mason's hole and fucks the cum right out of him. Colby pulls the rope, suspending Mason upside down and cums in his face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Colby Jansen",
      "person_id": 34457
    },
    {
      "name": "Mason Lear",
      "person_id": 60275
    }
  ],
  "release_date": "2019-09-26",
  "scene_id": 45057,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Gag",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Colby Jansen Manhandles Mason Lear"
}