{
  "collections": [
    "Device Bondage"
  ],
  "description": "Sultry, slutty redhead Lauren Philips is always hungry for pain, so The Pope gives it to her in spades. She begins in a seated position with her legs spread wide, and her limbs locked in place with steel traps. She patiently waits for her captor to arrive. The Pope enters and instantly blindfolds her. She realizes that the game has now changed, and not in her favor. Lauren's in total darkness now, and scared of what may happen, as The Pope suddenly becomes quiet as he moves around he dungeon. She notices his footsteps getting closer to her again, and he proposes a game for them to play. Lauren has no idea what, or how, this is going to happen, but she does know that is won't end well for her. She is taunted with electricity until The Pope presses a vibe against her pussy, compelling orgasms from her. Next Lauren finds herself in a doggy style position, on her knees and forearms, with her ass in the air like a good slut. The Pope discovers that she is ticklish, and decides to toy with this before he administers more torment. The zapper is brought back out and used to make her squirm. Her feet are destroyed with heavy impact before her pussy is fucked and vibed into non-stop orgasms. In the final scene, Lauren is spread eagle on the floor and held in place with steel shackles. Her flesh is assaulted again until The Pope sees fit to stop. Then he switches his attention to breath play and imposed orgasms.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2019-11-28",
  "scene_id": 45065,
  "tags": [
    "BDSM",
    "Big Tits",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "fake boobs",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "Pain",
    "Redhead",
    "shaved",
    "Straight",
    "Submission",
    "switch",
    "The Pope",
    "toned",
    "white",
    "Zapper"
  ],
  "title": "Lauren Phillips: Helpless Redhead in Brutal Bondage Made to Cum"
}