{
  "collections": [
    "Hogtied"
  ],
  "description": "Charlotte Sins is a sweet young slut who's wanted to shoot for Kink for a long time. But you know the old saying: be careful what you wish for, you may get it! Charlotte waits in solitude, kneeling with her legs spread, in what almost looks like a web of rope. She feels completely helpless as she awaits her captor's arrival. First a red ball gag is shoved into her mouth, then The Pope circles her, contemplating what to do first. To start off, this sexy slut is flogged, then nipple clamps are added. She seems playful, until she's blindfolded and the real intensity begins. Unable to see, Charlotte is now nervous with anticipation of what's to come. She's cropped all over her body, and she's rewarded with orgasms before she's taken to the next position. Charlotte is in a side suspension, with all of her holes fully exposed. Her body falls under a full-on assault from multiple implements that cause maximum suffering. Her body breaks out in a glistening sweat, but that doesn't stop The Pope, her sadistic handler. He brings in a massive didlo and fucks her pussy and mouth, completely using up her holes. In the final scene we have Charlotte on her back like a good little slut. The Pope enters and administers a grueling double flogger assault, before ripping more orgasms from her young pussy. Charlotte may be \"relatively new\" as she says in her opening interview, but by the end of the shoot, she's a veteran.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Charlotte Sins",
      "person_id": 62327
    }
  ],
  "release_date": "2019-12-05",
  "scene_id": 45063,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Nipple Clamps",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Charlotte Sins: Tall Blonde Beauty Makes Her Debut"
}