{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Joseline Kelly is a horny, verbal slut, who really wants to get fucked, but she's made to masturbate and tease us first! She removes just enough clothing to expose her perfect tits, and glorious pussy. She is given the magic wand and this horny little slut cannot wait to press it against herself. One orgasm, then another, and then another come pouring out of her, and she's just getting started. Once she's all warmed up, we sit her atop a box, and slide the first machine inside of her wet, hungry cunt. Joseline cannot believe that she is getting fucked so well, and she wants as much of this as possible. The machine begins to thrust in and out of her and the orgasms begin to happen and become more frequent. Next Joseline is on all fours and getting fucked doggy style. Her pussy is tight, and the more we fuck it, the tighter it gets from all of the orgasms. Her little pussy is being defiant, and doesn't want to cooperate, so she turns around and sucks all of her pussy juices off of the machine. We need to give her pussy a little \"break\", so instead of fucking her, we put her on the sybian. Her orgasms become so strong that she can barely form a full sentence, yet she continues. Her pussy has almost had enough, but she still wants more, so we set up one more scene so this slut can get all the orgasms she wants. The final scene has a cock mounted and Joseline has a vibe in her hand. She fucks herself while holding the vibe on her pussy, and we get some of the most powerful orgasms we have seen all day!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Joseline Kelly",
      "person_id": 58721
    }
  ],
  "release_date": "2019-12-18",
  "scene_id": 45066,
  "tags": [
    "Brunette",
    "Machine Dildo",
    "natural boobs",
    "slim",
    "Straight",
    "Sybian",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Joseline Kelly: Young Cum Slut Gets Fucked Every Way Possible"
}