{
  "collections": [
    "Hogtied"
  ],
  "description": "Katya Rodriguez has been with us on Fucking Machines before, but this time she's got a new handler in The Pope. She's very nervous, so she begins in a standing position, that quickly turns into a predicament position. She need to be comfortable so The Pope can gain her trust, but once he does, he instantly betrays her! He begins to punish her, and she presses her ass back into him, as if to signal that she is ready to suffer even more. Now she's ready, so her leg is pulled into the air and that spreads her legs wide and exposes her honey hole. She is craving his touch to ease the suffering, and once he touches her pussy she can't help but squirt everywhere. Next she is put in a predicament tie that has her leaning back with her legs spread wide, and her neck pulled back. Her nipples are put through grueling torment, and the pain alone makes this slut squirt again. It is now completely clear to her that The Pope's touch, good or bad, is enough to drain her pussy of it's juices. She wants to give him all of it, and he is going to take as much of it as he can. Next Katya finds herself face-down on the floor, totally helpless. The Pope turns her flesh a bright red from heavy impact-play before pouring hot wax all over her body. She is elated by what is happening to her, and he is willing to give this slut everything she can handle. To finish her off, he fucks her pussy so hard that he finally drains her of all of her pussy nectar.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Katya Rodriguez",
      "person_id": 61880
    }
  ],
  "release_date": "2019-11-07",
  "scene_id": 45062,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Hot Wax",
    "Humiliation",
    "Pain",
    "Rope Bondage",
    "Straight",
    "Submission",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Katya Rodriguez: Hogtied Newcomer Bound and Tormented in Bondage"
}