{
  "collections": [
    "Device Bondage"
  ],
  "description": "Juliette March is the ultimate pain slut, eager to start and then hungry for more. Because of this, she's always on The Pope's naughty list, and she's going to make sure she stays there. She comes in and makes a special request, just like she always does, and asks for the Vampire Trap. We've seen this before, but it's used sparingly because of how intense it is. Still, she wants it. We begin with the final touches being put on and we get to see Juliette wincing in agony from the trap even before the scene has officially started. The is is one of the most painful scenarios on Device Bondage, complete with minute adjustments that intensify the torment. Once it is adjusted to perfection, Juliette is pushed even further. She's flogged in the trap, exciting the pain and testing her ability to restrict her own movement. But because she's such a pain slut, the orgasms come fast and furious. Next we have her kneeling on the Throne of Suffering and held in place with steel shackles. This time it's her bush that The Pope goes for first, and as he is trying to slowly rip it out, Juliette has to suffer as her nipples are simultaneously slapped and pinched. He administers some breath control to make all things right with Juliette before applying nipple clamps, then rips the orgasms out of her pussy. Juliette is awash in pain and pleasure, which is exactly what he wants. She' finally exhausted by imposed orgasms. Finally, Juliette finds herself face-down with her ass in the air and her feet completely exposed. The Pope torments her feet with an array of implements, until she just can't take it anymore. Her ass is then spanked and her pussy is fucked as her day wraps up. The ultimate pain slut is both wrecked and satisfied, but it won't be long before she's desperate for more.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Juliette March",
      "person_id": 22072
    }
  ],
  "release_date": "2019-11-14",
  "scene_id": 45064,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "Brunette",
    "Bush",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "Petite",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "The Pope"
  ],
  "title": "Juliette March: Perfect Pain Slut Pushed to the Extreme"
}