{
  "collections": [
    "Men On Edge"
  ],
  "description": "The intensely sexy Adam Ramzi arrives for a photo shoot with Sebastian Keys and his assistant Lukas Tyler. But Adam's not quite the agreeable sort. In fact, he's got a bad attitude, one that Sebastian and Lukas think needs an adjustment. So as Adam is storing his precious guitar, the two guys plot to take him down and take advantage! They tackle him on their pristine, white set, string him up into a full suspension, and work his cock to the edge, tormenting him with repeated orgasm denial. After a quick take-down, Adam finds himself suspended on his side. Sebastian and Lukas cut him out of his clothes, fully exposing his round ass and hard cock. Lukas begins licking his nipples, driving him wild instantly, then moves on to that hard dick, sucking it and teasing it as Adam hangs there immobile. Sebastian spanks his butt, then slides a dick-on-a-stick into his tight hole. Adam can only squirm as his cock gets sucked and his ass gets fucked, right up to the moment when he's about to cum. They deny him that pleasure, then tickle him, sending him into a twisting, writhing fit. Before taking him out of the suspension, Sebastian licks and sucks his feet while Lukas resumes sucking that cock. They take him down and tie him to a chair, with a bit gag in his mouth and his arms bound behind his back. In this position they suck his cock, work it in a jack toy, apply nipple suction cups, and work the head of his dick with a vibrator attachment. Adam is led right up to orgasm again and again, but denied each time. Finally, he's allowed release, but only if he shoots his load on his precious guitar. Sebastian holds it in front of him while Lukas jerks Adam's dick until he cums all over his prized possession. And if that isn't humiliating enough, Adam is then made to lick his own load off the guitar.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Adam Ramzi",
      "person_id": 53722
    }
  ],
  "release_date": "2019-10-01",
  "scene_id": 45060,
  "tags": [
    "BDSM",
    "bit gag",
    "black hair",
    "Bondage",
    "Edging",
    "Feet",
    "foreskin",
    "Gag",
    "Gay",
    "Hairy",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Oral Sex",
    "Orgasm Denial",
    "Prostate Stimulation",
    "Rope Bondage",
    "Strokers",
    "Suspension",
    "switch",
    "Tattoo",
    "Tickling",
    "Uncircumcised",
    "unshaved",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Disgrace The Diva: Adam Ramzi Humiliated and Edged"
}