{
  "collections": [
    "Men On Edge"
  ],
  "description": "Alex Killian sits in his boxer briefs. He takes out his cock and starts stroking it. His breathing deepens and his toes curl as pleasure ripples through his body. Soon his cock is hard and leaking. Alex squeezes some precum from his cock and tastes it. Sebastian and Chance enter. Alex lies down as Sebastian ties him up. Meanwhile, Chance teases Alex's cock. Once Alex wrists and ankles are tied, Sebastian gags him. Alex watches as Chance swallows his cock whole, teasing it with his tongue. Chance brings out a masturbation sleeve and uses it over Alex's thick cock. Alex moans as his dick slides in and out of the sleeve. He's about to cum when Chance pulls away and both his captors begin tickling him! He struggles to evade their fingers but can't pull his feet away or shield his armpits. His sweaty armpits soon attract the attention of Chance, who buries his face in one, licking it and sucking on the hairs. Sebastian pushes Chance's mouth down on Alex's aching cock and brings Alex to the edge once more before pulling away. Next, Alex is tied and blindfolded. His captors spank his ass and play with his hole. Chance spreads his cheeks and Alex moans as Sebastian pushes a dildo attached to a fucksaw into his ass. Alex has no choice but to take the fucksaw as it stretches his ass open and begins fucking him vigorously. He begs to cum, trapped between the cock in his ass and Chance's warm sinful mouth. Soon the dildo is replaced by a clear butt plug and Alex cums all over himself. His reprieve is short lived as Sebastian hoists him into a full suspension and Alex gets tickled! His feet kick out in the air as he laughs uncontrollably.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alex Killian",
      "person_id": 62000
    }
  ],
  "release_date": "2019-10-15",
  "scene_id": 45061,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "buttplug",
    "Dildo",
    "Edging",
    "Feet",
    "fucksaw",
    "Gay",
    "Male Handler",
    "Male Sub",
    "masturbation",
    "Oral Sex",
    "pit worship",
    "Prostate Stimulation",
    "Rope Bondage",
    "slim",
    "Suspension",
    "Tickling",
    "Vibrator"
  ],
  "title": "Alex Killian: Tied and Edged"
}