{
  "collections": [
    "SW Nude"
  ],
  "description": "Erik Drda and Jura Marecek are paired in a submission wrestling match. They both look so good as they warm up, in just their underwear, before the match. The heavily tattooed Jura is bigger than Erik but that wont stop Erik from giving a good account of himself. After warming up they start the match and are quickly rolling all over the mats as they try to gain a good hold. Success comes Erik’s way as a neck hold gives him a submission. Then they remove their underwear before starting round two. Those naked bodies look so good as they roll around. Asses are parted and cocks flail as they grapple with each other before Erik prevails again. Straddling Jura Erik’s cock and balls rub against the muscled belly as he tries to gain the advantage. But Jura escapes and it is back to rolling all over. Jura then achieves his first submission with a great neck hold. He smiles a lot too, even when losing a round. The big cocks flail as the guys stretch and strain every sinew to get the advantage. Jura resorts to squeezing nuts and cock to win a round. That makes him smile even more. Erik will not be thwarted by such behaviour though and takes more rounds. They take a break to oil each other’s sweaty body. Then it is back onto the match, with Erik proving that size alone is not enough to win, by taking a magnificent victory. Then they settle down to wank. They quickly get their cocks are and wank each other as well. Then Jura delivers a massive cumshot, squirting all over the mats. Erik is not far behind, his creamy cum also shooting all over the place. Then it is off to the showers to clean up after a great match.",
  "directors": [],
  "models": [
    {
      "name": "Erik Drda",
      "person_id": 60773
    },
    {
      "name": "Jura Marecek",
      "person_id": 62218
    }
  ],
  "release_date": "2019-08-15",
  "scene_id": 45071,
  "tags": [
    "Athletic",
    "black hair",
    "erotic wrestling",
    "foreskin",
    "Gay",
    "jock",
    "masturbation",
    "Muscle",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "white",
    "Wrestling"
  ],
  "title": "Erik vs Jura - WRESTLING"
}