{
  "collections": [
    "Families Tied"
  ],
  "description": "Ashley Lane is a sexy blonde step-sister whore to step-brother Seth Gamble, but she's also stubborn and wants things her way. She refuses to help Seth sell their childhood home. Seth gives her time to think about it, but all Ashley actually wants is his cock back in her life. Ashley has never found another master as good as her step-brother when they used to play back in the day, and she's determined to keep the house as a ploy to hold their relationship intact. Seth's fiance Vanessa Sky demands that Seth convince Ashley that they need to sell while the market is hot. Ashley takes the opportunity to make an outright pass at Seth and refuses to sign away the house until he is her master again. Her unruly behavior awakens the sadistic sex monster in Seth and he takes Ashley down brutally. She is thrown on her knees, made to suck his cock, then has her own panties tied into her mouth while he shocks her with a zapper. Still refusing to sign, Ashley is tied into a painful semenawa shibari position, making her vulnerable to a heavy beating with flogger, hand, and canes. Once Ashley's ivory skin is red with welts, Seth draws her up into a full suspension and pounds her brat pussy, hoping that orgasm denial will win the war. He fucks her tight cunt until her eyes cross and then leaves her hanging from the ropes. Riled up from his rekindled dominance, Seth isn't taking any shit from Vanessa when she lays into him for still not having the papers signed. He corrects her bossy bullshit with a quick slap around and rough blow job, which only turns Vanessa on. She begs for more beatings and cock. Seth obliges, paddling her juicy thick ass hard, then cropping her wet pussy while she is in strict metal stocks. Seth takes her cunt, and then her asshole while she begs for each orgasm. When she steals one he rips off her nipple clamps and stuffs a hitachi deep in her cunt while fucking her in the ass to teach her a lesson. Seth gives Ashley a second chance to sign the papers, but she continues to run him around, and is rewarded with a heavy caning, pussy slapping, fucking, and eventually a tight zipper down her lithe body. Gagged and tied spread eagle she can only scream as Seth canes and threatens her. However, it's only when Vanessa makes a surprise appearance that Ashley actually begins to feel the burden of her refusal. Vanessa cuckolds the little bitch, taking Seth deep in her ass. She shows off for Ashley and rips off Ashley's zippers every time she cums on Seth's cock. Jealous and humiliated, Ashley agrees to sign if she can be their sex toy and have Seth's cock back in a filthy three-way.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Vanessa Sky",
      "person_id": 60690
    }
  ],
  "release_date": "2019-09-27",
  "scene_id": 45104,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blonde",
    "bottom",
    "brunet",
    "Brunette",
    "Caning",
    "Clothespins",
    "Cuckolding",
    "Curvy",
    "Double Penetration",
    "Electrical Play",
    "Family Roleplay",
    "Flogging",
    "Hitachi",
    "master",
    "Metal Bondage",
    "mixed",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Orgasm Denial",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "slim",
    "Spanking",
    "Squirting",
    "Stocks",
    "Straight",
    "Stud",
    "Suspension",
    "Threesome",
    "white",
    "Zapper",
    "Zipper"
  ],
  "title": "Family First: Cucked Slut Signs It Away for Her Step-Brother's Cock"
}