{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Ruckus and his gang of thieves have stolen Lily Lane's money. The gorgeous tattooed Lily Lane captures Ruckus, blindfolds and gags his mouth, strips him to his black underwear, and handcuffs him to a seat in the middle of a messy room. Lily asks Ruckus where her money is and he doesn't say a word. She beats his legs with a big wooden stick, hits him with a flogger, and repeatedly punches his chest and Ruckus still wont tell where he hid her money. She gets an idea, switches gears, and takes the blindfold off of Ruckus' eyes. She decides to use her sex appeal to get the information she wants out of him. She grinds her amazing ass on his dick, puts her big beautiful tits in his face, and asks again where her money is but he still wont budge. When these tactics don't seem to work, Lily gets so frustrated that she decides to try something different. She wants to fuck him in the ass with her big strap-on dildo. She has Ruckus bend over the desk to get fucked and she fucks his ass deep and hard with her girthy dildo. She gets so turned on while watching his ass get fucked that she sits her ass on his face and makes him lick her pussy. She teases his hard cock with her hands while she gets her pussy licked, grabs an Hitachi vibrator and cums hard. She grabs his cock and slides her pussy down on it and fucks him so good in cowgirl and reverse cowgirl that he begs to cum. After Lily cums on his cock, she fucks him fast and hard until he's close to cumming and then she gets off his cock quick, denying him the pleasure and spits in his face.",
  "directors": [],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2019-11-19",
  "scene_id": 45117,
  "tags": [
    "Athletic",
    "BDSM",
    "Big Tits",
    "Blindfold",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "CBT",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Hitachi",
    "Humiliation",
    "Latin",
    "Male Sub",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Snitch Fuck: Lily Lane Fucks the Information Out of Ruckus"
}