{
  "collections": [
    "Sweet FemDom"
  ],
  "description": "The villainess Charlotte Sartre hired mad scientist Fluffy to build her a sexy fembot programmed to seduce and castrate powerful men. He’s almost done, but she needs the femdom to castrate the Prime Minister of France tomorrow.\n\n“She better be done on time, or it’s your balls…” Charlotte threatens Fluffy while she grips his balls hard. She leaves. He immediately starts talking to the femdom(Bunny Colby) as if she’s his girlfriend. He creepily fondles her tits and ass, then remembers he needs a tool to proceed, so he leaves.\n\nCharlotte sneaks back in. She has a device in her hand that she paid Fluffy’s competitor to build her. It allows her to simply recode the robot with anything she wants.\n\nShe admires the fembot’s perfect body, then programs her to destroy her maker’s balls as soon as she sees him again. This way Charlotte won’t have to pay him.\n\nFluffy returns.\n\n“Identified Maker. Proceeding to destroy his balls.”\n\nThe fembot knees him in the balls. Charlotte laughs while she watches Fluffy get kneed and kicked in the balls over and over by his life’s work.\n\nWhile he”s on the ground in agony, Charlotte joins in and stomps his balls. She hold his legs open and tells the fembot to continue. Just when his balls are about to rupture for good, Charlotte straddles him and sweetly tells him that he can keep his balls a little longer if he agrees to become her servant. Of course, she’s going to continue to torment his balls the whole time. He has been demoted from the top robot scientist in the world to her sissy maid…\n\nTime has passed since Charlotte took ownership of the sexy fembot that Fluffy created. She has also taken full ownership of Fluffy. She makes him wear a skirt with fishnets and heels while he cleans her house.\n\nCharlotte is on her sofa, caressing the perfect breasts of her fembot. Her fembot has some AI and can talk. “When can I castrate another man?”\n\n“Soon…” Charlotte says. Fluffy walks in to report that he just finished cleaning the floors. Charlotte tells her sexy femdom, “Go ahead…”\n\nThe fembot walks directly at her maker, Fluffy, to do what he programmed her to do on other victims. She is programmed to destroy balls. She knees him hard in the nuts, and Charlotte laughs.\n\nFluffy begs her for mercy. She tells him his time has come and to take off his girly skirt and heels. After some hard kicks they grab his balls and take turns hitting them. He begs them to let him keep his balls. He even pleads that they go back to kicking him in the balls, just so he can keep them longer.\n\nCharlotte reveals in the fact that the proud scientist is begging her to kick him in the balls, so she does, gladly. They hurt him until he begs for them to castrate him just so it will stop.\n\nCharlotte got exactly what she wanted. Her Castra-bot did her job perfectly. “Oh, if you’re begging me to castrate you, I’m happy to. Let’s take you to the cutting room.”\n\nThey strut away, leading him out of the room by the balls while he whimpers.",
  "directors": [],
  "models": [
    {
      "name": "Bunny Colby",
      "person_id": 61167
    },
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Slave Fluffy",
      "person_id": 58760
    }
  ],
  "release_date": "2019-09-10",
  "scene_id": 45112,
  "tags": [
    "big dick",
    "Big Tits",
    "black hair",
    "Blonde",
    "bottom",
    "brunet",
    "CBT",
    "fake boobs",
    "Femdom",
    "Fishnets",
    "natural boobs",
    "Pain",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Tattoo",
    "Partner Studio",
    "toned",
    "top",
    "white"
  ],
  "title": "Charlotte and Her Castrabot"
}