{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The beautiful buxom Bella Rossi is testing out the durability of her new toy, Jessie Sparkles. She hears that he's tough, and wants to try him out for herself. Standing, tied up, with a spreader bar between his legs, Jessie drools with his tongue out because of the clothespin attached to it. His hair is tied to the ceiling and his face is wrapped in rope. With her strong arms she flogs him hard, but his moans of pleasure are not what Bella wants to hear. She wants to hear the sounds of pain. She gets out her single tale whip and goes back and forth with it, whipping his thighs, stomach, and chest. She punches his chest and stomach hard and Jessie's whole body buckles, sending him into an unexpected suspension. Next she pegs his ass with her strap-on and fucks him so good he begs to cum but she's not done with him in the slightest. After that, Bella smothers his face with her big beautiful ass and rides his tongue until she cums. She rewards Jessie for pleasuring her pussy and rides his cock. She teases and edges his cock with her pussy and he begs her to let him cum, but Bella will only lets him cum with a sounding rod buried deep in his urethra. Bella puts on rubber gloves and gets a shiny metal sounding rod out from her bag of tricks and shows it to Jessie. She lubes up the rod and slowly sinks its into Jessie's urethra. Once it's deep down in there, Bella strokes Jessie's cock and the sensation is so intense that Jessie shoots his load with the rod still in it. The cum then shoots the rod out and Bella just keeps stroking and rubbing the head of his cock until its too much and the pleasure turns into pain.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Jessie Sparkles",
      "person_id": 27566
    }
  ],
  "release_date": "2019-12-03",
  "scene_id": 45118,
  "tags": [
    "Athletic",
    "BDSM",
    "Big Tits",
    "Bondage",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "gloves",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slave",
    "Sounding",
    "Straight",
    "Suspension",
    "switch",
    "Tattoo",
    "versatile",
    "Whipping",
    "white"
  ],
  "title": "Bella Rossi Uses & Abuses Jessie Sparkles"
}