{
  "collections": [
    "Man Up Films"
  ],
  "description": "Buck Wright is trying to earn his first merit badge by selling chocolate door to door. D Archlyte answers the door and immediately drags the young Boy Scout inside…\n\n“Did you fucking eat half the chocolate…?!”\n\nD knows exactly what to do. This youth just needs some direction… He gropes the Boy Scout a little, then throws him on the sofa and starts to tickle the fuck out of him.\n\nAfter driving the vulnerable Buck crazy with Tickles, D whispers to him, “Have you earned your Breeding Badge yet…?”\n\nD Arclyte takes it upon himself to help the young Buck Wright earn his Breeding Badge. First, he tells Buck to get on his knees and suck his cock. Buck says,” My Scout Master says I’m really good at this…”\n\nD just ssshhh’s him with his cock in his mouth. Then he bends Buck over and eats his big perfect chocolate ass and slides his cock inside him.\n\nBuck moans and drips pre-cum out of his hard cock the whole time. Eventually, D blows his load inside him.\n\n“Mister… I can feel you throbbing… did you…?”\n\n“Congratulations. You just earned your Breeding Badge.”\n\nD kicks him out of his house.",
  "directors": [],
  "models": [
    {
      "name": "Buck Wright",
      "person_id": 61329
    },
    {
      "name": "D. Arclyte",
      "person_id": 59025
    }
  ],
  "release_date": "2019-09-10",
  "scene_id": 45113,
  "tags": [
    "Athletic",
    "Bareback",
    "big dick",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Cop",
    "Couple",
    "Creampie",
    "Doctor",
    "Domination",
    "Edging",
    "Feet",
    "Fetish",
    "foot fetish",
    "Foot Worship",
    "Gay",
    "Handjob",
    "Humiliation",
    "Interracial",
    "master",
    "Muscle",
    "Muscle Worship",
    "muscular",
    "Oral Sex",
    "Rimming",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "the chair",
    "Partner Studio",
    "Tickling",
    "top",
    "white"
  ],
  "title": "Boy Scout Earns His Breeding Badge RAW"
}