{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Today we have two pints sized fighters on the mats. Jay West at 125lbs and Gabbi Paltrova at 115lbs.\nGabriella trains regularly with weights. She was a swimmer and gymnast in school and used to be a\ndancer. Gabi has been into sports her entire life. She’s a natural athlete with a big round perfect ass and\nperky natural tits Her upper body strength is incredible. Jay West is coming in with better conditioning\nthan his past matches. He is utterly ashamed of his past losses, and he wants to get revenge today. This\nmatch is close in size and skill… Jay West is really determined to prove himself today after all his loses.\nHe knows that if he doesn’t win a match soon, he will be suspended until 2019. That means his lively\nhood AND his manhood are being threatened here. He really needs to win this match. If Gabriella loses,\nshe’s going to get her fat ass stretched out with a former losers cocks…The stakes are high! These two\nfight dirty, they rip at each other’s crotches in brutal fashion. One wrestler is able to get huge advantages\nand get on top for most of the match. They pin each other and grope anything they can find. After three\nrounds, there is a clear winner. The winner is gleaming with pride and makes the loser grovel. The loser must\nlick dirty toes and get fucked. The loser receives more crotch attacks and gets a nice hot load in their loser\nface at the end of the prize round. The Winner picks the loser up and carries the loser home to rub in\nmore humiliation.",
  "directors": [],
  "models": [
    {
      "name": "Gabriella Paltrova",
      "person_id": 41906
    },
    {
      "name": "Jay West",
      "person_id": 53166
    }
  ],
  "release_date": "2019-09-03",
  "scene_id": 45123,
  "tags": [
    "black hair",
    "Blowjob",
    "bottom",
    "erotic wrestling",
    "Facesitting",
    "Hood",
    "Humiliation",
    "mixed",
    "natural boobs",
    "Petite",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Partner Studio",
    "top",
    "Vaginal Penetration",
    "Weights",
    "white",
    "Wrestling"
  ],
  "title": "Gabriella Paltrova Gets Dirty in Competitive Mixed Wrestling"
}