{
  "collections": [
    "My Dirtiest Fantasy"
  ],
  "description": "Not content with having been treated like a complete piss-bitch by a trio of very horny studs, Caspar Ellis is bundled onto his stomach - again with his arse on full display so that his captors can do pretty much anything they want to him. To be fair, however, that’s exactly what this young, floppy-haired blond wants - and it’s with a satisfied groan that he realizes that the studs are now going to stretch his fuck-hole to breaking point. Literally! Of course, even the biggest cock would get lost in that well-worked pucker; but these horned-up are clearly well experienced when it comes to pushing a lad to the limits, and before you know it they’ve got a bucket full of lube and it’s all hands to the deck. Or in this case, all hands to the arse-hole! Suffice it to say they don’t seem to give a fuck as to how much it might be stinging poor Caspar - but then that’s all part of the fun, as they explore every inch of his gaping guts. Not content with that, they also give his rump a bit of a whipping - just in case the lad isn’t made to suffer enough already. What his parents back in Stockholm would think if they could see their darling like this is anyone’s guess, but vanilla is definitely ain’t!",
  "directors": [],
  "models": [
    {
      "name": "Alex Roman",
      "person_id": 61045
    },
    {
      "name": "Alexis Clark",
      "person_id": 62065
    },
    {
      "name": "Casper Ellis",
      "person_id": 60731
    },
    {
      "name": "Dominique Kenique",
      "person_id": 62064
    }
  ],
  "release_date": "2019-09-04",
  "scene_id": 45125,
  "tags": [
    "Anal",
    "Anal Stretching",
    "Bareback",
    "black hair",
    "blond",
    "brunet",
    "Dildo",
    "Fetish",
    "foreskin",
    "Gangbang",
    "Gaping",
    "Gay",
    "Mask",
    "Partner Studio",
    "Twink",
    "Whipping",
    "white"
  ],
  "title": "Twink Gang-Banged and Abused RAW"
}