{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Lyra Lockhart is trying to teach an anger management course to a bunch of loud, mischievous men who aren’t listening to a word she’s saying. She rings her bell to get their attention and they just take the bell from her. She stands up and tells them that they need some self control and so they slowly approach her and start grabbing at her body. She gives up and gives in. They grab at her floral dress and pull away the fabric, exposing her perfect pale perky tits. They squeeze and suck her nipples, get her naked, and take her to her knees. Lyra is tied up in rope bondage with her hands behind her back. The guys pull out their big hard cocks and one by one they take turns fucking her mouth. They stand Lyra up and play with her pussy while she sucks their cocks. She tells them that she’s ready to get fucked and so they tie her up in a different position on her back with her legs spread, with her arms tied to her legs. Student Donny Sins slides his big dick into her pussy and fucks her deep while the others grab and grope at her body and use her mouth to pleasure their cocks. After they’ve all had a turn fucking the teacher’s pussy they switch to fucking her ass and she cums hard on their cocks as she gets her ass fucked deep and hard. After that, they put her legs to one side and fuck her her airtight by double penetrating her pussy and ass while she sucks cock. She gets on top of Eddie Jaye’s big dick cowgirl style and she bends way over to get another double-stuffing of dick as the other guys take turns in her ass. In the finale when Lyra’s face is finally covered in cum, the guys seem more relaxed and less stressed making the class a success.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Jake Adams",
      "person_id": 60459
    },
    {
      "name": "Lyra Lockhart",
      "person_id": 62288
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    },
    {
      "name": "Rod Jackson",
      "person_id": 62024
    }
  ],
  "release_date": "2019-10-16",
  "scene_id": 45128,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "mixed",
    "muscular",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "switch",
    "Teacher",
    "top",
    "white"
  ],
  "title": "Anger Management: Lyra Lockhart Gets Gangbanged by Her Students"
}