{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "After a weekend full of cock, Christy Love shows up to a local peer sex addiction group. She tells the guys about getting gang banged by strangers and soon they're stripping her clothes, revealing her perky nipples and tight toned body. Christy giggles as they grab her throat and pull her panties down. Soon she's on her knees with a hard cock in her mouth. The guys surround her, waggling their dicks all around her. Christy eagerly takes cock after cock in her mouth. Then her peers tie her up with her hands behind her back for more face fucking. Drool leaks out from her lips as she deep throats their rock hard cocks. Next, they tie her down over a bench. Christy can barely move but that doesn't stop her from sucking and jerking every cock she can reach. She moans as the five strangers start fucking her pussy. They take turns flogging her, spanking her, and fucking her tight cunt. Christy loves the attention and cums hard, squirting all over. Next, they fuck Christy's ass before double penetrating her ass and pussy at the same time. Christy moans as they take turns double stuffing her. She can't keep the smile off her face as the strangers use her all holes. She gets spit on, slapped, and man-handled as these guys stretch out her holes to the max. She squirts all over them as she cums hard from getting dicked down. They make her cum over and over again before finally blowing their loads all over her face. Christy takes load after load on her knees until she's covered in cum and then she cums again. She runs her hand through the sticky fluids all over her body and brings it to her mouth, relishing the taste of a good day.",
  "directors": [],
  "models": [
    {
      "name": "Christy Love",
      "person_id": 61580
    },
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2019-10-02",
  "scene_id": 45129,
  "tags": [
    "Anal",
    "Asian",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "drool",
    "Flogging",
    "foreskin",
    "Gangbang",
    "MILF",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "Spanking",
    "spit",
    "Squirting",
    "Straight",
    "Stud",
    "toned",
    "top",
    "white"
  ],
  "title": "Christy Love Attends Sex Addiction Group and Gets Stuffed!"
}