{
  "collections": [
    "Everything Butt"
  ],
  "description": "Bratty Kate Kennedy in her high skirt and black knee length socks is stuck after school again. Full of excuses she is just not learning her lesson. Luckily hot milf busty blonde London River is a proper educator and knows how to get this young adult in line. Or so she thinks. Kate pulls out a hood and abducts her know it all professor. She takes her to an abandoned dirty warehouse and handcuffs her on a dirty chair. London insists that Kate is going to be in soo much trouble for this, but Kate knows a secret. London River is a butt slut! She loves it in the ass and goes home every night after grading papers and gets rammed. Kate has a table full of toys to stretch out London's hole even bigger. Starting with the glass dildo, London eats it right up. Gaping for more, Kate brings out a huge butt plug and metal toys. London's ass is happy and she begs for more as she cums on the vibrator. It's time for London to get fucked. Kate straps on the biggest dildo she has and begins to gape fuck London in her asshole. This hard anal deep fucking gets London screaming. London needs more! This MILF is begging for a fisting. Kate gets her whole hand up London's ass and starts punch fisting her teacher. London begs for her to punch fist faster and faster, harder and harder until she explodes with orgasms. London grabs Kate and flips her over, it's now time for Kate's tight little pink asshole to get stretched out. Starting with her hands London gets all her fingers in Kate and then bangs away at her asshole letting her in. Next is the slink that goes all the way in Kate. Her eyes bulge wide open as that toy penetrates her to orgasm.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Kate Kennedy",
      "person_id": 61558
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2019-10-04",
  "scene_id": 45131,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Fisting",
    "Gaping",
    "Hood",
    "Lesbian",
    "LezDom",
    "MILF",
    "natural boobs",
    "shaved",
    "slink",
    "Straight",
    "Strap On",
    "Teacher",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "After School Anal: Bratty Kate Kennedy Fists Hot MILF London River"
}