{
  "collections": [
    "Families Tied"
  ],
  "description": "Ella Nova is pacing nervously before her step-mother Cherie DeVille arrives to meet her new fiance Derrick Pierce. Cherie has typically been very possessive of Ella, right down to Ella's slutty cunt. Derrick has no idea that his future mother-in-law is part owner of Ella's ass, and tries to reassure his blushing bride-to-be that she has nothing to worry about, they will all get along fine, as long as Cherie can respect him as the man of the house. To underline his point, he puts submissive Ella through her paces with a sexy spanking, pussy clamps, deep throating on her knees, and a passionate fuck in the living room. Cherie arrives an hour early and catches the excited couple in the act. She makes quick work of insulting their home decor, the flower arrangement, their restaurant choice, and the engagement ring. Once Derrick has left the house, she really digs into the meat of the issue, which is that Ella has been giving up her pussy before the ceremony. Cherie flips her little step-slut over and gives her a strict over-the-knee spanking, followed by a massive anal dick-down in tight leather bondage. Ella drools and moans around her favorite ball-gag while Mommy stuffs a huge dildo deep in her ass and paddles it a scarlet red. Derrick is furious when he comes home to find Cherie balls-deep in his fiance. Pulling Cherie's dick out of Ella, he puts her on her knees and has Ella watch as her dominering lesbian Mommy sucks his cock. Flogging and zapping Cherie's tits to keep her on task, Derrick eventually finds he doesn't have to enforce Cherie's submission anymore, as she is turned on and can't wait to get fucked and humiliated. Derrick grabs Cherie by the hair, pushing her face in her daughter's snatch and rails her cunt from behind. She begs to cum, but first Derrick makes her admit that he is in charge. Tied spread-eagle, Cherie has one more surprise, which is her son-in-laws cock in her ass. Cherie yells around her ball gag as Derrick slides his cock between both her holes and has Ella rip off her nipple clamps. Cherie cums heavily from the degrading anal fuck, despite herself, and once untied makes the rest of the night about training Ella in how to properly serve a cock with both her ass and her mouth. Ella repays in kind, stuffing four fingers into Cherie to stroke Derrick's cock in her ass.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Ella Nova",
      "person_id": 51866
    }
  ],
  "release_date": "2019-10-11",
  "scene_id": 45132,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "Blonde",
    "Bondage",
    "bottom",
    "Couple",
    "Dildo",
    "fake boobs",
    "Family Roleplay",
    "Flogging",
    "Gag",
    "Leather",
    "Lesbian",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "shaved",
    "Spanking",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Mommy's Girl: Anal Slut Didn't Save Enough Pussy For Step-Mommy"
}