{
  "collections": [
    "TS Seduction"
  ],
  "description": "Probation Officer Roxxie Moth knows how to deal with negligent behavior of her charges and today one Tony Orlando is in for some strict reeducation. Tony's been breaking curfew, late to check in, and is still struggling to find a job. If he wants to stay out of jail, Tony's going to need to learn some discipline and Ms. Moth is just the person to keep him in line. She makes him get on his knees and spits on his face. She tells him she's going to need a drug test. Tony hesitates but doesn't want to lose what freedom he has. He obliges, hoping this will satisfy Ms. Moth, but she isn't done yet. She rips Tony's tank and places clothes pins from his nipples to his hips. Tony moans in pain as she plays with them, each movement tugging on his sensitive skin. She then commands him to take off her stockings. Tony removes them and can't help himself from smelling her feet. Ms. Moth shoves her feet into his mouth and Tony lavishes them with attention. Next, she puts him over her knee and delivers a swift spanking with her bare hands. Tony's ass reddens nicely and soon Ms. Moth brings out a leather paddle to further Tony's disciplinary spanking. Now that Tony knows his place, Roxxie commands him to suck her cock. And if there's one thing one Tony is good at, it's sucking dick. He swallows every inch, choking as he deep throats her cock. Then he buries his face into her ass and laps at her asshole with his greedy tongue. Finally, Ms. Moth bends him over and plows his tight ass. Tony moans as Ms. Moth fucks him hard and deep. She flips him onto his back and continues fucking her new slut. Tony cums hard as Roxxie fucks him, but Roxxie isn't about to stop just because Tony came. She drives into him harder, faster, and deeper than before until she's had her fill and blows her load all over his face.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Roxxie Moth",
      "person_id": 62272
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2019-10-29",
  "scene_id": 45136,
  "tags": [
    "Anal",
    "Blowjob",
    "brunet",
    "Choking",
    "Cock Worship",
    "Discipline",
    "Feet",
    "Leather",
    "Paddle",
    "Pain",
    "Piss Play",
    "Role Play",
    "shaved",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "TS Fucks Male",
    "versatile",
    "white"
  ],
  "title": "The Reeducation of Tony Orlando: Roxxie Moth Reins in Wayward Parolee"
}