{
  "collections": [
    "Everything Butt"
  ],
  "description": "Oh no it's that time again! Rent is late. The young and gorgeous kink newcomer Paige Owens is freaking out. She doesn't want to lose her perfect apartment, but she is late on rent, again! Her roommate Penny Pax is going to freak! She desperately begs Penny for an extension on rent, again. But, Penny isn't having it this time. She offers Paige the traditional everything butt alternative payment method. Her ASS! Reluctantly Paige delivers. She isn't sure she can take it all, but Penny knows how to stretch out every inch of payment. Starting with a metal anal hook, Penny gets her new play toy on leash. With Paige's ass in the air and under control, she makes Paige worship her asshole. Paige delivers a sloppy wet rimjob on Penny. With the vibrator out, Penny's body shakes with orgasm. Delicious, but this is just the start. Flipping Paige over, Penny brings out the huge dick on a stick and gets it ramming right up Paige's tight asshole. Paige is shocked at how much she can take, and she is even more shocked that she wants more! Her ass gapes for Penny to stretch it out further. Next up is the giant strap on cock. Penny first gets it wet with her deep throat skills before it gets her ass rocking. Deep pounding anal gets the girls shaking with orgasm. Finally both women take turns fisting each other's hungry holes and then Paige takes a Slink all the way up her ass!",
  "directors": [],
  "models": [
    {
      "name": "Paige Owens",
      "person_id": 62346
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2019-10-18",
  "scene_id": 45130,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Tits",
    "Blonde",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Fisting",
    "Gaping",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Slapping",
    "slink",
    "Straight",
    "Strap On",
    "switch",
    "Vibrator",
    "white"
  ],
  "title": "Rent's Late: Newcomer Paige Owens Gives Up Ass to Penny Pax for Rent"
}