{
  "collections": [
    "TS Seduction"
  ],
  "description": "Kayleigh Coxx and Mike Panic are two toys who have come to life at the strike of midnight. Kayleigh opens her eyes to the chimes of a cuckoo clock. She leans over and wakes Mike up and tells him that it's time to play. Mike pulls down Kayleigh's sexy negligee, exposing her big beautiful tits. He gets to work sucking on her nipples and squeezing her breasts. She tells him to suck her cock and Mike doesn't waste a second getting his lips around it. She grabs his head and makes him take her cock all the way down his throat. She tells him to take off his shirt and flex his muscles for her. Satisfied with her muscle show, Kayleigh tells Mike to get back on his knees and continue sucking her cock. Mike licks and sucks his way from her cock down to her feet. He removes her pretty shoes and licks and sucks her toes making her dick even harder. She tells him to get on the couch, pull down his pants, and bend over. She spanks his ass and slides her hard cock deep inside it and begins pounding. After a thorough fucking, Kayleigh orders Mike to clean his ass off of her dick with his mouth. He sucks his own juices off her cock and then lies on his back and spreads his legs. Kayleigh slides her hard cock once again inside Mike's asshole and fucks him hard. She fucks him so good that Mike cums all over himself with her cock buried in his ass, pounding away. She gets him to his knees and fucks his face one last time and blows a hot, fat load in his mouth. The clock chimes strike suddenly. and now naked and covered in cum, the toys have returned to their stiff and inanimate state.",
  "directors": [],
  "models": [
    {
      "name": "Kayleigh Coxx",
      "person_id": 61277
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2019-12-10",
  "scene_id": 45143,
  "tags": [
    "Anal",
    "Athletic",
    "Blonde",
    "Blowjob",
    "bottom",
    "brunet",
    "Cock Worship",
    "fake boobs",
    "Feet",
    "Kinky",
    "Muscle",
    "Role Play",
    "shaped",
    "Straight",
    "Tattoo",
    "toned",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Time To Play: Kayleigh Coxx Brings Mike Panic to Life For Kinky Fun"
}