{
  "collections": [
    "TS Seduction"
  ],
  "description": "The beautiful Korra Del Rio is on a date with Ruckus. Sparks fly and the chemistry between them seems to be in perfect harmony. Ruckus suggests that they get out of there and head to his place. He tells Korra that he's going to blow her mind and Korra is very excited by the idea. They arrive at Ruckus' apartment, and the place is a mess. Korra while at first reluctant to sit beside him on his dirty bare mattress, she thinks, \"Fuck-it\" and gets naked anyway. Ruckus fails to deliver sexually anything that he promised earlier, rolls over, and passes out. Unfulfilled, Korra falls asleep and slips into a dream where she finds her self on all fours, bound and gagged in a dark dungeon. Ruckus enters the dungeon, confident and commanding. First he crops her bare ass and spanks it with his gloved hands. He sinks his tongue deep in her ass and licks it while he strokes her cock. He introduces her to his leather flogger and begins whipping her ass until it turns pink. After that, he removes Korra's ball-gag from her mouth to make room for his cock. She sucks his cock all the way down her throat making Ruckus's dick rock hard, covered in spit. In the next scene, Ruckus has Korra standing, wearing only a leather garter and black thigh-high stockings, chained to a Saint Andrew's cross. He strokes her cock until its rock hard, puts clothespins on her nipples, and gets to his knees and sucks her cock. He lets her down and with her ass in the air, Ruckus sinks his cock into Korra's pretty little asshole and fucks it deep and hard. He turns Korra over, spreads her legs, and continues fucking her ass until he makes her cum.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2019-10-22",
  "scene_id": 45141,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Clothespins",
    "Cock Worship",
    "dungeon",
    "foreskin",
    "Gag",
    "Kinky",
    "Leather",
    "Male Fucks TS",
    "natural boobs",
    "Role Play",
    "shaped",
    "slim",
    "spit",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "TS",
    "unshaved",
    "versatile",
    "Whipping",
    "white"
  ],
  "title": "In Her Dreams: Korra Del Rio Fantasizes of Being Dominated by Ruckus"
}