{
  "collections": [
    "TS Seduction"
  ],
  "description": "When goody-two shoes Natalie Mars rats out her classmates to Headmaster Dale Savage, she expects to be rewarded. Little does she know, Dale doesn't take too kindly to tattletales telling him how to run his academy. He bends Natalie over the desk, pulls down her white panties and spanks her cute little ass with a wooden ruler and with his big hands until it's rosy red. Natalie squirms as Dale's strokes get harder and harder. After her spanking, Dale inspects her cock and slowly unbuttons her shirt, revealing her perky pink nipples. He's been waiting the whole year to get his hands on these. Natalie moans as he feels her up and squeezes her tits. He tells her to touch his cock before making Natalie kneel before him so he can rub his cock all over her face. Next, Natalie is naked, gagged and bound with a device crushing her balls. Dale puts nipple suckers on her nipples and adjusts them so Natalie's nipples get big and puffy. Natalie moans as her Headmaster has his perverted way with her. He puts clothespins along her body and uses a leather slapper on her sensitive bits. As her cock grows, Dale teases her and tells her it's okay because he's excited too. He strips, revealing his hard cock, and rubs it on her body. Finally, he frees Natalie and tells her to get her hole ready for him. He moans as he sinks into her tight ass and enjoys the sight of young Natalie beneath him. Having her Headmaster's hard cock in her ass does turn Natalie on and soon she's begging him to fuck her. Dale pounds her tight hole and soon cums all over her pretty tattletale face.",
  "directors": [],
  "models": [
    {
      "name": "Dale Savage",
      "person_id": 62015
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2020-03-03",
  "scene_id": 45142,
  "tags": [
    "Anal",
    "Blowjob",
    "Brunette",
    "Clothespins",
    "Cock Worship",
    "Leather",
    "Male Fucks TS",
    "natural boobs",
    "Role Play",
    "slapper",
    "slim",
    "Spanking",
    "Straight",
    "TS",
    "white"
  ],
  "title": "Schoolgirl Snitch: Natalie Mars Punished and Fucked by Headmaster"
}