{
  "collections": [
    "CFNMEU"
  ],
  "description": "Viktor Adam visits the doctor's office. This hot straight guy is in for a check-up and the sexy doctor asks him a few questions to start things off. Then she begins her examination, having Viktor remove his tee-shirt, so we see his sexy chest. Then he stands and removes his pants to stand in just his tight underwear. The doctor feels his back as Viktor holds his hands behind his head. She strokes his torso too and up to his chest. Viktor bends over fully as the doctor continues to exam him. She tells him to remove the underwear too, so Viktor is standing naked and leaning on the table.\nThen, with his cock seeming to grow, he has to kneel on the table for a prostate exam. The doctor lubes his ass and slides a finger inside as Viktor moans. The finger goes all the way into that tight ass, but the doctor needs to check it out further, so she keeps probing the hot hole. Then Viktor stands, and his cock is rock hard. The doctor has to feel around the groin as that dick seems to get even harder. She feels the balls that are tight against the shaft. Viktor's cock is so hard as she rubs the balls that she can't resist feeling it too. She takes some oil and begins wanking the big, fat, cock. Then she moves Viktor to the exam chair, with his legs in the stirrups. With his tight hole on display, she fingers it again as she wanks his cock. The hole loosens enough for her to slide a vibrator into it as she continues wanking Viktor's throbbing dick. Another toy is then pushed into that hot ass, fucking it deep as his rock hard cock is wanked. The hole is stretched wide as Viktor's face shows how much he is feeling it. That dildo goes all the way in and then Viktor is turned over, onto his knees, for another, bigger dildo to work his ass. His ass gets opened up good, and then the doctor fucks it with her strapon. He takes it so good and he gets another toy deep in that ass as he lays on the table. Then the strapon works his ass some more as Viktor wanks himself. Then he lays back as the doctor wanks his big dick until it releases a thick, squirting, cumshot. The hot cream lands on his sexy body to complete his check-up.",
  "directors": [],
  "models": [
    {
      "name": "Dominantni Sestra",
      "person_id": 62032
    },
    {
      "name": "Viktor Adam",
      "person_id": 62304
    }
  ],
  "release_date": "2019-09-11",
  "scene_id": 45165,
  "tags": [
    "Anal",
    "Anal Fingering",
    "big dick",
    "CFNM",
    "Dildo",
    "Doctor",
    "Handjob",
    "Male Sub",
    "Medical Fetish",
    "Pegging",
    "Squirting",
    "Straight",
    "Strap On",
    "thirdparty",
    "Vibrator"
  ],
  "title": "Viktor Adam's Doctor Visit"
}