{
  "collections": [
    "Hogtied"
  ],
  "description": "Young and sexy pain slut, Avi Love, finds herself in a traditional hogtie atop a steel cage. The Pope enters and begins to enjoy her body, inch by inch, to decide which part of her flesh he wants to torment first, as she lies there, helpless to resist him. Her feet grab his attention, and he wastes no time preparing her sensitive soles for immediate suffering. Rubber bands are placed around her feet, and the torment begins with non stop snaps to her soles. The crop is introduced along with other implements to ensure maximum pain. Avi is made to join in on her own withering agony as she holds the bands and waits for The Pope to instruct her as to when to release them. At the same time, he finger bangs her pussy, giving her pleasure while teasing her with impending pain. Next, Avi is put in an inverted hip suspension with her hands tied to her ankles. Her nipples are pulled and tugged on as she is swung around the dungeon. Her body is then flogged and turned a beautiful red, before her pussy is fucked and vibed for optimal orgasms. In the final scene, Avi finds herself on her back, eager for whatever comes, like the slut that she is, with her feet exposed and at the perfect location for some bastinado. The Pope pulls out all the stops as Avi’s subjected to nonstop foot torment. After more suffering from brutal pain, she’s made to cum again until she has no more to give.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Avi Love",
      "person_id": 60196
    }
  ],
  "release_date": "2019-11-21",
  "scene_id": 45178,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "bottom",
    "Brunette",
    "Cage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Feet",
    "Fingering",
    "Foot Torment",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Avi Love: Young, Sexy Rope Slut Tormented and Made to Cum in Bondage"
}