{
  "collections": [
    "Device Bondage"
  ],
  "description": "Cadence Lux has worked with The Pope enough that she fully trusts his ability and judgment, to treat her right, and perfectly wrong. Today she fully submits to him in a nonstop, no-holds-barred, grueling hour of suffering. The camera rolls and it does not cut or hold until the suffering is over. You get to see every little nuance, every activity, every orgasm, and every salty tear Cadence has to offer us. She's locked into place with four steel shackles that are already placed on the floor. Cadence soon realizes that she is in the most vulnerable position that anyone could possibly be in. A spread eagle leaves her wide open, with all of her body exposed. She cannot defend herself in any way, but this is what she asked for. The Pope begins to tenderize her flesh with floggers and a cat-o-nine tails, then begins a brutal nipple tormenting session with wooden spikes and suction. Fear sets in for Cadence, but she doesn't tap, not yet anyway. The suffering escalates in severity as Cadence settles in, knowing that this is only the beginning. Orgasms are administered to give her mild breaks, but not so much that she eases up. Even during the orgasms she is subjected to The Pope's sadism, which shows her there is no escaping what she has signed up for. We get some bastinado before The Pope decides that he is going to change the tie mid-scene, so that he can get to her back. Once he has finished tormenting her back side, she is laid back down, but this time her left hand is locked in a steel trap. The challenge for Cadence now isn't just not tapping, as the torment becomes more and more brutal. Her milky white skin is littered with bright red marks and bruises, but it's not over yet. The water boarding hasn't even started...",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    }
  ],
  "release_date": "2020-01-23",
  "scene_id": 45179,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Caning",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "other hair color",
    "Sadism",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "The Pope",
    "toned",
    "Vibrator",
    "Water Boarding",
    "white"
  ],
  "title": "Cadence Lux: The Depths of Hell"
}