{
  "collections": [
    "Hogtied"
  ],
  "description": "Penny Pax has found herself in a precarious situation. She's in sexy lingerie, tied to a wooden column, unable to escape. She is the epitome of a damsel in distress, and with those big blues eyes, she definitely sells the part. The Pope enters and begins to inspect her body, slowly rubbing his hand across her exposed flesh, making sure to caress her big tits and sweet, slutty pussy. He slowly rips her clothes away, then shoves her panties in her mouth. The pain first comes by way of the flogger. After some impact play, her pussy is devastated with non stop orgasms. The nest scene begins and Penny is flying in a side suspension with one leg high in the air. The Pope enters with his crop and goes to town on her pussy and tits, before moving to her sensitive feet. This slut is so turned on by what is happening that her mouth opens as soon as she sees the cock. The Pope fucks Penny's mouth until the dildo is soaked with her spit, and then he moves to her pussy. The orgasms pour out of her and once she has enough of the cock, he finger fucks her into more orgasms. In the final scene Penny is on a table and sprawled out like a meal at dinner time. She is completely helpless and unable to stop what is about to happen to her. Penny is subjected to more flogging before The Pope initiates the most powerful onslaught of imposed orgasms she has ever experienced. She thrashes around trying to escape, but to no avail, as the orgasms keep coming, again, and again, and again.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2020-01-15",
  "scene_id": 45177,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Lingerie",
    "natural boobs",
    "Pain",
    "Redhead",
    "Rope Bondage",
    "spit",
    "Straight",
    "Submission",
    "Suspension",
    "switch",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Penny Pax: Blue-Eyed Redhead Damsel Tormented in Strict Bondage"
}