{
  "collections": [
    "Families Tied"
  ],
  "description": "Sexy blonde Kate Kennedy is head-over-heels for her new dominant boyfriend Rob Piper. She can’t wait to sneak her hot sadistic sexual top into her step-mothers vacation home for some nasty BDSM sex. Rob is quite taken with her sweet gesture and jumps at the opportunity to bring their sexual games to the next level, tying her in a strenuous shibari rope position. With her arms and legs spread eagle in a grueling squat, Kate begs for orgasms and cock. But first, she must suffer through a barrage of cropping and tight clamps on her tender labia and perky tits. Slapped, spanked, and still begging, she is eventually rewarded with a screaming, squirting orgasm, followed by an intense throat fucking with Rob’s huge cock. She drools and chokes as he has his way with her mouth, then gags her and moves to her pussy. With her milky ass spanked bright red, she can do nothing but strain against the ropes to get more of his cock inside of her. Rob grants her an orgasm, but then slides his hard dick into her tight asshole. She tells him it belongs to him and is rewarded with a fast and hard anal pounding. When they’re finished, Kate hears her step-mother come into the house unexpectedly. Dee wasn’t expecting Kate either, and was getting ready for an extra-marital fuck-date to come over. Dee is even more surprised to meet Rob, for he was once her fuck-piece on the side, before she ghosted on him years prior. Rob and Dee try to play it cool in front of Kate, but as soon as she leaves the house for a jog Dee confronts Rob and demands he break up with Kate. Rob is still pissed off after being ghosted by Dee, so he decides to take her down in the middle of her own living room. Cuffed and stripped, Dee gives in immediately. Her slutty, submissive side emerges and she begs him to punish her. She gets a metal ass hook latched to her cuffs, and receives a strict caning and spanking, leading to an intense revenge fuck on the floor and a drooling make-up blow job. Just as Dee is gobbling down his cock, Kate comes back and walks in on them. She’s furious. But Rob isn’t having any of her shit, so he also puts Kate on her knees and has Dee explain herself. Kate is disgusted with Dee, but she’s under the spell of Rob’s huge cock and dominant hand. She begrudgingly shares his dick with her mother, eventually licking Rob’s cock clean right out of Dee’s asshole. Dee screams like a craven whore with Rob taking her in an anal doggy fuck-fest. Rob ties up both women, with Kate in a tight arabesque pose with her face tied into Dee’s pussy, which is exposed in a pretzel tie. Rob makes them both swear they belong to him as he pounds Kate’s trapped pussy. When Dee can no longer hold her orgasm she squirts all over her daughter’s face. This is just the beginning of the afternoon’s sexual depravity, as Dee teaches her step-daughter to ride Rob’s cock in reverse cowgirl. Once Kate is cum drunk and exhausted her mother pushes her off and shows her how a real submissive slut takes it in the ass, milking a huge load out of Rob for Kate’s pretty little face.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Kate Kennedy",
      "person_id": 61558
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    }
  ],
  "release_date": "2019-11-08",
  "scene_id": 45189,
  "tags": [
    "Anal",
    "Ass Hook",
    "BDSM",
    "big dick",
    "Big Tits",
    "Bisexual",
    "Black",
    "black hair",
    "Blonde",
    "Caning",
    "Family Roleplay",
    "MILF",
    "muscular",
    "natural boobs",
    "shaved",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "Tattoo",
    "Threesome",
    "top",
    "white"
  ],
  "title": "Ghosted: Slutty MILF & Step-Daughter Destroyed by Sadistic Sidepiece"
}