{
  "collections": [
    "Man Up Films"
  ],
  "description": "Dr Mason Lear is working on his newest muscle robot. He makes sexy muscular terminator robots for villains, and generally is displeased with his own career. Most of the villains these days want their terminator bots to be sexy with big functioning dicks that cum.\n\n“I’m a fucking scientist… why am I making dicks?”\n\nHe is very pleased with his newest creation though. He has Ricky Larkin, the new robot, flex for him and show off his perfect body. He feels his big perfect muscles, then licks his nipples to make sure they have sensitivity.\n\nHe tells the robot to get erect, and immediately Ricky’s big cock gets fully hard in his camo thong.\n\n“Well that works…”\n\nDr Mason has to make sure the robot can cum, or his boss will be displeased. He sucks his cock, then orders the robot to cum, which he does, filling the doctor’s mouth.\n\nWith a mouth full of cum still dripping, Dr Mason stands up and knows this part of the project is complete.\n\nDr Mason returns to Ricky Larkin, his newest robot. Ricky is still standing in the shop with a full hard on, just as Dr Mason left him. Dr Mason powers him on. He just has to run through his directives to make sure he’s ready to ship.\n\nHe asks the robot what his first directive is and the robot responds reciting his terminator directive.\n\nHe then asks for his second directive and the robot responds reciting his directive to hold down and fuck anyone he is assigned to fuck in the ass.\n\nThen something goes haywire and Ricky goes into terminator mode, grabbing Dr Mason by the throat. Dr Mason is getting chocked out and just barely shuts him off in time.\n\n“Holy shit… Something is clearly wrong with your code. I wonder why you went into your first directive and not your second one though…”\n\nRicky powers himself back on and recites his second directive, while slamming Dr Mason against a wall and pulling down his pants. Dr Mason screams, but no one can help him. He cannot over power his creation. All he can do is just bare through getting brutally fucked in the ass until the robot’s cycle is complete.",
  "directors": [],
  "models": [
    {
      "name": "Mason Lear",
      "person_id": 60275
    },
    {
      "name": "Ricky Larkin",
      "person_id": 35556
    }
  ],
  "release_date": "2019-09-13",
  "scene_id": 45182,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "big dick",
    "black hair",
    "Doctor",
    "Gay",
    "mixed",
    "Muscle",
    "muscular",
    "Rough Sex",
    "shaped",
    "switch",
    "Tattoo",
    "Partner Studio",
    "versatile",
    "white"
  ],
  "title": "Dr. Mason's SexBot Goes Haywire RAW"
}