{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Gia Milana makes her Kink.com debut on Fucking Machines, and she can't wait to get started. Her pussy is wet and ready. She feels the need to move, so she gets to it and strips for us. We give her a gag, and she quickly puts it in her mouth, and tightens the leather straps. She exposes her magnificent breasts from under her bright blue dress. She raises her dress to expose her pussy barely hidden under a pair of lace panties, then grabs a vibrator and sinks into the pleasure of her wet, slutty pussy. Gia can't get enough and we are not going to stop her, so we sit back and enjoy her non-stop orgasms. Soon the first machine is ready for her, and she is more than happy to climb on and insert the dildo deep inside her pussy. We cuff her with some traditional handcuffs, since this is her first time being tied up, to let her get comfortable with the idea of being bound and machine fucked at the same time. The orgasms are constant, and she can barley keep herself standing because her knees are so weak form all of the orgasms. She catches her breath, and then it's back to fucking. Next, Gia is on her back, bound in leather belts. The machine slides between her pussy lips as the orgasms begin to take over yet again. The next scene begins with Gia held in place with steel shackles, spread eagle. Her pussy has been fully fucked and Gia seems spent, but she's so close to the finish line that she can't stop now, so we add a vibrator to top off the scene, then we drop her on a sybian for our finale. The orgasms pour out of her, much to her pleasure, and ours!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Gia Milana",
      "person_id": 61912
    }
  ],
  "release_date": "2019-11-06",
  "scene_id": 45180,
  "tags": [
    "Bondage",
    "Dildo",
    "Gag",
    "Leather",
    "Machine Dildo",
    "Straight",
    "Sybian",
    "top",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Gia Milana: Big Titted Beauty In Bondage Getting Machine Fucked"
}