{
  "collections": [
    "Bound Gods"
  ],
  "description": "Cute athletic boy Lucas Leon is blindfolded, bound, and wrapped in saran wrap. He’s Sharok’s captive today and will have no choice but to submit to his Master’s devious desires. Sharok licks Lucas’ face through the plastic, biting his chin. He toys with Lucas’ sensitive nipples until Lucas is panting for more. He cuts off Lucas’ briefs and exposes his uncut cock. Lucas begs Sharok to let him go, but Sharok has other plans for this fine young boy. He crops his chest and belly, making them a rosy red. Sharok brings Lucas’ luscious lips in line with his cock and tells him to suck it. Lucas tries to wiggle away but has no escape from sucking Sharok’s cock. He groans as the head slips between his lips and Sharok fucks his pretty mouth. Next Lucas is bound on his knees with his hands behind his back. Sharok tastes his boy’s hole and spanks his perfect ass. Lucas moans under the attention and soon Sharok slips an acrylic butt plug into his asshole. Lucas gasps as it slides in and Sharok pushes it in and out of his ass. His ass twitches as Sharok spanks him with gloved hands. Once his cheeks are warmed up, Sharok takes out the plug and slides his dick into Lucas’ tight slick hole. Lucas moans as Sharok fucks his asshole, owning him in every way. After Sharok is done with his ass, he makes Lucas suck his cock clean. Then Lucas gets strung up again for hard flogging. Sharok flogs his abs, back, and ass. Each hit of leather has Lucas screaming. After tenderizing his boy, Sharok fucks him again. He drives into Lucas’ ass over and over as Lucas thanks him. Finally he cums on Lucas’ ass and brings Lucas down to his knees. Lucas sucks him clean before begging to cum all over his Master’s boots. Permission granted, Lucas blows his load and is instructed to clean up his mess.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Lucas Leon",
      "person_id": 62347
    },
    {
      "name": "Sharok",
      "person_id": 62054
    }
  ],
  "release_date": "2019-10-17",
  "scene_id": 45195,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission"
  ],
  "title": "The Captive Boy: Lucas Leon Submits to Sharok"
}