{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Our Favorite FBB Ebony MILF is back on the mats today taking on a man who towers over her. Tony\nOrlando has yet to win a match, so we have paired him with a petite MILF to see how he fends against\nher. He is able to get her back a few times and get her pinned long enough to suck on her chocolate tits.\nKelli does have some quick moves in her arsenal, however. We are giving you a warning here. There is\nPEGGING in this video. The winner gets to fuck the loser how the winner wants. The Winner picks up the\nloser and drags them into the locker room to get ass fucked. Kelli Provocateur has completely dominated\nher match with Tony Orlando. She submitted his bitch ass over and over again, and now it's time to fuck\nhis bitch ass. But First Kelli gets to claim her prize. Kelli starts with some muscle worship. She flexes her\nbiceps and makes Tony kiss them. Then she pops her pec in his face. The muscle worship leads down to\nher swollen fat clit and Kelli makes Tony suck her fat beefed up clip, Kelli sits on Tony's face and uses\nhim for her pleasure before she drags his ass into the locker room. She throws him onto the bench and\ngets her strap on cock on. She makes him suck her cock before she bends him over for a good hard ass\nfucking. She flips Tony over and fucks his ass until he cums. Tony eats his cum like a little sissy bitch",
  "directors": [],
  "models": [
    {
      "name": "Kelli Provocateur",
      "person_id": 39587
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2019-09-17",
  "scene_id": 45192,
  "tags": [
    "Anal",
    "Black",
    "black hair",
    "brunet",
    "Ebony",
    "erotic wrestling",
    "Facesitting",
    "fake boobs",
    "Interracial",
    "MILF",
    "Muscle",
    "Muscle Worship",
    "muscular",
    "Pegging",
    "Petite",
    "shaved",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "thirdparty",
    "top",
    "versatile",
    "white",
    "Wrestling"
  ],
  "title": "Ebony Muscle Goddess Destroys Skinny Man"
}