{
  "collections": [
    "Carmen Rivera"
  ],
  "description": "Melinda Jolie and Carmen Rivera know that the love of the whip goes through the stomach. They also know that few things satisfy the stomach better than pizza. Waiting to do their daily whip training, their horny slut in tow calls for a pie and, as they wait, Melinda and Carmen warm up the slut by hanging her on her ass hook and milk her juicy cock-clit.\nUnfortunately, when Hans, the delivery boy, arrives, he has no pizza! Carmen and Melinda threaten to call his boss and get him fired, unless he does EXACTLY as the mistresses demand. Hans is immediately made the object of intense whip training as blackmail to keep his job! Intimidated into being tied to his tail, he endures the hardest pain. The ladies also delight from torturously scratching his back, popping whips across his flesh, and seeing percussive instruments stirring up painful feelings in their target. Whimpering in pain after just his warm-up, there is no end in sight. A bullwhip is introduced, and just like a pizza when does when it burns, they make his ass go up in smoke! PIZZA DOMINA is highly recommended...FOR EVERY HUNGRY SLAVE!",
  "directors": [],
  "models": [
    {
      "name": "Carmen Rivera",
      "person_id": 60339
    },
    {
      "name": "Chris \"Schock\" Cock",
      "person_id": 60356
    },
    {
      "name": "Hans im Glueck",
      "person_id": 61549
    },
    {
      "name": "Melina Jolie",
      "person_id": 62337
    }
  ],
  "release_date": "2019-09-24",
  "scene_id": 45213,
  "tags": [
    "Ass Hook",
    "big dick",
    "black hair",
    "Bondage",
    "CBT",
    "Chains",
    "Clothespins",
    "Corporal Punishment",
    "Dominatrix",
    "fake boobs",
    "Fishnets",
    "Flogging",
    "foreskin",
    "German",
    "Paddle",
    "Pain",
    "Rope Bondage",
    "Sissification",
    "Slave",
    "slim",
    "Straight",
    "Suspension",
    "thirdparty",
    "Whipping",
    "white"
  ],
  "title": "THE WHIP LESSON 1 - HUNGRY FOR PAIN"
}