{
  "collections": [
    "Bound Gods"
  ],
  "description": "Wrists and cock tied up in rope bondage and restrained to the floor, hot stud newcomer to Kink Men Adrian Hart is ass up and ready to serve his Dom. His tight body writhing fully naked and exposed. His holes are ready to be used. In all black, with leather boots, pants and gloves, Dominic Pacifico is ready to inflict pain on his new bound toy. Starting with Adrian’s exposed ass, Dominic inflicts a brutal punishment. Slapping and flogging are just the beginning. A metal ass hook comes out and is shoved in Adrian’s hungry hole. The hook slides in and gets tied up and hung tight with a heavy bucket. Brutal Dom continues to add to the bucket stretching out Adrian’s hole further. Next Dominic turns to his other hole and gets Adrian to worship his boots and feet. Clean it pig! Adrian spit shines that boot before Dominic shoves his foot in Adrian’s mouth. After removing the hook, Dominic shoves his foot up Adrian’s ass. Begging for more, Dominic delivers a deep throat fucking in Adrian’s wet mouth. He gags on Dominics massive cock before servicing and worshipping Dom’s heavy and hairy balls. Flipped over and restrained again in rope bondage, Adrian begins to worship Dominic’s perfectly hairy armpits while Dom edges Adrian’s massive boner. As Adrian gets close Dom pulls back and torments Adrian with clover clamps all over his body and ballsack. Adrian’s testicles quiver in pain. Unable to resist, Dom shoves his ass on Adrian’s mouth for a deep breath play rimming. Adrian services his Dom with his mouth before giving up his ass. Dominic delivers a brutal hard anal fucking while Adrian is mounted to the wheel and blindfolded. Through his gag you can hear the screams of pain and pleasure as Dominic tears up Adrian’s hungry asshole with his cock. Both Men shoot huge loads of cum and Adrian eats it up.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Adrian Hart",
      "person_id": 62383
    },
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    }
  ],
  "release_date": "2019-10-31",
  "scene_id": 45220,
  "tags": [
    "Anal",
    "Ass Hook",
    "BDSM",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "Boot",
    "Brutal Punishment",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Edging",
    "Feet",
    "Flogging",
    "foot fetish",
    "Gag",
    "Gay",
    "gloves",
    "Hairy",
    "Humiliation",
    "Latinx",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "spit",
    "Stud",
    "Submission",
    "Tattoo",
    "unshaved"
  ],
  "title": "Dom Worship: Newcomer Adrian Hart Services Muscle God Dominic Pacifico"
}