{
  "collections": [
    "Men On Edge"
  ],
  "description": "Bound with rope to the outside of a cage, wearing only a blindfold and a gag in his mouth, Donny Argento anxiously waits for Sebastian Keys and Chance Summerlin to get to work edging his hard cock, and having their way with his muscular body. The two enter the dark dungeon and surround the cage like two sharks who've just found prey. They grab at his hairy naked flesh, squeezing his muscles and stroking his thick dick. Chance gets to his knees and sucks Donnie's cock with style and enthusiasm and Sebastian attaches clothespins to the sides of Donnie's body. Chance lubes up a clear stroker and slides it onto Donnie's stiff throbbing cock and jerks him off with it. Through the ball gag in his mouth he begs to cum, but the two are not done having their fun so they deny him the pleasure of shooting his load. Sebastian attaches a vibrator to the top of Donnie's shaft using more rope and his dick gets even harder and he begs to cum again and once again his orgasm is stopped in its tracks. Next they take Dillon down from the cage and tie him up lying face-down on the floor on his stomach with his ass on display. His legs and arms get tied together in a Hogtie, and with his hard cock out, Chance gets to stroking it. They both tickle his toes and Donnie wiggles and giggles. They lube up a gyrating prostate toy and slide it into his asshole. Chance and Sebastian each take a foot and together they lick and suck Donnie's toes. The prostate massager, the foot licking, and the cock stroking are too much for Donnie to handle and so they turn him over and Chance finishes off Donnie's cock, stroking out multiple loads.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Donnie Argento",
      "person_id": 62343
    }
  ],
  "release_date": "2019-11-26",
  "scene_id": 45225,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blindfold",
    "Bondage",
    "Cage",
    "Clothespins",
    "dungeon",
    "Edging",
    "Gag",
    "Gay",
    "Hairy",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling",
    "top",
    "Vibrator"
  ],
  "title": "Donnie Argento Tied Up and Edged in Rope Bondage"
}