{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Audrey Noir is super excited for her first ever gang bang! This hot babe with big tits and creamy white skin crawls after her Master Ramon Nomar to meet his friends, whom she has the honor of servicing today. She begs each one of them for their cocks and is rewarded with five rock hard cocks. She takes turns sucking each one as Ramon attaches a row of clothespins to her tits. Audrey relishes the pain and gets face fucked as Ramon hits the clothespins with a paddle. He instructs her to hold her mouth open as she moves from dick to dick. He puts clover clamps on her labia and tugs on them sharply as he and Donny play with her meaty cunt. Audrey screams as her pussy gets finger fucked and begs to cum. They laugh at her and tell her to keep sucking cock as they take turns zapping her all over her body. Next, Audrey is on all fours in bondage. The men take turns fucking her pussy and mouth as Ramon flogs her. Audrey moans as she is used as their fuck doll. Soon, she begs them to fuck her in the ass. Audrey’s asshole gets pummeled by cock after cock. She screams as she gets stuffed from both ends. Then they release her from bondage and stuff all her holes. Having both her pussy and ass full for the first time ever drives Audrey wild. She cries out but her screams are muffled by the cock in her mouth. The men stuff her airtight, taking all her holes. Audrey begs to cum over and over again as she gets pounded. They flip her over and double stuff her again. Finally, they cum all over her face, leaving her a sloppy cum covered slut.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Audrey Noir",
      "person_id": 52439
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Jake Adams",
      "person_id": 60459
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-11-13",
  "scene_id": 45228,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Tits",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clothespins",
    "Clover Clamps",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Latinx",
    "master",
    "MILF",
    "mixed",
    "muscular",
    "natural boobs",
    "Paddle",
    "Pain",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "switch",
    "toned",
    "top",
    "white"
  ],
  "title": "Audrey's First Gang Bang: Big Tit Slut Gets Stuffed Airtight"
}