{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Alexa Nova is on location with her camera man Robby Echo, to shoot the next installement of her reality horror video blog. This Halloween, Alexa has chosen to investigate the story of Tommy Samhain and his band of sadistic surgeons. Although never apprehended, Tommy and his crew were known for carrying out acts of sexual deviance. Seeing the location where Tommy and his men committed all their perverted acts is making Alexa horny and Robby is more than eager to indulge Alexa in her fantasies. Just as they start to get it on, they hear an ominous cackle from the shadows. Robby goes to investigate, leaving Alexa all alone. Suddenly Alex hears a scream in the distance, she cries out for Robby and upon getting no response, goes to look for him. Instead, she finds Tommy Samhain and his band of sadistic surgeons. Alexa is horrified to find that Robby is now one of them! They strip her of her clothes, feel her up, push her onto her knees and make her suck their cocks. Soon Alexa is drooling and covered in her own spit as she gets facefucked by cock after cock. Next, Alexa is bound in a suspension with one leg up in the air. Tommy and his doctors swarm around her, wrapping their hands around her neck and smacking her small tits. They take turns fucking her pussy and soon move to her ass. Alexa moans as fuck her tight asshole. Soon these diabolical fiends double penetrate her holes, fucking her cunt and ass at the same time. Alexa had no idea being double penetrated would feel so good. Finally, they take her down and stuff her airtight. Alexa eagerly takes cock after cock, moaning as they fuck her fast and hard. She begs for their cum and gets five loads on her face.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Alexa Nova",
      "person_id": 57359
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Mr. Pete",
      "person_id": 16823
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-10-30",
  "scene_id": 45227,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "Facefucking",
    "foreskin",
    "Gangbang",
    "halloween",
    "Latin",
    "mixed",
    "muscular",
    "natural boobs",
    "Redhead",
    "Role Play",
    "Rough Sex",
    "shaved",
    "slim",
    "Small Tits",
    "spit",
    "Straight",
    "Stud",
    "Suspension",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Samhain Slut: Alexa Nova Gets Double Stuffed on Halloween"
}