{
  "collections": [
    "Men On Edge"
  ],
  "description": "Newcomer to Kink Men August Alexander, is a handsome rookie cop walking the beat. Dressed in uniform this stunning stud won’t let any thugs get away shenanigans on his watch. He stumbles upon two mischievous hooligans ruffing up a local! Stop he yells at them and pulls out his service weapon. The two delinquents make a run for hit, and August is hot on their trail. The criminals run into an abandoned clock tower set and think they got away. They settle down for a little light snooze but they don’t realize officer Alexander is sneaking up on them. Weapon drawn again he surprises the two men, and begins to handcuff one. The other begs to let them go, and this was August’s big mistake. The two men jump the officer and take him down. And these aren’t any two men, it’s Kink’s very own Sebastian Keys and Chance Summerlin! Oh golly these two are going to have their way today with August. Tying up in restrictive rope bondage, with a blindfold and then a mouth gag the men get to work. Stripping this thick stud naked reveals his Massive cock. This will occupy these thugs for a while. Slapping it and sucking it Chance goes for the deep throat on August. Sebastian brings out the clear stroker and gets August rock hard and ready to blow his load, but these men are just here to torment this pig. Over and over as August gets closer and closer to blowing his load the men deny him and edge him to the limit. After working his cock, it’s time to work his tight asshole. What better to fuck him with than his own nightstick! Sebastian shoves the stick up this pigs ass and has him fuck his own stick. This gets Alexander groaning and moaning with pleasure begging to shoot. The bring out a vibrating dick on a stick too. Finally with a last sleeve that barely fits on the monster cock, August is taken over the edge and shoots a huge load. Sebastian milks every last drop out of it.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "August Alexander",
      "person_id": 62379
    }
  ],
  "release_date": "2019-11-12",
  "scene_id": 45224,
  "tags": [
    "BDSM",
    "big dick",
    "Black",
    "Blindfold",
    "Bondage",
    "Cop",
    "Edging",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Slapping",
    "Strokers",
    "Stud",
    "Tickling",
    "Uncircumcised",
    "Vibrator"
  ],
  "title": "Nightstick: Thick Uncut Rookie Cop Gets Fucked With His Own Stick"
}