{
  "collections": [
    "Bound Gods"
  ],
  "description": "Locked in a clock tower, tied up with rope to a wooden chair, burlap sack over his head, Nic Sahara struggles to break free. Michael DelRay enters the room and removes the burlap hood. Nic instantly recognizes Michael as one of his old crime buddies and asks him when did he get out of jail. Michael tells him that he’s been in jail for three years and was just released early. He tells Nic that he knows he snitched on him and that for there years he’s been planning his revenge. Nic denies the accusations and Michael gets to work on him, hoping that he’ll get him to confess. Michael rips open Nic’s shirt and repeatedly punches him in the stomach. He pinches Nic’s nipples and rips off his jeans with his bare hands. He cuts off Nic’s underwear with scissors and fashions them into a gag, stuffs them into Nic’s mouth and ties them behind his head. Michael gets his leather flogger and hits Nic in the chest and stomach hoping to get him to confess but Nic continues to insist that he did not snitch on him. Michael removes the gag from Nic’s mouth and shoves his big fat cock in there. Nic reluctantly sucks it at first but stops resisting and lets Michael fuck his mouth. Michael attaches rope to a pulley and lifts Nic and the chair he’s tied to, up into the air. Swaying back and forth, Michael flogs Nic even harder this time. In the next scene, Michael has tied Nic up in a standing position, blindfolded, completely naked with his back against the wall and his hands up at his sides. Michael hits Nic with a leather flogger and slowly attaches two strings of clothespin zippers along the flanks of Nic’s torso. The strings meet at a pulley and on the other side hangs a boat anchor. Michael gives Nic the strings to hold and starts dripping hot wax all over Nic’s naked body. When he finally loses his grip on the strings, the clothespins rip off and he screams in agony. In the final scene, Nic is naked in a full rope suspension. Michael creeps up from behind and fucks Nic’s ass raw. After pounding Nic’s ass he gets his confession and lets him down only to cum in his face. Michael attaches a chastity cage to Nic’s cock and lifts him back up in the air, leaving him to sway in the clock tower.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Michael DelRay",
      "person_id": 61138
    },
    {
      "name": "Nic Sahara",
      "person_id": 62344
    }
  ],
  "release_date": "2019-11-28",
  "scene_id": 45222,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Cage",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "Hood",
    "Hot Wax",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Suspension",
    "the chair",
    "the wall",
    "white"
  ],
  "title": "Getting His: Michael DelRay Captures, Ties Up, & Fucks Nic Sahara RAW"
}