{
  "collections": [
    "Men On Edge"
  ],
  "description": "MOE brings you a spooktacular, sexy Halloween Thriller with Cody Winters that is sure to bring you to the “edge” of your seat. Dressed up as a pirate and a sailor for Halloween Cody takes his friend Chance to a haunted house to do some good old fashioned ghost hunting but Chance is immediately creeped out by the cobwebs and skulls inhabiting this house of horror so he leaves Cody alone to have his so called fun. With his special tools he investigates the room searching for any signs of spirits when suddenly he detects some strange form pulsating through his thermal gun. Whatever it is it’s not visible to the naked eye. Cody begins the ritual of summoning beasts forth with incantations until the unthinkable happens! The room starts quaking and his Halloween dreams come true. Before he knows it he is tied up and blindfolded with the hands of two cock sucking ghouls all over his body and Cody is Scared Stiff! They tear at his clothes, cut his underwear off and one of the little monsters (that looks surprisingly like his friend Chance) devours Cody’s cock. He may be scared but his dick is hard and he is enjoying every second of this ghoulish cock sucking. Taken to the edge of cumming again and again these scary fiends are there to collect his seed for their master. But not yet! In due time after lots of teasing and devilishly delightful edging. They paw at him, suck his nipples and seduce him relentlessly with their otherworldly, supernatural touch. After nearly driving Cody crazy with wanting to cum he is now on his back with legs spread eagle tied to the floor. The diabolical demon sucks Cody’s cock while his ass gets fucked with a dick on a stick. And then they stuff a tiny, evil looking skull up Cody’s tight ass and make him push it out. Haha You gotta see it to believe it. Foot licking, toe sucking, nipple teasing and more deep throat cock sucking drive Cody to the edge until finally its time to let it rip! He shoots his hot load and the ghouls collect his sweet seed for their malevolent master. Happy Halloween!!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Cody Winter",
      "person_id": 59548
    }
  ],
  "release_date": "2019-10-29",
  "scene_id": 45223,
  "tags": [
    "Anal Fingering",
    "Athletic",
    "BDSM",
    "Blindfold",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "Edging",
    "foreskin",
    "Gay",
    "halloween",
    "Male Handler",
    "Male Sub",
    "master",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Stud",
    "Tickling",
    "unshaved",
    "white"
  ],
  "title": "Scared Stiff!"
}