{
  "collections": [
    "Bound Gods"
  ],
  "description": "In a dark room, lying on a cold metal table, naked, masked, and shackled under a black sheet, Jack Dyer pulls on his chains in frustration. Wearing a white lab coat and hospital scrubs, Riley Mitchel enters the menacing room to catalog Jacks final belongings. Riley reminds Jack of the sterilization procedure he'll be administering to him soon and Jack grunts and writhes from beneath the sheets. Unbeknownst to Riley, Jack escapes from his shackles and when Riley turns his back, he's attacked from behind and Jack takes control of him. He strips Riley naked and ties him up in rope bondage, legs crossed, seated on the cold metal table with the rope anchored to a suspension ring above their heads. He places a leather blindfold over Riley's eyes and begins to beat his back and shoulders with a leather flogger. He screams and Jack strokes Riley's big hard cock with his leather gloved hands. Jack pinches Riley's nipples and shoves his cock in his mouth. He lays Riley down on his back and runs a violet wand up and down Riley's body. He shocks his cock and balls and then his tongue. Jack makes Riley get on his hands and knees and he sinks his cock inside Riley's asshole and fucks him hard with his pierced cock. He turns Riley over and puts a ball-gag in his mouth. Jack ties up Riley's hands and spreads his legs. Jack sticks electrodes to the bottoms of Riley's feet and turns up the electricity just before pounding his asshole with his hard pierced cock. With electrified feet, Riley gets the cum fucked right out of him and then Jack blows his load across Riley's bearded face. Jack slides the mask that he once wore onto Riley's head and kisses him goodbye.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jack Dyer",
      "person_id": 62058
    },
    {
      "name": "Riley Mitchel",
      "person_id": 61662
    }
  ],
  "release_date": "2019-11-07",
  "scene_id": 45221,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "body builder",
    "Bondage",
    "brunet",
    "Chains",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Gag",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "Mask",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Suspension",
    "Violet Wand",
    "white"
  ],
  "title": "Sick Fuck: Riley Mitchel Overtaken, Flogged, and Fucked by Jack Dyer"
}