{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Hot buxom MILF London River has been dancing since she was 18, and today she brings one of her personal fantasies to Bound Gang Bangs. Horny from a long day working the pole, London goes home with a group of customers from work. She can't wait to get a taste of all the man meat she's followed home, and the men can't wait to get a taste of her. Clad in her work heels and a tiny bikini, she gets on her knees and immediately starts sucking cock. She takes cock after cock into her wet mouth, working hard to please the guys. But the group isn't impressed with her cock sucking skills and make fun of her for being so bad at giving head. Eventually they tie her to a post in the garage and take turns fucking her face. London takes every hard cock, gagging on them as they hit the back of her throat. She squirms as they play with her wet pussy while they fuck her face. Next, they suspend her in rope bondage with her legs spread. She moans as they begin fucking her warm wet cunt. Taking advantage of her exposed holes, the guys go straight for double stuffing this eager strung up slut. London screams as they fuck her pussy and ass at the same time. She cums hard as they pummel her holes and choke her. London loves getting used like this and begs for more. The guys take her down and stuff her airtight, fucking her cunt, ass, and mouth at the same time. They take turns spit roasting her and making her taste her pussy and ass on their cocks. London screams as they stretch her holes wide open. Drool leaks from her mouth as they ruthlessly fuck her mouth. Finally, they blow their loads all over her face, leaving London covered in cum. Getting glazed does nothing to dull London's lust and she begs to cum again. The guys grant her permission and London cums hard. She loves being a used wrecked whore.",
  "directors": [],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    }
  ],
  "release_date": "2019-11-27",
  "scene_id": 45229,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "drool",
    "Gangbang",
    "MILF",
    "mixed",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "spit",
    "Straight",
    "Stud",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "London's Stripper Fantasy GangBang: London Stuffed Airtight After Work"
}