{
  "collections": [
    "Everything Butt"
  ],
  "description": "The sexy long-legged Lexi Lore is rummaging though her step-mom’s dresser drawers when she finds a curious looking metal instrument with a ball at each end that could only be some sort of sex toy. She strips completely naked, kicks her feet up onto a leather chair, and slides the metal toy inside her asshole. She pops it in and out of her ass, spits on it, and slides it back in deep when suddenly she’s startled by her hot tattooed step-mom Joanna Angel. Joanna at first, scolds Lexi for going through her things, and then for not using the big end of the toy. Joanna squats down next to Lexi’s asshole and spanks her perfect pale ass pink. She sinks the big end into Lexi’s ass and Lexi moans in pleasure, thanking her step-mom for fucking her ass with the cold metal toy. Joanna takes Lexi by the hair and brings her over to her bed and with her ass in the air and her face in the mattress, Lexi gets her ass stuffed with a huge dick on a stick. Joanna makes Lexi rub her pussy until she cums but tells her that she’s not allowed to cum without something in her as so Joanna straps on a huge dildo and fucks Lexi’s ass deep while Lexi holds a vibrator against her clit and she cums hard with her step-mom’s cock in her ass. Joanna flips Lexi over and fucks her ass with her legs spread. She makes Lexi climb on top and ride her cock in cowgirl and reverse cowgirl. Joanna wants to show her step-daughter how a real anal whore takes it, and tells Lexi to fuck her with her big glass toy. Lexi sinks the clear glass toy inside her step-mom’s ass and fucks her with it and Joanna cums hard with a vibrator. Next, Joanna takes out the Slink and has Lexi slide it way up inside her ass and Joanna cums hard again with two feet of the toy in her guts. Lastly, she makes Lexi slide her whole fist inside her ass and because Lexi does such a fine job, she rewards her step-daughter with the pillar, and slides the cold clear glass toy in and out, gaping Lexi’s hole.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Joanna Angel",
      "person_id": 61458
    },
    {
      "name": "Lexi Lore",
      "person_id": 61958
    }
  ],
  "release_date": "2019-11-01",
  "scene_id": 45230,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Tits",
    "black hair",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Feet",
    "Gaping",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "slink",
    "Straight",
    "Strap On",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Slutty Anal Step-Daughter: Joanna Angel and Lexi Lore's Lesbian Anal"
}