{
  "collections": [
    "Families Tied"
  ],
  "description": "Cadence Lux is the picture of radiant beauty as she enters the home of her new suitor Seth Gamble for the very first time. The sun is shining and his gorgeous modern Californian bungalow is filled with fresh flowers and promise. Even when Seth makes a confession that he has a long-term illness Cadence is not deterred. She has fallen for the oldest trick in the book, and fails to notice that all of Seth's new age crystals and hippy nonsense is actually an elaborate altar designed to extract Cadence's soul through a sex ritual. As they fall deeper into a passionate afternoon fuck, Cadence becomes delirious under Seth's 2000-year-old sexual prowess. Seth throws Cadence around and fucks her throat rigorously while beating her ass pink with a flogger and cane. Cadence obeys with pleasure when Seth asks her to slip her fingers in her panties and make herself cum, but what she doesn't know is that every time she cums she super charges Seth and depletes herself. Seth gets one taste of her soul and starts to binge on her orgasms by tying her up in leg binding shibari and alternates between caning her sensitive legs and feet and fucking her wet horny cunt. As the flower of her soul wilts under a barrage of squirting wet orgasms, Cadence is almost certainly done for, but then Seth's mysterious step-sister sneaks in and interrupts them. Unfortunate for Cadence, Victoria Voxxx is an even more deadly sex vampire then Seth, her immortal step-son. Victoria smelled Cadence's insouciant sexual spirit from afar and came to steal her from Seth. Victoria quickly orders Seth away and then binds Cadence in leather handcuffs. Playing more deadly lesbian games Victoria devours Cadence's cunt and coaxes more squirting orgasms from her. While Victoria is distracted by Cadence's delicious body Seth breaks free and binds Victoria determined to steal the soul of both Victoria and Cadence. The punishing sexual showdown between Victoria and Seth is white-hot and thousands of years in the making. Seth handcuffs and plugs her ass with a metal anal hook and then flogs her pussy and ass until it is welted and striped. He fucks both of Victoria's holes while she writhes and cums without control. Cadence also gets in on the fun sitting on Victoria's face and squirting all over her open mouth. Orgasms aren't enough for Seth and he turns Victoria over and canes her viciously until she cums from the pain. He then has them both under his spell and cover their bodies with clamps, tight metal ones for Victoria's sensitive nipples and clothespins for Cadence's milky skin and Victoria's pussy zipper. The brutal pain play and BDSM threesome would be enough to steal anyone's life force but Cadence is special and survives until the final orgasm, gobbling Seth's hot cum off of her own bush and running to steal the charged talismans from the altar, leaving both Victoria and Seth to age and wither on the floor.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Cadence Lux",
      "person_id": 51424
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2019-10-31",
  "scene_id": 45232,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Bisexual",
    "Blonde",
    "brunet",
    "Brunette",
    "Bush",
    "Caning",
    "Clothespins",
    "Family Roleplay",
    "Feet",
    "halloween",
    "Latin",
    "Leather",
    "Leather Cuffs",
    "Lesbian",
    "Muscle",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pierced Nipples",
    "shaved",
    "Slapping",
    "Spanking",
    "Squirting",
    "Straight",
    "Stud",
    "switch",
    "Threesome",
    "toned",
    "top",
    "Vibrator",
    "white",
    "Zipper"
  ],
  "title": "Vampira Moderna: Squirt Sucking Anal Succubus Withers Under Orgasms"
}