{
  "collections": [
    "Everything Butt"
  ],
  "description": "18 year old brat Kendra Spade gets revenge on her strict teacher Dee Williams by fucking her in the ass with lots of huge butt toys and a fat strap-on dildo. \"Mrs. Williams is a stupid whore\" is written on the chalk board when Dee shows up late for their meeting. First thing Kendra does is pull her cutoff blue jean shorts down and tells Mrs. Williams to eat her 18 year old ass. And now it's Mrs. Williams turn to receive Kendra the brat's wrath. Teacher is bent over the desk with her curvy ass in the air and huge tits squished together while Kendra stretches her hole with a long glass butt toy. Dee is enjoying this a little too much and Kendra just wants to punish her lame teacher who tried to send her to the principles office. Next Kendra fucks teacher with a hard metal dildo while Dee vibes her clit until she cums hard and squirts all over. Kendra orders Mrs. Williams to bend over so she can fuck her tight bitch ass with her strap-on cock. She loves it and cums again. Flipped over on her back with her legs spread high and wide Kendra drives that giant cock up her ass and pounds her out until she gets off real good screaming and moaning like crazy. Dee gets on top of Kendra and bounces on that big dick and then does reverse cowgirl with the Hitachi and squirts a geyser of cum all over the room. But the punishment doesn't stop there because there are more toys to try in Mrs. Williams ass. A big rubber butt plug stretches her butt hole and then a clear glass cylinder fills her up and sends her writhing and moaning. Just when you think Teacher can't take any more she gets another long fat cock up her ass causing a squirt fest. Then Mrs. Williams shakes and drools as she takes the slink way inside making her wail with pleasure. Kendra fists her teacher and by the end of the day Kendra is Mrs Williams #1 student and the Teachers pet.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Kendra Spade",
      "person_id": 60694
    }
  ],
  "release_date": "2019-11-15",
  "scene_id": 45231,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "big dick",
    "Big Tits",
    "Blonde",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaved",
    "slim",
    "slink",
    "Straight",
    "Strap On",
    "Teacher",
    "top",
    "white"
  ],
  "title": "Teacher's Pet: Kendra Spade Takes Revenge on Teacher Dee Williams"
}