{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Looking very smart in her lab coat and glasses, Dr. Paige Owens readies her syringe for her hysterical patient, Tommy Pistol. She administers the shot and Tommy goes to sleep. He wakes up in Paige’s house, handcuffed to the bed. Paige calms him down and frees him from the cuffs and tells him that she has a job interview lined up for him. He tells Paige that she’s made a big mistake and climbs on top of her. He grabs her tits, spreads her legs, and fingers her pussy. She moans reluctantly and gives in to his control. He lays her on her stomach and strips her clothes off. He uses rope to tie her wrists and ankles to the four corners of the bed and whips her ass and back with a leather flogger. He climbs on top of her naked body and slaps her perfect round ass, and she sticks it in the air for more. He sinks his hard cock deep in her slutty pussy and fucks her hard and fast. And with a perfect view of her asshole he cant help but shove his cock right into it. Paige loves getting her ass rammed and she cums hard on his cock. Tommy flips her over and ties her up using more rope. This time, her legs are tied spread, wide open with her fucked pussy and ass on display. Tommy lubes up a hand and slides his whole fist inside Paige’s pussy. He fist-fucks her pussy while fucking her ass in an amazing double penetration and she screams in pleasure. He lets her out of bondage and tells her to suck his cock and to not stop until he cums. Tommy puts nipple clamps on her natural perky tits and aggressively fucks Paige’s mouth until her face and his cock are covered in spit and cum.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Paige Owens",
      "person_id": 62346
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-10-25",
  "scene_id": 45240,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "Doctor",
    "Domination",
    "Double Penetration",
    "Fisting",
    "Flogging",
    "Humiliation",
    "Latinx",
    "Leather",
    "Medical Fetish",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "spit",
    "Straight",
    "Submission",
    "top",
    "Vaginal Penetration"
  ],
  "title": "Doctor's Orders: Paige Owens Fucked and Fisted by Tommy Pistol"
}