{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Mackenzie Moss is the typical girl next door, but she's got a bottomless hunger for stiff dick and brutal pain play. Seth Gamble wastes no time giving this petite blonde exactly what she wants. Mackenzie is tied to a Saint Andrew's cross, dangling from her knees and wrists via the inescapable grip of tight rope bondage. This leaves her wet pussy and perky little titties exposed to Seth's brutal whims. He immediately begins to tenderize her pale exposed flesh with a heavy leather flogger. Once Mackenzie's skin is radiating a warm pink, he begins to sting her flesh with a riding crop and bamboo cane. She yelps and squeals from the sting of the cruel impact play. A blindfold covers her sweet blue eyes making it impossible to know when the abuse will be inflicted upon her. This sensory deprivation only gets Mackenzie even more turned on. As Seth fingers her whore hole she squirts all over his hand and oozes creamy pussy juices. She begs to feel his cock inside of her cunt as Seth jams it in. He slams her into submission and she begs to cum. Tired of hearing his fuck toy plead for mercy, Seth throws her to the floor and shoves his cock into her mouth. He ruthlessly face fucks his female sex slave until she gags from the deep throat blow job. Seth flogs her swollen pussy and beats her tender back while she struggles to devour his cock. Pleased with her devotion, he jams a hitachi onto her cunt and coerces yet another orgasm out of her. Next Mackenzie stands with her legs spread and her hands tied to her knees. Now Seth can devote his attention to beating her perfect round ass. He attacks her ass with a plastic paddle that leaves red hot streaks across her back side. Panting from the searing pain, she gasps as Seth jams his cock back into her pussy. Mackenzie's ass shakes and trembles as he relentlessly fucks her. She is then flipped onto her back and tied down to a table with her broken pussy exposed and ready to be penetrated yet again. Seth slaps her face and chokes her as he continues to slam her cunt. She whimpers and thanks her master for all the attention and orgasms he has given her. She begs to taste his cum and in the height of a sexual frenzy he shoots his hot load all over her tits and pussy. He scoops it up and feeds it to her so she can taste her sweet humiliation.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Mackenzie Moss",
      "person_id": 62135
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2020-01-06",
  "scene_id": 45246,
  "tags": [
    "big dick",
    "Blindfold",
    "Blonde",
    "Bondage",
    "brunet",
    "Crop",
    "Deprivation",
    "Hitachi",
    "Humiliation",
    "Leather",
    "master",
    "muscular",
    "Paddle",
    "Pain",
    "Petite",
    "Rope Bondage",
    "shaved",
    "Slave",
    "Straight",
    "Stud",
    "Sub",
    "Submission",
    "white"
  ],
  "title": "Mackenzie Moss: A Hunger For Pain and Dick"
}