{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Pain slut Kira Noir is Derrick Pierce's Happy Little Plaything in this weeks Brutal Sessions. Rope tied and suspended in mid-air Kira takes punishing discipline from Derrick's relentless flogging. He plays with her pussy in between bouts of beating her cute ass and lets her suck his hard cock and then fucks her good and hard as she hangs from the ceiling. Next Kira is on her knees stretched out and tied up on a wooden cross. With predicament rope bondage tight on her pussy and nipple clamps on her tits Derrick gives Kira strict rules to follow while he whips her firm sexy belly. Her screams echo throughout the dungeon as he strikes her with the leather single-tail but she takes it like a good pain slut. To counteract the pain he rubs her clit and brings her to a wild orgasm. Derrick stuffs his dick in Kira's mouth and pulls the nipple clamps off making her suffer and moan but it gets her pussy so wet. She begs to keep sucking his cock, it makes her happy. Now Kira is tied up laying down on her knees so her holes are exposed and ready. Derrick fucks her slutty pussy and she thanks him for his cock. She is a people pleaser and wants to use all her holes to serve him. Fucking and flogging and more fucking take Kira over the top with a hot blend of pain and pleasure. She loves it and can't get enough as Derrick pounds her tight ass and then lets her clean it all off with her whore mouth. Finally Kira is on her back tied down with legs spread open. Mr Pierce busts out the crop on Kira's tits, belly and sensitive swollen cunt. Choking her delicate neck with his strong hands Derrick fucks Kira's pussy and ass back and forth driving her crazy until she begs to cum and Derrick covers her fucked hole with his hot load.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Kira Noir",
      "person_id": 58892
    }
  ],
  "release_date": "2019-12-09",
  "scene_id": 45245,
  "tags": [
    "Anal",
    "Athletic",
    "Black",
    "black hair",
    "Bondage",
    "Choking",
    "Crop",
    "Discipline",
    "dungeon",
    "Flogging",
    "Leather",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Pain",
    "Pain Slut",
    "Rope Bondage",
    "shaved",
    "Straight",
    "Sub",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "Happy Little Plaything"
}