{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Junior lawyer at the firm, Gia DiMarco is dressed for success. Tight black top, even tighter skirt. Her black high heels accentuate her silky perfect legs. The patriarchy is strong at this company and so this busty brunette will do whatever it takes to succeed in this man's world. She knows she needs to get the client list or else her career is at stake. How messed up is that. Walking into Derrick Pierce's office she kindly asks him to uphold his deal and get her the client list. Of course this asshole man says no and walks out. She has nothing else to do and nothing else to lose so she searches his office for the list. This muslce stud catches her in the act. He takes a suggestive photo of her going through his things and uses it to blackmail. His coercion is demeaning and he demands that she submit to him or lose her job. This harassment gets the best of everyone and next Gia is tied up in rope bondage. She is stripped of her clothing and tight underwear. Derrick slaps her ass before fucking her tight pussy. Is that pussy getting wet? Gia submits to her boss and gets the list. Next Gia shows up at Derrick's house for more. More means much more. Tied up in restrictive bondage, mouth ball gagged. Out comes the crop and the flogger. Gia screams in pain and pleasure before going down on Derrick and delivering a brutal deep throat cock sucking. Out comes the hitachi and Gia soaks the floor with a squirting orgasm. Flipped over and tied up again, Gia submits her pussy again to Derrick. Her huge tits are slapped and she begs Derrick for his cum.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    }
  ],
  "release_date": "2019-11-15",
  "scene_id": 45242,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "fake boobs",
    "High Heels",
    "Hitachi",
    "Humiliation",
    "other hair color",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Squirting",
    "Straight",
    "Stud",
    "Submission",
    "Tattoo",
    "toned",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Client List: Submissive Gia DiMarco Returns for More Punishment"
}