{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Welcome back Daisy Stone to the Kink dungeon. This perky blonde girls next door has a flawless body and a filthy dirty mind. Trapped in a metal cage this self described whore is eager to stretch out all of her holes, and she’s not leaving til her ass is full of cum. Tommy Pistol starts by fingering all her holes, using her slobbery spit to wet her pussy and ass. He uses both hands to stretch out her holes. He also knows a little pain can help get these holes begging to be used. First with the crop right on the pussy, Daisy screams for more. Tommy’s gloved hands spank Daisy’s ass red and the flogger on her thighs brings her to orgasm. Tommy starts the stretching and shoves his cock down Daisy’s throat. She delivers a brutal sloppy deep throat, but Tommy demands more. He brings out a huge red fucking toy and shoves it in her throat. He uses that to fuck her mouth and stretch her out. Nipple clamps on her perfect perky tits get her screaming. Tied up in restrictive rope bondage with her ass in the air, Tommy pulls her hair while slapping her ass. Her pussy is ready for stretching. A deep pounding gets her stretched and begging for what she really wants. Deep anal. Her tight asshole quivers waiting for her master to fuck her breathless. Tommy delivers his most brutal fucking on her ass. He flips her over and continues to brutalize her ass before she begs him, pleads to him, to unload his balls deep in her ass. Tommy fills her up and has her shoot out his load from her ass.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Daisy Stone",
      "person_id": 61519
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-11-25",
  "scene_id": 45244,
  "tags": [
    "Anal",
    "Anal Creampie",
    "Blonde",
    "Bondage",
    "brunet",
    "Cage",
    "Crop",
    "dungeon",
    "Fingering",
    "Flogging",
    "Latinx",
    "master",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "Slapping",
    "slim",
    "spit",
    "Straight",
    "Sub",
    "white"
  ],
  "title": "Anal Fuck Toy Daisy Stone is Helpless in the Dungeon"
}