{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Social media superstar Ana Foxxx has over a millions followers, but not without thanks to her agent Stirling Cooper, who demands to be paid in kind. But it’s not money he wants, it’s sexual favors. Ana won’t have it, so she throws her drink in his face and storms off. But that’s not the end of it. Stirling busts into her home and takes what he wants. Ana’s tied up and fucked in every hole. She’s flogged and cropped, and left a twitching slab of fuck meat. First, Ana finds herself strapped down to a sofa, spread eagle. Stirling adds nipple clamps, crops her, then primes her with a vibrator to get her loosened up. He then face-fucks her over the back of the sofa as her spit runs over her face, coating her. He flogs her pussy, sending waves of pain and pleasure through her body. Stirling then ties Ana to a table with one of her legs up so he can get at her soaking wet pussy and asshole. He teases her ass and cunt while flogging her, then slides his big thick dick inside her. He fucks her we pussy then moves on to her hungry ass. Both holes take his dick deep and hard. Stirling eventually loosens the rope so he can flip Ana onto her back and fuck her missionary. He slams both holes again, fucking her like a whore. He shoots his huge load all over her fucked cunt, leaving her plowed and soaked in her own shame.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-11-01",
  "scene_id": 45241,
  "tags": [
    "Athletic",
    "BDSM",
    "Black",
    "black hair",
    "Blowjob",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "foreskin",
    "Humiliation",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Pain",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "spit",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Social Promotion: Ana Foxxx Gives Up Her Ass For More Followers"
}