{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Blonde busty masochistic MILF London River has been bad. She came without permission and now she's in strict rope bondage awaiting her punishment. The sight of her tied and helpless, with her luscious tits all but falling out of her bra and her ass wiggling in the air gets Charles Dera hot and horny. He berates London for her failure, spanking her round ass. He takes off his belt and delivers firm hits to London's ass. London knows she deserves to be punished. More so, she yearns to be punished. She begs to suck Charles' cock and is rewarded with a rough face fuck, leaving her breathless and on her tip toes. Next, Charles instructs her to fuck her ass with a big metal dildo. London obeys, moaning as the cold head disappears into her eager ass. Charles commands London to cum and she does, earning her reward -- a caning and hits with the acrylic paddle. The paddle and cane provide the sharp and intense pain London craves. Once her ass is red, Charles fucks her sweet cunt, burying every inch of his rock hard cock into her slick warmth. London cries out, begging to cum, but is refused over and over again as Charles takes his pleasure from her pussy. He has her clean her pussy juice off his cock and then brings London to orgasm by playing with her sensitive cunt. Then he drives his cock back into her pussy and fucking into her at a brutal pace. London cries out as Charles fucks her relentlessly, only allowing her to cum when he feels like it. Each time, London cums harder and harder, her cunt squeezing down on Charles' hard cock. Finally, London begs Charles to cum on her face and Charles pulls out, pushes London to her knees, and cums all over her face and in her open slut mouth.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2019-11-08",
  "scene_id": 45243,
  "tags": [
    "BDSM",
    "black hair",
    "Blonde",
    "Blowjob",
    "body builder",
    "Bondage",
    "bottom",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Humiliation",
    "MILF",
    "natural boobs",
    "Paddle",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Spanking",
    "Straight",
    "Submission",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Earning the Cane: London River Gets Beaten and Fucked by Charles Dera"
}