{
  "collections": [
    "Device Bondage"
  ],
  "description": "BDSM gear fetishists everywhere will unanimously agree that building a collection of high quality equipment that is properly designed, aesthetically pleasing yet functionally useful is a process that takes many years and an inordinate amount of disposable income. Hunting down the one or two people on Earth that have the knowhow to make a custom fitting chastity belt or straitjacket is time consuming enough, let alone the agonizing 8 to 24 week waiting period to receive items from a tiny town in Europe or from an individual astisan who makes each piece by hand in his or her spare time.\nOnce the gear finally arrives, it is worth every penny and the long agonizing wait. The latex fits like second skin, the straitjacket is molded to the precise form of a woman, ensuring that she is utterly helpless, tightly constricted, yet able to remain in the bondage indefinitely. The chastity belt is so tight that a single finger is all that can be put under the waistband and the vaginal shield is locked in place and pressing so much against her pubic mound that it may as well be bolted in place with surgical screws. The extremely strict form of control this type of gear has on a submissive can cause her to have a mind blowing experience in a scene.\nThis shoot was done with all custom made to measure gear. For those individuals who are unsure what kind of difference this type of gear can make in a bondage scene, enjoy the update and perhaps you will see an item you would like to pick up for your own play. If you'd like to know the manufacturer, post on the forums and ask.\nNote to Non-Gear Fetishists: Thanks in advance for the super anecdote you're planning to post about how you built your home dungeon and all your equipment for $1.73 with supplies from Home Depot, things found in your couch and an old pasta strainer. It's sure to be a real zinger and the insightful crafting of your comment will no doubt teach us that a true BDSM master (like yourself) needs no expensive props to securely bind and dominate a woman. In fact, you can dominate a woman with your mind, body language and voice, causing her to remain rigidly motionless and at attention with no restraints at all, ready to please you on a moments notice should you give the command or even the slightest gesture of your hand. Your go-get-em' DIY thriftiness and sheer Dom power both humbles us and amazes us. In fact, since we already know how frugal and fantastic you are, you may as well skip the effort of posting the comment at all since it will no doubt take you away from your harem of willing submissives.",
  "directors": [],
  "models": [
    {
      "name": "Claire Adams",
      "person_id": 378
    },
    {
      "name": "Sarah Jane Ceylon",
      "person_id": 12772
    }
  ],
  "release_date": "2012-05-22",
  "scene_id": 4524,
  "tags": [
    "BDSM",
    "Bondage",
    "Chastity Play",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Fetish",
    "Fingering",
    "Handler",
    "Humiliation",
    "Latex",
    "master",
    "Metal Bondage",
    "Straight",
    "Submission"
  ],
  "title": "CLASSIC SHOOT WITH CYD BLACK, SARAH JANE CEYLON, AND CLAIRE ADAMS!"
}