{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Submissive little Sherman Maus has messed up again. His Domina Helena Locke is not happy, not one bit. It’s time to retrain this pathetic little bitch. Stripping naked in the kitchen and made to go down on all fours, Sherman starts by worshiping Helena’s high heels. His gorgeous dominant goddess deserves respect. Next comes out the riding crop and corporal punishment. Sherman takes a beating on his ass by Helena. It’s time for the real punishment to start. Waterboarding in the kitchen sink. Sherman loses all breath as his mistress trains him with punishment. After gasps of air, the zapper comes out and she torments his cock and balls with electricity. You always have to beat a bitches balls. Next comes out the crop to the balls. Sherman takes a brutal beating. Moving on to the kitchen, Sherman has a rope bondage around his neck and a red ball gag in his mouth. Bent over he takes the flogger hard. This pathetic little bitch needs to learn a lesson. A BIG one. The biggest one! a giant huge strap on cock is on Helena’s leather harness. Her body clad in latex she is ready to fuck his hole with a giant strap on pegging. Sherman screams with every inch. But this punishment and training isn’t all about little Sherman, she is in control and in charge. She tramples Sherman’s body before sitting on his face, smothering the air out of him. He is made to eat her perfect pussy and lick her delicious ass. She stands over him and cums all over his face, he is then made to clean it all up.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Sherman Maus",
      "person_id": 62063
    }
  ],
  "release_date": "2020-01-28",
  "scene_id": 45264,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "CBT",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "Gag",
    "High Heels",
    "Humiliation",
    "Latex",
    "Leather",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "harness",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Smothering",
    "Straight",
    "Strap On",
    "toned",
    "top",
    "unshaved",
    "Water Boarding",
    "white",
    "Zapper"
  ],
  "title": "Pathetic Little Bitch: Helena Locke Smothers & Tramples Sherman Maus"
}