{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Santa Dale Savage is on a routine present drop-off in the lair of busty buxom MILF Syren de Mer. Just as he’s about to leave Syren catches him leaving presents. She doesn’t believe for a second that he’s Santa Claus and makes quick work of tying him up and gagging him. Dale is surprised but boners don’t lie and his dick is as stiff as a Christmas candy cane. Syren teases him with her mouth and ass, and delivers a sound flogging to Dale. Each hit only turns Dale on more and soon he’s begging to cum. Next she has him on his hands and knees. Dale moans as her long fat strap on cock sinks into his tight asshole. Syren fucks him hard and deep as slutty Santa Dale cries for more. Finally Syren makes Dale worship her feet. Dale eagerly licks between her perfect toes and bites her sensitive heels. Syren trails her feet down his body and ends up on Dale’s hard cock. She wraps her feet around Dale’s cock and commands him to fuck her feet. Dale’s hips thrust upward, trying desperately to get the friction he needs to cum. But he’s forgetting Syren’s pleasure comes first! She sits on his face and Dale greedily licks her juicy pussy. Syren rides his face, cumming hard over and over again. Finally, she sinks down on his cock. Dale moans as her tight slick warmth envelops his sensitive cock. Syren sets a brutal pace as she uses his body to orgasm on his cock. When she’s had her fill, she wraps her hand around his cock. Dale begs to cum, desperate to blow his load even if it’s only in her hand. Just as he’s about to cum, Syren denies him, laughing as he struggles in bondage.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Dale Savage",
      "person_id": 62015
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2019-12-17",
  "scene_id": 45263,
  "tags": [
    "BDSM",
    "Big Tits",
    "black hair",
    "Bondage",
    "CBT",
    "christmas",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Humiliation",
    "Male Sub",
    "MILF",
    "mixed",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Redhead",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Santa Gets Got: MILF Syren de Mer Catches Dale Savage in Her Dungeon"
}