{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Bella Rossi loves to be useful. During office hours, she fetches Jessica water, helps her sort mail, and makes her feel good. Jessica loves putting Bella to use and today, she cancels her afternoon meetings to spend more time with her favorite office slave. Bella lavishes Jessica’s hard cock with attention. She runs her tongue along the underside and swallows every inch. She bobs up and down until Jessica is moaning and pulling open her blouse to reveal her luscious tits. Jessica slaps Bella’s big tits and tells her to bend over the desk. Bella wiggles her butt as she lifts her skirt and gasps as Jessica’s hand spanks her cheeks. Jessica spanks and crops Bella’s ass until it’s a rosy red and leans in to taste her sweet skin. She has Bella strip down to her garter and stockings and ties her over the desk. Bella has waited all day for her boss’ hard cock and begs Jessica to push her cock into Bella’s wet hungry pussy. Jessica isn’t entirely convinced and doesn’t give in until Bella is writhing on the table pleading for her boss’ cock. Eventually, Jessica gives in and fucks Bella’s tight cunt. She wraps a hand in Bella’s hair and pulls her head back as she fucks her slut’s hungry hole. Bella moans as Jessica slams into her over and over again, driving her cock deeper and deeper into Bella’s pussy. Next, Bella is tied on her back with her legs open. Jessica takes Bella’s pussy again, fucking Bella until she cums hard. Then she sets her sights on Bella’s ass. Bella moans as her ass swallows her boss’ hard cock. Jessica moans as Bella’s tight ass clamps down on her cock. Jessica fucks Bella to orgasm and then blows a load on Bella’s perfect tits.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Jessica Fox",
      "person_id": 17013
    }
  ],
  "release_date": "2019-11-04",
  "scene_id": 45265,
  "tags": [
    "Big Tits",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Curvy",
    "Latinx",
    "Lingerie",
    "natural boobs",
    "Nylons Stockings",
    "other hair color",
    "Role Play",
    "shaved",
    "Slave",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Office Slave: Jessica Fox Fucks Bella Rossi in Every Hole"
}