{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Helena Locke is hear to worship and serve. Down on all fours this beautiful woman, this stunning figure, has only one thing in mind. Worship Khloe. Her mistress is pure finesse. Tall, stockings, high heels, latex skirt. Khloe Kay drips seduction and dominance. This mistress of the dungeon is ready to torment with desire. Helena on all fours, dances and shakes her round ass for Khloe. Mistress repays with corporal punishment on her ass. Helena begs for more, begs to be punished harder. Helena worships Khloe’s long legs, licking from heel all the way up. Please mistress, I desire your cock. Not yet, there is more torment. Clover clamps come out and Khloe puts them right on Helena’s juicy wet pussy lips. This milf screams and begs for cock. Finally she is rewarded with her mistress’s smooth hard cock. She goes down for a deep wet sloppy blowjob. Her deep throat gets Khloe ready for what’s next. But, first more pain. Helena is told to slap her pussy, and slap it hard. Over and over again she slaps her pussy in pain for her beautiful domme. This gets Helena’s vulva red and ripe for Khloe’s hard cock. Bent over and bound, Khloe delivers a brutal hard fucking, pounding Helena’s pussy raw. Helena’s toes curl as she screams for more. Flipping her over, Khloe fucks her harder. Khloe then climbs over Helena and smothers her with ass. The two go in for 69. Khloe spits on Helena’s pussy and applies her tongue. This lesbian pussy eating gets Helena screaming to cum. But not just yet. The Hitachi comes out and Helena’s body shakes with orgasm. Finally Khloe shoots a massive hot load onto Helena. Drenched in cum, the two kiss.",
  "directors": [],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Khloe Kay",
      "person_id": 61949
    }
  ],
  "release_date": "2019-12-16",
  "scene_id": 45266,
  "tags": [
    "Blowjob",
    "Brunette",
    "Clover Clamps",
    "Cock Worship",
    "Corporal Punishment",
    "dungeon",
    "High Heels",
    "Hitachi",
    "Latex",
    "Lesbian",
    "MILF",
    "natural boobs",
    "Pain",
    "Pussy Eating",
    "Role Play",
    "smooth",
    "Straight",
    "Tattoo",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Worship Khloe: Submissive Helena Locke Devotes Herself to Mistress Kay"
}