{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Eager toy Dresden is all dolled up in shiny black latex. She's tied and gagged, awaiting the arrival of her Mistress, Ella Hollywood. Ella enters, her svelte figure covered by a skintight latex catsuit. She runs her hands all over Dresden, feeling Dresden's plump ass and wet pussy. Dresden moans, drool leaking from around her gag. Today she's going to be the perfect little toy for Ella. Ella releases Dresden from bondage and tells Dresden to worship every inch of her body. Dresden eagerly licks Ella's heels. Her pink tongue laps at the toe and the heel. She kisses Ella's beautiful cock, licks the along the length, and worships Ella's balls. Upon command, she takes Ella's hard cock down to the base. She lavishes it with attention, gagging as Ella fucks her face. Then she buries her face into Ella's ass. Dresden moans as Ella sits on her face. She eagerly licks Ella's asshole as Ella licks her cunt. Suddenly Dresden begins laughing! Ella has found her ticklish spots and exploits them mercilessly as Dresden squirms beneath her. Next, Ella slides her cock into Dresden's sweet cunt. Dresden moans as Ella fucks her pussy and is soon begging to cum. But Ella denies her and keeps fucking her cunt. Dresden cries out as she tries not to cum on Ella's perfect cock. Finally Ella grants her permission and Dresden cums hard over and over again. While fucking Dresden's pussy, Ella slides a finger into Dresden's ass. Dresden's ass opens up nicely and Ella pushes her cock in. Dresden moans as Ella fucks her tight asshole. This is Dresden's first time getting ass fucked on camera and she loves it. She cums hard as Ella uses her ass and is rewarded with Ella's big load all over her face.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Dresden",
      "person_id": 58978
    },
    {
      "name": "Ella Hollywood",
      "person_id": 61985
    }
  ],
  "release_date": "2019-12-02",
  "scene_id": 45267,
  "tags": [
    "Anal",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "Cock Worship",
    "drool",
    "First Anal",
    "Gag",
    "Latex",
    "natural boobs",
    "Role Play",
    "shaved",
    "Straight",
    "toned",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Greedy Latex Slut: Ella Hollywood Fucks Dresden's Pussy and Ass"
}