{
  "collections": [
    "TS Seduction"
  ],
  "description": "Jessica Fox flips the script by being the Sub for the very first time in this weeks super hot TSS, The Surrender. Clad in tight latex Jessica sits on a fuck box with a leather collar on her neck awaiting her master’s commands. Muscular and meaty Ricky Larkin takes the lead as Dom when he peels Jessica’s clothes off and squeezes and slaps her breasts, bites her nipples and gets her all worked up for what is to come. He pulls her skirt up to reveal her hard cock and then he goes to town on some deep and thorough ass eating. The aroma of Jessica’s feet seduce Ricky into smelling, licking and biting her smooth arches. He slides an acrylic butt-plug in Jessica’s hole and licks it clean before Jessica begs him for cock. She needs it now and M.r Larkin is excited to give it to her but only under his conditions of course. Ricky spits in Jessica’s mouth and they exchange wet, passionate kisses. Slutty Jessica Fox begs again for his man-meat, she wants it in her mouth. He lets her suck his dick and lick his balls, her cock dripping pre-cum all the while. She gets his cock all slippery with spit so he can fuck her ass. With a mouth gag and arms tied together with bright pink tape Jessica is in doggie with her ass high in the air ready to get stuffed. Ricky’s fat dick fills her ass and he fucks her so good she moans and whimpers with every thrust. He removes the gag and lets Jessica taste his cock, she takes it deep down her throat and gets it all sloppy wet again. Ricky flips Jessica over on her back to pound her hungry ass and it drives her so crazy she begs to cum. She shoots her load high and wide as Ricky continues fucking her tight ravenous ass. This gets Larkin so hot he shoots his hot load all over his little fuck slut and leaves Jessica a quivering beautiful mess. Sometimes it’s best to Surrender.",
  "directors": [],
  "models": [
    {
      "name": "Jessica Fox",
      "person_id": 17013
    },
    {
      "name": "Ricky Larkin",
      "person_id": 35556
    }
  ],
  "release_date": "2019-12-03",
  "scene_id": 45261,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "big dick",
    "black hair",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Collar",
    "Feet",
    "Gag",
    "Latex",
    "Latinx",
    "Leather",
    "Male Fucks TS",
    "master",
    "mixed",
    "Muscle",
    "muscular",
    "natural boobs",
    "Role Play",
    "shaped",
    "smooth",
    "spit",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "toned",
    "TS",
    "versatile"
  ],
  "title": "The Surrender: Jessica Fox submits to Ricky Larkin"
}