{
  "collections": [
    "TS Seduction"
  ],
  "description": "Beautiful Korra Del Rio is The Naughty Nun in this weeks TSS sinful sexy role-play update.\nAfter witnessing DJ touching himself in Mass Korra relegates DJ to the cold dark basement to fix furniture and learn a lesson about his shameless, disgraceful ways. After admiting to DJ that she saw him masturbating during church service she orders DJ to read from the bible to find salvation from his wickedness. As he is reading bible verses Korra peels off her black and white habit to reveal a very sexy lace teddy, black thigh high stockings and garter. DJ doesn't know what's going on! Sister Korra is confronting DJ with his petty disgusting fantasies and will lead him to redemption by being his vessel to absorb all of his sick sexual perversions in the name of the Lord. Korra tells DJ to take off her black patent leather high heel shoes and smell her feet. He peels off her nylons and licks each and every tantalizing toe of Sister Del Rio and then she pulls her cock out for DJ to let loose on. All the sins and lies trapped in his throat need to be plunged out with some deep throat cock sucking. She spreads her long legs wide and DJ swallows her hard dick right up. Korra takes her firm inviting breasts out of her corset while DJ gets down and dirty on her dick. Now he is on his back in the stocks with a blindfold on so he can't see anything. This dirty little sinner is ready to get all of his evils forgiven so Korra punishes this bad boy with the zapper and some firm paddling on his butt. She crawls up on top of his face and slides her cock in his mouth and rubs her balls all over his greedy mouth. Sister Del Rio tells depraved DJ she is going to fuck him so hard he is never gonna want to sin again. And sure enough she sticks to her plan. After fucking his face she gives him a little taste of heaven by eagerly eating his ass. She jerks his cock while licking his asshole and DJ is loving it. Korra's bright red diabolical lipstick smears all over his ass and thighs and he can't get enough from this Naughty Nun. Now that his ass is wet and slippery she fills him up and fucks his sin hole into submission. DJ moans and pleads and begs for her to cum all over him and finally she squeezes her lusty load out on his face. Redemption at last!",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "DJ",
      "person_id": 20225
    },
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    }
  ],
  "release_date": "2019-11-26",
  "scene_id": 45262,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Corset",
    "Feet",
    "Foot Worship",
    "foreskin",
    "Hairy",
    "Leather",
    "muscular",
    "natural boobs",
    "Role Play",
    "shaped",
    "slim",
    "Stocks",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male",
    "white",
    "Zapper"
  ],
  "title": "The Naughty Nun: Korra Del Rio Punishes Disgraceful Sinner DJ"
}