{
  "collections": [
    "TS Seduction"
  ],
  "description": "In a remote field of tall dry grass, inside a run-down shack, dressed in all tight latex, Natalie Woods readies her frightened captive, Dillon Diaz who is lying on his back, bound completely in plastic wrap except for his hard cock and his head that stick out. His eyes are covered in a black wrap and a red ball gag is stuck in his mouth. Natalie removes the ball-gag and sticks her latex gloved fingers down Dillon’s throat making him gag on them. Natalie bites his hard cock, slaps his balls, and covers them in clothespins. After that, Natalie unwraps him and has him get on his knees to suck her rock hard cock. Dillon takes her whole cock deep down his throat and sucks it well. Natalie lifts her legs in the air and tells Dillon to lick her asshole. He licks long licks from her asshole all the way up to her hard cock and sucks it. She orders him to put a finger in her ass and so he fucks her ass with his thumb while he sucks her cock. She puts a dildo gag in his mouth and makes him fuck her ass with it. After Natalie gets her ass fucked well with the dildo-gag, she has Dillon get on his knees. She sinks her rock hard cock deep into his asshole and fucks it. She flips him over onto his back and spreads his big muscular legs, and once again begins pounding his hole. She sits on his face and smothers his mouth and nose with her asshole while she strokes his cock. She strokes his cock and makes him cum with her hands. She collects his sperm into a specimen jar, just before unleashing her own hot load across his face.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2019-11-12",
  "scene_id": 45260,
  "tags": [
    "Anal",
    "Ball Gag",
    "Blowjob",
    "Brunette",
    "Clothespins",
    "Cock Worship",
    "Dildo",
    "Gag",
    "Latex",
    "muscular",
    "natural boobs",
    "Role Play",
    "slim",
    "Straight",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Latex Predator: Natalie Mars Captures and Fucks Dillon Diaz"
}