{
  "collections": [
    "Str8Hell"
  ],
  "description": "In part one of a Duty Bound Dream Set with Patrik Maly, Ivan Mraz, Libor Kenda and Laco Meido we find Ivan strapped to a bench. Patrik and Laco are brought in by Libor to given them some instruction. Ivan is under instruction not to reveal information and Laco and Patrik need to extract it from him. They start off by tickling Ivan, who wriggles around. Libor tells them to do it harder and Ivan moans as they work on his torso. Laco is told to cover Ivan's mouth to limit the noise he makes. When tested Ivan refuses to reveal information, so Patrik and Laco are instructed to start slapping him. Ivan moans as they hit all over his body. Patrik and Laco are then instructed to strip to the waist then Laco is told to use a whip on Ivan as Laco gags his mouth with a hand. Ivan keeps on moaning as he feels the whip on his chest. A bar gag is inserted into his mouth and his punishment continues. Libor has more planned and tells the guyso to get their cocks out and slap Ivan with them. They hit the hard cocks again his body and then remove his gaga. Patrik slaps Ivan's face with his stiff cock and Laco pulls down the prisoner's shorts. Still Ivan want speak, so Laco's stiff cock is shoved into his mouth. He has to suck on the cock, then Ivan's shorts are removed, leaving him naked and his cock is hard. Patrik abuses Ivan's cockand balls ad Laco feeds his cock into the mouth again. Then Laco and Patrik change places. Ivan has to suck on Ivan's dick then they release his ankles and raise them in the air, to expose his ass. Laco starts to finger that ass and then shoves his cock in the hole. He fucks Ivan's ass nice and deep as Patrik holds his legs up. Ivan moans as he takes the big dick in his ass. Patrik and Laco swap places and Patrik fucks that ass before they swap again. The keeps swapping until Libor tells them to dress again as Libor has to decide which of them will be offered promotion.",
  "directors": [],
  "models": [
    {
      "name": "Ivan Mraz",
      "person_id": 60765
    },
    {
      "name": "Laco Meido",
      "person_id": 61376
    },
    {
      "name": "Libor Kenda",
      "person_id": 61728
    },
    {
      "name": "Patrik Maly",
      "person_id": 61777
    }
  ],
  "release_date": "2019-10-03",
  "scene_id": 45275,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "bit gag",
    "blond",
    "Bondage",
    "brunet",
    "Flogging",
    "foreskin",
    "Gag",
    "Gangbang",
    "Gay",
    "Leather Cuffs",
    "Slapping",
    "thirdparty",
    "Tickling",
    "white"
  ],
  "title": "Patrik Laco Libor and Ivan - DUTY BOUND PART 1"
}