{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Barbara Bieber needs to get fucked rough but it's not often that she gets it. The porn shoots she does are vanilla, and most civilian men are pussies. It's a complaint / frustration we hear from our SubSluts all too regularly. Which is why it's always a pleasure to service these fine women with a day's bump-and-grind for PSS, and have them leave our company afterwards with a radiant smile lighting up their faces. Ms Bieber was not disappointed. She was roughed up and abused good and proper. In the scene she plays the horny girlfriend of the bloke who owns the flat. She's heard about us shooting and taken it upon herself to pop in to see if all's ok. She keeps on sticking her arse out in a way that suggests that there may be an ulterior motive to her visit, a hunch which is checked out and proven to be correct. The bitch gets spanked in no time and from there on in basically freaks her way through a series of orgasms, getting properly fucked and used, until Pascal shoots in her mouth and commands her to swallow. It's exactly what the doctor ordered. Prescription:\n- Vaginal fucking\n- Physical & verbal domination\n- Deepthroat & face-fucking\n- Face-slapping & spitting\n- Choking\n- Spanking\n- Cumshot (CIM & swallow)",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Barbara Beiber",
      "person_id": 62354
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2019-10-03",
  "scene_id": 45282,
  "tags": [
    "Athletic",
    "big dick",
    "brunet",
    "Choking",
    "Collar",
    "Deepthroat",
    "Doctor",
    "Domination",
    "Facefucking",
    "Facial",
    "Flogging",
    "foreskin",
    "Hand Gagging",
    "Leather Cuffs",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Straight",
    "Sub",
    "Swallow",
    "thirdparty",
    "white"
  ],
  "title": "Barbara Bieber: Flat Owner's GF Wants Some Action"
}