{
  "collections": [
    "Hogtied"
  ],
  "description": "Angela White is a beautiful Australian bombshell who has taken the adult industry by storm. She has explored her sexuality in every possible way, and has chosen The Pope as the one that she will explore BDSM with. She began her journey almost 2 years ago with him and looks forward to every encounter. Today begins with Angela in a partial suspension with on leg tied up as she twirls in circles waiting for The Pope to arrive. As soon as he touches her we see Angela melt and become very sensual with her actions. It's no secret that she absolutely loves everything about shooting with him, and she's willing to do whatever it takes to feel his touch. She's a playful creature, and The Pope knows exactly how to handle her. Angela has to endure some crop action to her pussy, feet and more, to prove her worthiness for him to allow her to cum. Next we find Angela in another partial suspension, but this time it's more of a doggy position, and she is still spinning. This time, Angela suffers more with a nice assault to her feet with some bastinado. She is pushed to her breaking point and then he fucks her so hard that she can barely contain herself. Scene 3 begins with Angela being hoisted into the air in a traditional hogtie suspension. This one is difficult for her, so The Pope comes in and begins to rip orgasms out of her to get her through the scene. The orgasms come fast and Angela cannot believe that she is cuming so much. She begins her final scene in a chair with her legs spread wide, and her neck tethered to a point above her head. Her nipples are his target and he pulls her put of the chair with the intensity of the pain. A couple of clothes pins are added to maintain the pressure as he moves on to other torment. Angela has to suffer through the zapper attacks just to get her final orgasms, but when she cums the whole world feels it!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Angela White",
      "person_id": 60688
    }
  ],
  "release_date": "2020-01-02",
  "scene_id": 45284,
  "tags": [
    "BDSM",
    "Big Tits",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Couple",
    "Crop",
    "Curvy",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "the chair",
    "The Pope",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "Angela White: Complete Submission to The Pope"
}