{
  "collections": [
    "Device Bondage"
  ],
  "description": "Ashley Lane is no stranger to BDSM, or to The Pope. They have a long history of working together, so he knows how to get in her head. Ashley is locked into the first position on her knees, with every part of her body restrained with cold steel. She's exposed and vulnerable, and she knows that The Pope is going to exploit her circumstances to his advantage, but she doesn't know exactly how. Her flesh is warmed up with a heavy leather flogger that turns it a bright shade of red. He kneels down to let her know that it is only going to get worse from this point forward, and this is the first time we see Ashley quiver from fear. Fluffy the dragon tail makes a rare appearance and is used to mark her skin with brutality. This is an implement used only when the model can be marked, because of its menacing touch. To up the intensity, The Pope breaks out a knotted leather tail flogger that pushes Ashley to the edge, but he knows what he's doing, and he dances that fine line between conquering her and breaking her. At this point, even the vibe is tormenting her, and he uses it to push her even further, before bringing Fluffy back to hammer home his sadistic intent. Scene two begins in the same fashion, with brutal attacks on her flesh, and The Pope doing everything in his power to mind fuck her. The dungeon fills with her screams of agony, and we wouldn't have it any other way. If we were to describe everything that he does to her it would take too long. Just know that Ashley is put through the closest thing to \"hell on earth\" that she has ever felt. Her mind and body are brutalized in the most extreme shoot to date with The Pope. Prepare yourself, as this is not for the faint at heart; this is one of the most extreme shoots in the history of Device Bondage.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    }
  ],
  "release_date": "2019-12-26",
  "scene_id": 45286,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "mind fuck",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "The Pope",
    "white"
  ],
  "title": "Ashley Lane: Pain Slut Brutally Tormented in Device Bondage"
}