{
  "collections": [
    "Hogtied"
  ],
  "description": "It's Christmas morning and Kristen Scott is at home, starting her day with some coffee. Her festive spirit is jovial, as she moves through her home getting ready to open presents. She settles on her first choice: a gift from a friend who knows exactly what would make her smile. She opens it to find a sexy red nightie, that she quickly decides to try on. There's a knock at the door, so Kristen grabs her robe and goes to see who it is. Merry Christmas! She has a special delivery on Christmas day, and the delivery man is asked to come in to join her for coffee. From here on out, things get a little uncomfortable for the delivery guy, but that doesn't stop Kristen form doing what she wants with the situation. But Kristen soon finds the tables turned, as she's tied up and put at the mercy of the delivery guy. First, she's sitting in a chair in the middle of her living room as he rummages through all of her stuff, looking for the perfect way to torment her on this special day. She is gagged, clamped, shocked and made to cum against her will. This is just him getting warmed up, because he has her for as long as he wants, and he's going to take full advantage of this situation. Next he enjoys her body with some traditional OTK, or as most know it as over the knees spankings. After exploring her body and pussy, and making her cum more than she thought possible, he's ready to change things up a bit, and Kristen can't wait. Kristen is on her back with her legs spread and a cat-o-nine tails is introduced. She trembles under the distress of torment from him, but still craves more of his sadistic touch. Orgasm after orgasm are ripped from her pussy, and her entire body shakes as she gives up her most precious commodity. The delivery guy has had all that he wants of Kristen, and leaves her there tied up and able to reflect on her best Christmas ever.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kristen Scott",
      "person_id": 60734
    }
  ],
  "release_date": "2019-12-19",
  "scene_id": 45283,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "christmas",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Kinky",
    "natural boobs",
    "OTK",
    "Rope Bondage",
    "slim",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Deviant Delivery: Kristen Scott Gets Holiday Torment at Home"
}