{
  "collections": [
    "Device Bondage"
  ],
  "description": "Ariel X and The Pope have known each other for a long time, and things get more intense every time they meet. Ariel begins shackled to the wall with her legs spread and her arms pulled up, to ensure we get to see those glorious muscles flex when The Pope hurts her. Her body is abused in a way that only he knows how to do, and she cannot get enough. The orgasms are just as powerful as the torment, so right away, the pace is set for the day! Ariel soon finds herself bound in a doggy position that now shows off her perfect back side. The Pope works his way through several implements before choosing to use his hand as the preferred weapon of ass destruction. He switches gears for a moment, and issues a brutal bastinado. Then he moves the cane to the rest of her flesh and gives her some beautiful cane marks. The orgasms continue, and we get one of the most brutal spankings in DB history. Ariel keeps begging for it to be harder, and The Pope doesn’t disappoint. It’s time for the final scene and Ariel is on her back with her legs pinned back and her feet up in the air. He dishes out more torment before fucking her ass and pussy at the same time. We don’t get to see double penetration often on Device Bondage, so this is a huge treat. And since it’s Ariel X’s gorgeous holes getting DP’d, it’s just that much better.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    }
  ],
  "release_date": "2019-12-12",
  "scene_id": 45285,
  "tags": [
    "BDSM",
    "body builder",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Destruction",
    "Domination",
    "Double Penetration",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "The Pope",
    "the wall",
    "white"
  ],
  "title": "Ariel X: Body Builder Double Penetrated in Diabolical Devices"
}