{
  "collections": [
    "Sweet FemDom"
  ],
  "description": "Colby Jansen committed a financial crime that robbed money from a feminist organization. He’s at home, bragging to his buddy on the phone about it when Penny Barber appears in his kitchen, looking for justice.\n\nPenny tells Colby that she is going to get everything she needs to get her organization’s money back, and he’s going to give it to her. Her methods are a mix of seduction, ball squeezing and keeping Colby on the edge of orgasm until he breaks and tells her how much he stole, where his safe is with all the evidence, and the combination.\n\nWhile she’s working on him he begs her to stop squeezing his balls. She sucks and strokes his cock along the way also making him beg to cum. “If you tell me what I want, I’ll fuck you…”,”I’ve done this before, you’ll break eventually…”\nShe sucks the cum out of his cock then crushes his balls in hand putting him out.\n\nColby Jansen comes to in his living room laying over a weight bench. Penny Barber is standing over him with a pink strap-on cock on. “I told you I’d fuck you if you gave me what I wanted…”\n\nColby begs her not to fuck his ass. She smiles and makes a deal with him. “I could get the police involved, have you arrested, and put in prison where you’ll get your ass fucked every day by sweaty inmates, or…,You can just take my cock right now. I’ll take you back to our feminist compound where we keep bad boys like you to be used forever for whatever we desire…”\n\nColby has no choice. He doesn’t want to go to prison. Before he can decide she slides her cock inside him. At first it hurts, but he soon starts to enjoy it. “Come on Colby! What’s it going to be? Get fucked by me and my feminist friends or get fucked by Bubba in prison?”\n\nHe eventually breaks and agrees to leave his life and come with her to be a sex slave.\n\nWeeks have passed. Colby is laying naked in the feminist compound awaiting his next task. Penny struts into the room. She wants to use his mouth and dick to make her cum a few times.\n\nShe rides his face in her pantyhose and miniskirt, then rips her pantyhose open and places her wet pussy on his tongue. Penny has a few big orgasms, then tells him she needs his cock.\n\n“You can’t cum Colby. If you do, I’m having you assigned back the strap-on line up. I’ve got a line of dominant women eager to use their new gigantic strap-on cocks on you. You don’t want that, but I’d actually enjoy watching…”\nPenny orders Colby to fuck her hard. He tries as hard as he can not to cum while fucking her hard from behind. Every time he has to stop fucking her to keep from cumming she yells at him to keep going. Eventually he can’t take it anymore and explodes a load of cum all over her torn pantyhose covered thighs.\n\n“Looks like you’re about to get your ass fucked…”\n\nPenny smiles and leaves him to await his next task.",
  "directors": [],
  "models": [
    {
      "name": "Colby Jansen",
      "person_id": 34457
    },
    {
      "name": "Penny Barber",
      "person_id": 6664
    }
  ],
  "release_date": "2019-10-11",
  "scene_id": 45294,
  "tags": [
    "big dick",
    "blond",
    "Brunette",
    "Facesitting",
    "Femdom",
    "Hairy",
    "muscular",
    "natural boobs",
    "Pegging",
    "Slave",
    "Straight",
    "Partner Studio",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Feminist Assassin Enslaves Colby Jansen"
}