{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The Upper Floor's Halloween Sadists & Swingers Ball is to be served by two trained house sluts, Chloe Cherry and Ana Foxxx. Governess Aiden Starr is not convinced that Ana is worthy of wearing the full uniform as Ana's service on the The Upper Floor preceded Aiden's rigorous training regime. Aiden sets a simple test for Ana: if Ana can keep the house collar on the tray in her hand through the entire first service session, then she can keep it. But if she drops it, she'll be subjected to brutal whore and service training at the very bottom of the slut pile. So Ana has her hands full, literally. In the meantime, a tightly tied Chloe Cherry can only moan and scream as she has her tight teen body punished for every mistake Ana makes. And Ana's in quite a bind! She's holding a tray, while in an athletic squat, with tight clamps on her pussy and nipples, with Donny Sins throat fucking her with his massive cock. Ana holds on tight for as long as she can while slobbering and working his dick, but gravity prevails and the tray falls. Chloe's feet are held aloft and exposed in her rope shibari, leaving her vulnerable to the barrage of electro zaps. Ana is throat fucked and then pounded from behind as she licks Chloe's cunt ad begs for Chloe to take the dick so she can request more instruction and take her flogging. The scene ends with Chloe taking a glorious pounding in her beautiful pink pussy while reciting the rules for the delighted crowd. Ana is given punishment orgasms on her knees like a filthy little trainee. The crowd is dressed in kinky Halloween costumes and having a wild party with plenty of partner swapping, asses spanked, and sluts earning their Master's cum. The Darko BDSM babes take the shiny new wooden TUF paddle at the hands of their Master Darko, leaving both beautiful masochists gasping with deep red asses. A masked red-headed bondage slut takes a brutal rope suspension, flogging, and relentless orgasms, while another party goer offers her perfect ass for a long and strict caning with a metal rod. When Ana and Chloe return to the floor, it is for Chloe's anal fucking in a doggy rope tie that makes her round ass press deliciously against the ropes. However, Ana again steals the show with her disobedience. The governess discovers Ana has rips in her stocking already, and has Ana lick Chloe's asshole as she personally zaps each of Ana's exposed toes for being out uniform. Ana is already quite sorry for her mistake by the time Donny uses her mouth as a wet service hole, but she is truly apologetic when the Steward traps her clit with a vibrator and Aiden refuses to let her cum. In the meantime, Chloe is enjoying a deep anal fucking in doggy and asking for all her orgasms like a good girl. Ana on the other hand is cumming, and falling over herself, unable to speak since she is so overwhelmed with the vibrator. Sweating, zapped and flogged, she can't stop herself from cumming without permission to the entertainment of the crowd. Aiden laughs in spite of herself and promises Ana that she will pay for each stolen orgasm for the rest of the night. Please join us for the next installment of this incredible celebration of perversion, kink and sexual service.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    },
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2019-11-08",
  "scene_id": 45303,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Bisexual",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Caning",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "fake boobs",
    "Feet",
    "Female Slave",
    "Flogging",
    "halloween",
    "Humiliation",
    "Kinky",
    "master",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Paddle",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Suspension",
    "Swingers",
    "Tattoo",
    "Threesome",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Ana Foxxx Demoted at The Sadists & Swingers Halloween Ball"
}