{
  "collections": [
    "Families Tied"
  ],
  "description": "Jasmine Jae is a gilded trophy wife with a perfect body and silky voice. While she is a grade-A whore, she’s also terrible mother and has deeply disappointed her new crime boss husband by mis-educating his teenage daughter Mackenzie Moss. Mackenzie is a posh little thoroughbred with attitude for days, and she spends those days sitting by the pool waiting for her inheritance while drinking cocktails with her step-mother. Her mobster father is disappointed with both his daughter and new wife, and sends “Uncle Ramon” to teach them a few lessons about discipline, learning, and familial duties. Jasmine immediately knows something is up when she goes to greet the new tutor for Mackenzie, but finds Ramon instead. She can’t help but mouth off to him, who is quick to point out her wifely duties are the only thing that grant her privilege in their criminal family. Before she can flutter her long eyelashes, Ramon takes Jasmine down roughly to her knees, paddling and flogging her perfect curvy ass. As she protests, Ramon presents her with his stiffening cock. Jasmine knows the score and gets to work sucking his dick while suffering through some tight nipple clamps and continued flogging. Ramon enjoys throat-fucking Jasmine and watching her drool on her giant boobs, but he can’t abide the lack of gratitude. Using her bathrobe as a hood, he throws her over the couch and uses her posh pussy roughly, causing her to orgasm on his cock despite herself. This only arouses Ramon’s sadistic ire, and he puts her in iron bondage and fucks her ass and slutty pussy hard while she screams around a ball gag. He leaves her exhausted in bondage and goes to find Mackenzie. Mackenzie is enjoying an afternoon cocktail by the pool, but the mood changes when Ramon tosses out her drink and begins spanking her spoiled ass with a hard cover book. Mackenzie protests but Ramon has been given carte blanche to discipline her. Mackenzie is a quick learner and starts sucking his cock while balancing the book on her ass. But whenever the book falls, Mackenzie is treated to an electro zap or series of spanks. Uncle Ramon gets into his work and bends Mackenzie over, using that teen pussy right and showing her how good rewards can feel. Soon, it’s time to teach mother and daughter how to work together towards Mackenzie’s goals, so Ramon ties both Jasmine and Mackenzie to some school desks in tight rope shibari, and moves between both of them, punishing each for the others misdeeds, leading to Mackenzie’s first zipper orgasm and some very instructive oral service from Mackenzie. Jasmine returns the favor, teaching her teenage brat how to fuck like a champion slut on Ramon’s cock, licking at her step-daughter’s clit as a reward. Jasmine is rewarded for her stewardship with a final rough anal fucking and the chance use Mackenzie’s face to coax cum from Ramon’s cock.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Jasmine Jae",
      "person_id": 59210
    },
    {
      "name": "Mackenzie Moss",
      "person_id": 62135
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2019-11-22",
  "scene_id": 45305,
  "tags": [
    "Anal",
    "Ball Gag",
    "Big Tits",
    "Bondage",
    "bottom",
    "british",
    "brunet",
    "Brunette",
    "Champion",
    "Curvy",
    "Discipline",
    "drool",
    "fake boobs",
    "Family Roleplay",
    "Flogging",
    "Gag",
    "Hood",
    "muscular",
    "Nipple Clamps",
    "shaved",
    "Spanking",
    "Straight",
    "Stud",
    "Tattoo",
    "toned",
    "white",
    "Zipper"
  ],
  "title": "The Power Of Books: Jasmine Jae and Ramon Nomar School Mackenzie Moss"
}