{
  "collections": [
    "The Upper Floor"
  ],
  "description": "In our final installment of the Halloween Sadists Ball, Governess Ana Foxxx is up for some serious discipline at the hands of busty Governess Aiden Starr. Ana has been a sloppy, cum-hungry slut, unable to hold her position, ask for her orgasms, remember the rules, and what's worse is that her uniform is already shredded. Aiden stares with sadistic disdain at Ana's bare feet poking through her torn stockings while Ana wiggles nervously in her tight shibari frog tie. The guests look on with much pleasure as Aiden lectures Ana about the importance of her uniform and offers her a new pair of red and black, submissive-issue stockings... at a price. Ana's torn pantyhose are stripped away, leaving her tender toes vulnerable to cropping and shocks with a zapper. Ana squeals and apologizes, but Aiden moves on to her pert nipples, pinching and biting them until they are swollen and covered with vicious teeth marks. Aiden then applies some brutal metal clamps to both Ana's nipples and labia, pulling them tightly in her hands and she teaches Ana the house rules one final time. Every orgasm Ana will have from here out will only come when she has recited the rules and has a clamp pulled off of her tender bits. Ana screams and sweats through her punishment, and eventually succeeds in delivering her recitation through the suffering painful punishment orgasms. The crowd cheers and claps as she collapses with a new pair of stockings. The party goers find themselves horny from this display and begin working each other over. One latex submissive endures a hard flogging and anal hook, while another submissive is locked in stocks and made to take a strict caning with a metal rod as swingers fuck each other and look on. Gorgeous women are tied and spanked heavily, while others suck cock and take a paddling while having their nipples clamped together in a painful daisy chain. A beautiful femme domme teases her man with a bound face sitting session, and others beg for orgasms from a hitachi as their asses and thighs are beaten red. Stefanos is perturbed to find that Ana has earned her red and black stockings before senior submissive Chloe Cherry. He bring Chloe over and demands that she find her stockings among the crowd while her pursues her with a zapper, and our guest of honor Donny Sins takes her pussy and mouth for fucking. Chloe is a sweet and desperate mess as she crawls through the party, begging for her uniform, finding sadist female party-goers who will give her each garment at a price. Her tits are clamped with wooden pins and she is given a glass to hold on a silver tray and told not to drop it, as Donny rails her from behind. Ana is a crafty little whore, and crawls over to steal the cock, almost sending Chloe's tray crashing to the ground. But Chloe holds tight and manages to keep the dick and her new uniform. Ana is sent to service Donny in an intense reverse cowgirl to earn her collar, but it is Chloe who comes out victorious with a rousing anal fuck, coaxing the cum from Donny and orgasming to the admiring cheers of an impressed party.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    },
    {
      "name": "Chloe Cherry",
      "person_id": 60066
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2019-12-13",
  "scene_id": 45304,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Caning",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "fake boobs",
    "Feet",
    "Female Slave",
    "Flogging",
    "halloween",
    "Hitachi",
    "Humiliation",
    "Latex",
    "master",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Stocks",
    "Straight",
    "Swingers",
    "Tattoo",
    "Threesome",
    "top",
    "white",
    "Zapper"
  ],
  "title": "House-Owned Whores Earn Their Place at The Halloween Fuck Fest"
}