{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "I've been told not to do it. \"You just piss the girls off, Andy,\" they say. \"You can't be all gushing with a model you really like one week and then just standard nice with another one the next week. People notice.\" They're right of course and I have sought to correct my ways. But what about, er... professional observation? Well, we've got a girl for you this week who's never shot porn before, never been properly dommed or BDSM'd, all that stuff, the like of whom I don't think I've shot in my 18 years of being a smut merchant. Candice Banks is a star straight out of the blocks (and I'm someone who believes the term' star' is so overused in porn to have become almost redundant). She loves sex so that's the most important basic thing ticked off. (Her cunt was creaming all the way through the day.) She looks cute and, really important, dirty. She's photogenic and loves posing as a fuck doll, giving killer looks to the camera. She shakes her ass like you won't believe (and I'd bring her back again just for that, and the face I didn't make her do it enough this time round; that and bouncing up and down and Pascal's cock.) She's a little reticent in the chat department but when a girl tells a guy, as she did with P when he was slamming her in doggy, that \"I'm happy you're enjoying me\" then you know it's just a matter of time. And the body's to die for. I don't know, you can't help but let a bit of personal preference creep in. I really dug the way there was a bit of Marylin Monroe going on with her. I love a girl with a bit of 1950s flesh on her. But it's really rare to work with a newbie who flirts with the camera so confidently, who seems, quite literally, to have been born to be a porn star. Professionally speaking, Candice Banks really is the whole package. You're in for a treat. Her fuck it list doesn't come close to doing her content justice: - Vaginal fucking\n- Physical & verbal domination\n- BDSM\n- Orgasms\n- Deepthroat & face-fucking\n- Face-slapping & spitting\n- Choking\n- Spanking\n- Squirting\n- Cumshot (CIM & swallowing)",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Candice Banks",
      "person_id": 62356
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2019-10-16",
  "scene_id": 45317,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blindfold",
    "Bondage",
    "brunet",
    "Choking",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Facial",
    "Fingering",
    "Flogging",
    "foreskin",
    "Leather Cuffs",
    "Slapping",
    "Spanking",
    "Squirting",
    "Straight",
    "Sub",
    "thirdparty",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Candice Banks: A Star Is Born"
}