{
  "collections": [
    "Families Tied"
  ],
  "description": "Aidra Fox is a tight bodied teenager with eyes only for her step daddy, and a major vendetta against his bangin’ new fiancee Syren de Mer. Not only is Syren a big titted anal slut, more than capable of soothing Ramon’s sadistic urges with her big booty and submissive skills, but Adria is also convinced that she’s a gold digger, out for the small fortune that her mother left the family. With Aidra home for the summer, it’s a total psycho-sexual war for the heart and mind of Ramon. After a tense family breakfast, Ramon enjoys a late morning play session with Syren, when he thinks Aidra has finally left the house. He is clearly hungry for his submissive’s curvaceous body and skilled mouth. He wastes no time in clamping her big swollen nipples with tight tweezers and tying her up with her own negligee. Syren is a good domesticated whore, so she drops to her knees to perform an incredible blowjob while being spanked and flogged. When her bouncy ass is nice and red and her tits are covered with drool, Ramon pulls the nipple clamps off of her nipples and puts her into a tight rope shibari hobble bondage. Ramon flogs Syren to drive her into the living room couch in a constricted crawl. Once she reaches the couch he takes his time both her ass and her pussy, fucking them both hard and fast. Syren forgets herself and cums on his cock without permission but after being reprimanded with a swift caning, she makes sure to get his blessing for each anal orgasm after that. When the late afternoon rolls around, Aidra decides to fabricate some evidence for her conspiracy against Syren by stealing money from Ramon’s wallet and blaming it on her future stepmother. It’s a clever attempt to drive a wedge between the happy kinky couple, but Ramon is a smart man and can immediately see that his gorgeous little step daughter is deceiving him. When confronted, Aidra betrays herself immediately and accuses him and Syren of stealing her mothers money. This is an accusation that Ramon can only respond to with a strict spanking. When Aidra refuses to apologize and continues on her tirade against both step parents, they decide to discipline her tight little ass with a good flogging in leather handcuffs. All of Aidra’s flirtation with Ramon has not been merely manipulation and she is clearly turned on and happy when he finally gives in and fucks her wet pussy while shoving her face into Syren’s cunt. Aidra is stripped down, beaten red and fucked senseless while having her mouth used by a grinning Syren. Aidra welcomes the painful administration of some metal clover nipple clamps by Syren, riding her step daddy’s cock even harder so that the clamps pull tightly on her sensitive little nipples. After Adria’s overloaded with orgasms, Syren pushes her off Ramon’s cock and enjoys one final ride before taking Aidra to the floor to show her how to coax a hot load out of her step daddy. If Syren is indeed hoping to command the family fortune, she’ll earn every penny this afternoon.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aidra Fox",
      "person_id": 58677
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2019-12-06",
  "scene_id": 45335,
  "tags": [
    "Anal",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Caning",
    "Couple",
    "Discipline",
    "drool",
    "fake boobs",
    "Family Roleplay",
    "Flogging",
    "Kinky",
    "Leather",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Redhead",
    "shaved",
    "Spanking",
    "Straight",
    "Stud",
    "Tattoo",
    "Threesome",
    "toned",
    "white"
  ],
  "title": "Aidra's Little Games: Aidra Fox Gets Played By Her Slutty Step-Mommy"
}