{
  "collections": [
    "Everything Butt"
  ],
  "description": "When evil step-mother Dana DeArmond finds Whitney Wright's porn collection she grounds Whitney and forbids her to go out to a New Year's Eve party. Whitney is very upset but its going to be more fun at home tonight when big ass sluts Joanna Angel, Dana and Whitney have their own perverted party with plenty of ass eating, anal party favors, dicks on sticks, a champagne enema and more!\nTurns out Dana and Joanna are old college friends so they had lots of crazy ass adventures back in the day. Tonight they will show Whitney how to have a real party! All three hotties are decked out in sexy party dresses featuring their beautiful tits and shapely hips. Dana gets things started by cramming Joanna's face into her big curvy butt and makes her lick her ass and pink slit. Good step-daughter Whitney helps by holding her step-moms ass open so Joanna can drench her asshole with her wet wanton mouth. Dana flips over on her back and both girls go to town eating her slutty ass and pussy. Whitney and Joanna will be real butt sluts by the stroke of midnight! Joanna stretches Dana's ass with a curved metal dildo and makes her very happy. Then out come the party balls! On her hands and knees Dana offers her ass up to Joanna and she inserts a stainless steel ball right up her butt and then she pushes it out like a party trick. Now its Joanna's turn to get her ass dealt with. With legs spread wide open Dana voraciously eats her ass and plays with her perfect tits. She stuffs her ass with a butt-plug and fingers her tight pussy while Whitney vibes her clit until she is screaming and moaning and freaking out. Next Dana slides a see through pillar up Joanna's hole and still wearing her shiny black stiletto heels she cums and cums. Now it's time for some three way action in the form of a lady train. Dana fucks Whitney's tight ass while pounding Joanna's slutty but with a dick on a stick. Everyone is going wild and getting off and heading towards the new year! To top off this epic kinky three way fuck fest Whitney gets a real New Year's treat in the form of a champagne enema. Dana fills Whitney's ass with sweet bubbles and they count down the new year in style until she sprays a sparkling effervescent stream of good times out of her ass! Happy Bubbly Butt Surprise New Year!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Joanna Angel",
      "person_id": 61458
    },
    {
      "name": "Whitney Wright",
      "person_id": 61018
    }
  ],
  "release_date": "2019-12-27",
  "scene_id": 45338,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Ass",
    "black hair",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Enema",
    "Gaping",
    "Kinky",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Petite",
    "shaved",
    "slim",
    "Straight",
    "toned",
    "top",
    "white"
  ],
  "title": "Bubbly Butt Surprise! Dana DeArmond Takes on Two Hot Asses"
}