{
  "collections": [
    "Everything Butt"
  ],
  "description": "Paige Owens has been ordered to clean the dungeon. Her perky tits in a leather harness and her perfect ass in latex has no intention of getting this task done. Clean all the toys in 15 minutes, hell no! Fuck her ass to orgasm sounds like a much better plan. She picks out a pink dildo and starts stretching out her hole. Just as she cums with a toy in her ass and a vibrator on her tight pussy, her mistress steps in. In a full tight black latex dress, Chanel Preston humiliates her anal pet. That is Chanel's hole to stretch and she gets to work. She wants to see that hole gape. She starts with glass dildos and butt plugs and gets a full view of Paige's pink huge asshole. Her stretchy hole is hungry for more gape. A huge dildo on a stick fucks her ass deep and fast. This gets Paige screaming with orgasm and causes her hole to permagape! Her wide open hole is hungry for more, but her mistress demands her turn. Paige goes down for lesbian anal rimming while fucking her mistress with a metal hook. Chanel cums all over Paige before putting oh a giant strap on dildo. She uses her huge cock to fuck Paige hard. Bigger toys, bigger plugs and a huge slink still isn't enough for Paige's huge hole. Finally a speculum is used to stretch Owens' hole to the extreme and gives Chanel a full view.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Paige Owens",
      "person_id": 62346
    }
  ],
  "release_date": "2019-11-29",
  "scene_id": 45336,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "fake boobs",
    "Gaping",
    "Latex",
    "Leather",
    "Lesbian",
    "LezDom",
    "harness",
    "Rimming",
    "slim",
    "slink",
    "Speculum",
    "Straight",
    "Strap On",
    "Vibrator",
    "white"
  ],
  "title": "Wide Open: Chanel Preston Stretches Out Paige Owens' Permagape Asshole"
}