{
  "collections": [
    "Everything Butt"
  ],
  "description": "Ella Nova's car is having engine trouble. She drives into her step sister, Casey Calvert's garage. Casey tells Ella that she'll fix her car, but there's only one form of payment that she'll accept...her asshole. Ella knows the drill and bends over her car's hood. Casey lifts up Ella's short skirt and pulls down her thong panties. She squeezes and spanks Ella's gorgeous round ass, then tells her to wait there as she gathers some toys. First Casey gets out a big metal anal hook attached to a chain leash. She shoves it in her step-sister's asshole and makes her hold the leash handle with her teeth. Casey removes her own shorts and panties, grabs the leash, and puts one leg up on Ella's car. She pulls Ella closer to her and makes her lick her pretty asshole. And with Ella's tongue on her asshole and a vibrator on her clit, Casey cums hard on Ella's face. Casey removes the hook from Ella's ass and replaces it with a big metal dildo. She fucks her ass with the metal toy, pops it out, and puts it right in Ella's mouth to taste her own ass. Casey tells Ella to turn over and spread her legs. Casey gets a big clear glass plug called The Pillar and sinks it into her step sister's ass, creating a window for us all to see her pretty pink insides. After that, Casey gets the biggest dildo she has and strap-on fucks Ella with it, popping it in and out, gaping her used hole. Next Casey Calvert has Ella squat down on top of big black cone shaped butt-toy. Ella sits on the toy, taking as much as she can in her ass while Casey chokes her from behind. Just when Ella thinks its over, Casey gets out the slink. She has Ella spread her legs and she slides the entire twenty-four inches of slink inside Ella's asshole, and Ella cums again. For the grande finale, Casey shoves her whole fist inside Ella's asshole and Ella cums hard for the last time while getting fist-fucked by her step sister.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Ella Nova",
      "person_id": 51866
    }
  ],
  "release_date": "2020-01-10",
  "scene_id": 45337,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Gaping",
    "Hood",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaped",
    "shaved",
    "slink",
    "Straight",
    "Tattoo",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Rear Ended: Ella Nova Gets Her Ass Stretched By Casey Calvert"
}