{
  "collections": [
    "Bound Gods"
  ],
  "description": "“Just as Alexander catches his breath, he unleashes an overwhelming gasp as he feels his Master’s cock plunged into his tight hole,” Damon Heart reads aloud, licking his lips. His night at home is quickly turning into a steamy masturbation session. He groans, imagining what it would be like to be taken by a rugged leather dom. He jerks off and falls asleep, awakening to find himself bound and gagged on his knees at the mercy at the chiseled leather god Michael Roman. Michael runs his hands along Damon’s bare flesh. Damon looks up at Michael, a little scared and helplessly turned on. Michael gives his face a couple slaps and spits on him before commanding him to sniff his hard cock through his leather pants. Damon takes in the scent of Michael’s warm leather as his tongue drags along the outline of Michael’s hard cock. Michael laughs and clamps Damon’s nipples, arms, and tongue with medical forceps. Damon moans, drooling in himself as Michael edges him. He begs to cum and is denied by his cruel leather god. Next, Damon is suspended upside down. Michael lets Damon taste his hard cock before grabbing a flogger to tenderize his meat. He hits Damon’s chest, back, and firm ass. Damon grunts as Michael sets a relentless pace. Michael gives Damon’s ass firm spanks with his gloved hand. Damon’s cries and tight ass are turning him on. He shoves his cock into his boy’s mouth and fucks that wet hole. Next, Damon is blindfolded and tied in a stress position with his ass out. Michael crops that ass red and places clover clamps along his boy’s balls. Damon screams as the metal clamps his sensitive flesh. Michael resumes cropping, commanding Damon to shake his balls. Finally, Michael sinks his hard cock into Damon’s ass. Damon moans as Michael takes his ass, fucking his tight hole. He can’t think of help but feel as lucky as Alexander from his novel as Michael pounds into him. Michael jerks off on his boy’s face with a gloved hand before jerking off Damon for being such a good boy.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Damon Heart",
      "person_id": 62074
    },
    {
      "name": "Michael Roman",
      "person_id": 61574
    }
  ],
  "release_date": "2019-12-05",
  "scene_id": 45345,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clover Clamps",
    "Corporal Punishment",
    "Couple",
    "Domination",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "masturbation",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "white"
  ],
  "title": "I Dream of Leather: Damon Heart Submits to Leather God Michael Roman"
}