{
  "collections": [
    "Bound Gods"
  ],
  "description": "Logan Stevens brings his big, thick dick back to Bound Gods, and he couldn’t ask for a better fuckhole than ripped stud Casey Everett. Logan has captured Casey from baseball practice and has him locked up at home, ready to use at just the right moment. When Logan’s busted old TV no longer works, it’s time to take Casey out of his little prison. Logan immediately puts him in his place, ripping him out of his jersey and cutting him out of his uniform pants. Casey’s tanned abs heave as he breathes heavily through a ball gag, unaware of exactly what awaits him. Logan removes the gag, and immediately shoves his fat dick into Casey’s mouth. Casey resists, but he can’t hide his enthusiasm for taking that hard wet cock as deep as it’ll go. Logan suspends him upside down, at just the right height and angle to literally fuck Casey’s throat. Casey’s blindfolded and bound, so Logan can spin him around to swat his ass and eat his hungry hole, then spin him again to keep fucking that sweet throat. Casey is now completely primed, eager and hungry to get his ass fucked by that hard, soaked cock. He’s fitted with a bit gag, and tied to a broken old sofa, with his legs held apart by rope bondage around his knees and ankles. But before he gets that cock, Logan torments him with a multiple-filament electro toy. The current that flows through it jumps in unpredictable ways, shocking Casey again and again, causing him to yelp and jump as he struggled to get away from it. Logan uses the implement to torment Casey’s feet. Then, when he’s fully used in every other way, Casey finally gets his beautiful ass fucked full of hard cock. Logan’s long dick slides deep into Casey’s hole, fucking him in full strokes, penetrating him again and again, as deep as that ass can take. Casey can hardly contain himself. He moans with uncontrollable pleasure as Logan plows him. Casey shoots his load all over himself, almost by surprise. But Logan keeps on slamming his ass, fucking his slutty hole until he’s ready to cum. He blows his huge load all over Casey’s face. Logan removes Casey’s gag, and orders him to clean his cum off his cock.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Casey Everett",
      "person_id": 60450
    },
    {
      "name": "Logan Stevens",
      "person_id": 39184
    }
  ],
  "release_date": "2019-11-14",
  "scene_id": 45342,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "bit gag",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "foreskin",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "Tattoo",
    "unshaved",
    "white"
  ],
  "title": "Extra Innings: Casey Everett Abducted and Fucked by Logan Stevens"
}