{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "After another unsatisfying night alone Nenetl Avril finds total fulfillment in a kinky Gangbang Fantasy! During her cab ride home Nenetl plays with her pussy in the back seat and fantasizes about getting slapped, choked, tossed around, fucked, used up and all her slutty holes filled! In her delicious gangbang \"fantasy\", which really happens, John Johnson, Tommy Pistol, Ramon Nomar, Eddie Jaye and Donny Sins are the 5 big hot cocks that fill Nenetl up air tight. Starting with a round of solid cock sucking Nenetl goes from dick to dick sucking and choking back and forth until her make-up is running down her face and she is begging for more cock.\nThese boys man handle Nenetl in the best way slapping and cropping her tits and tender thighs, pulling her hair, teasing her pussy and getting her all hot and bothered. So much cock for one girl but Nenetl is more than willing to take them all. With her hands tied behind her head and a strict rope breast harness Nenetl gets whacked with the flogger and keeps sucking those big hard cocks until its time to get fucked. With her legs tied back on a bondage ladder each dude takes turns fucking her pussy with stiff dicks making her eyes roll back in her head. This dirty slut just cant get enough. Along with all this sweet schlong she gets the vibrator on her clit and begs to cum cock after cock. Next the crop turns her skin bright pink and each and every guy pounds that ass until she is going crazy. Now on a fuck box with a dick in her mouth, cunt and ass Nenetl is air tight! This horny slut is getting all her holes filled making her cum and cum again until all 5 guys shoot their hot loads all over Nenetl's filthy whore face. Ahh finally satisfied.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Nenetl Avril",
      "person_id": 53654
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2020-01-08",
  "scene_id": 45340,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "bukkake",
    "Choking",
    "Corporal Punishment",
    "Crop",
    "Double Penetration",
    "Gangbang",
    "Kinky",
    "Latin",
    "masturbation",
    "mixed",
    "muscular",
    "natural boobs",
    "harness",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Slapping",
    "Straight",
    "Stud",
    "Tattoo",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Nenetl's Gangbang Fantasy"
}