{
  "collections": [
    "Men On Edge"
  ],
  "description": "Kinky Viktor has dreamed about getting edged by KinkMen for a long time, and today that dream comes true. Sebastian Keys and Alex Hawk team up, tie him down, and work his hard, pierced cock, again and again. They tickle his feet, pits and ribs, they blindfold him, gag him, suspend him, and fuck his ass with a dick-on-a-stick, edging him all day until his solid cock explodes with cum. Viktor starts blindfolded and gagged, with his body strapped to a pipe rack, held in place by leather bondage. Sebastian and Alex tease him and his nipples, rubbing his cock through his underwear, stimulating him with hands and tongues, a vibrator and clothespins. His dick gets hard so damn fast, even Sebastian is impressed. Immediately they get to edging this greedy fucker, working his cock until he nearly cums right away. They suck his dick, stroking it while it’s dripping wet, bringing to the edge again, all while he’s strapped in and immobile. Later he’s bound to the floor on his back, with a bit gag in his mouth, as they continue to work his cock. They tickle him relentlessly, while continuing to edge him, worship his feet, and prod his hole. Sebastian shoves a lubed up dick on a stick into his sweet hole, and fucks him with it while Alex works Viktor’s cock. As he gets closer, they haul him up into a partial suspension, with his back arched and his dick sticking straight up. Alex sucks his cock, working him harder and faster, until Viktor can no longer hold back. He shoots a huge, hot load, with fat ropes of cum spouting from his engorged cock into the air as he convulses and screams.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Kinky Viktor",
      "person_id": 47699
    }
  ],
  "release_date": "2019-12-10",
  "scene_id": 45349,
  "tags": [
    "Athletic",
    "BDSM",
    "bit gag",
    "Blindfold",
    "Bondage",
    "brunet",
    "Clothespins",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Kinky",
    "Leather",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "rack",
    "Rope Bondage",
    "shaped",
    "Straight",
    "Sub",
    "Suspension",
    "Tattoo",
    "Tickling",
    "Vibrator",
    "white"
  ],
  "title": "Kinky Viktor: New Sub Bound, Roped, Edged and Shoots A Fat Load"
}