{
  "collections": [
    "Bound Gods"
  ],
  "description": "Sebastian Keys takes full control of two slaves, Tony Orlando and Sherman Maus, and pits them against one another in a competition where they face their fears head-on. He first strips them of their clothes and their names, assigning them their slave numbers, before putting them to their first task: who can get hard first while wearing pinching nipple clamps. The winner gets his big fat dick sucked by the loser, but he doesn’t get to enjoy it for long. The next challenge comes up fast. They have clamps added to their balls, and they’re flogged, single-tailed, and cattle prodded. Next they’re both gagged, as Tony is lifted into a high, full suspension. Sherman is bound to a wooden chair with weights added to his balls while candles drip hot wax all over his body. The two slaves are tormented brutally with the single tail and crop. Tony has clothespins added to his body, his face and his tongue, then they’re smacked off with the crop. They’re then hooded, put on their backs, and fucked with gigantic slinks, to see who can take the most. The final competition is to see who can cum first while riding a dildo-mounted sybian. This is no small task, considering everything they’ve been through. And when they finally get release, it’s explosive.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Sherman Maus",
      "person_id": 62063
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2020-01-02",
  "scene_id": 45347,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Gay",
    "Hot Wax",
    "Humiliation",
    "Male Sub",
    "master",
    "Nipple Clamps",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Single Tail",
    "Slave",
    "Submission",
    "Suspension",
    "switch",
    "Sybian",
    "Tattoo",
    "versatile",
    "Weights",
    "white"
  ],
  "title": "Face Your Fears: Tony Orlando and Sherman Maus Confront Their Torment"
}