{
  "collections": [
    "Bound Gods"
  ],
  "description": "Grayson Frost is naked, gagged and restrained on his knees in unyielding device bondage. His hands are bound behind his back and his cock is encircled by a conductive cock ring connected to a small tens unit. Dressed in head to toe leather, Alex Killian enters eager to play with today's meat. Grayson looks up at Alex as Alex runs his gloved hands along Grayson's chest and pierced nipples. He turns on the tens unit, sending electricity pulsating around Grayson's uncircumsized cock. Grayon's cock jumps as Alex quickly ramps up the intensity. Smirking, Alex begins to flog Grayson's stomach and cock. Grayson moans as the hits fall harder and harder on his sensitive cock. All Grayson's flinching and moaning is making Alex hard. He removes the bit gag from Grayson's mouth and replaces it with his rock hard cock. Grayson eagerly devours every inch as Alex fucks his face. Next, Grayson is blindfolded and restrained on all his knees and elbows. Alex spanks Grayson's ass as he wraps a hand around Grayson's cock. Grayson loves feeling his Sir's hand around his cock and is soon thrusting his hips, begging to cum. But Alex isn't done with Grayson yet. He single tails Grayson, leaving pretty pink marks across his ass. Grayson yelps as the tail falls over and over again. Satisfied his slut is taking the pain so well, Alex smacks the marks on Grayson's ass and lets Grayson suck his cock again. He drives deeper and deeper into his slut's warm mouth. Then he puts Grayson on his back with his ankles and wrists in stocks. He pulls out his hard cock and pushes it into Grayson's tight ass. Grayson groans as his Sir stretches him open. Soon he's begging to cum as Alex gives his asshole a hard pounding. Luckily for Grayson, Alex is feeling generous and jerks him off as he fucks him. Then Alex blows a big load all over Grayson's face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alex Killian",
      "person_id": 62000
    },
    {
      "name": "Grayson Frost",
      "person_id": 59557
    }
  ],
  "release_date": "2019-11-21",
  "scene_id": 45344,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "bit gag",
    "blond",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "foreskin",
    "Gag",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Pain",
    "Pierced Nipples",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stocks",
    "Submission",
    "switch",
    "Tattoo",
    "Tens Unit",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Grayson Frost Whipped and Fucked by Alex Killian"
}