{
  "collections": [
    "Bound Gods"
  ],
  "description": "It's time to play and Cesar Xes is Ace Rockwood's Perfect Little Bitch Boy. Can Cesar handle Rockwood's demands? This filthy fucking slut slave is hard from the start and certainly eager to please so he's up for the challenge. Clamped into a metal collar and chain leash Ace drags Cesar around the room checking him out see if he is capable of serving properly. He makes Cesar play with his own asshole while he punishes him with the crop. Rockwood's tight leather pants conceal his huge cock and Cesar is excited to get down to business sucking dick. With nipple clamps and clover clamps tight on his nuts Cesar finally gets his chance and Ace is happy with his little bitch boys cock sucking skills. Cesar is proud and appreciative to be sucking his masters dick so he polishes it up real good but Cesar needs more discipline. Deprived of sight with a leather head mask on Cesar is on his hands and knees scrubbing the dungeon floor with a toothbrush. Ace needs this little piece of scum to scrub the floor clean so he uses the zapper to motivate him with electricity. Cesar works hard for his master while Ace tongues his slave's slutty little asshole and strokes his cock. Cesar's cleaning is just not cutting it so Ace restrains him in stocks with a mouth gag and gives him hell with the flogger. Now tied up onto a metal device wearing a latex gas mask Ace Rockwood's thick cock is deep inside Cesar's captive ass. Ace teaches Cesar to take his masters dick and learn his place beneath him. With nice long strokes Ace pounds his slaves tight bitch ass until he shoots his powerful load all over Cesar's covered face. And because Mr. Rockwood wants to see his subs cock cum he jerks him off real good and then puts his filthy fucking slut slave back to work on the dirty floor!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Ace Rockwood",
      "person_id": 62055
    },
    {
      "name": "Cesar Xes",
      "person_id": 60954
    }
  ],
  "release_date": "2019-12-12",
  "scene_id": 45346,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "Clover Clamps",
    "Collar",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Domination",
    "dungeon",
    "foreskin",
    "Gag",
    "Gay",
    "Humiliation",
    "Latex",
    "Latin",
    "Leather",
    "Male Sub",
    "Mask",
    "master",
    "Nipple Clamps",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Stocks",
    "Submission",
    "Zapper"
  ],
  "title": "Cesar Xes is Ace Rockwood's Perfect Little Bitch Boy"
}