{
  "collections": [
    "Sweet FemDom"
  ],
  "description": "Cleo keeps Lance Hart locked in a warehouse so she can come use him whenever she pleases. She does all kinds of terrible things to him, but today she is going to make him squirm on her strap-on while she fucks his brains out.\n\nShe always dresses sexy for the occasion, because she knows it drives her little slave crazy.\n\nLater on, Cleo returns to Lance. Now he is strung up from the ceiling naked. She is wearing a sexy bunny costume with black pantyhose and heels. She struts up to him and toys with him a little bit, then she slides her big strap-on cock up his ass and smiles.\n\nCleo fucks Lance sweet and hard, making him moan. She loves watching him squirm for her. She starts to toy with his cock. He thanks her, but she just giggles. She gets him begging to cum, then stops and leaves him hanging from the ceiling, fucked hard with blue balls.\n\nCleo returns to Lance again. She is still wearing her sexy bunny outfit. It’s finally time to extract his cum and empty his full blue balls…\n\nCleo slides her sexy pantyhose covered thigh between his legs. Then she turns around and bends over, rubbing her perfect ass against his hard throbbing cock. She makes him lick his pre-cum from her fingers while she toys with him. Cleo takes her time stroking his cock lightly while he squirms and begs for release.\n\nShe finally squeezes his balls and makes him blow his load all over her bunny outfit. She smiles and leaves him hanging.",
  "directors": [],
  "models": [
    {
      "name": "Cleo",
      "person_id": 62270
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    }
  ],
  "release_date": "2019-10-22",
  "scene_id": 45350,
  "tags": [
    "Athletic",
    "Big Tits",
    "brunet",
    "Brunette",
    "Femdom",
    "Pegging",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "switch",
    "Partner Studio",
    "versatile",
    "white"
  ],
  "title": "Cleo and Her Fuck Slave"
}