{
  "collections": [
    "Sexual Disgrace"
  ],
  "description": "I was surprised to see my Master again. I suppose I must move further away. His slave and anal sex training is difficult to endure. He would probably find me anyway. This time he chained me down on top of a tormenting sybian. The twirling cock and rapid vibration kept my entire body tense, causing orgasm after orgasm. I’ve never cummed so much in my life before. His dick deep down my throat only helped to make me cum, spit oozing off my face. But he wanted my asshole again. He chained my neck and hands to a post. He took turns using his dick in my throat, pussy and asshole, raising me right back up every time I fell in exhaustion. I’ve never been put to work so long and rough. He likes to hear me moan and scream, his huge dick the cause of all the noise. I desperately needed a break from deep throat-ing his cock. It’s way too big for me to swallow. I can’t take it as long as he wants. I wish I did. Maybe he would take it easy, maybe not slap the back of my head as his dick reaches further down my throat, gagging all over myself. Whenever I thought he gave me a break, he stepped behind me to push his dick deeper and deeper in my asshole. When he did give me a chance to catch my breath, it was to watch me struggle with my confinement. It made him much more horny, which he took out on me. This time I left sore and cum drenched. I should run away, but his cum tasted so good. I want more.",
  "directors": [],
  "models": [
    {
      "name": "Fiona Rivers",
      "person_id": 61349
    },
    {
      "name": "James Kickstand",
      "person_id": 48660
    }
  ],
  "release_date": "2019-10-24",
  "scene_id": 45357,
  "tags": [
    "Anal",
    "Ball Gag",
    "big dick",
    "Big Tits",
    "Bondage",
    "brunet",
    "Brunette",
    "Clothespins",
    "Deepthroat",
    "Facial",
    "fake boobs",
    "Latinx",
    "Leather Cuffs",
    "master",
    "shaved",
    "Slave",
    "slim",
    "spit",
    "Straight",
    "Sub",
    "Swallow",
    "switch",
    "Sybian",
    "Tattoo",
    "Partner Studio",
    "top",
    "Vaginal Penetration",
    "versatile",
    "white"
  ],
  "title": "Fiona Rivers's Master Wants More of her Asshole"
}