{
  "collections": [
    "Man Up Films"
  ],
  "description": "Mason Lear is at home when he gets a text from his landlord. He’s late on rent. Mason reaches for his magic pocket watch. “This could come in handy…”\n\nRicky Larkin, Mason’s hot muscly landlord shows up in tight slacks and a tight button up tucked in shirt. He’s mad and wants the money now. Mason invites him to just sit down for a second. Mason puts his hand on his leg, looks at him flirty and asks if there’s something they could “work out.” Ricky get’s madder. He pushes Mason away and demands the money now.\n\nMason pulls out his pocket watch and swings it in Ricky’s face, quickly mesmerizing him. “You should have just taken the sex for rent… now I have to fuck with you…”\n\nMason establishes a couple trigger words which make his muscle man landlord think he peed his pants, or act like a chicken. He then snaps him back out and asks him if he likes to hook up with guys.\n\n“No! I’m straight. I don’t fuck guys. Give me the money, enough of this!”\n\nMason snaps him under again and asks him how many guys he’s fucked. “37 or 38…” Ricky says…\n\nMason is very pleased. “Do you like to eat ass?”\n\n“Yes, I love to eat ass” the masculine landlord says.\n\n“When I snap you back out, you will feel like you weigh a million pounds. You will fall on this sofa and you won’t be able to move.” SNAP\n\nRicky can’t believe he can’t move a muscle. Mason laughs over the strong man who is now helpless, then sits on his face. Ricky protests and Mason just keeps laughing, ‘But you said you love to eat ass!”\n\nMason needs to see how big his dick is. He pulls it out of his tight pants and it’s huge and rock hard. He sucks on it for a while, then snaps the protesting Ricky back under.\n\n“You are going to cum in my mouth when I snap you back out. But you won’t lose your erection. In fact, you will have an uncontrollable urge to fuck me in the ass. You won’t be able to stop yourself.”\n\nHe snaps Ricky out and sucks the cum out of his cock. Ricky can’t believe how horny he still is. He jumps up, throws Mason on the sofa and pulls his pants down.\n\nRicky is still completely un Mason’s control as he rage fully slides his huge hard cock into Mason’s eager ass. Mason enjoys the fucking from behind and on his back.\n\nRicky can’t believe how good it feels. Mason snaps him back under and he falls on top of him. “When I snap my fingers again, you will suck the cum out of my dick.”\n\nSNAP\n\nRicky gets down and slobbers all over Mason’s cock. He sucks until Mason fills his mouth with cum, then Mason snaps him back out.\n\n“What the fuck!? What is this all over my face?”\n\n“That’s the rent payment I owed you…”\n\n“Please don’t tell my wife” Ricky begs.\n\nSNAP\n\n“When I snap my fingers again, you will feel the need to suck a dick every time you think you need to go collect rent. Any dick… hopefully mine, but any dick will do…”\n\nSNAP\n\nRicky puts his pants back on. “Ok I gotta go collect rent from some other people, or suck some dicks… or get rent… suck dicks…”\n\nRicky walks off bewildered. Mason is really happy with himself.",
  "directors": [],
  "models": [
    {
      "name": "Mason Lear",
      "person_id": 60275
    },
    {
      "name": "Ricky Larkin",
      "person_id": 35556
    }
  ],
  "release_date": "2019-10-23",
  "scene_id": 45354,
  "tags": [
    "Athletic",
    "Bareback",
    "big dick",
    "black hair",
    "Couple",
    "Gay",
    "mind fuck",
    "mixed",
    "Muscle",
    "muscular",
    "shaped",
    "Straight",
    "switch",
    "Tattoo",
    "Partner Studio",
    "top",
    "versatile",
    "white"
  ],
  "title": "Mason Mind Fucks His Landlord RAW"
}