{
  "collections": [
    "TS Seduction"
  ],
  "description": "Jamie French has a boy toy to play with today and she is determined to punish him good and break him down. Sitting on her dungeon throne and dressed in a tight black latex bodysuit Jamie has a special little bundle all wrapped up in a plastic bag on the floor. What's inside? Sebastian Keys claws his way out of the suffocating bag wearing a gas mask and is immediately ready to please his mistress. Sebastian is Jamie's pathetic privileged piggy and he will do whatever she says. First she orders him to shine her latex boots up so he licks and kisses and oinks like a pig as he polishes her shoes. She inspects the pork-butt and slaps his dirty little piggy ass to get it nice and pink. He removes her latex boots and sniffs and licks her rubber covered sweaty feet. All this wet tongue action is getting Jamie hot but no cock for Sebastian until she is all shiny. With his filthy mouth the little piglet unzips her body suit and polishes her hard cock up with some slow, deep dick sucking. Now Sebastian is on his back tied up with clover clamps on his nipples while Jamie strokes his cock teasing him to the edge. He's making too much noise so she smothers him with her firm tits to shut him up. She jacks his dick with a vibrating fleshlight and he almost cums but no! not yet, not until Jamie says so. Jamie finally fucks her little piggy's ass on his hands and knees and slaps him with a leather paddle. She flips him over and pounds his ass deep until Sebastian begs to cum. She allows it and then she lubes her cock up with his jizz and jerks off onto his belly.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Jamie French",
      "person_id": 47848
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2019-12-17",
  "scene_id": 45359,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Clover Clamps",
    "Cock Worship",
    "dungeon",
    "Feet",
    "Latex",
    "Leather",
    "Mask",
    "master",
    "Paddle",
    "Role Play",
    "shaved",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "TS",
    "TS Fucks Male",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Pathetic Privileged Piggy: Sebastian Keys Dominated by Jamie French"
}