{
  "collections": [
    "CFNMEU"
  ],
  "description": "Muscled str8 guy Jan Bavor has been hooded and shackled, wearing just some see-through underwear. he is joined by his sexy tormentress who tells him to keep quiet. She whips his sexy body and scratches over his torso, slapping it too. Then she removes Jan's hood and we see that he is gagged as well. His cock gets hard in his underwear as the girl torments him. She whips his hot body some more. Then she rips open the underwear releasing Jan's throbbing cock. That dick stands fully to attention as he runs her fingernails all over his muscled body. She alternates between seductively licking and whipping. She cups Jan's balls and slaps his cock. Then nipple clamps are applied and the girl goes down on Jan's throbbing dick. After sucking him she applies clothes pins to his hard body and uses her electric shocker on his torso. She then moves him, to sit, back to front on a chair, with his hot ass available, as the cheeks spread naturally. Jan's cock and balls are pulled back too and she spanks his sexy ass. Caressing the balls and pulling on the cock and then running fingers over his tight hole she is getting ready for more. She takes a dildo and oils it before shoving it deep into Jan's tight hole. She fucks it in and out until she has it all the way in that hot hole. With that hole loosened the girl changes to a larger dildo and stretches the ass more. Then a longer one is used too. Jan has to take it, feeling it fuck his hot ass. As she fucks his ass and wanks his cock Jan gives up his creamy cum. But the girl isn't finished yet, as she changed dildo's again and fuck his ass some more.",
  "directors": [],
  "models": [
    {
      "name": "Dominantni Sestra",
      "person_id": 62032
    },
    {
      "name": "Jan Bavor",
      "person_id": 62318
    }
  ],
  "release_date": "2019-10-23",
  "scene_id": 45353,
  "tags": [
    "Anal",
    "Ball Gag",
    "CFNM",
    "Clothespins",
    "Dildo",
    "Handjob",
    "Hood",
    "Leather Cuffs",
    "Male Sub",
    "Nipple Clamps",
    "Rope Bondage",
    "Slapping",
    "Straight",
    "thirdparty",
    "Whipping",
    "Zapper"
  ],
  "title": "CFNM JAN BAVOR"
}