{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "You've been following Dominatrix Helena Locke around and don't think for a second she doesn't know what you're after. Your ass obsession has piqued her interest and she's decided to entertain your desire to gaze upon her perfectly round, hot ass. She begins by swerving her body around in her black latex thong. Straddling a leather chair, her patent thigh high boots squeak as she teases you with the thick contours of her beautiful booty. You have a perfect view of her ass as she slowly girates up and down, and twists her hips so the slightest little bit of her asshole peeks out from behind her thong. She grabs her butt cheeks and spreads them apart. She verbally taunts you by describing her sweet aroma and all the ways in which she can control you with her behind. She describes burying your face into her bubble butt and then making you to hold your breath until she decides to lift her body up off of you. Teasing you some more, she starts to bounce harder on the chair making her ass go up and down. She giggles devilishly and then throws her ass from side to side making it jiggle faster and faster. She instructs you to stroke yourself as she thrusts her pelvis back and forth stopping to slowly drop her ass closer and closer to your face. Do you think you can handle more without exploding your cumload? Because the only way you're going to be able to earn being in Helena's presence is if you be a good little weakling and hold off from cumming until she tells you to. She continues to tease you by now stroking her fingers over her thong from behind her back. Watch as they hypnotically graze what you know lies just below the surface of her g-string... that beautiful asshole. Don't you just wish you could look at it? Well, Helena has something special in store for you.",
  "directors": [],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    }
  ],
  "release_date": "2019-10-24",
  "scene_id": 45356,
  "tags": [
    "Blonde",
    "Bondage",
    "Brunette",
    "Cuckolding",
    "Dominatrix",
    "Femdom",
    "Fetish",
    "High Heels",
    "Latex",
    "Leather",
    "natural boobs",
    "Straight",
    "the chair",
    "thirdparty",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Helena's Round Beautiful Ass"
}