{
  "collections": [
    "Divine Bitches"
  ],
  "description": "The demoness Charlotte Sartre just wants two things today. To inflict pain and take balls. She wants to rip those testicles right off and put them on display on shelf. Maybe she'll wear them as earrings, anything is possible. Dressed in tight black, this slender goddess of the dungeon has some meat all tied up. Sebastian Keys, the ultimate pain slut, has no idea what he is getting his manhood into today. Tied up in fully restrictive rope bondage and gagged with a ball gag, his mistress asks a simple question, \"Do you value your balls\". Unable to answer through the gag and screams, Charlotte can only assume. With a staple gun she finished strapping Sebastians low hangers to the block. His cock tied up tight in rope, each testicle straining with tension pulling them down. Charlotte must first inflict the pain, she has to know if these are the right balls for her. She doesn't just cut off anyone's balls, ...well actually. She brings out the riding corp and begins to torment Sebastian, turning his testicles red. She punches his chest and slaps his face. She spits on him and humiliates this flaccid waste. Oh but she needs to test those testes more. After chocking him, she puts Sebastians balls in a vice. With each turn of the knob, Sebastian screams louder. His face is covered in clothespins as she torments his tongue with pain. Ok, maybe this pain slut deserves something, with a big black strap on cock she fucks Sebastians ass. Unable to scream clearly through the clothespin, all you can hear is pathetic whimpers as this goddess takes his ass. That's enough, this isn't about him. He needs to worship her pussy as she sits on him and smothers his face. She squeezes his balls to their breaking point while he eats her pussy. Her dripping wet lips drown his mouth. There is more for him to do. She offers her feet to be worshipped as he sucks on her toes and licks her perfect arches. His cock is now fully caged in chastity and this excuse for a man is equipped with a strap on cock, something that has the chance to please his mistress. Sebastian obeys and fucks his mistress demon with the strap on dildo. With the intense vibrations of the Hitachi she cums over and over again, taking what she needs from him. He maybe, just maybe might have done well today, but she is still going to punish his balls.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2019-12-31",
  "scene_id": 45363,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Clothespins",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Pain",
    "Pain Slut",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "toned",
    "versatile",
    "white"
  ],
  "title": "CASTRATION: Vicious Charlotte Sartre Destroys Pain Slut Sebastian Keys"
}