{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Maya Kendrick is rushing to make sure her apartment looks perfect for potential subletter Casey Kisses. She cleans the kitchen, hops in the shower, and washes her body just in time to greet Casey at the door. Casey isn’t too sure what to make of Maya but she seems nice enough. Maya shows Casey the kitchen and then leads her into her bedroom that she forgot to clean! Maya is mortified that Casey is seeing her sex toys strewn about the bed and apologizes profusely, but Casey doesn’t seem to mind. She asks Maya about the nipple clamps and Maya agrees to show her how they work. Sparks fly as Casey places them on Maya’s sensitive nipples and leans in for a kiss. Casey undresses, revealing her perfect body, and Maya gets on her knees to worship Casey’s gorgeous cock. Casey moans as the warmth of Maya’s wet mouth engulfs her dick. She picks up a crop laying on the bed and spanks Maya’s ass with it. Maya yelps around Casey’s dick and moans as Casey continues smacking her cute little ass. Then Maya lays back and Casey worships her cunt. Maya moans as Casey toys with her clit and soon Maya begs for Casey’s cock. Casey laughs, slipping her cock into Maya’s tight cunt. Maya moans as her potential subletter begins fucking her in earnest. Her toys curl as she cums hard on Casey’s cock. Next, Maya is tied in rope bondage, leaving her holes exposed to Casey. Casey fucks Maya’s pussy and then pushes her cock into Maya’s ass. Maya loves getting fucked in the ass and Casey’s cock feels so good! Maya gets fucked hard and then flipped over for more anal pounding. Maya cums over and over again as Casey fucks her ass. Finally, Casey cums on her pussy and feeds Maya her cum.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2020-01-13",
  "scene_id": 45366,
  "tags": [
    "Anal",
    "big dick",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Cock Worship",
    "Crop",
    "Curvy",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "tea2020",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Subletter: Casey Kisses Fucks Maya Kendrick to Many Anal Orgasms"
}