{
  "collections": [
    "TS Seduction"
  ],
  "description": "On a cozy winter night, two lovebirds sit by holiday light. Sharing naughty gifts they wrapped, soon her perfect ass will be slapped. But first, what is this? A Kink butt plug, a stroker, what bliss! The ropes come out for her to submiss, as what he desires is Casey’s Kiss. The stunning couple, Casey Kisses & Dante Colle are home for the holidays. Forget the family, these two want to spend a kinky night at home. Opening up their gifts, Dante finds Casey visited the kink store and got him new toys for him to try out on her. A butt plug, a stroker, nipple clamps, leather cuff, oh my. This truly will be a kinky Kink Store Christmas. Dante flips over his beautiful girlfriend as she begs him to begin. He ties her up in restrictive rope bondage, pulls up her tight dress and starts slapping that perfect ass. Next is the butt plug which her tight asshole is hungry for. She screams as the nipple clamps are pinched over her sensitive nipples. Dante pulls out her huge cock and goes down for a deep throat cock sucking. This gets her rock hard and begging to cum for him. Please daddy let me cum. Dante edges his girlfriend and takes it up a notch. Out comes the vibrator and cock stroker. This gets Casey’s body excited. She has never felt anything like this before and her rock hard cock is ready to blow. Edged and denied again, Dante takes off her nipple clamps as she screams in pleasure. The ropes come out again, and this time Casey is tied up in full restrictive rope bondage suspension. Her body is ready to submit to her boyfriends cock. All she wants for Christmas is Daddy’s Cock. She eagerly pleases her man’s hard cock and deep throats him. She wants more! She needs him in her. He lowers her into a submissive position and slides his cock into her ass. Deep anal fucking gets her rock hard and begging to cum. She finally is allowed to cum for Dante and unleashes her load onto his cock. He flips her over and fucks her again then cums all over her cock and body. Merry Christmas.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Dante Colle",
      "person_id": 61292
    }
  ],
  "release_date": "2019-12-24",
  "scene_id": 45362,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "buttplug",
    "christmas",
    "Cock Worship",
    "Couple",
    "holidays",
    "Kinky",
    "Leather",
    "Male Fucks TS",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "slim",
    "Straight",
    "Strokers",
    "Suspension",
    "switch",
    "tea2020",
    "top",
    "TS",
    "Vibrator",
    "white"
  ],
  "title": "Best Christmas Ever: Gorgeous Casey Kisses Submits To Dante Colle"
}