{
  "collections": [
    "TS Seduction"
  ],
  "description": "Pierce Paris has been frustrated with Chelsea Marie's constant lolly-gagging and lack of self-discipline when it comes to doing her house chores. On this day, Paris waits and waits for Chelsea to get out of the shower and get dressed. On the verge of being late for an appointment, Paris loses his patience as she comes up the stairs and scolds her for taking too long. She apologizes while parading around in front of him, wearing lingerie, looking cute with her tits out, but he's had enough and he's off to work. Chelsea promises him she'll do the housework while he's gone but she doesn't do any of it, hoping he comes home mad, and punishes her. When he returns home, he sees that the house is a mess and Chelsea is bent over the kitchen counter on the phone with a friend. He walks up behind her and hooks one finger in her mouth and tells her that she needs to be punished. He lifts her skirt, grabs and spreads her ass, and spanks it with his hands and his leather belt until it turns pink. He brings her to her knees and whips out his fat cock and she takes it all the way down her throat while she jerks off her own hard cock. Pierce picks her up, bends her over the counter, buries his big cock deep in her tight little round ass and fucks it hard. Chelsea gets flipped over onto her back and fucked deep and hard with her legs spread while Pierce jerks her throbbing hard cock. He has Chelsea get on her knees again and fucks her pretty face until he cums all over it. Chelsea gets so turned on by his load that she jerks her cock and shoots her's.",
  "directors": [],
  "models": [
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2020-01-21",
  "scene_id": 45360,
  "tags": [
    "Anal",
    "big dick",
    "Blonde",
    "Blowjob",
    "brunet",
    "Cock Worship",
    "Discipline",
    "Leather",
    "Leather Belt",
    "Lingerie",
    "Male Fucks TS",
    "muscular",
    "natural boobs",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "tea2020",
    "TS",
    "white"
  ],
  "title": "Daddy's Little Brat: Chelsea Marie Punished by Pierce Paris' Cock"
}