{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Hey loser! Today’s your lucky day. Hot Asian MILF Christy Love is in a good mood and willing to put up with your pathetic lame self. She tells you her five golden rules for servicing her and lets you watch her use her gimp of the day, Papa Georgio. Georgio wears a hood and his cock is locked up in chastity. Christy womanhandles Georgio to his knees and lets him clean her shiny thigh high red boots. Georgio’s tongue glides along the vinyl, from the tip of his Mistress’ toe to the top of the boot nestled near her perfect pussy. Pleased with her gimp’s performance, she pushes his face into her ass and makes him smell it. Georgio tries to please her, inhaling the glorious smell from her sweaty ass. Christy commands Georgio onto his back and then sits on his face, smothering him and allowing him to worship her. Satisfied with his ass licking, she pulls aside her mesh red thong to reveal her beautiful shaved pussy. She gives him permission to worship her cunt and Georgio uses his pathetic tongue to bring his Mistress to an orgasm. Next, Georgio is in a latex shirt with his legs tied up and open. Christy laughs as she shoves her strap-on cock into his whore mouth. She holds his nostrils shut and makes him choke on her perfect cock. Then she gives him the honor of receiving her cock. Georgio moans, his feet curling as his Mistress’ cock penetrates his tight hole. His hole is so tight but Christy knows exactly how to stretch out this slave’s ass. She fucks it open, telling him she needs to prepare him for all of her friends who he’ll be servicing also. Georgio cries out as Christy laughs and pounds his little slut hole. Finally, Christy lets this sad slave worship her perfect size six feet. Georgio works his tongue between each toe and lavishes her heels with attention. Pleased, Christy sits on his face and lets him lick her to another orgasm. She cums hard and turns her attention to his pitiful caged leaking cock. She releases it from the cage and plays with the copious amounts of precum leaking from the tip. Georgio is so hot from pleasuring his Mistress, he’s hard and aching for any attention she’ll give his cock. Christy pushes her gimp’s cock into her pussy and uses it for her pleasure. She takes every inch, fucking down on it as Georgio squirms beneath her. Giggling, she cums hard drenching her slave in all her delicious squirt. Then she drain’s Georgio’s balls and wipes his disgusting cum all over his disgusting face. Maybe one day you’ll be so lucky.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Christy Love",
      "person_id": 61580
    },
    {
      "name": "Papa Georgio",
      "person_id": 61743
    }
  ],
  "release_date": "2020-01-14",
  "scene_id": 45364,
  "tags": [
    "Asian",
    "Athletic",
    "BDSM",
    "Bondage",
    "Boot",
    "brunet",
    "Brunette",
    "Cage",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Gimp",
    "Hood",
    "Humiliation",
    "Latex",
    "Male Sub",
    "MILF",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Smothering",
    "Straight",
    "switch",
    "top",
    "versatile",
    "white"
  ],
  "title": "Christy Love Dominates The Gimp and Fucks Him in the Ass"
}