{
  "collections": [
    "TS Seduction"
  ],
  "description": "It’s been 365 days since Chelsea Marie locked Sherman’s cock in chastity. He’s been aching for release and tonight is the night. But after they both count down the seconds to the New Year, Chelsea isn’t sure Sherman has learned all his lessons. Before she releases him, she makes him worship her gorgeous feet. Sherman is all too happy and starts sucking on each glorious toe. Satisfied Sherman has done a good job, Chelsea unlocks Sherman’s cock. She takes in a big whiff and then swallows every inch. Sherman moans as Chelsea’s mouth envelops his sensitive neglected cock. He hopes that maybe, just maybe she’ll let him fuck her. But his Mistress laughs at his suggestion. She pushes his head down on her cock and fucks his face before turning her attention to his other hole. Sherman is on all fours with his ass up in the air. Chelsea pulls out a large fucking dildo and pushes it into Sherman’s tight boy pussy. Sherman pants as the cock stretches him open. He writhes on the end of the cock as Chelsea fucks him deeply with it. Sherman begs for his Mistress’ cock but Chelsea decides her butt slut needs punishment first. She pushes a fat plug in his ass and delivers a firm paddling to his ass. Sherman moans as his Mistress turns his ass bright red. Chelsea then uses him as a foot stool while telling him what the next year will hold. She commands he push the plug out and Sherman shoots it out of his ass across the room. Finally, Chelsea fills Sherman’s ass with her perfect cock. She gives him a good hard pounding as Sherman moans on her cock. She fucks him in doggy before having him get on his back so she can drive her rock hard cock even deeper into his ass. Sherman is so turned on after a year of denial he blows his load and licks his mess up. Chelsea continues fucking him before blowing her load all over his ass.",
  "directors": [],
  "models": [
    {
      "name": "Chelsea Marie",
      "person_id": 40544
    },
    {
      "name": "Sherman Maus",
      "person_id": 62063
    }
  ],
  "release_date": "2019-12-31",
  "scene_id": 45361,
  "tags": [
    "Anal",
    "Blonde",
    "Blowjob",
    "Cock Worship",
    "Crop",
    "Dildo",
    "fake boobs",
    "Feet",
    "natural boobs",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "tea2020",
    "toned",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "New Years Bang: Chelsea Marie Frees Butt Slut From Chastity"
}