{
  "collections": [
    "Str8Hell"
  ],
  "description": "Lorenc Byro is shackled, blindfolded and gagged and wearing only see thru underwear. His cock looks hard in the underwear as he wriggles around, trying to free himself. Rado Zuska comes in to find out why Lorenc is making a noise. He berates him and slap him, telling him to be quiet. Taking a whip Rado uses it on Lorenc, making him moan louder. Lorenc’s cock stays hard as he takes the punishment. As he continues with the whip Rado pins one of Lorenc’s nipples and bites the other one. Lorence keeps up with his moaning as Rado torments him, pinning both nipples and the belly button. Then he starts grabbing Lorenc’s cock and balls before kissing and licking his sexy chest. He releases Lorenc and takes off the gag and blindfold. Then Rado’s big dick is out and being shoved into Lorenc’s eager mouth. Rado grabs Lorenc’s head and pushes it all the way down on his cock. Lorence gags as he takes the stiff dick deep into his throat. Then Rado moves him to lay on a thick wooden beam. He pulls Lorenc’s legs in the air and shoves his throbbing cock into the waiting hole. Lorenc moans as he takes that big dick in his hot ass. His hole is being stretched wide by Rado’s cock. Rado fucks that hot ass deep and hard and then moves Lorenc again. He has him bent over, and the big cock is deep in that hole again. Lorenc’s ass gets pounded hard and fast making him moan even louder. To show how much he enjoys that big cock in his ass Lorenc sits on it as Rado lays down. He rides the big cock and the Rado fucks upwards into the eager hole. Rado can’t hold back and shoots his hot cream deep into Lorenc’s ass. Loren comes off the cock and works his ass to push the cum back out. Then he is held in a neck",
  "directors": [],
  "models": [
    {
      "name": "Lorenc Byro",
      "person_id": 62199
    },
    {
      "name": "Rado Zuska",
      "person_id": 61061
    }
  ],
  "release_date": "2019-10-31",
  "scene_id": 45384,
  "tags": [
    "Anal",
    "Anal Creampie",
    "Bareback",
    "BDSM",
    "big dick",
    "bit gag",
    "Blindfold",
    "Blowjob",
    "body builder",
    "Bondage",
    "brunet",
    "Clothespins",
    "Facefucking",
    "Flogging",
    "foreskin",
    "Gag",
    "Gay",
    "Leather Cuffs",
    "Slapping",
    "Partner Studio",
    "white"
  ],
  "title": "Rado and Lorenc RAW - DUTY BOUND"
}