{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Unsuspecting, perfect-bodied blonde, Kit Mercer, answers the door when Charles Dera comes calling. He's here to collect on her debts, which she'll repay with her wet, hungry pussy and slutty back-talking mouth! Charles slips into her house, and he won't leave until she's payed up. He first puts her in a hogtie, demanding that she pay with her mouth. He face fucks her as she greedily gobbles up his hard dick, and quickly admits that she's wet for him. He flogs her and demeans her, then torments her perfect cunt with a vibrator cranked up to high. When Kit is fully pliable, he puts her on her hands and knees on her coffee table, gagged and tied in rope bondage. He smacks her ass and readies her for a deep, hard fucking, which she's already hungry for. He slides in and she's in heaven, taking that dick deep from the first thrust. Charles unapologetically uses her perfect, tight body. She moans and pouts, wails and grunts, as he pounds her out. Slamming her dripping cunt. Finally he puts her on her back with her legs spread wide, held apart by rope. He further humiliates her by teabagging her and sliding his hard cock all over her slut face. But she's done protesting. Now she just wants that dick in her pussy, fucking her and fucking her. And she gets it, but not before he slaps and crops her pussy. He fucks her so good Kit is literally BEGGING for his cum when he's close to unloading. She begs like the greedy, ravenous slut she really is, and Charles shoots his load all over her sweet, perfect, fucked cunt.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Kit Mercer",
      "person_id": 62418
    }
  ],
  "release_date": "2019-11-29",
  "scene_id": 45389,
  "tags": [
    "BDSM",
    "black hair",
    "Blonde",
    "Blowjob",
    "body builder",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Humiliation",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "The Tax Man Cumeth: Charles Dera Collects On Kit Mercer"
}