{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Kate Kennedy and Stirling Cooper have the perfect home life, except for one thing. Kate’s been keeping a secret, but she can’t hold it in any longer. She wants to let her inner slut out, get tied up, used, slapped and flogged, and fucked in every hole. She’s just been afraid to say it. But now the secret’s out, and Stirling is excited by this new side of Kate. He wastes no time bringing that fantasy to life. He binds her in rope and gags her, then takes her into his house to use as he sees fit. Kate has no idea what he’s going to do, which excites her and gets her horny pussy wet, and she lets him take full advantage. First he canes her feet and slaps her perfect ass until it’s a hot red, then crops her and toys with her pussy. But before he fucks her, he slides his dick into her wet, spit-soaked mouth. He face fucks her as the spit flows, running down her face and all over Stirling’s cock. This only excites him more, and he uses her throat for everything it’s worth. And Kate simply gobbles it up. She’s voracious, hungry for dick like she’s never been before. She knows that if she’s good, she’ll get that sweet cock in her slutty cunt and hungry ass all the sooner. He chains her to a table with her ass up, at the perfect height to toy with and fuck. But first he crops her feet, to remind her who’s in control. Then he pounds his thick cock into her tight, perfect cunt. She’s so desperate for it he removes her gag so he can hear her scream like a bitch. Before she’s even had enough he slides in to her tight asshole, and Kate loves it so much she begs for more. She’s getting her wish: she’s tied up, chained, owned, and fucked in every hole. Stirling puts her on her back and flogs her fucked pussy, then slams her cunt with his cock again, deep and hard, making her cum like the slut he knew she was. He finally blows his fat load all over that worked pussy, claiming it, as Kate begs for every drop of his seed.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Kate Kennedy",
      "person_id": 61558
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2019-11-22",
  "scene_id": 45388,
  "tags": [
    "Athletic",
    "BDSM",
    "Blonde",
    "Blowjob",
    "Chains",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "foreskin",
    "Gag",
    "Humiliation",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "spit",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Kept Secrets: Kate Kennedy and Stirling Cooper's Dark Fantasies"
}