{
  "collections": [
    "Sex And Submission"
  ],
  "description": "On New Year’s Eve, alone at home wearing only a blouse and thong underwear, Katrina Jade waits for her boyfriend Tommy Pistol. When he finally comes home, she’s pissed off and they argue. Tommy begs for another chance and after almost kicking him out of their house, she gives him one. Tommy brushes off the bad vibes and comes up with a plan that would win back her love. He takes her to a remote area in the woods. He leads Katrina by a chain locked around her neck. In only a bra, panties, and a ball-gag, she’s tied to a rock with her arms out and her legs spread. Tommy hits her with his flogger. He licks her pierced pussy and squeezes her pretty tits. She’s untied, brought to her to her knees, and Tommy removes the ball-gag. He face-fucks her mouth with his hard cock and she deep throats his meat. He stuffs his balls in her mouth and makes her bite them. He uses her spit to finger fuck her pussy and makes her cum. Next they go back to their house and Tommy ties her up again with rope, this time standing with one leg up on the kitchen counter. He spanks her ass just before stuffing his hard cock inside her slutty pussy and fucks it well. She cums hard and Tommy switches to fucking her ass deep, hard, and fast. She cums multiple times while getting her ass fucked. In the last scene, Katrina is on her back with her legs spread, tied with rope to a leather chair. Tommy crops her ass then fucks her pussy once again. He switches back and forth fucking her ass and pussy and cums hard shooting his load inside her giving her a surprise cream-pie, hopeful that his seed will keep them closer.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Katrina Jade",
      "person_id": 52640
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2019-12-27",
  "scene_id": 45387,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "Gag",
    "Humiliation",
    "Kinky",
    "Latinx",
    "Leather",
    "natural boobs",
    "Pierced Pussy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "spit",
    "Straight",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Anal Resolution: Tommy Pistol and Katrina Jade's New Year's Fuck"
}