{
  "collections": [
    "Sex And Submission"
  ],
  "description": "There’s no hope, the jury is going to convict. Seth Gamble is going to jail and legal counsel Whitney Wright can’t do anything about it. Or can she! If Seth is going away on a five to seven, he’s going to take what he wants right now. Throwing Whitney to the ground and binding her hands behind her back with his belt, Seth shoves his hard cock right down Whitney’s throat. A deep sloppy wet cock sucking is just the beginning. With her tits out, Seth grabs his phone and records this unprofessional conduct. Stripped fully naked and tied up in restrictive rope bondage, Seth gets to work on what he wants, corporal punishment. Flogging Whitney’s round ass red. She screams in pain as he inflicts his stinging pleasure. Her holes exposed, Seth goes in for a pussy pounding. Her wet hole begs for his hard cock as he goes in deep and hard. She begs him for more and to fuck her tight asshole. He delivers a deep anal which gets Whitney screaming with orgasm. Flipped over and mouth gagged with a ballgag, Seth fucks his legal counsel again. She begs for his hot cum and he shoots a huge load all over her body. See you in court for a mistrial Whitney.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Seth Gamble",
      "person_id": 57488
    },
    {
      "name": "Whitney Wright",
      "person_id": 61018
    }
  ],
  "release_date": "2019-12-06",
  "scene_id": 45394,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Humiliation",
    "muscular",
    "natural boobs",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Straight",
    "Stud",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Misconduct: Legal Counsel Whitney Wright Pleads Her Case for Deep Anal"
}