{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "First time Kinkster Jasmine Ryder gets tied up, flogged and fucked when Derrick Pierce initiates this new slut into a hot and kinky Brutal Sessions. Standing up and bound tight with a spreader and stiletto heels Jasmine is ready to take whatever Derrick throws at her and he promises this day will be painfully pleasurable as he shows her the ropes. First some hardcore flogging on her beautiful tits and belly turn her sensitive skin nice and pink. Derrick is determined to push her limits to see what this whore is made of. He plays with her pussy until she wants to cum but its not time yet for there is so much to do. After a lot more slapping and flogging Derrick vibes her pussy with the Hitachi and finally lets her cum. Next newcomer Jasmine is on all fours tied up by her curvy hips to the ceiling rafter. Nipple clamps hang tight on her tits and her pussy is wet and ready for Derricks cock. He fingers her and she begs him to let her cum. But whats in it for Derrick? All this pleasure is making it hard for her to talk so Derrick busts out the single tail on her ass and marks her up real nice. Derrick stuffs his hard dick down Jasmines throat and she polishes his cock with her mouth. Finally Derrick fucks Jasmines pussy and it drives her crazy. She loves being his filthy whore and can’t get enough of this hot action. To keep things in balance Derrick pulls on her nipple clamps and canes her ass and tender feet which just gets Jasmine more turned on. Now Jasmine is on her back tied up with her sexy legs spread wide. Derrick fingers her hole and she begs to cum. He lets her but then the crop comes out to mark her tits up. Derrick pounds her pussy with his hard cock and chokes her as she comes again and again. How much can one slut cum? Oh Daddy! she cries until Derrick shoots his load all over this Beautiful Slut.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Jasmine Ryder",
      "person_id": 62423
    }
  ],
  "release_date": "2020-02-03",
  "scene_id": 45392,
  "tags": [
    "Athletic",
    "Crop",
    "Curvy",
    "Feet",
    "Flogging",
    "Hitachi",
    "Kinky",
    "Nipple Clamps",
    "other hair color",
    "Single Tail",
    "Slapping",
    "Straight",
    "Sub",
    "Tattoo",
    "white"
  ],
  "title": "The Beautiful Slut"
}