{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Alexis Tae is an eager slut, hungry for dick, flogging and fisting. Tommy Pistol delivers this and more. We open with Alexis in a full suspension, head forward and ass-up. Tommy immediately starts wailing on her ass with a cane, marking her up in ways that remain through the entire day. He spanks her ass where he's already caned her, tenderizing her flesh with a sharp, burning sting. He finger fucks her, spreads her pussy open, then wastes no time sliding his cock in her. Alexis is quickly prepped and fucked before any words are even spoken, then Tommy face-fucks her as a final humiliation in the suspension. Alexis is then bound to a table with her ass presented, for whatever Tommy wants to do. He starts by fingering and spanking her ass, then driving his hard cock into her wet, slutty pussy. He flogs her relentlessly as he uses her cunt for his own purposes, pulling on her rope bondage to drive deep inside her. As Alexis gets fucked and used, she starts drooling like a sloppy whore. Her drool gets all over herself as Tommy moves on from fucking her to fisting her. His hand slides right into her hungry cunt as he spanks her, and she leans into it, desperate for more. Tommy returns to fucking that perfect pussy as Alexis screams with orgasms. He silences her by shoving his cunt-soaked cock in her throat, face-fucking her again before returning to fisting her and fucking her. He puts Alexis on her back and canes her again, adding more welts to her bright red ass. He fucks her while she's gagged, with clover clamps on her tits, making her cum like a slut as she moans and screams through her own spit. Alexis is ultimately soaked in her own drool as she's used and abused, fisted and fucked, and made to cum in a pool of her own juices. Tommy shoots his load directly into her gaping mouth, then finishes her off with a vibrator and multiple orgasms she cannot control.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Alexis Tae",
      "person_id": 62033
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2020-01-20",
  "scene_id": 45391,
  "tags": [
    "Bondage",
    "brunet",
    "Caning",
    "Clover Clamps",
    "drool",
    "Fingering",
    "Fisting",
    "Flogging",
    "Gaping",
    "Humiliation",
    "Latin",
    "multiple orgasms",
    "Rope Bondage",
    "Spanking",
    "spit",
    "Straight",
    "Sub",
    "Suspension",
    "Vibrator"
  ],
  "title": "Alexis Tae: Fuck-Hungry Slut Fisted For The First Time"
}