{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Seth Gamble is a loyal and smitten employee of Jasmine Jae. He readies a holiday gift for her, placing it inside a sparkly red box and sets it aside. Jasmine approaches his desk and yells at him for not having certain reports ready in time. He apologizes and offers her the gift and she refuses to accept it. With a heavy head, Seth works late to finish his reports. She hands him en envelope which reads \"X-Mas Bonus\". When Seth gets home, he opens the envelope and finds a key inside. Soon after there's a knock on the door and in walks Jasmine Jae in sexy lingerie with a leash locked to a leather collar. Seth grabs the leash and leads her to another room. Seth takes her panties off, puts a red ball-gag in her mouth, and ties her up on her hands and knees. He slaps her ass hard with a leather crop. She begs him to fuck her ass so he pulls out her bejeweled butt-plug and replaces it with his hard cock. He switches back and forth fucking her pussy and ass. Next Jasmine gets tied up on her knees with clamps on her nipples. Seth presses an Hitachi against her pussy and she cums without permission. As punishment, he torments her sensitive clit with the strong vibrator. He shoves his cock in her mouth and pushes it all the way down her throat. He face-fucks her until shes covered in her own drool. In the final scene, Jasmine is tied up on top of a thick wooden table. Seth canes her legs and feet, and switches to the crop. He crops her ass and her tongue and then slides his cock inside her ass. He fucks her ass and pussy deep and hard, switching back and forth until she begs for his cum and he sprays his load all over her.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Jasmine Jae",
      "person_id": 59210
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-12-20",
  "scene_id": 45390,
  "tags": [
    "BDSM",
    "big dick",
    "Big Tits",
    "Blowjob",
    "bottom",
    "british",
    "brunet",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "drool",
    "fake boobs",
    "Feet",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Lingerie",
    "muscular",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "Submission",
    "Tattoo",
    "toned",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "XXX-Mas Bonus: Jasmine Jae Lets Seth Gamble Dominate Her For X-Mas"
}