{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Adira Allure is typically dominant, but today she submits to Derrick Pierce in her Kink premier. She admits she’s not into pain, but she learns to take it, and to take a lot of it. Under her tough exterior lies a hungry little fuck toy that longs to serve. She starts her day wearing only heels, with her arms and legs spread out wide, restrained with tight, inescapable rope bondage. With a hitachi strapped to her tight pink pussy, Derrick Pierce begins to test the limits of his captive sex slave. He toys with her perky little nipples and her small natural breasts. He runs his fingers up the sides of her chest and stomach and tickles her inner thighs. As the vibrator relentlessly torments her swollen clit, Adira purrs and moans in delightful anticipation. Derrick begins to rev things up, and starts to flog Adira’s taut skin with a heavy leather flogger. She yelps and moans as her sensitive skin is abused with cruel impact play. Derrick grinds the head of the hitachi into her cunt and Adira begs to cum. He merely laughs and watches her squirm from the searing pain of orgasm denial. He then tosses her to the floor and shoves his fat cock down her throat. She gags and spits all over herself, but she’s so damn hungry she devours Derrick’s dick, continuously throat fucking herself on it. She begs to cum and falls to the floor in a quivering mess of ecstasy and cum juices. Next Adira is tied to a table on her stomach with her legs in a perfect split. Not many subs are this limber and Adira loves to show of her slutty talents. With her perfect round ass on display, Derrick jams his cock into her pussy and Adira squeals with delight. He pounds her until the table his shaking and Adira is gasping for breath. She cums over and over until the multiple orgasms drive her into a frothing fit of sexual depravity. Derrick then flips her onto her back and renews the pounding of her fuck hole. Her ass slaps and shakes as he plows her over and over. Adira begs to taste his cum and to feel his hot juices squirt all over body. Derrick is only too happy to oblige and blows his load all over her pussy and titties.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Adira Allure",
      "person_id": 62419
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    }
  ],
  "release_date": "2019-12-23",
  "scene_id": 45393,
  "tags": [
    "Athletic",
    "Bondage",
    "Hitachi",
    "Leather",
    "multiple orgasms",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "Rope Bondage",
    "Slave",
    "Straight",
    "Sub",
    "Tattoo",
    "Vibrator",
    "white"
  ],
  "title": "Adira Allure: Derrick Pierce Takes Down the Domme"
}