{
  "collections": [
    "Sex And Submission"
  ],
  "description": "The lithe, sex-hungry Zoe Sparx is chained up in Charles Dera’s warehouse, ready to be handed over to her new handler. But she needs to be tested first, by Charles himself. He flogs her and crops her, then fucks her perfect, slutty pussy, training her to give in to his needs, and the needs of her next dom. She starts alone in the warehouse, chained with her arms above her head and a ball gag in her mouth. He torments her nipples and rolls a spike wheel over her natural tits and exposed pussy, as her anxiety rises and rises. He then rams his hard cock in her mouth as she’s bound to a table with rope, pulling her head onto him. Spit runs down her face as she takes that cock in her throat. Charles puts her on her back with her legs locked to the floor above her head, and crops her ass and pussy, sliding the crop between her pussy lips as she pants. He spits in her cunt then pushes his hard dick inside her. She’s tight, but he pumps her open, loosening her pussy for a good hard fucking. He adds a vibrator to the mix, driving her over the edge, making her cum and squirt, which gets all over herself. Next, Zoe’s put on the table with her legs tied spread. Charles slides into her and fucks her, choking her and flogging her, making her cum. He puts her pussy-soaked cock in her mouth, making her taste herself, then shoves it back into her soaked cunt. Zoe cums over and over as Charles uses the vibrator as he fucks her, compelling her to beg him for more. He blows his huge load all over her plowed cunt, leaving her soaked and beaten and spent!",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charles Dera",
      "person_id": 59597
    },
    {
      "name": "Zoe Sparx",
      "person_id": 62035
    }
  ],
  "release_date": "2019-12-13",
  "scene_id": 45395,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Blowjob",
    "body builder",
    "Choking",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Flogging",
    "Gag",
    "Handler",
    "Humiliation",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "spit",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Put Away Wet: Zoe Sparx Squirts Under Charles Dera's Punishing Cock"
}