{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Introducing Dana Spit, an adorable new submissive ready to shoot their first porn ever. But don’t let Dana’s youthful appearance fool you; they’re quite the experienced pain slut and lives life in a 24 hour D/S relationship. Today we find Dana on their knees with their arms bound by rope behind their back with a gag in their mouth. Dana’s already beginning to drip spit from the mouth as Fivestar places clothespins all the way down their sides. From Dana’s pierced nipples to the belly button, our dominant is creating a menacing looking zipper. Unfazed, Dana smiles and giggles, while Fivestar zaps their body to try and get them to make some noise. Now, Fivestar begins a mean caning while Dana says, “I’m a pain slut” with a smile and more spit flowing from those juicy lips. Fivestar, dissatisfied with our pain slut’s ability to take so much noise while remaining so stoic moves the caning from the thigh to the bottoms of Dana’s pretty little feet. Now Dana finds it hard to contain their reactions. As that cute ass gets caned, Fivestar decides to go harder. You can hear the cane ripping through the air as Dana giggles and wimpers still with long streams of spit hanging from their pretty face. Now Fivestar notices a few clamps dangling from Dana’s taut young skin and begins to hit them off with a crop. Dana gets rewarded with a vibrator as Fivestar beats their thigh with a leather paddle. Pressing that dripping wet pussy and clit against the vibrator, Dana moans through the gag as Fivestar spanks them. A second vibrator is introduced just before the last zipper is pulled. Finally this painslut gets to cum. Dana is glowing and giggling and says “Thank you,” over and over again.",
  "directors": [],
  "models": [
    {
      "name": "Dana Spit",
      "person_id": 62011
    },
    {
      "name": "Fivestar",
      "person_id": 19452
    }
  ],
  "release_date": "2019-11-07",
  "scene_id": 45408,
  "tags": [
    "Ball Gag",
    "Bondage",
    "Caning",
    "Clothespins",
    "Crop",
    "Cuckolding",
    "Discipline",
    "Domination",
    "Feet",
    "Femdom",
    "Fetish",
    "First Porn Shoot",
    "First Timers",
    "Gag",
    "Hitachi",
    "Leather",
    "Paddle",
    "Pain",
    "Pain Slut",
    "Pierced Nipples",
    "Rope Bondage",
    "spit",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "Vibrator",
    "Zapper",
    "Zipper"
  ],
  "title": "Pain Slut Takes It"
}