{
  "collections": [
    "The Upper Floor"
  ],
  "description": "London River is a sadist's wet dream, with deep curves, an ass that begs to be fucked, and a thirst for all the rope torment and beating this BDSM swingers orgy can dole out. Her one weakness is tested on this installment of The Upper Floor. She must take a slutty little teen, Gia Derza, who wriggles around in her rope bondage like a puppy, and discipline her by teaching her to recite the rules, serve the orgy, and earn the cock. London starts the party with three tight nipple clamps on her huge round tits, one for each rule Gia must learn. Meanwhile, Gia is strapped down to a sybian in shibari restraints, entertaining the crowd with her drooly mouth and eager answers to Aiden Starr's probing questions. London hangs suspended in a strenuous bamboo bondage tie and slobbers around her ball gag as Gia digs a deeper and deeper hole of trouble for them to climb out of. Our guest of honor helps himself to Gia's mouth and London's ass, perfectly presented for anal fucking. Gia screams and writhes on the sybian as her beatings and the vibrations are ramped up slowly, leading both women to cum like wailing whores. No rules are learned, but perhaps just as importantly, the party goers are endlessly amused! Meanwhile, regular guests set upon each other like hungry, horny wolves. A gorgeous little brunette beats her blond female submissive with a flogger while her dominant reddens her perky ass with a whip, and then fucks her swollen pussy silly with a hand held fucking machine. The rest of the guests are enjoying swinger exchanges in dark corners and hanging their submissive dates in tight rope shibari. Davey takes beatings and heavy kicks from her partner Fox until she is so turned on she can't hold back and flips Fox, beating her ass in a sadistic lesbian onslaught. Davey takes a pounding from Fox's thick strap-on cock, but again rolls Fox on her back and gets her cunt squirting in no time. Their play session ends with an entire hitachi head shoved up Davey's pussy and the entire party cheering for the kinky exhibitionist couple. Stefanos and Aiden have decided to try London as a teacher once more, and bind her banging body in a tight pretzel tie that leaves both her rosy holes in the air. Aiden tempts London with the promise of a brutal fisting, if she can just get Gia to learn the rules and recite them, while she has her pretty little pussy pounded out by Donny's huge cock. The burdensome tight clamps are still swinging painfully on London and she tries to earn that fist in her tight cunt and get Gia riding cock and reciting her rules like a good house whore. Tune in for part two next month, on The Upper Floor!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Gia Derza",
      "person_id": 61617
    },
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2020-01-10",
  "scene_id": 45409,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "blond",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Couple",
    "Curvy",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Fisting",
    "Gag",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "master",
    "MILF",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Oral Sex",
    "Orgy",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Strap On",
    "Swingers",
    "Sybian",
    "Tattoo",
    "Teacher",
    "Threesome",
    "toned",
    "top",
    "white"
  ],
  "title": "Teen Cock Whore Gia Derza Taught to Fuck by Masochistic Anal MILF"
}