{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Introducing Dana Spit, an adorable new submissive ready to shoot her first porn ever. But don't let her youthful appearance fool you; she's quite the experienced pain slut and lives her life in a 24 hour D/S relationship. Today we find her on her knees with her arms bound by rope behind her back with a gag in her mouth. Her namesake is already beginning to drip from her mouth to her chin as Fivestar places clothespins all the way down her sides. From her pierced nipples to her belly button, our dominant is creating a menacing looking zipper. Unphased, Dana smiles and giggles, while Fivestar zaps her all over her body to try and get her to make some noise. Now, Fivestar begins a mean caning while Dana says, \"I'm a pain slut\" with a smile and more spit flowing from her juicy lips. Fivestar, dissatisfied with our pain slut's ability to take so much while remaining so stoic moves the caning from the thigh to the bottoms of Dana's pretty little feet. Now she finds it hard to contain her reactions. As her cute ass gets caned, Fivestar decides to go harder. You can hear the cane ripping through the air as Dana giggles and wimpers still with long streams of spit hanging from her pretty face. Now Fivestar notices a few clamps dangling from Dana's taute young skin and begins to hit them off with a crop. Dana gets rewarded with a vibrator as Fivestar beats her thigh with a leather paddle. Pressing her dripping wet pussy and clit against the vibrator Dana moans through her gag as Fivestar spanks her. She gets a second vibrator just before the last zipper is pulled. Finally this painslut gets to cum. Dana is glowing and giggling and says \"Thank you,\" over and over again.",
  "directors": [],
  "models": [
    {
      "name": "Dana Spit",
      "person_id": 62011
    },
    {
      "name": "Fivestar",
      "person_id": 19452
    }
  ],
  "release_date": "2019-11-07",
  "scene_id": 45408,
  "tags": [
    "Ball Gag",
    "Bondage",
    "Caning",
    "Clothespins",
    "Crop",
    "Cuckolding",
    "Discipline",
    "Domination",
    "Feet",
    "Femdom",
    "Fetish",
    "First Porn Shoot",
    "First Timers",
    "Gag",
    "Hitachi",
    "Leather",
    "Paddle",
    "Pain",
    "Pain Slut",
    "Pierced Nipples",
    "Rope Bondage",
    "spit",
    "Straight",
    "Tattoo",
    "thirdparty",
    "Vibrator",
    "Zapper",
    "Zipper"
  ],
  "title": "Pain Slut Takes It."
}