{
  "collections": [
    "Man Up Films"
  ],
  "description": "Dr. Sgt Miles is doing his rounds in his hospital. A new doctor that just transferred in, Alex Hawk, is joining him. They are checking on a patient, Lance Hart, who Dr. Sgt Miles is having trouble diagnosing.\n\nDr. Hawk asks if they have tried taking a sperm sample. Dr. Miles says they haven’t and proceeds to lube up his hand and stroke Lance’s cock. Lance is perplexed but immediately aroused. While stroking his cock, Dr. Miles suspects that this may not be the right thing to be doing, but Dr. Hawk suggests that he squeeze the patient’s balls and keep him on the edge of cumming for as long as possible…\n\nDr. Miles is unaware that Dr. Alex Hawk is actually and alien with the ability to manipulate human minds. He has implanted the idea that Dr. Miles must stroke, edge, and deny his patient over and over until the maximum amount of cum explodes from him. Alex Hawk’s species is looking for the perfect male DNA sample.\n\nWhile they put Lance Hart through the edging and stroking of his life, Alex Hawk learns that Dr. Miles was a Sargent in the Army before he was a doctor. He spent time with the special forces, fought in many battles, and since he has devoted his life to healing instead of hurting. This intrigues alien Alex Hawk. Dr. Sgt Miles may just be the perfect male specimen he is looking for.\n\nThey get a big load of cum from Lance. Then Alex tells Dr. Miles exactly what is going on. He gets deep inside Dr. Miles’ head to explore his past..",
  "directors": [],
  "models": [
    {
      "name": "Alex Hawk",
      "person_id": 59999
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Sergeant Miles",
      "person_id": 56815
    }
  ],
  "release_date": "2019-11-06",
  "scene_id": 45402,
  "tags": [
    "Athletic",
    "brunet",
    "Doctor",
    "Edging",
    "Gay",
    "Handjob",
    "Medical Fetish",
    "muscular",
    "shaved",
    "switch",
    "Tattoo",
    "Partner Studio",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Dr Sgt Miles VS Alex Hawk Part 1"
}