{
  "collections": [
    "Families Tied"
  ],
  "description": "Avi Love is a gorgeous corporate bitch who has her step-brother Seth Gamble wrapped around her little finger. Seth has been lusting after her perfect body and brilliant mind for years, but all lesbian Avi wants is pussy and big money. She's happy to string Seth along, keeping him coding the latest hot app under brutal working conditions to make back her Daddy's investments. When it seems like Seth might finally be at a breaking point, she seduces him into a frenzy and then orders him a slutty blond personal assistant on whom he can take out his sexual angst. Daisy Stone is the picture perfect blond secretary with stars in her eyes and a hot body. She's eager to please Seth as he bangs out lines of code on a tight deadline, but when it seems like all he can do is throw memos on the floor and jerk off thinking about Avi, she decides to try some unconventional methods of inspiration. Leaning over his office couch, she beckons him over to smell her panties, but soon finds Mr. Gamble's lust is far greater than she estimated. Years of dreaming about his step-sister has turned Seth into a sadistic, ass-obsessed anal monster, and he wastes no time in tearing her panties away and spanking her curvy butt a deep red, using his hands, a paddle, and a crop. Daisy is game, swallowing his cock and begging to be tied up. Bound in tight rope in a doggy position she takes Seth's cock deep in both her holes as she moans around a ball gag and begs for more. Seth fucks all her perfect holes, moving between her ass and pussy until he feels rejuvenated and walks right back to his desk to finish his work. When Avi catches Daisy in her walk of shame out of the office her sadistic lesbian desires overtake her corporate sensibility and she can't help but take some of Daisy for herself. Degrading and spanking Daisy's used and swollen ass, she throws her on the floor and tells her to eat pussy until Avi cums in her slutty mouth. When Seth hears Avi's orgasm and sees his sister push Daisy around, he realizes they have both been played and decided to confront Avi once and for all. Either Avi has to submit with Daisy and give him what he wants, or he is abandoning the family business right then and there. Avi is a sensible woman and agrees to a bit of sexual suffering on her brother's dick to save her money. Seth binds her in rope and places a ring gag in her mouth so she is made to clean his cock each time it comes out of Daisy's ass. Daisy is enjoying her anal pounding so she joins in on the fun, humiliating Avi and goading her to beg for Seth's cock as Seth crops Avi's clit and flogs her hot body. Avi is stubborn, so Seth turns her over and takes her ass anyhow, while she is made to lick Daisy's pussy. A full day of zippers, shibari bondage, anal fucking, and predicament are just the medicine for Avi. By then of the day she's enjoying herself on her brother's dick and cumming happily in a twisted workplace scenario.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Daisy Stone",
      "person_id": 61519
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2019-12-20",
  "scene_id": 45411,
  "tags": [
    "Anal",
    "Ball Gag",
    "big dick",
    "Big Tits",
    "blond",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Crop",
    "Curvy",
    "Domination",
    "fake boobs",
    "Family Roleplay",
    "Gag",
    "Lesbian",
    "muscular",
    "natural boobs",
    "Paddle",
    "Redhead",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Stud",
    "switch",
    "toned",
    "unshaved",
    "white"
  ],
  "title": "Family Assets: Cold Hearted Step-Sister Warms Up To Her Brother's Cock"
}