{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The second half of our BDSM swinger soiree opens with petulant teenage slut Gia Derza tied on her knees in a back arch, pouting up at her handlers. A small group of guests has gathered to watch as she is finally stripped of house slut London's guidance and she is presented alone for the first time this evening. Stefanos presses a vibrator up against her exposed pussy and she starts to wriggle and moan, but Governess Aiden Starr brings her back into focus with a simple question: Do you remember my House Rules? The question is highlighted by a painful stream of hot red candle wax. Gia lights up with screams, writhing on the vibrator and struggling against her ropes as the crowd refuses to give her any hints. Gia suffers and begs, and it is finally Stefanos who teaches her the rules one last time so she may have a series of tremendous orgasms while being heavily flogged. Gia is then rewarded for her recital while cumming by being given the opportunity to lick Mistress Aiden Starr's asshole in front of the whole party. Meanwhile the crowd is engaged in their own sexual mischief. A gorgeous red headed slut is hanging in a seated suspension, having her trapped body vibrated and caned. A petite little masochistic woman is spanked and heavily caned on her legs and clit, while Rodeo Kitten continues to enjoy fucking her new plaything with a giant strap on while under her Master's whip. Another gorgeous guest has her clothing slowly stripped from her body while in a tight partial suspension, and is made to cum in her partner's hand while surrounded with a pile of her own ripped up clothing. London River isn't off the hook just because Gia has been taught the rules. The guests demand more of her trainee, and deliver their requests in the form of a series of clamps pulled off London's giant tits as she makes the rounds at the party. Donnie Sins is in close pursuit, taking every moment he can to fuck London's inviting mouth and cunt as she tries to politely listen to the guests and not cry out in an orgasm as soon as each clamp is pulled. She promises to teach Gia several skills of a sexual submissive and is allowed one gigantic orgasm amidst the guests. Skill number one is deep-throating, and London wastes no time in grabbing Gia to guide Donnie's cock all the way down her young trainees throat. Gia slobbers and her eyes roll back in her head, but the cock goes all the way down her tight young throat, and so it is on to task two, which is to recite the rules while getting fucked. Gia is thrown on her back and pounded by Donnie while London keeps a guiding hand on her pussy. Gia is succeeds in both her entertaining orgasms and recitation of the rules, so London is finally allowed her cock whore prize. London lays back on the the table and begs for an anal fisting, double penetration, and deep fucking of all her holes while using young Gia's mouth to pleasure her clit. The crowd cheers London on to many sexual antics until Gia's face is covered with hot cum. Well done!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Gia Derza",
      "person_id": 61617
    },
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2020-02-07",
  "scene_id": 45410,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Athletic",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "Double Penetration",
    "fake boobs",
    "Female Slave",
    "Fisting",
    "Humiliation",
    "master",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Suspension",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Big-Titted Anal Slave Rewarded & Fisted For Training Teen Submissive"
}