{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "There's something we do pretty well from time to time here at PascalsSubSluts.com and which we're very proud of. It's shooting women of a certain age whose sex lives have been a little snoozy for the majority of their adult lives (the fault of which invariably falls at the feet of their hubbies whom they eventually decide to leave), who discover a second wind and start to fly high, enjoying a sexual adventure of increasing confidence and downright fucking fun. We're never the trigger. We just get to jump onboard and join the party. And it's wonderful. Which brings us to the magnificent Skylar Squirt. She's sexually unleashed, she hasn't stopped finding out more about herself, and she wants to take the next step with PSS. This is her first proper porn scene. Not only that but, bit by bit, it comes out pretty clearly that the big thing she wants is a damn good spanking. That and a bloody good rodgering obviously but the spanking bit's a biggie for her. So that's what she gets, and at the end of the shoot her bum's black and blue but the grin on her face is a wide as a Cheshire cat's. Oh, and she doesn't call herself 'Squirt' for nothing. From start to end, this lady gushes, guys. Proper jets. All in all, it's a rather intoxicating mix, and here's what she got up to with us:\n- Vaginal fucking\n- Hard spanking\n- Squirting\n- Orgasms\n- Physical & verbal domination\n- Deepthroat & face-fucking\n- Face-slapping & spitting\n- Choking\n- Toy\n- Cumshots",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Skylar Squirt",
      "person_id": 62373
    }
  ],
  "release_date": "2019-11-07",
  "scene_id": 45412,
  "tags": [
    "Athletic",
    "Ball Gag",
    "big dick",
    "brunet",
    "Choking",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Facial",
    "Feet",
    "Fingering",
    "Flogging",
    "foreskin",
    "Hand Gagging",
    "Slapping",
    "Spanking",
    "spit",
    "Squirting",
    "Straight",
    "Sub",
    "thirdparty",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Skylar Squirt: The Birth Of A Spank Slut"
}