{
  "collections": [
    "TS Seduction"
  ],
  "description": "Clad in tight shiny latex blonde beauty Lianna Lawson is locked up in a cage. She looks around to make sure her Master Dominic Pacifico is not in the room before she slides a hand down to tease herself. She frees her cock from her latex panties and starts to jerk off. Caught up in self pleasure, she is startled by her Master’s sudden appearance and gets caught touching herself. Dominic is none too pleased his horny little bitch cannot follow instructions. He drags her out of the cage and bends her over it for a firm spanking. Lianna squirms as the spanking soon turns her ass bright red. Dominic manhandles Lianna into position on her knees and locks her in place with a chain. He slaps her face and reminds her who is in charge. He bites her tits until Lianna is gasping from the pain and flogs her sensitive tits and her hard cock. Soon Lianna is begging to cum but Dominic has other plans for his disobedient fuck toy. He strings her up in her first full suspension and fucks her face. Helpless in bondage, Lianna takes every inch of her Master’s fat cock. Drool pours from her mouth as Dominic fucks her throat and makes her suck on his balls. Lianna’s cock is rock hard throughout this rough treatment and soon she begs her Master to fuck her ass. Dominic brings her down, ties her up, and runs two zippers along her sides. He locks her cock in chastity to ensure she will not be touching it anytime soon. He crops her tits as he stretches her ass open with his fingers. Lianna moans as her Master slides his hard cock into her hole. She loves getting fucked and used. She begs to have the zipper off and is rewarded as Dominic rips them off, sending pain and pleasure rushing to her caged cock. Dominic lavishes her feet with attention before blowing his load all over her face and throwing her back into the cage.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Lianna Lawson",
      "person_id": 62014
    }
  ],
  "release_date": "2020-01-07",
  "scene_id": 45446,
  "tags": [
    "Anal",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Cage",
    "Cock Worship",
    "drool",
    "Feet",
    "Latex",
    "Latinx",
    "Male Fucks TS",
    "master",
    "muscular",
    "Pain",
    "Role Play",
    "Spanking",
    "Straight",
    "Suspension",
    "Tattoo",
    "TS",
    "unshaved",
    "Zipper"
  ],
  "title": "Bad Little Bitch: Lianna Lawson Punished, Suspended and Fucked"
}