{
  "collections": [
    "CFNMEU"
  ],
  "description": "Peter Lipnik is on the phone, after checking in to his hotel. He is making arrangements for a meeting when his sexy girl, dressed in underwear only approaches him from behind. She begins to feel Peter all over, and he has to terminate his call. The girl has Peter lay on the bed, after removing his tee shirt. Her hands rub over his sexy body and he can't distract her, even though they have a meeting to attend. She opens the suitcase and pulls out something to cover Peter's eyes. Then she shackles his wrists to the frame of the bed. Next she begins to caress and kiss his nipples before putting a gag into his mouth. She applies clamps to Peter's nipples as well and then rubs his groin. Removing the blindfold she begins to whip Peter's hot body and pull on the clamps. Then she pulls down his jeans and wanks on his stiff cock. The clamps are attached to his balls too, and pulled to stretch the skin. Raising his legs and shackling them too he has Peter's hot ass available too. But first she ties his balls. Then a dildo is shoved into his hot hole as his stiff cock is wanked too. A thicker dildo is then used to stretch is ass further, and fuck deeper. That too is replaced by another that is shoved deep into his as, stretching it wide. She releases Peter and puts him onto his keens so that she can fuck his ass with her strapon. She keeps up the fucking, turning him onto his back. His ass gets fucked as his cock is wanked as well. Then the fucking stops and Peter is wanked until his shoots his cream cum onto his belly.",
  "directors": [],
  "models": [
    {
      "name": "Lucy Vojak",
      "person_id": 62062
    },
    {
      "name": "Peter Lipnik",
      "person_id": 62316
    }
  ],
  "release_date": "2019-11-13",
  "scene_id": 45451,
  "tags": [
    "BDSM",
    "bit gag",
    "Blindfold",
    "Bondage",
    "Brunette",
    "CBT",
    "CFNM",
    "Dildo",
    "Fetish",
    "Flogging",
    "Gag",
    "Handjob",
    "Male Sub",
    "Nipple Clamps",
    "Pegging",
    "Rope Bondage",
    "Straight",
    "Strap On",
    "thirdparty"
  ],
  "title": "CFNM PETER LIPNIK"
}