{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Stunning Penny Pax is getting ready for a work trip. Dressed in heels and stalkings and tight underwear, she is dressing alone in her bedroom. Her sex craved husband comes in to greet her and cannot keep his hands off this beauty. She pushes him and tells him no over and over again. But he is demanding. Luckily for this couple she lets him in on a little kinky secret. No means Yes. Seth Gamble throws her over on the couch, pulls up her dress and slaps her round ass red! He gets out the rope and ties her up. She scream no no no, this isn't what she wanted. Seth pulls out his hard cock and fucks her wet tight pussy right there on the couch. Stripped naked Penny is then tied to the pillar. Nipple clamps on her huge tits. She deep throats her husbands massive cock. But he desires something more. Pain. He brings out the crop and cane. Penny screams in pain and pleasure. She is then tied to teh bed ass up in the air. Seth fucks her tight pussy again before moving on to her hungry asshole. She takes a deep anal pounding while getting flogged. The hitatchi comes out and gets her screaming with orgasm. Flipped over again, her feet are caned and the Wartenberg wheel torments her body before Seth takes a final turn on his submissive wife. She begs for his cum and Seth fills her pussy up with a creampie.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2020-01-17",
  "scene_id": 45468,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blonde",
    "Blowjob",
    "brunet",
    "Corporal Punishment",
    "Couple",
    "Creampie",
    "Crop",
    "Curvy",
    "Domination",
    "Feet",
    "Humiliation",
    "Kinky",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "Submission",
    "switch",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Submissive Wife: Kinky Anal Couple Explores Limits When No Means Yes"
}