{
  "collections": [
    "Bound Gods"
  ],
  "description": "Welcome to the frat house new pledge. You have to prove yourself worthy to get into this elite chapter. First step is initiation! Frat daddy, muscle god Sharok is ready to welcome you with his fists. Smooth stud Zak Bishop wants to make his daddy proud. He is pledging to the best fraternity and needs to get in, his career and family name depends upon it. He will do whatever it takes, and today that is Sharok. First Zak is blindfolded and put into a plank position as his frat brother does a mean brutal corporal punishment on his ass. The frat paddle comes out and turns Zak Bishop bright red. Sharok rips off Zaks clothes and pushes the boy down to the floor. As a good frat brother, he knows Zak must be thirsty. He sticks a speculum in Zak's asshole and opens it wide. He pours his drink down Zak's ass, bottle deep! Zak is made to clean his hole out for his pledge master. Next Zak is bound in fully restrictive rope bondage and his cock and balls are tormented with clothespins. Sharok takes his leather gloved hand and sucks Zak off. But now it's daddy's turn. Zak is suspended and gives Sharok a deep throat cock sucking. After the pleasure comes more pain. The flogger comes out and Zak's perfect body is beat red. How far is Zak willing to go to pass this test? Can he take Sharok's fist! A deep fisting gets Zak's wide ass torn open. Finally Sharok suspends Zak and fucks him hard. Zak blows his load all over the floor. Sharok's final challenge involves a classic hazing. Sharok unloads his cum on a cookie and feeds it to his pledge. Welcome to the brotherhood.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Sharok",
      "person_id": 62054
    },
    {
      "name": "Zak Bishop",
      "person_id": 61162
    }
  ],
  "release_date": "2020-01-09",
  "scene_id": 45464,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Clothespins",
    "Corporal Punishment",
    "Domination",
    "Enema",
    "Fisting",
    "Gay",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "Paddle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "smooth",
    "Speculum",
    "Stud",
    "Submission",
    "white"
  ],
  "title": "Bound Initiation: Sharok Breaks in New Fraternity Pledge Zak Bishop"
}