{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Perky little Juliette March is a lying cheating girlfriend. She hooks up with D the night before and gets caught by her boyfriend Codey Steele. She denies it all, but Codey knows the truth. It's right there on her phone. She tries to kick Codey out, but he comes storming back in. He isn't going to get kicked out of her house without his guitar. The two get into a heated argument. Juliette slaps Codey in the face, and he has had enough. He chokes her and slams her to the couch. If he's getting kicked out by this cheating woman, he's going to get one last grudge fuck in. The two spit and slap each other. He wrestles her into submission. Holding her down he pulls out his huge cock and slams it down her wet throat. She deep throats his hard angry cock as he slaps her pussy red. She is tied up in rope bondage and he crops her body. Nipple clamps get her screaming, but the real fun begins when he removes the clover clamps. She continues to suck his cock as he pulls out the Hitachi and vibes her pussy! That wet hole is ready to be grudge fucked. He delivers a brutal pounding. Deep pussy fucking while she is gagged gets him hard as a rock. The ball gag muffles her screams. He finally cums deep in her pussy for a cream pie. He pulls it out and rubs it all over her pathetic face.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Juliette March",
      "person_id": 22072
    }
  ],
  "release_date": "2020-01-03",
  "scene_id": 45469,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Hitachi",
    "Humiliation",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "spit",
    "Straight",
    "Submission",
    "Tattoo",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Grudge Fuck: Cheating Girlfriend Juliette March Brutally Fucked by Ex"
}