{
  "collections": [
    "Bound Gods"
  ],
  "description": "It’s almost 2020 and Vander Pulaski can’t wait to leave this year behind him. The Christmas robbery of his parents’ house and the memory of being at the mercy of two burglars is still fresh in his mind as he settles in for a quiet New Years Eve. He orders some pizza and decides to borrow some inspiration from his favorite movie in order to pay for it all. An hour later, pizza delivery man Michael DelRay arrives with a stack of pizzas. Pissed to find only a twenty dollar bill thrown at him, Michael gets ready to have a strongly worded conversation with whoever ordered these pies. But what happens next leaves Michael running for his life only to discover that Vander is pranking him. As Vander gets comfy, Michael sneaks up on him and wrestles him into submission. He ties Vander up and puts him over his knees for a good old fashioned spanking. Vander struggles, trying to scream for help around the metal spider gag in his mouth. But he can’t get away from the pizza man’s strong hands holding him in place and spanking his ass. Michael laughs as Vander’s pathetic attempts to escape. He grabs a bottle from nearby and slides it into Vander’s asshole. Vander cries out as the cold glass of the bottle moves in and out of his ass. Then he is made to take every inch of Michael’s rock hard cock in his mouth. Next, Vander is tied on his knees with a kazoo duct taped into his mouth. Michael’s put him in a party hat and has electrified metal rods tightened around his balls. As Michael begins to flog his chest, Vander cries out. His cries muffled by the kazoo makes the experience all the more humiliating. Then Michael runs a line of clover clamps across his chest and dials up the electricity. He takes the kazoo out of Vander’s mouth and makes him suck his cock. He fucks Vander’s wet mouth as Vander’s hard cock twitches from the electricity. He makes Vander apologize for ripping him off and then he rips off the clamps and flogsÂ Vander’s sensitive chest. Then Vander is on his hands and knees with a tray on his back. Michael fills two glasses and places them on Vander’s back, instructing him not to drop anything. He flogs Vander’s ass, cock, and feet as Vander tries not to move. Finally, Michael slides his cock into Vander’s tight hole. Vander moans as his ass gets stretched open and violated by a stranger for another time this week. Michael makes Vander cum as he fucks him and then makes him clean up his mess. Then he ties Vander in piledriver with a plug in his ass. Michael lights some sparklers to celebrate and then cums all over Vander’s face.Â",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Michael DelRay",
      "person_id": 61138
    },
    {
      "name": "Vander Pulaski",
      "person_id": 61944
    }
  ],
  "release_date": "2019-12-26",
  "scene_id": 45462,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "christmas",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Spanking",
    "spider gag",
    "Submission",
    "white"
  ],
  "title": "Homo Alone Part 2: Pizza Man Michael DelRay Punishes Vander Pulaski"
}