{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Dirty cop Tommy Pistol is in trouble again. He was able to escape but he left some incriminating evidence behind. Luckily for him he knows the Evidence Clerk Casey Calvert is a slut for cop cock. He finds Casey working in the basement on the weekend, no one else is around. He just needs the little bit of evidence for his freedom. Unfortunately it was just locked away. Casey must have the code and he is going to do whatever it takes to get it. Throwing her against the wall and handcuffing her, he tells her she is going to be in big trouble for withholding evidence. Tying her up in rope bondage and gagging her with a ballgag, he pulls her pants down and flogs her ass red. She screams she doesn’t know the code. Well maybe this cock hungry whore just needs some good cock cop to start talking. Tommy rams his hard pistol down her deep wet pussy. Well the rumor in the precinct goes, this slut likes to suck cop cock. Stripped naked and tied up again in restrictive bondage, Casey’s nipples are now clamped. She takes a hard deep throat cock sucking. She gags that she doesn’t have the code. Liar. Flipping her over, Tommy knows where to start knocking. Casey gives up her tight asshole for Tommy’s cock. He rams that hard thing deep and fast into her hole. Anal fucking gets her cumming hard. Tommy brings out the hitatchi for her pussy before he covers her holes in cum.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2020-01-31",
  "scene_id": 45467,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Cop",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Flogging",
    "Humiliation",
    "Latinx",
    "natural boobs",
    "Nipple Clamps",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Submission",
    "the wall",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Anal Evidence: Dirty Cop Fucks & Abuses Evidence Clerk Casey Calvert"
}