{
  "collections": [
    "Men On Edge"
  ],
  "description": "Welcome Jack Vidra to KinkMen! Hung as fuck with a thick cock piercing, Jack Vidra is a muscle god with thick ginger hair who can’t stop touching his cock. His punishment: electric chastity. Jack is bound with leather, gagged, blindfolded, and his cock is locked in a chastity cage wired to a tens unit. He squirms as Dillon Diaz dials the electricity up, sending a strong current surging around his cock and balls. Dillon pushes in a conductive sound into Jack’s cock and watches as Jack’s tugs at his bondage, moaning as the electricity pulses through his cock. Now that Jack is occupied, Dillon runs his gloved hands along Jack’s muscles. He leans in, sniffing Jack’s hairy armpit. His tongue presses down ever so slightly against the hair there as Jack moans from the contact. Dillon begins to worship Jack’s sweaty pits, tugging on the hair with his teeth before moving to claim Jack’s mouth. He tickles him before removing the cock cage from Jack’s aching cock. Once free, his cock grows rock hard as Dillon strokes it. Dillon’s leather gloves glide over Jack’s fat cock as it gets bigger and bigger. Dillon leans in and takes Jack’s cock in his mouth. He swallows every inch, deep throating it as Jack bucks up against his bonds. Dillon’s mouth feels so good Jack wants to blow his load but he is denied. Next, Jack is in leather bondage on his back with his arms and legs spread. Dillon sucks his cock and eats his ass. Jack moans as Dillon slips a dildo into his eager asshole. Jack begs to cum as Dillon picks up the pace, pushing the cock faster and deeper into Jack’s hole. But Dillon’s not done yet. He puts clothespins on Jack’s balls as he sucks him once again. Jack begs to cum and finally is rewarded release. He blows his load, relieved his day is over. But before he can get too comfortable, Dillon starts tickling him! Jack pulls himself up, trying and unable to get away from Dillon’s fingers. It looks like Jack’s torment isn’t over yet.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jack Vidra",
      "person_id": 61495
    }
  ],
  "release_date": "2020-01-21",
  "scene_id": 45466,
  "tags": [
    "Athletic",
    "BDSM",
    "Blindfold",
    "Bondage",
    "Cage",
    "Clothespins",
    "Dildo",
    "Edging",
    "Gay",
    "gloves",
    "Hairy",
    "Leather",
    "Leather Gloves",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Redhead",
    "Rope Bondage",
    "Sniffing",
    "Tens Unit",
    "Tickling",
    "white"
  ],
  "title": "Hairy Ginger Beefcake Jack Vidra Bound, Edged, and Fucked!"
}