{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Doug is reading at his desk when the phone rings. He has a short conversation with Master Mario, whose slave he's been boysitting. He invites Mario to come for the boy and possibly help punish his own slave Tag, who's been fucking up.\nThe Dungeon: Tag stands in the middle of the dungeon, hands cuffed behind his back, head in a round steel headcage. Locked in a puppy cage Sean Patrick, collared and plug-gagged and hands also cuffed behind him, sits and watches. Sean works himself onto his belly to hump the cage floor. He moans and cums on the cage mat, then gets himself back into his former sitting position. Tag's cock goes from semi-hard to fully hard throughout, he's clearly been standing in this position for a while. Doug enters the dungeon. He starts manipulating Tag's cock, biting and chewing on his nipples, slapping his chest. Tag goes rock hard right away. Doug frees Tag from the head cage. Tag drops to his knees and nuzzles Doug's crotch. Doug sticks his fingers deep in Tag's mouth. Sean watches, fascinated. Tag sniffs Doug's ass through his jeans, sucks and kisses the denim. Doug squeezes Tag's head between his legs, feeds Tag his fingers, dries his hand on Tag's face. He drops his pants, offering Tag his asshole to taste, lick, suck and \"eat like a fucking dog\" From his cage, Sean, drool seeping out around his gag, can't get enough of what he sees. Tag is totally into eating Doug's ass. Tag pulls down Doug's black jockstrap with his teeth. Doug, leaning over the cage, can tell how turned on Sean is by what he sees, and through the bars slaps Sean's face. Doug offers Tag his cock to be sniffed and his balls to be licked and sucked. He orders Tag to suck his cock, smacks Tag's face with it, has Tag go back to licking his balls, then back to his cock again, making him take it all the way. Tag alternates cocksucking and ball licking and sucking. Doug pulls Tag's head all the way down on his cock and asks Tag if he's ready for his punishment session. Blackout. (15 minutes)",
  "directors": [],
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 61819
    },
    {
      "name": "Sean Patrick",
      "person_id": 61551
    },
    {
      "name": "Tag Adams",
      "person_id": 62428
    }
  ],
  "release_date": "2019-11-15",
  "scene_id": 45461,
  "tags": [
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Cage",
    "Collar",
    "Domination",
    "drool",
    "dungeon",
    "Gag",
    "Gay",
    "Jockstrap",
    "Kinky",
    "Mask",
    "master",
    "Rimming",
    "Slapping",
    "Slave",
    "thirdparty",
    "Twink",
    "white"
  ],
  "title": "Tag Punished - The Headcage"
}