{
  "collections": [
    "Men On Edge"
  ],
  "description": "Nic Sahara is alone at home, lounging on his sofa, reading a book in only his underwear and a t-shirt. His phone rings and shows its from a private number. He blocks the caller and goes back to reading, and his phone rings again. He answers and tells the person to stop harassing him or he’ll call the police. He hangs up and falls asleep, unaware of two men that are his biggest fans, sneaking around outside, preparing to enter his house. The two men, Sebastian Keys and Alex Hawk quietly break in to Nic’s house with stockings over there faces. They cant believe its actually him as they creep closer to Nic sleeping on the couch and give him a rude awakening. They cover his mouth and grab him. Nic screams for help but nobody comes to his rescue. They tie him up with a lot of rope with his legs crossed, sitting up. They cut his shirt off, play with his nipples, and tease his hard cock through his underwear. They attach twist nipple suckers to Nic’s sensitive nipples. They cut off his underwear and Alex gets to work sucking his uncut cock. They tease his cock some more by using a clear stroker with two bullet vibrators attached to the sides. In the next scene, Nic is naked on his couch with a bit-gag in his mouth. His arms are tied with rope above his head and his legs are tied spread open. Sebastian gets more rope and ties Nic’s dick and balls in rope bondage, making his cock even harder. They stroke his cock with another clear stroker and Nic begs to cum. Sebastian slides a dildo attached to a vibrator, deep into Nic’s ass while Alex strokes Nic’s cock. Alex helps himself to a mouthful of Nic’s toes and sucks each one while Sebastian inserts an anal prostate massager into Nic’s ass. Nic cant hold back any longer and shoots a huge load all over himself.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Nic Sahara",
      "person_id": 62344
    }
  ],
  "release_date": "2020-01-07",
  "scene_id": 45465,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Dildo",
    "Edging",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling",
    "Vibrator"
  ],
  "title": "Nic Sahara Edged by His Two Biggest Fans"
}