{
  "collections": [
    "Bound Gods"
  ],
  "description": "Vander Pulaski is home alone for the holidays and ready to party. A knock at the door interrupts his festivities. It's silver fox Dirk Caber with a warning that there's always a string of robberies around the holidays. Vander decides to set up some extra precautions in case anyone tries to break into his parents' house. Meanwhile, Dirk meets up with his partner in crime, Daddy Jack Dyer. Together they are the Horny Bandits! Jack is pleased to hear Vander is home alone. Later that night, Dirk and Jack return dressed as Santa and an elf. They jimmy open the window and slip inside, missing the trap Vander has laid out for them. Jack slips on the ornaments beneath the window. The crash alerts Vander to their presence and the game is on! He yells at them to get out of his house and these two daddies chase him around the house before taking him down. Vander struggles as they pin him, blindfold him, and tie him up. They rip open his pajama onesie, revealing his puckering asshole. Dirk dives into to get a taste as Jack holds Vander's ass open with his gloved hands. They spank and crop his asshole and notice that Vander is rock hard. Laughing, Dirk pinches Vander's sensitive nipples as Jack tastes their boy's delicious cock. They decorate his chest and balls with clothespins and ornaments, making him their Christmas toy. Jack pushes Vander's face into his crotch before taking his pierced cock out and making Vander choke on it. Vander takes every inch, unable to get away from his devious captors. They pass him back and forth, laughing as he drools on their cocks. They hit all the clothespins off his body as Vander screams in pain. Next they string him up in his parents bedroom. They decorate him in Christmas lights and flog his chest and ass. Vander struggles but is trapped. Dirk tugs Vander's head back and makes him swallow his cock as Jack continues flogging him. Finally, they gag him and Dirk sinks his cock into Vander's tight boy hole. Dirk slaps his face and tells him to scream as much as he wants. Dirk rides Vander's ass hard and then the Horny Bandits push Vander down onto the bed and frost his face with their fat creamy loads. Then they jerk Vander off, squeezing every drop of cum out of his cock.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dirk Caber",
      "person_id": 27341
    },
    {
      "name": "Jack Dyer",
      "person_id": 62058
    },
    {
      "name": "Vander Pulaski",
      "person_id": 61944
    }
  ],
  "release_date": "2019-12-19",
  "scene_id": 45463,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "blond",
    "Blowjob",
    "Bondage",
    "christmas",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Flogging",
    "Gag",
    "Gay",
    "holidays",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "Swallow",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Homo Alone, Part One: Vander Pulaski Taken Down in Home Invasion"
}