{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Hot young teacher Zoe Sparx is in hot water with the Board of Education because she’s been posting lewd nudes online. The Board decides they have no choice but to make an example out of Zoe and they call in for a meeting. Zoe apologizes profusely and agrees to submit to whatever punishment the Board demands in order to keep her job. They tell her to write on the chalk board that she will not post nudes online. While Zoe writes, they discover she’s wore a glass butt plug to work today! They push her to her knees and make her suck all their cocks, one after the other. Mouth full of cock, Zoe repeats her promise to never post nudes online again. They inspect her holes as she drools all over their cocks. They tie a bimbo lip gag around her head and take turns fucking her face. Next they tie her hands behind her back, use nose hooks to pull open her nostrils, and push a pig tail plug in her ass. Zoe oinks and snorts for cock as her tight pussy gets rammed by hard cock after hard cock. The board members step on her head and make her lick their dirty boots. They stuff her ass full of cock too and Zoe comes hard as they paddle her thighs and fucks her ass. Zoe squeals as she gets stuffed from both ends. She loves the attention and squirts all over the board as they make her come. Then Zoe is put in a head harness bit gag and stuffed airtight. She moans as the board members use all her holes at the same time. She thanks them for giving her the discipline she craves. Finally, she begs for their cum and is rewarded with five hot loads on her face.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Zoe Sparx",
      "person_id": 62035
    }
  ],
  "release_date": "2020-02-05",
  "scene_id": 45475,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "bit gag",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Discipline",
    "Double Penetration",
    "Gag",
    "Gangbang",
    "Latinx",
    "mixed",
    "muscular",
    "Paddle",
    "harness",
    "Role Play",
    "Rough Sex",
    "Straight",
    "Stud",
    "Teacher",
    "top",
    "white"
  ],
  "title": "Dirty Pig Whore: Teacher Zoe Sparx Oinks for Cock, Stuffed Airtight"
}