{
  "collections": [
    "Families Tied"
  ],
  "description": "Lacy Lennon is a perfect princess, with sex appeal for days, and a complete lack of discipline or work ethic. She stomps and wails and throws her lithe body around her cluttered apartment while arguing with her busty red headed step-mother Penny Pax. Lacy claims her art practice meets the terms of her trust fund. Penny tries to be strict, but allows her manipulative little monster to talk her into one more chance at cleaning up her act. Lacy calls in the help of a life coach that specializes in discipline and self-organization, but fails to read the fine print and soon finds herself in an extreme and sexual therapeutic regime, aimed at using her privilege and slutty disposition against her. Once life coach Seth Gamble gets the waiver signed, he grabs Lacy in a choke hold and wrestles her into ankle and wrist shackles. Made to face her mess, Lacy fights back, but she is soon on her knees, sweeping and cleaning under Seth's strict spanking hand. She learns bad girls get the whip and good girls who clean get the cock. Lacy begins folding her clothes quickly while being railed like a whore on a pile of her laundry. Seth takes her mouth, throat fucking her until she is drooling everywhere, then places a lost tiara on her head in an act of degradation. Chained to a post and interrogated, Lacy admits she is enabled in her bad habits by her doting step-mother, and is rewarded for her honestly with a furious fucking that bring eye rolling orgasms. When Penny comes to visit her darling daughter for New Years Eve she finds Lacy in extreme spread legged bondage wearing a latex corset and fetish ballet boots. Lacy can only drool through her ball gag and watch as Seth strips Penny down of her entitlement and social status with a electro zapper, then caning her milky ass and tits so they are ripe for fucking. Using both Penny's ass and pussy in front of her daughter brings Lacy to taboo orgasms and leaves a wailing Penny to take the anal punishment like a dutiful mother. Penny is tied in a partial rope suspension and made to watch as her indoctrinated daughter licks her pussy, ass and Seth's cock in a trance. Lacy drools in a latex hood, tied on her knees, being an obedient little sex doll that cleans up the mess from her mother's fucked asshole and pussy. Penny cums again and again despite herself while begging for their release. Seth isn't done yet with Lacy's training and places her in full latex lingerie with silver trays that carry her and her mothers New Years Eve champagne toast glasses. He challenges to Lacy to hold the glasses with discipline as he whips and crops her trembling arms. Penny can only watch from the bed with her huge tits clamped tight and a party favor tied into her mouth. Lacy struggles and sweats and puts her most into the task, earning Seth's approval and a sexy New Years threesome fuck. Happy New Year!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Lacy Lennon",
      "person_id": 62053
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2020-01-01",
  "scene_id": 45470,
  "tags": [
    "Anal",
    "Ball Gag",
    "big dick",
    "Blonde",
    "Bondage",
    "brunet",
    "Caning",
    "Corset",
    "Discipline",
    "drool",
    "Family Roleplay",
    "Fetish",
    "Gag",
    "Hood",
    "Latex",
    "Lingerie",
    "muscular",
    "natural boobs",
    "shaved",
    "Spanking",
    "Straight",
    "Stud",
    "Suspension",
    "switch",
    "Threesome",
    "white",
    "Zapper"
  ],
  "title": "Bad Habits: New Year's Resolution Lands Family in Latex Anal Training"
}