{
  "collections": [
    "Everything Butt"
  ],
  "description": "Lexi Lore and Gia Derza sit in awkward silence, waiting for their couple’s therapy session with Dr. Aiden Starr. Aiden introduces her self to the two. She tells them to relax and listens to both sides. Gia explains that when Lexi is asleep, she plays with Lexi’s asshole, but never when she’s awake. Lexi wishes Gia would just be honest about her wants and needs. Aiden suggests a new technique to Gia and she agrees to it. Aiden dangles a pendant in front of her eyes and Gia drifts off to sleep. Just then, Aiden puts her arm around Lexi, gropes her tits through her short dress and tells her to bend over. Lexi spins around in her chair and puts her ass high in the air and Aiden shoves her thumb up Lexi’s ass. Aiden gets a clear glass butt-plug and slides it inside her hole. She pops it in and out, making Lexi’s asshole gape. Gia wakes up shocked to see her girlfriend getting her ass fucked by their therapist. Aiden yells at her to come lick her girlfriends asshole and Gia rushes to Lexi’s hole and licks it furiously. Aiden bends Gia over her leather chair and spanks her perfect tight round ass until it turns pink. She pulls Gia’s panties down and spreads her ass cheeks. Aiden takes a blue butt-plug and stuffs Gia’s ass with it. She stuffs it in and pulls it out making big gapes. She leaves the plug inside and presses a vibrator against her pussy and Gia cums so hard that she shoots the plug out of her ass. Aiden tells Gia to go masturbate in the corner while she watches her fuck her girlfriends ass with a big clear glass toy. She fucks Lexi with a strap-on and fucks Gia with a big dick on a stick. After stuffing a big metal ball, and the entire slink up Lexi’s ass, Aiden makes them kiss, ending their therapy session.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Gia Derza",
      "person_id": 61617
    },
    {
      "name": "Lexi Lore",
      "person_id": 61958
    }
  ],
  "release_date": "2020-02-21",
  "scene_id": 45473,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "big dick",
    "Blonde",
    "Brunette",
    "buttplug",
    "Couple",
    "Curvy",
    "Dildo",
    "Doctor",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaved",
    "slim",
    "slink",
    "Straight",
    "Tattoo",
    "Vibrator",
    "white"
  ],
  "title": "Anal Therapy: Aiden Starr Rekindles Lost Love Through Rough Anal"
}