{
  "collections": [
    "Everything Butt"
  ],
  "description": "Jane Wilde always knew there was something weird about her step-mom Lisey Sweet. One day Jane goes snooping around in her mom's bedroom and finds all kinds of kinky butt toys so finally it all makes sense! Now Jane knows \"My Mom is an Anal Whore!\" But of course Jane can not resist trying one of her enticing anal toys so she grabs a butt plug, Hitachi and goes to town! Right in the middle of a wild orgasm Lisey walks in and yells at Jane for using her stuff. Jane won't have any of this so she takes charge and decides to see just how much of an anal whore her step mom really is. Jane grabs Lisey and pushes her down between her legs and makes her suck pussy while Jane fucks her own ass with the butt-plug. Jane wants to get dirty with step-mommy so she crams the butt-plug in her mouth and makes her clean it off. But this is just the beginning of a long day of kinky, taboo style role-play for Jane and Lisey! On the bed Lisey lays back with her white lacy thigh-high stockings, garter belt and high heels while Jane grinds her pussy and ass on Lisey's face. Soon Jane gets curious about Lisey's ass so she pulls her panties to the side and checks out the goods. She shoots lube up her butt and fucks her hole with a clear butt plug while vibing her clit until Lisey cums. Next toy is bigger and longer and Jane stretches Lisey's asshole with it until it gapes. Now on her side Lisey holds her fuckhole open with her long black fingernails while Jane pounds her with a strap-on dildo and drives Lisey crazy. She tastes it and gets it all nice and wet and then flipped over onto all fours in doggie Jane fucks her ass into another big orgasm. Lisey wants to ride that cock so she climbs onto Jane's cock in reverse cowgirl position and bounces her sexy curvy butt all up in it until she cums again. So many toys to play with! Next Jane finds a dick on a stick and really takes Lisey over the top with multiple orgasms while she squirts all over Jane's face. Jane wants in on the anal whore action so Lisey gives her special treatment with a big glass dildo that causes her slutty hole to gape and leaves Jane a quivering mess. The day wouldn't be complete without a fist up someones ass so Jane does the honors and pries Laceys willing ass wide open with her hand and fists her into straight up heaven. Like mother like daughter Jane and Lisey are dirty little anal whores together!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Jane Wilde",
      "person_id": 61147
    },
    {
      "name": "Lisey Sweet",
      "person_id": 60674
    }
  ],
  "release_date": "2020-01-24",
  "scene_id": 45472,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Blonde",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Fisting",
    "Gaping",
    "High Heels",
    "Hitachi",
    "Kinky",
    "Lesbian",
    "LezDom",
    "multiple orgasms",
    "natural boobs",
    "Petite",
    "slim",
    "Squirting",
    "Straight",
    "Strap On",
    "top",
    "white"
  ],
  "title": "My Step-Mom Is An Anal Whore"
}