{
  "collections": [
    "Families Tied"
  ],
  "description": "India Summer has flown from the East Coast to check on her niece Gia Derza and Gia's Step-Daddy Derrick. It's been months since Gia's mother left, and her rich family has promised to help financially as long as India lets them know Gia's new condition is legit. Nothing has prepared India for what she finds in their suburban home in California: tiny teen Gia strapped down to the bed, writhing and threatening to fuck anything that moves. Gia giggles with psychotic glee as India runs from the room in fear. But it's all part of an act she and Derrick have put together since running her mother out of the house. The last step is to trick her aunt. Then Gia and her Step-Daddy will be free to enjoy their taboo relationship and posh life together. The first hitch in the plan comes when India seduces Derrick out of pity, and asks him to destroy her ass. Derrick can't resist her toned MILF body and epic blowjob skills. He puts India on her knees and fucks her face good. He then flogs and paddles her until her ass is hot and red with welts. Her arms and legs are pinned together with medical bandages so Derrick can enjoy both her holes. The deep fucking causes her eyes roll back in her head with anal orgasms. Derrick can't wait to fuck his step-daughter again, so he sneaks back into her room in the night to have his way with her in the medical restraints they used for their deception. Locked in a straitjacket, Gia obediently chokes and slobbers on his cock. Her legs are spread wide in a split with leather belts. He takes his time reminding her who is in charge, cropping her horny clit and wet pussy until she agrees to wait for permission to cum. She is rewarded with a pounding in her tight cunt with Daddy's dick. The second hitch in their plan comes when Gia screams so loudly while cumming all over Derrick cock she wakes her auntie fuck-face from a deep sleep. India creeps to Gia's room to investigate and finds her with Derrick. There is nothing left for them to do but work India over until she agrees to sign over the house. They tie her up in a tight rope shibari position and fuck both her ass and pussy, while Gia threatens her with an electro zapper and sits on her face. After cumming all over a degraded Aunt India, Gia steals the cock out of her aunt's ass and cleans it good for one final round of fuck torment. They keep edging India while pulling on her nipple clamps until she agrees to sign away the house and Gia's trust fund to Derrick. Satisfied that horny Aunt India is good for her word, Derrick sprays them both with a hot load of cum to sign the deal.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Gia Derza",
      "person_id": 61617
    },
    {
      "name": "India Summer",
      "person_id": 16909
    }
  ],
  "release_date": "2020-01-17",
  "scene_id": 45471,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "Brunette",
    "Curvy",
    "Edging",
    "Family Roleplay",
    "Humiliation",
    "Leather",
    "MILF",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Role Play",
    "shaped",
    "slim",
    "Straight",
    "Straitjacket",
    "Tattoo",
    "toned",
    "white",
    "Zapper"
  ],
  "title": "Auntie Fuck-Face: Teen Slut Destroys Her Ass with Her Step-Daddy"
}