{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Smoking hot babe Ana Foxxx does not put out on the first date so angry suitor Donny Sinns calls his boys over to give Ana more cock than she can handle. They break into her apartment, catch her on the couch, and roughly shove their fingers in her cunt and in her mouth. Ana struggles at first but after they push her to her knees, she is overwhelmed with cock and gives everyone a turn at her holes. As the boys fuck her mouth, spit trails down Ana's body, running from her mouth over her small tits directly to her wet pussy. Soon Ana becomes a messy sloppy sloppy slut taking cock after cock in her mouth. Next, the boys put Ana in a leather straight jacket that leaves her tits exposed. They flog her tits and stomach as they continue face fucking her. Once she's drenched in spit, they release her from bondage and stuff her from both ends. Ana works cocks with her hands, mouth, and pussy. She takes every hard cock in her tight cunt multiple times and cums hard as the boys take turns pounding her pussy. Soon they turn their attention to her ass. Ana moans as the first fat cock slides into her asshole. She gets passed around the group, each getting a turn fucking her perfect ass. Finally they double penetrate Ana in the pussy and ass at the same time. Ana cries out as they fuck both her holes. Her cries are soon muffled by the cock pushed into her mouth. Ana cums hard as these boys stuff her airtight. After they've had their fill, Ana gets on her knees and begs for their hot loads of cum. She gets her wish and they paint her face. Donny promises Ana that next time they'll do the same with a new group of friends. Ana can't wait.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    },
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2020-01-22",
  "scene_id": 45474,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Double Penetration",
    "drool",
    "Facial",
    "foreskin",
    "Gangbang",
    "Leather",
    "mixed",
    "muscular",
    "natural boobs",
    "Petite",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Small Tits",
    "Smoking",
    "spit",
    "Straight",
    "Straitjacket",
    "Stud",
    "top",
    "white"
  ],
  "title": "Hot Fit Slut Ana Foxxx Bound, Fucked, DP'd and Stuffed Airtight"
}