{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Phoenix Madina is 29. Unfortunately, she's only had one boyfriend who was a bit kinky, but that's it. Nothing more than some spanking and handcuffs. On top of this, apart from him, all her boyfriends have been shit. Getting on the train from Bradford in Yorkshire to Southend, Phoenix had things she wanted to learn from PSS, which is why her Yeah list went like this:\n- Vaginal fucking\n- Physical domination & verbal abuse\n- Bondage\n- Orgasms\n- Spanking\n- Squirting\n- Deepthroat & face-fucking\n- Choking\n- Face-slapping\n- Face-spitting\n- Cumshot & swallowing\nFortunately, this is a woman on a voyage of self-discovery. She recently packed in a successful business running (and co-owning) a hair salon. At the same time, she started getting her tats done. She was a horny, exhibitionist girl who wanted to strip down and fuck for all to see. Right place, right time for everyone as PascalsSubSluts offered her a gig fucking in a way she's never had the chance to seriously do before. Perfect girl for us. During the scene itself (at the start of which she's seriously shitting bricks), there are two great things that happen: first, she realises she's a pain slut (because P beats her hard and she lets him do it for ages before saying yellow) and second, she adores the whole obedience thing. Early on, I get her to thank Pascal for spanking her, and she carries on saying it at various times throughout the scene without any prompting. There's nothing quite as erotic as a girl voluntarily putting herself into a position of complete sexual servitude like that. So yes, it's a seriously hot fucking scene! There's real chemistry between the pair of them, as she squirts lots and cums loads, and even better...she just wants more and more of it without fail!",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Phoenix Madina",
      "person_id": 62363
    }
  ],
  "release_date": "2019-11-21",
  "scene_id": 45486,
  "tags": [
    "Athletic",
    "big dick",
    "Blindfold",
    "Bondage",
    "brunet",
    "Choking",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Facial",
    "foreskin",
    "Kinky",
    "Pain",
    "Pain Slut",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Squirting",
    "Straight",
    "Sub",
    "Tattoo",
    "thirdparty",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Phoenix Madina: Virgin SubSlut Craves It Rough"
}