{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Tag on his knees in a submissive position, wearing locking leather wrist and ankle restraints. Doug attaches Tag’s outstretched wrists to chains that hang from the ceiling, Tag’s outstretched ankles to a long spreader bar. He winds a flogger erotically around Tag’s neck and over his face. He plug-gags Tag then starts flogging Tag’s ass and back. Sean lies down in his cage, watching. Every so often Doug stops flogging to rub Tag’s back and ass, and handspank his ass. Tag cries out through his gag as his back turns redder. Doug pauses, caresses him, then recommences, concentrating on Tag’s ass. He embraces Tag from behind, holds his gag tight with one hand and pinches his nipples with the other. Tag cries out as much as he can. Fadeout.Fade up. Doug stands behind Tag, squeezing and slapping his nipples. He feels Tag’s dick, which is almost hard, and slaps at Tag’s balls. He moves off, only to return with a riding crop, which he smacks against Tag’s thighs. Blackout. Lights up on Doug slapping Tag’s dick with the riding crop, hard. Tag roars in pain through his gag. Doug slaps Tag’s balls with the crop, then alternates between Tag’s dick and his balls. Tag, drooling around his gag, stays hard throughout. blackout. Lights up on Doug detaching the spreader bar from Tag’s ankles. Tag brings his legs together. Doug detaches Tag’s wrists from the chains. He turns Tag to face him and puts Tag on his knees, then removes his gag. Cut to Sean lying in his cage. Tag kneels in submission. Doug puts his cock at Tag’s lips but Tag waits for it to be inserted, after which he sucks it lovingly and obediently. Tag takes Doug’s cock all the way down, stays down on it. blackout.",
  "directors": [],
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 61819
    },
    {
      "name": "Sean Patrick",
      "person_id": 61551
    },
    {
      "name": "Tag Adams",
      "person_id": 62428
    }
  ],
  "release_date": "2019-11-21",
  "scene_id": 45487,
  "tags": [
    "Blowjob",
    "Bondage",
    "brunet",
    "Cage",
    "Chains",
    "Crop",
    "Flogging",
    "Gag",
    "Gay",
    "Leather",
    "Mask",
    "Pain",
    "Slapping",
    "Submission",
    "Partner Studio",
    "Twink",
    "white"
  ],
  "title": "Tag Punished: The Flogging"
}