{
  "collections": [
    "TS Seduction"
  ],
  "description": "TS top Aspen Brooks is the lady of the house and she wants things done a certain way. In fact she is a domestic dominatrix and Jessie Prather is her dirty little submissive slave who will do anything for his Duchess Aspen. Although today he is a little behind schedule so he must be punished. Aspen comes sauntering down the hallway in black patent leather heels and a super sexy corset with thigh-high stockings. Her fiery orange hair matches her fingernails and she means business! Jessie was supposed to be done with the dishes and Aspen’s daily lemon water should have been prepared but it’s not so Aspen motivates him by paddling his little ass with a wooden spoon until it turns bright red. Now she is ready for a show so she tells Jessie to strip all his clothes off and get into position. She puts tight clothes pins on his nipples and reminds Jessie who owns him and what a privilege it is to serve Duchess Aspen. With his hands behind his back Jessie sucks Aspens huge dick which makes her super hard and hot for some ass. She bends him over the table and fucks his tight ass with her big girl cock. Aspen moves Jessie onto the couch where she spreads his legs and his butt wide open and continues fucking his wee slave ass while her big voluptuous tits bulge from the top of her inviting lingerie. Next Jessie mounts Aspen’s big dick in cowboy position and rides that hard cock until Aspen wants him back on all fours where she pounds his ass out until she shoots her hot load all over his ass. Poor little Jessie doesn’t get to cum because Aspens lemon water was not ready when she wanted it. Maybe he will do better next time.",
  "directors": [],
  "models": [
    {
      "name": "Aspen Brooks",
      "person_id": 59054
    },
    {
      "name": "Jessie Prather",
      "person_id": 62481
    }
  ],
  "release_date": "2020-01-14",
  "scene_id": 45499,
  "tags": [
    "Anal",
    "big dick",
    "Blowjob",
    "Cock Worship",
    "Corset",
    "domestic",
    "Dominatrix",
    "Leather",
    "Lingerie",
    "Role Play",
    "shaved",
    "Slave",
    "Straight",
    "tea2020",
    "toned",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Aspen Brooks fucks new comer Jessie Prather into domestic bliss"
}