{
  "collections": [
    "TS Seduction"
  ],
  "description": "Fresh meat Alex Killian submits to hot top Korra Del Rio in this sexy Valentines Day special.\nSensual domination is Goddess Korra’s forte and oh boy does she deliver once she gets her hands on this new submissive slut Alex. Decked out in seductive, strappy black lingerie, thigh high stockings and heels Korra leaves a note on Alex’s door inviting her dirty little Valentine pet to come down to her chambers so she can have her way with him. Once he arrives into her web of tantalizing temptation she puts him in a cage with leather cuffs and collar and lays out the rules for the day. Goddess Korra demands suffering, submission and total obedience from her toy. Today Alex will be worshiping every inch of Korra’s perfection and he will have to work for her cock. First some foot worship with the threat of the crop and then a face full of ass for Alex to explore. She promises the deeper his tongue goes in her ass the harder she will fuck him. After he adores her sexy ass Korra sets Alex to fuck his own hole on a dildo to get him warmed up. Then to further her pleasure she gets a good deep dick sucking from her little cock whore as she trains him to be her perfect toy. Bent over a table with his ass exposed and ready Goddess Korra slides her hard cock into Alex’s ass and pounds him hard until his legs are shaking and he is begging for more. But first Korra puts Alex on his back and rides his face with her ass and gives him a throat fucking that makes his dick extra hard and on edge. Now it’s time for Korra’s Dirty Valentine to get his ass pounded further into submission so with his legs spread wide she fucks him hard and deep until he shoots his load all over himself. And then Goddess Del Rio gets herself off by fucking his slutty hole until she fills him up with her warm lovin’ cum. Happy Valentines Day!",
  "directors": [],
  "models": [
    {
      "name": "Alex Killian",
      "person_id": 62000
    },
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    }
  ],
  "release_date": "2020-02-11",
  "scene_id": 45495,
  "tags": [
    "Anal",
    "Blowjob",
    "Brunette",
    "Cage",
    "Cock Worship",
    "Collar",
    "Crop",
    "Dildo",
    "Domination",
    "Foot Worship",
    "foreskin",
    "Leather",
    "Leather Cuffs",
    "Lingerie",
    "natural boobs",
    "Role Play",
    "shaped",
    "slim",
    "Straight",
    "Submission",
    "tea2020",
    "top",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Korra's Dirty Valentine: Korra Del Rio Takes Down Alex Killian"
}