{
  "collections": [
    "Evolved Fights Lesbian Edition"
  ],
  "description": "Daisy “Lethal Legs” Ducati is on the mats doing our Lesbian wrestling today. She has wrestled many\ntimes for our Mixed wrestling site and we keep bringing her back because she lives up so well to her\nwrestling name “Lethal Legs”. She’s a tall dark beauty who dominates physically, mentally, sexually,\nverbally…do we really need to go on? Daisy is the full package. Today, The full package is taking on a\nsmall package. Little miss Gabriella Paltrova also lives up to her wrestling name “Fun Sized Human.”\nGabriella is a Petite woman with a curvy physique that will drive you crazy. She’s got natural tits and ass\nthat are so firm and juicy we are scared our wrestlers are going to start throwing matches just so\nGabriella will put her big beautiful ass on their face. Despite her fun size, Gabriella is a demon on the\nmats. She’s hardcore and never gives up. We want to make our matches more sexual so we have\nintegrated a penalty segment anytime there is a submission. If there is a submission during the fight, The\nwrestler to administered and successfully applied the submission will get 20 seconds to do anything she\nwants to the person who submitted. There is no fighting back during this 20-second penalty. The person\nto submitted must lay there and take it. We get many orgasms during this time which are not counted\ntowards the outcome of the score because the clock is stopped during this penalty time. This is a close\nmatch judging by the score. But only one girl can win. The winner fucks the Loser with Hair pulling, hand\ngagging, hardcore pussy fucking so deep it leaves the loser’s pussy gaping open. Then let loser is fucked\nso hard anally that her asshole gapes wide open and never closes. Poor loser, now everyone will know\nshe lost today because her butthole won’t close.",
  "directors": [],
  "models": [
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Gabriella Paltrova",
      "person_id": 41906
    }
  ],
  "release_date": "2019-11-26",
  "scene_id": 45493,
  "tags": [
    "Anal",
    "black hair",
    "Curvy",
    "erotic wrestling",
    "Facesitting",
    "Fingering",
    "Gaping",
    "Hair Pulling",
    "Lesbian",
    "mixed",
    "natural boobs",
    "Petite",
    "Redhead",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Strong legged beauty destroys Petite big butt girl then fucks\nher"
}