{
  "collections": [
    "CFNMEU"
  ],
  "description": "Kamil Banek is a very sexy str8 guy. He is sleeping and tosses and turns as his sexy cleaning lady dusts the furniture. She keeps looking at Kamil as he sleeps. He turns over, and we see his underwear tenting with his erection. The girl notices and approaches the bed and begins to run a hand over Kamil’s sexy body. She lets her hand rub over the underwear and the stiff dick inside. Kamil wakes as she does that, and the girl, clearly having experience of the situation, shackles Kamil’s wrists, tying them to the bed. Kamil is clearly turned on by the events as his dick stays hard in the underwear. The girl grabs the dick in the underwear. Then she runs her hands all over Kamil’s body. She slaps his chest and pulls off the underwear, releasing that stiff cock. She takes hold of it and wanks it as she slaps his chest and his face. Taking some clothespins she put them on Kamil’s nipples and then rubs his cock and balls. She places pins on the balls too. Then she puts a gag into his mouth to stop any very loud moans. Keeping him rock hard, the girl continues to torment him, using a vibrating massager on his cock and balls. Kamil writhes as he feels it, and his cock twitches in pleasure. The girl wanks the stiff cock as the balls are vibrated and Kamil thrusts his hips. Then the girl takes a whip and uses it on that hot body. Kamil’s legs are raised in the air, exposing his tight hole. The girl whips his hot ass and then wanks his cock a bit. She takes a dildo and slides it into Kamil’s ass, fucking it in and out. As shes fucks that ass the girl wanks his cock too. Kamil feels the toy deep in his hole and he twitches as it comes out and is then pushed in again. A thicker toy is then used to fuck that hot ass, and still his dick stays so hard. Kamil is turned over onto his knees and he takes that vibrator deep in his ass again. Then he is released and lays on his back to wank his cock until he shoots the thick, creamy, cum onto his hot body.",
  "directors": [],
  "models": [
    {
      "name": "Kamil Banek",
      "person_id": 62322
    },
    {
      "name": "Lucy Vojak",
      "person_id": 62062
    }
  ],
  "release_date": "2019-11-27",
  "scene_id": 45494,
  "tags": [
    "Anal",
    "bit gag",
    "CBT",
    "CFNM",
    "Clothespins",
    "Dildo",
    "Flogging",
    "Gag",
    "Hitachi",
    "Male Sub",
    "Rope Bondage",
    "Straight",
    "Partner Studio",
    "Vibrator"
  ],
  "title": "CFNM KAMIL BANEK"
}