{
  "collections": [
    "TS Seduction"
  ],
  "description": "The stunning busty Eva Maxim is bound in leather cuffs to the ceiling and waiting to submit her body. In black lingerie her body writhes in desire for pain and pleasure. Her beautiful cock is hard and exposed for her master. The dominant, muscular Ricky Larkin walks in ready to deliver a brutal punishment. First comes the crop which he uses on Eva’s round tight ass. Turning pink, it’s time for more corporal punishment. As he bites and licks her tight curvy body, a leather paddle comes out and delivers pain to Eva’s armpits. She screams and begs for more. The crop is used on her cock and balls. Next comes out a painful flogger. Ricky’s muscles deliver a brutal flogging on Eva’s back and ass. Ricky applies clothespins to Eva’s ass as well. As Ricky chokes Eva’s slender neck, she begs him to please fuck her. Ricky’s massive hard cock gives Eva a deep hard anal fucking. He pounds away on his beautiful nasty slut. Flipping her over Ricky rims Eva and sucks her cock. Deep throat cock sucking gets her rock hard for more fucking. Both Eva and Ricky shoot a huge load over her big tits. Eva is Ricky’s Nasty Girl.",
  "directors": [],
  "models": [
    {
      "name": "Eva Maxim",
      "person_id": 62480
    },
    {
      "name": "Ricky Larkin",
      "person_id": 35556
    }
  ],
  "release_date": "2020-02-18",
  "scene_id": 45497,
  "tags": [
    "Anal",
    "big dick",
    "Big Tits",
    "black hair",
    "Blowjob",
    "Brutal Punishment",
    "Clothespins",
    "Cock Worship",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Flogging",
    "Leather",
    "Leather Cuffs",
    "Lingerie",
    "Male Fucks TS",
    "master",
    "mixed",
    "muscular",
    "Paddle",
    "Pain",
    "Role Play",
    "shaped",
    "Straight",
    "switch",
    "Tattoo",
    "TS",
    "versatile"
  ],
  "title": "I'm Your Nasty Girl: Eva Maxim Submits Her Body to Ricky Larkin"
}