{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Stunning Lauren Phillips leads her boyfriend Dillon Diaz, blindfolded into a mysterious room. Dressed in a black dress and stockings, she guides her boyfriend to a couch. Happy one month anniversary, she has a surprise for him. Teasing his senses, she undresses and zips into a corset and thigh high boots. The zipper sounds get him excited, but he has no idea what punishment and pleasure is in store. Are you ready to play. Lauren in her corset shows off her busty chest, she is about to show him her Dominant Femdom side. First he is made to strip down naked. But, there are rules. She is Miss Phillips and she will be respected in her dungeon. A hard slap across his face reminds him of the rules. Next is pain, nipple clamps come out and he screams as they are applied. His cock gets harder as the pull against the chains on his chest. He begs to have them come off, and she slaps him harder. Flipped over on all fours, she brings out the paddles and he takes a beating on his ass. Please Miss Phillips. Will he be a good boy for his Mistress. Tied up in rope bondage he begins to worship her feet and stockings. She shoves her foot down is mouth. Oh but what else could this good boy put down is mouth. How about this big strap on she is wearing. He gets it wet first, before taking a deep anal strapon fucking. She sits on his face and smothers him with her ass. Oh it's time for her pleasure, this isn't all about the good boy. Tied up in rope bondage suspension, he is made to eat her ass and pleasure her pussy with pussy licking. Now she will use his body, his hard cock. She fucks him hard and cums hard with the hitachi. Will this good boy get to cum too?",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2020-02-11",
  "scene_id": 45500,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Bondage",
    "CBT",
    "Chains",
    "Corporal Punishment",
    "Corset",
    "Couple",
    "Crop",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Male Sub",
    "Nipple Clamps",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Redhead",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Suspension",
    "switch",
    "toned",
    "white",
    "Zipper"
  ],
  "title": "Punishing the Good Boy: Kinky Couple Explores FemDom Punishment & Pain"
}