{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Demi Sutra has built her company from the ground up. Her only mistake is trusting her long time business partner Seth Gamble. Seth is sick of listening to Demi and decides it’s time to take charge. He kidnaps her, strips her to her bra and panties, and has her tied and gagged. Now Demi has no other choice but to sign the contract Seth has drawn up which gives her shares of the company to him. Demi thinks after she signs Seth will let her go, but Seth has other plans. He knows he has to show Demi who is in charge and make Demi respect him. He slaps her across the face and makes her acknowledge that he’s her boss now. He tells Demi he’s willing to let her have a job with the company if Demi obeys his every order, starting with sucking his cock. Demi begrudgingly opens her mouth and blows her new boss. Seth groans as her lips close around his cock. This moment is better than he could’ve imagined. Demi is humiliated as Seth fucks her face and makes her call him boss. Even more embarrassing is as much as she doesn’t want this, her pussy is dripping wet. Next, Demi is tied on her knees and flogged. Demi’s feet kick out as she struggles in bondage. She cries out as Seth sinks his rock hard cock into her warm wet cunt. He fucks her hard and fast. Each thrust stretches open her tight pussy. Then he makes her ride him. Demi bounces up and down on her new boss’ cock before Seth ties her down on her back with her legs spread. Demi moans as Seth fucks her cunt and punches her ass. She begs to cum and cums hard on her boss’ cock. Finally, Seth blows his load all over Demi and makes her admit once more that he is the boss.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Demi Sutra",
      "person_id": 61557
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2020-02-14",
  "scene_id": 45512,
  "tags": [
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Humiliation",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "Submission",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Hostile Takeover: Boss Bitch Demi Sutra Dominated by Company Partner"
}