{
  "collections": [
    "Device Bondage"
  ],
  "description": "Joanna Angel is a porn legend, and today she gives us one more reason to love her. Today she takes on The Pope for our Device Bondage channel, and she gives us everything she has. She begins in a slight predicament, with all of her weight resting on her sweet, fuckable pussy, her arms pulled back, and her legs spread, and off the floor. A red ball gag is shoved into her mouth and she silently awaits her captor’s return. She has never claimed to be a pain slut, but she damn sure shows us how fucking tough she really is. The Pope flogs her flesh with a big leather flogger, and takes aim at all of her most sensitive spots. The scene concludes with some bastinado to tenderize her precious soles. Next Joanna is put in a doggy type position, locked in leather straps that prop her perfect ass is higher than the rest of her body, making it a perfect target. Her ass is flogged, harder and harder, then her feet are caned, before The Pope fucks her mouth and pussy. The orgasms pour out of her exposed cunt, and then he fingers her g-spot to impose multiple orgasms. In the final scene, Joanna is on her back in a spread eagle style position. She’s got multiple large tattoos, which means we can abuse those areas more… it just adds more color! Joanna is pushed all the way to the edge of her tolerance, with constant torment and pain, but she just doesn’t break. The orgasms start, and she finds out that she can be tormented by them as well. She cums like a desperate pain slut, more than she’s ever cum before at one time. She cannot believe that this is happening, and she has no idea when it will stop.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Joanna Angel",
      "person_id": 61458
    }
  ],
  "release_date": "2020-01-09",
  "scene_id": 45513,
  "tags": [
    "Ball Gag",
    "BDSM",
    "black hair",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "multiple orgasms",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "Straight",
    "Submission",
    "Tattoo",
    "The Pope",
    "toned",
    "white"
  ],
  "title": "Joanna Angel: Tattooed Slut Made to Cum in Grueling Bondage"
}