{
  "collections": [
    "Hogtied"
  ],
  "description": "Maddy is a dirty slut, and she loves getting tied up and tormented, but we haven’t had her on the pages of Kink.com for many years. That changes today when she submits to The Pope. How could anyone say no to that? We now present to you Maddy O’Reilly, bound and beaten and made to cum. Maddy begins her journey on her knees like every good whore should, in inescapable bondage. The Pope enters and we get right into the good stuff. After some flogging and cropping, we find out how playful Maddy can be. She clearly loves this more than any of us may have thought, so The Pope cranks up the intensity with some brutal bastinado. She is rewarded with multiple orgasms before moving on to the next scene, where we have Maddy face down and ass up to showcase her luscious ass. The only proper thing to do in this scenario is a double flogging scene to ensure maximum suffering. Her ass and back are berated with non-stop flogging until her flesh glows a bright red. That is followed with some heavy-handed spanking, then she is fucked and made to orgasms repeatedly. The final scene begins with Maddy spread eagle on the floor. She is as helpless as she can possibly be, and The Pope takes full advantage of the situation. Her beautiful suffering is heightened with a cat o nine tails as it whips her flesh. She squeals as he hits all of her sensitive spots. The cane stripes her body, then The Pope moves on to the brutal torment of her feet with a knitting needle. The orgasms are plentiful as the scene wraps up. It’s been a while since we’ve seen Maddy, but we are confident in saying it’s totally been worth the wait.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Maddy O'Reilly",
      "person_id": 41042
    }
  ],
  "release_date": "2020-02-12",
  "scene_id": 45519,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "multiple orgasms",
    "natural boobs",
    "Rope Bondage",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Maddy O'Reilly: Naughty Slut Submits to The Pope"
}