{
  "collections": [
    "Device Bondage"
  ],
  "description": "Cam Damage is new to us at Kink, but bondage and torment are right up her alley. She's a hardcore bottom that loves to be helpless in extreme bondage, so putting her on Device Bondage makes perfect sense. The devices are designed to ensure her ultimate suffering, and The Pope adds his own sadistic play to push her over the edge. Cam begins in a bridge position with her pussy pushed up and vulnerable. Her bush is the first target, and he plucks her pubes like flowers in the spring. Her flesh is warmed up with a flogger, and then the crop is used to bring out the red in all of her tattoos. The Pope then plays the game of crop or vibe, and not allowing her to orgasm until her pussy is so sensitive that she can no longer help herself. Her tits are covered with clothes pins and then they are slapped off to increase her pain level. The second scene begins and Cam is in a doggy position with her arms pulled out to her side. The Pope comes in and rips at her flesh to get her ready for the torment that is coming. Nipple clamps are added and then weights are added to them, so that the intensity is increased even more. Her ass is target of the next assault, because Cam is one tough bitch, and The Pope takes full advantage of that fact. After properly\nabusing this slut, he shoves a huge dildo down her throat and then deep inside of her pussy. The orgasms flow quickly! Next Cam is in a seated position with her arms pulled into a mild strappado. She is more exposed than ever, and The Pope takes full advantage of this. Her flesh is showing signs of wear from all of the torment, but she is still a very willing participant in this sadistic dance. The pain only gets more intense from this point. The Pope doesn't get to play at this level often, so when given the opportunity with someone as tough as Cam Damage, he enjoys every second of her suffering.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Cam Damage",
      "person_id": 62498
    }
  ],
  "release_date": "2020-03-05",
  "scene_id": 45517,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "Bush",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "Nipple Clamps",
    "Pain",
    "Straight",
    "Submission",
    "The Pope",
    "Weights"
  ],
  "title": "Cam Damage: First Time Torment For A Badass Bitch"
}