{
  "collections": [
    "Device Bondage"
  ],
  "description": "Lacy Lennon is a sexy, sensual redhead who gives everything she’s got, on every shoot. Today is no different, except The Pope has higher expectations of her than last time. Lacy starts the day seated on a large wooden throne with her hands pulled out and restrained with steel traps. Her ankles are held in place with steel shackles, and her head is locked in a deprivation box. The box has a two way mirror that allows us to see inside, but she cannot see out. The box makes her stare at herself while she is suffering, which is a mind-fuck all its own. The torment starts and Lacey closes her eyes and looks deep into herself for the strength to tolerate the pain. The Pope will not allow that, and makes her open her eyes, so she is fully present during the suffering. After some impact play, he applies mouse traps to her pussy and then tapes them to her leg to spread her nice and wide. A vibe is brought in to press against her stretched out pussy for her to cum. Scene two begins and Lacy is bent over in a doggy position with her hands pulled far out in front of her. The Pope adds a spike pad to the bottom of each of her feet. He then begins to explore her body, and decides to spend some quality time fucking her tight whore cunt. The orgasms begin, and it isn’t long before her pussy is gushing with squirting orgasms. He puts down the dildo and starts to milk her pussy for more orgasms and she soaks the entire table with her juices. In the final scene we have Lacy on her side with one leg pulled up high, exposing her pussy to whatever The Pope’s sadistic mind can drum up. Nipple clamps are applied to her sensitive tits, and then she is throat fucked before he moves to her pussy again. He launches a full-out assault on her fucked cunt with the plan to drain her of all of her juices. She shows us a prime example of imposed orgasms when she has to just lay there and take it until he decides to stop.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Lacy Lennon",
      "person_id": 62053
    }
  ],
  "release_date": "2020-02-20",
  "scene_id": 45516,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Deprivation",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "mind fuck",
    "Nipple Clamps",
    "Pain",
    "Redhead",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope"
  ],
  "title": "Lacy Lennon: Gorgeous Redhead's Sensual Submission"
}