{
  "collections": [
    "Device Bondage"
  ],
  "description": "The day begins with Charlotte restrained in heavy, cold\nsteel chains, with her neck locked into place with a steel neck trap. The Pope\nenters with a fist full of nipple clamps and with one goal in mind, which is to\nmake Charlotte squeal. As he decorates her nipples with clamps, she winces\nin agony as they squeeze her sensitive nipples. Next, he grabs a crop and with\nabsolute precision, he attacks her flesh to reign pure agony down on her.\nCharlotte is at the end of her rope, and just as she is ready to throw in the\ntowel, The Pope switches gears and begins to make her cum uncontrollably.\nHer knees are weak and she is about to give out when he finishes with her\nand leaves her alone awaiting the next device. The second scene begins with\nCharlotte in a sitting position with her legs spread and her arms pulled out\nwide. Leather belts hold our porcelain doll in place as he enters and begins to\nrub her pussy. His massive hands caress her flesh, then squeeze it until she\nscreams, then hits her for maximum effectiveness. A heavy flogger comes\nout and her ass is beaten with it, then The Pope moves around to the front of\nher and issues some breath control. Her front side is turned to a bright red\nwith his flogger, and just as we see her begin to break, he quickly clinches her\nthroat in his hand and our little slut smiles with pleasure. Multiple orgasms\nfinish the scene and leave Charlotte one step closer to her final destruction.\nIn the final scene, Charlotte is folded in half with her feet and ass on full\ndisplay. The Pope makes sure to assault every inch of flesh that he can get to.\nHer feet suffer through a nasty bastinado, and her ass is caned, but the part\nthat almost breaks her is when he stretches her nipples as far as he can\nusing the cane. Alligator clips are applied to her pussy and then she is vibed\nuntil she can no longer take it.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    }
  ],
  "release_date": "2020-02-06",
  "scene_id": 45514,
  "tags": [
    "BDSM",
    "black hair",
    "Bondage",
    "bottom",
    "Chains",
    "Corporal Punishment",
    "Crop",
    "Destruction",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "multiple orgasms",
    "natural boobs",
    "Nipple Clamps",
    "shaved",
    "Straight",
    "Submission",
    "Tattoo",
    "The Pope",
    "toned",
    "white"
  ],
  "title": "Charlotte Sartre: Gothic Torment in Diabolical Bondage"
}