{
  "collections": [
    "Hogtied"
  ],
  "description": "Katie Kush is a sweet and innocent looking slut who’s just bratty enough to motivate The Pope to do every last nasty thing to her. It’s not a secret that he loves brats, but we’re not sure if Katie is ready for the repercussions of behaving that way with him. We begin the day with Katie in a full split suspension, just to show her what happens when brats need to be put in their place. This doesn’t curb her brattiness, but rather inspires her to taunt him even more. The positive thing to remember is that she is willing to endure whatever he throws at her when she pushes his buttons, so this is going to be an interesting shoot no matter what. The next position is also a suspension, but this one is very asymmetrical and it pulls this slut in every direction. Orgasm after orgasm is ripped from her slutty pussy, and she begins to show signs of submission as the pain is ramped up. After two brutal suspensions, you would think that she would be a little less bratty, but this is not the case. She continues to antagonize him to see how sadistic he can\nreally be, and soon finds out how fucking twisted this man is. Katie is now folded in half, and her arms are tied in a way that they are what holds her in place for the next dose of torment. Now the pain comes faster and harder, and suddenly Katie realizes that her mouth may have gotten her in more trouble than her body was capable of handling. The torment is brutal and she begins to wonder if she is going to make it to the end. Her throat and pussy are fucked mercilessly until she can no longer take the stimulation. In the final scene, Katie is atop a wooden box with her limbs pulled up and away from her body leaving her completely helpless. Foot torment, breath control, and imposed orgasms close out the day as we see Katie finally submit to The Pope.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Katie Kush",
      "person_id": 62547
    }
  ],
  "release_date": "2020-02-26",
  "scene_id": 45521,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Foot Torment",
    "Handler",
    "Humiliation",
    "Pain",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Katie Kush: Blonde, All Natural, Flexible Slut in Grueling Bondage"
}