{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Starting from the bottom now you’re here, at Ryan Keely’s delicious feet. Her hand’s motion up and down as she caresses her calves, then her thighs, getting closer to her gorgeous pussy. She spreads her legs as she describes dragging her tongue up and down yours. Her pussy lips glisten as she begins to pet them telling you to touch yourself. She slides two wet, slippery fingers into her dripping cunt and instructs you to do the same to yours. She knows you’re a slut and what you want is to please yourself, which maybe you don’t do nearly enough. So sit, watch, and mimic Ryan as she shows you just how to make your pussy throb and swell with orgasmic anticipation. With bright red nails she squeezes her pussy lips and clit making small circles with her fingers. She wants to lick your cunt, taste your cum all over her face, feel you let go, so don’t stop playing with your pretty pussy. She stands up to show you her beautiful, bubbly ass. She spanks herself and tells you to play with your g-spot if that’s what makes you wet. You see, she’s a bad girl, too. She likes spanking herself and showing off for strangers, just like you’re gonna do for her. She licks her fingers and tells you to get a toy if you need one. She beats her clit faster and faster with her fingers and tells you to cum with her as she gets closer to orgasm. She doesn’t care how you do it, Ryan just wants you to cum for her. She writhes and strokes until she explodes with pleasure, thinking about you riding her face the whole time.",
  "directors": [],
  "models": [
    {
      "name": "Ryan Keely",
      "person_id": 15370
    }
  ],
  "release_date": "2019-12-05",
  "scene_id": 45529,
  "tags": [
    "Bondage",
    "bottom",
    "Brunette",
    "Cuckolding",
    "Feet",
    "Femdom",
    "Fetish",
    "JOI",
    "Kinky",
    "Latinx",
    "Lesbian",
    "masturbation",
    "natural boobs",
    "slim",
    "Solo Female",
    "Spanking",
    "Straight",
    "Partner Studio"
  ],
  "title": "KINKY JOI: Ryan Keely's Female JOI"
}