{
  "collections": [
    "TS Seduction"
  ],
  "description": "Shiri Allwood is an unpaid intern, working hard for her boss Dale Savage. She’s put in a lot of overtime and is always going above and beyond for the company. She applies for a manager position and is sure she’s going to get it. When her boss calls her into his office, she anxiously waits for the good news but instead its bad news. He tells her another guy in the office got the job, and that if she were to show a little more skin around the office, maybe she would get ahead easier. Shiri slaps him in the face and commands him to get on his knees. Shocked and surprised but not scared, Dale smiles and gets to his knees. She takes a seat and puts one long leg out to Dale and tells him to worship her feet. Dale takes off her high heels, licks, sucks, and kisses her stocking covered feet. Shiri rips her stockings open, exposing her pretty feet and and Dale gets to work sliding his tongue in between her toes. He kisses all the way up to her thighs and Shiri pulls up her short skirt to show him his next treat, her hard cock. He sucks her cock with enthusiasm, drooling all over himself. Shiri gets so turned on by the power she has over him, she turns around and spreads her ass cheeks and tells him to lick her asshole. She smothers his face between her ass cheeks, and he licks her pretty pink hole until she tells him to stop. In the next scene, Dale is naked, blindfolded, and hogtied with leather cuffs and straps. Shiri stands over him with an electronic zapper. She zaps him a couple times and it gets her cock rock hard and ready to fuck his ass. She sinks her cock into his hairy hole and fucks him deep and hard.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Dale Savage",
      "person_id": 62015
    },
    {
      "name": "Shiri Allwood",
      "person_id": 61393
    }
  ],
  "release_date": "2020-01-28",
  "scene_id": 45526,
  "tags": [
    "Anal",
    "Blindfold",
    "Blowjob",
    "Cock Worship",
    "Couple",
    "Feet",
    "Gag",
    "Hairy",
    "High Heels",
    "Leather",
    "Leather Cuffs",
    "natural boobs",
    "Redhead",
    "Role Play",
    "slim",
    "Straight",
    "TS",
    "TS Fucks Male",
    "white",
    "Zapper"
  ],
  "title": "Getting Ahead: Shiri Allwood Owns Her Boss, Dale Savage With Her Cock"
}