{
  "collections": [
    "Hogtied"
  ],
  "description": "Since Hogtied started, there have been several styles, and riggers that have been featured on these pages. The one style that has been shared by all of them is the traditional basic bondage style. It’s not showing off. It’s not overly stylized. It’s simply effective bondage that renders the model totally helpless in tight ropes. Today we have a classic bondage shoot featuring a smoking hot model, Carmen Valentina. Carmen begins in a standing position with her hands above her head and her legs spread wide. A large red ball gag makes her mouth drool, which drips down her body and makes it glisten. The Pope takes his time tormenting her with different implements before giving her her the first of many orgasms. Next Carmen is in a traditional hogtie suspension. She gets flogged on her pussy before a crop is used to precisely attack the sensitive spots on her body as he holds a vibe against her pussy. She is not allowed to cum until he says so, and he is in the mood for some tease and denial. The Pope introduces a large dildo and fucks Carmen’s mouth before shoving it inside her pussy. The orgasms pour out of her pussy before he exits the scene. The final scene is upon us and Carmen is on her back with her legs up and spread. The Pope puts rubber bands on her feet to start the suffering. What follows is the most intense bastinado that Carmen has ever had to endure. The day is finished up with more pussy fucking and non stop orgasms.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Carmen Valentina",
      "person_id": 59901
    }
  ],
  "release_date": "2020-03-11",
  "scene_id": 45522,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "drool",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Latinx",
    "natural boobs",
    "Rope Bondage",
    "slim",
    "Smoking",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Carmen Valentina: The Brutal Bondage Basics!"
}