{
  "collections": [
    "Hogtied"
  ],
  "description": "Paige Owens begins in a predicament position with all of her weight balancing in her knees. Her feet are pulled up and her thighs are pulled out to keep them separated. Her hands are pulled up high. In this position she is totally helpless. The Pope enters and spends a few moments groping her young tight body before shoving a gag in her mouth. Next she's flogged all over her gorgeous body and then the crop is used to get at her nipples and other sensitive places, including her feet. After that clothespins are added to her tits, and the he takes aim at trying to knock them off with the crop. Then The Pope feverishly finger bangs her with a vibe to assist in the overwhelming attack on her pussy. The next scene starts and Paige is in another sticky situation. One of her legs is pulled as high as it will go, exposing her pussy to whatever The Pope has planned for it. The suffering begins with some bastinado, and then turns to breath control. After some extreme breath play, The Pope fucks her mouth and pussy, then adds a vibe to push her over the edge of orgasmic bliss. The third scene begins and Paige is in doggy position, tied to a wooden horse. The flogger is used to redden her ass before shoving a dildo in her pussy again. The fucking starts, and Paige quickly realizes that orgasms can be as much pleasurable torment as actual pain. The dildo goes back and forth from her pussy to her mouth, and then back again. And she fucking loves it.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Paige Owens",
      "person_id": 62346
    }
  ],
  "release_date": "2020-03-25",
  "scene_id": 45523,
  "tags": [
    "BDSM",
    "Bondage",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Pain",
    "Rope Bondage",
    "Straight",
    "Submission",
    "The Pope",
    "Vaginal Penetration"
  ],
  "title": "Paige Owens: Hot, Young, and Willing to Suffer in Bondage"
}