{
  "collections": [
    "TS Seduction"
  ],
  "description": "Natalie Mars is a secret agent. She takes photos of some top secret documents, and just when she thinks she's gotten away with it, Sebastian Keys sneaks up from behind, covers her head with a leather hood, and drags her off to his hide-a-way. Keys strips off her overcoat revealing a sexy black latex outfit with thigh-high stockings. On top of a black box, he ties her hands behind her head and her ankles to her thighs. He gets out a leather crop and tells her who he works for. He explains to Natalie that he's going to extract information out of her one way or another. He whips her ass hard with the leather flogger. He grabs the latex covering her ass and pulls it aside to smack her bare asshole with his leather crop. When that doesn't make her talk, he moves on to his leather flogger and repeatedly flogs her ass and cock. In the next scene, Natalie is on her knees with her hands tied above her head. Sebastian sucks her hard cock while he hits hers tits with a leather paddle. He pulls out his cock and Natalie gets a mouthful of it. He face-fucks her pretty mouth until she's covered in spit, and then puts a latex hood over her head with only one small hole to breathe. He plugs the hole with his fingers and his tongue while she struggles for air inside the hood. In the final scene, Natalie is on her hands and knees with her pretty pink asshole presented and ready to be fucked. Sebastian stuffs her asshole full with his hard cock and fucks her with her head pressed into the floor. He flips her over and fucks her again with her legs spread wide open. After Natalie gets Sebastian's hot load in her mouth, she spits it back in his face because she's still not talking.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Natalie Mars",
      "person_id": 60280
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    }
  ],
  "release_date": "2020-02-04",
  "scene_id": 45525,
  "tags": [
    "Anal",
    "Blowjob",
    "brunet",
    "Brunette",
    "Cock Worship",
    "Crop",
    "Hood",
    "Latex",
    "Leather",
    "Male Fucks TS",
    "natural boobs",
    "Paddle",
    "Role Play",
    "slim",
    "spit",
    "Straight",
    "switch",
    "Tattoo",
    "tea2020",
    "top",
    "TS",
    "versatile",
    "white"
  ],
  "title": "Laid Bare: Natalie Mars Tied Up, Beaten, and Fucked by Sebastian Keys"
}