{
  "collections": [
    "Hogtied"
  ],
  "description": "Ana is one of the most beautiful women we have ever\nseen, and she loves to be bound and tormented. Her body is tight and fit, her\nface is angelic, and her flesh pristine. What happens when you take the\nperfection that is Ana Foxxx, and add the sadistic mind of The Pope? You get\na mind-blowing shoot that puts her body on display, as she is tormented and\nput through the paces. Ana begins in a standing position, but not just any\nstanding position. she is in a predicament that keeps her body stressed\nthroughout the entire scene. Her body is pulled in all directions which is\npainful enough, but then The Pope enters and begins his manipulation of\nher body and mind. She is flogged, then nipple clamps are added before she is\nallowed to have her first orgasm. More orgasms quickly follow and Ana’s face\nleaks with drool as she orgasms uncontrollably. In the next scene, we have\nAna in a seated position with her legs spread, her hands pulled down, and her\nneck pulled up. A bowling ball is added to her neck to restrict breathing\nenough to make her control herself for the duration of the scene. A crop is\nused for precision to get all of the sensitive parts as she struggles to breathe.\nHe is relentless with his punishment and her faces show signs of breaking as\nthe torment goes on. As this scene nears its end, her body has clothespins\nadded and then flogged off. She is made to cum multiple times before the\nscene concludes as he reward. The final scene begins and Ana is face down\nand bent over with her ass in the air. Again, Ana is made to endure a brutal\npunishment issued by The Pope. He eventually gives her a dildo to fuck her\nface with as he continues to torment her. Next the didldo is shoved into her\ntight pussy and she is fucked, vibrated, and finger fucked until she forgets\nher own name.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    }
  ],
  "release_date": "2020-01-29",
  "scene_id": 45520,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Black",
    "black hair",
    "Bondage",
    "bottom",
    "Clothespins",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "drool",
    "Fingering",
    "Handler",
    "Hitachi",
    "Humiliation",
    "natural boobs",
    "Nipple Clamps",
    "Petite",
    "Rope Bondage",
    "shaved",
    "Straight",
    "Submission",
    "The Pope",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "Ana Foxxx: Racked, Bound, and Tormented"
}