{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Liz Rainbow's a 22-year-old pain slut, loves humiliation, and pretty much does the lot (hurrah!)\n-Physical domination & verbal abuse\n-Vaginal fucking\n-Bondage\n-Deepthroat & face-fucking\n-Squirting\n-Spanking\n-Face-slapping\n-Face-spitting\n-Breath-play\n-Cum-in-mouth & swallowing\nThere's a very simple test you can do on a PascalsSubSlut to test her pedigree. You treat her like doggy poo right from the off then you dip your finger into her baby hole to see how much honey she's secreting. Such was the case with Liz Rainbow at the start of the merry scene we've got for you this week and yes, said digit slipped in like knife through butter and slipped out glistening with nectar. Apparently this had something to do with her kneeling on all fours in front of Pascal and myself sporting a blindfold and handcuffs while I complained to the good doctor about pretty women not giving me the time of day anymore, and each of us, in turn, gratuitously spanked her, kicked her and pushed her over for no good reason whatsoever, other than that she was kneeling on all fours in front of us sporting a blindfold and handcuffs. Liz Rainbow is another one of these freak Spanish girls who've started to beat a path to my Chalkwell Bay love palace and who we really can't resist. They're just so damned depraved. Thereafter in the scene Pascal pumps the living crap out of the poor girl's mouth and vagina, spanks the beejesus out of her buttocks, and I attach clothes pegs to her very cute puffy nipples and the flaps of her snatch. She appears to have a lot of fun and it's all very jolly. We are very dirty old men, ladies and gentlemen, and we value your custom.",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Liz Rainbow",
      "person_id": 59028
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2019-12-05",
  "scene_id": 45530,
  "tags": [
    "Athletic",
    "big dick",
    "Blindfold",
    "Bondage",
    "brunet",
    "Brunette",
    "Clothespins",
    "Collar",
    "Deepthroat",
    "Doctor",
    "Domination",
    "Facefucking",
    "Facial",
    "fake boobs",
    "foreskin",
    "Humiliation",
    "Latin",
    "Pain",
    "Pain Slut",
    "Rimming",
    "Slapping",
    "Spanking",
    "Squirting",
    "Straight",
    "Sub",
    "thirdparty",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Liz Rainbow: The Torment Never Stops"
}