{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Sean, leashed, and wearing a gag that has a dildo in front, is led on all fours into the middle of the dungeon. Tag is led on all fours toward Sean, then turned around so that his ass is in Sean's face. Doug lubes up Tag's ass as Mario puts a condom on the dildo. Doug inserts the tip of the dildo into Tag's ass and Sean fucks Tag with it, helped by Mario's hand on his head, holding his hair. Tag, ballgagged, breathes in short quick breaths, his face on the rug, and growls like a dog. Mario spanks Sean to fuck harder as Doug prompts Tag to fuck himself on the dildo. Mario puts Sean back in his cage.\nTag is placed in the dog stockade, his neck, wrists and ankles locked onto a steel frame that keeps him in dog position. Doug fixes the dildo from the stand at the back of the frame into Tag's ass. From his cage, Sean watches. Tag is ordered to get the dildo out, and tries hard, without success. Doug barks orders at him, as Tag drools around the gag and tries harder. Doug twists the dildo in. Mario squeezes Tag's nipples, Doug urging him to squeeze harder. In his cage, Sean licks his lips. Doug now squeezes Tag's cock and balls. Tag cries out. In his cage, Sean, no longer cuffed or watched, is jerking off. Mario announces that he wants to fuck Tag. At the same time Doug spots Sean playing with himself, and calls out for hime to be cuffed.\nTag in a sling. Mario waves his dick over Tag's mouth as Doug spits in his mouth and on Mario's dick. Tag takes Mario's dick in his mouth, Doug pinches Tag's nipples and Tag jerks his own cock. Doug orders Tag to open his throat as Mario skullfucks him, then slaps his face with his cock. Sean, regagged, hands cuffed behind his back, watches. Doug fucks Tag hard, telling Mario to choke him with his cock. Doug shouts orders at both of them. Tag holds on to the sling chains, his cock rock hard as both invade him. Tag's a pig for this kind of treatment, he can't get enough of it. Doug spits at Tag and slaps his face. Tag himself asks Mario to fuck his mouth. Doug smacks and punches Tag's chest. Doug offers Tag's ass to Mario, and tells Mario to shove his big cock in roughly. Doug tells Mario to fuck Tag harder as Tag sucks Doug's dick. Doug slaps Tag's face and spits in his mouth, then goes back to skullfucking him, asking if he wants it harder, which Tag does. Sean watches the action, wide-eyed. Cut to Tag asking both men to cum on him, working his own cock as they do. Mario cums on Tag's hand and cock and balls, Doug cums on Tag's face, chin, neck and chest, Tag himself cums on his belly, while Doug jams most of his hand in Tag's mouth and orders him to cum by the count of ten or not at all. On the count of ten Tag does cum, the first jet almost hitting his face, most going on his belly. Doug makes Tag continue stroking himself long after he cums. Doug kisses Tag as Mario goes over to the cage. Mario looks down at Sean in the cage, and tells him he'll be next.\nTag, submissive, bows his head as manacles are place on his wrists behind his back. A plug-gag is tightly put in his mouth. The top of a round cage descends upon the bottom half, in which Tag is sitting. The two sections of the cage are bolted together. Sean watches from his cage. The cage is hoisted into the air with Tag in it, and slowly revolves. Doug and Mario go for a beer, leaving Tag and Sean together, each in his cage, eyes on each other.",
  "directors": [],
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 61819
    },
    {
      "name": "Mario Ortiz",
      "person_id": 61820
    },
    {
      "name": "Sean Patrick",
      "person_id": 61551
    },
    {
      "name": "Tag Adams",
      "person_id": 62428
    }
  ],
  "release_date": "2019-12-05",
  "scene_id": 45531,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "bottom",
    "brunet",
    "Cage",
    "Chains",
    "Dildo",
    "dungeon",
    "Facefucking",
    "Facial",
    "Fetish",
    "Gag",
    "Gay",
    "Machine Dildo",
    "thirdparty",
    "top",
    "Twink",
    "white"
  ],
  "title": "Tag Punished: Dog fucks Dog, More Dog Training, Man fucks Dog"
}