{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "Gwen Viscious wants cock and she wants it in every slutty hole she’s got. Never before has she experienced a cock in her ass until her first gangbang at Kink. Not only does Gwen Vicious want lots of cock she is excited to get spit on, stepped on, humiliated, throat fucked, choked, thrown around and manhandled! Five mighty, meaty men with fat cocks await Gwen as she is rolled down the corridors of the gangbang warehouse like a caged animal. She gets out of the cage, undresses slowly and is inspected by these hot and horny dudes. She is more than willing to let them have their way with her whore ass so lets get this party started! Down on her knees Gwen strokes and sucks cock, she takes it deep down her throat choking and gagging on big dicks. Gwen loves being a trashcan for cocks, it’s what she has aspired to her whole life and today her dreams come true. Covered in spit and hot pink from slapping and flogging Gwen gets her trashy ass tied up for more action. Gagged and bound in a sexy leather straight jacket that shows her perky natural tits Gwen spit shines all their hard cocks so she can get her holes fucked. On her knees with hands tied behind her back Gwen begs to get her filthy holes fucked. All 5 dicks fuck her pussy one after the other while she sucks cock. And then finally Ms. Gwen Vicious gets her tight little ass fucked for the first time. With clothes pins tight on her nipples she loves watching her trash holes get fucked, she just wants more more more! They squeeze and slap her swollen tits and play with her clit while they pound her ass out. She is having so much fun she pleads for more cock in her ass and pussy at the same time so on all fours Gwen gets her nasty slutty holes stuffed airtight. Drilling deep into her ass and pussy at the same time these gangbangers take Gwen to the edge of ecstasy until she is whimpering with pleasure from hardcore double penetration and she gets her face covered in 5 loads of hot cum. Time to take the trash out!",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Codey Steele",
      "person_id": 60685
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Gwen Vicious",
      "person_id": 62601
    },
    {
      "name": "Johnny Goodluck",
      "person_id": 61282
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2020-04-01",
  "scene_id": 45552,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "blond",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Cage",
    "Choking",
    "Corporal Punishment",
    "Double Penetration",
    "First Anal",
    "First Gangbang",
    "Flogging",
    "Gangbang",
    "Latinx",
    "Leather",
    "mixed",
    "muscular",
    "Role Play",
    "Rough Sex",
    "Slapping",
    "spit",
    "Straight",
    "top",
    "white"
  ],
  "title": "Filthy whore Gwen Vicious gets her slutty trash holes stuffed airtight"
}