{
  "collections": [
    "CFNMEU"
  ],
  "description": "Sexy str8 guy needs a check up. He goes to the doctor’s office and encounters the sexy doctor. She asks him some questions and then, when he reports a back problem she tells Dan to take off his tee shirt. He sits on the table so that she can listen to his chest first. Then Dan stands and turns around so that the girl can check his back too. Then she tells him to remove his shorts and underwear. Dan smiles as she checks out his hips and groin. His cock starts to get hard in response to what the doctor is doing. Then Dan lays, face down, on the table and the doctor feels his back. Dan feels the pain so the doctor says she will massage the back. Soon her hands are spreading that hairy ass and showing Dan’s hole. He turns over and lays on his back as the doctor works on his thighs. His dick starts to get hard as her hands brush against the balls. The doctor takes hold of that cock and starts to wank it. Then he has Dan turn over onto his knees, ass in the air, and she inspects his hairy hole. She slides a small, slim toy into that hairy hole and fucks it in and out. Then she moves Dan to the chair, so that he can sit with legs in the stirrups. With that ass on show the doctor fucks a dildo into the hot hole as Dan wanks himself. His dick is rock hard as his ass gets the dildo deep. With that hole opened up a little the doctor uses a much larger dildo and shoves it deep inside. Dan moans as he feels his ass stretched wide and fucked deep. Then the smaller dildo is used again and Dan wanks himself some more. He sits up and lets the doctor wank him. She keeps wanking on Dan’s throbbing cock until it release the cum. Then she lets him go off to the shower to clean up.",
  "directors": [],
  "models": [
    {
      "name": "Dan Holan",
      "person_id": 62320
    },
    {
      "name": "Sarah Kay",
      "person_id": 61137
    }
  ],
  "release_date": "2019-12-11",
  "scene_id": 45558,
  "tags": [
    "Anal",
    "Blonde",
    "CFNM",
    "Dildo",
    "Doctor",
    "Hairy",
    "Handjob",
    "Male Sub",
    "Medical Fetish",
    "natural boobs",
    "Pain",
    "slim",
    "Straight",
    "the chair",
    "Partner Studio",
    "white"
  ],
  "title": "CFNM - DAN HOLAN"
}