{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "First time Kinkster and Filthy Whore Vanessa Vega Fucked, Stuffed and Shaken To The Core when she and hubby Robbie Echo decide to spice up their marriage and participate in a Gang Bang with a 5 Star review! In an old warehouse with a bunch of weird sex toys and cages a group of 4 horny guys with big hard cocks approach their clients. First they tear off Vanessa’s dress and check out the goods. All of their dicks are hard and ready for sucking so Vanessa makes the rounds stuffing her mouth full of each and every one. With nipple clamps on her perfect natural tits whips from the flogger turn her skin hot pink as she gags on all these 5 star cocks. In her first BDSM experience they tie her up with rope so now she can only use that whore mouth of hers to suck dick. The flogger and the vibrator send crazy mixed sensations through Vanessa’s hot body and get her pussy super wet for whats next. Tied up on her back with legs spread wide open Vanessa gets fucked by 5 fat cocks. The first one makes her feel so good she begs to cum and squirts all over his dick. But never should Mrs. Vega be without a cock in her mouth even when she’s getting fucked. This filthy whore can’t get enough cock so as each dude pounds her pussy she cums and squirts again and again. Choked, slapped and verbally humiliated she begs for a dick in her ass and these sexy gang bangers are more than willing to oblige in her anal desires.\nEveryone fucks her ass with their thick cocks and she loves it especially as the Hitachi vibes her clit. Next with Vanessa on all fours this dirty slut gets stuffed airtight. So many cocks hammering her slutty holes, one in her pussy, one in her ass and always one in her mouth. All this fucking takes her over the top with pleasure and with gratitude she thanks all these skilled fuck masters for stuffing her airtight. Flipped over on her back with her ass mounted on a stiff dick they take turns banging her pussy until she is out of her mind and all fucked up with the thrills of getting her holes filled. Finally each of these 5 star fuckers blow their hot load all over Vanessa’s pretty whore face and now, covered in cum, her life is complete.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Vanessa Vega",
      "person_id": 62549
    }
  ],
  "release_date": "2020-02-18",
  "scene_id": 45551,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Hitachi",
    "Latinx",
    "mixed",
    "muscular",
    "Nipple Clamps",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Filthy Whore Vanessa Vega Fucked, Stuffed and Shaken To The Core!"
}