{
  "collections": [
    "Bound Gods"
  ],
  "description": "In a dark dungeon, Dillon Diaz is naked and alone with his hands tied behind his back. His chest rests on a post and his feet are suspended from the ceiling behind him, leaving his body bent backwards like a scorpion. The muscular Michael Roman enters the room on his motorcycle. He kills the engine, dismounts his hog, and slowly approaches Dillon who is already rock hard and ready. He slaps Dillon’s ass and makes him smell his gloved hands. Michael drops to his knees and sucks his cock so good that Dillon begs to let him cum, but Michael wont let him. Instead, Michael gets his leather flogger and hits Dillon repeatedly on his ass and back. In the next scene, Mr. Roman has Dillon mounted on his motorcycle with Dillon tied to the bike in rope bondage with a blindfold over his eyes. His neck is tied to the handlebars and his legs are tied to the bike’s frame. Unable to move at all, Michael torments Dillon with a spiked pinwheel, rolling it over his ass and cock. Michael gets his pliers, pulls out Dillon’s tongue and rolls the pinwheel over it. Michael pulls out his hard cock and shoves it in Dillon’s mouth and Dillon takes it down his throat, all the way to the hilt. Then, after a couple zaps with the cattle prod, Michael flips him over and sinks his fat hog inside Dillon’s asshole and fucks him deep and hard right there on top of the motorcycle. After Michael shoots his load on Dillon’s face, he ties Dillon standing up with two zippers of clothespins flanking his body from his chest to his thighs. He jerks Dillon’s cock and makes him cum just before getting back on his motorcycle and riding away, pulling at the zipper’s strings that he attached to the bike.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    },
    {
      "name": "Michael Roman",
      "person_id": 61574
    }
  ],
  "release_date": "2020-01-16",
  "scene_id": 45556,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "brunet",
    "Cattle Prod",
    "Clothespins",
    "Corporal Punishment",
    "Couple",
    "Domination",
    "dungeon",
    "Feet",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "top",
    "white",
    "Zipper"
  ],
  "title": "Rode Hard: Dillon Diaz Dominated On Michael Roman's Motorcycle"
}