{
  "collections": [
    "Bound Gang Bangs"
  ],
  "description": "First time Kinkster Febby Twigs loves BDSM and is ecstatic to be shooting her first Gang Bang among 5 hot guys with big dicks. In her Gang Bang fantasy Febby goes to the therapist to get help with her problem which is being relentlessly horny all the time! Its effecting her concentration, her life and her job and she needs a solution quick. After a therapeutic masturbation session for the doctor, therapist Ramon Nomar offers her a special treatment called a Gang Bang and even though it may be a little shocking it is sure to cure all her slutty ills. Ramon strips her clothes off to prep her, calls in the orderlies and they roll her away into the situation room where Febby, now Patient 365, promptly begins sucking every cock in the room. 5 big hard meaty cocks. one after the other banging Febby’s throat making her choke and slobber. All the guys inspect different parts of her body, they taste her pussy and ass and feel her natural tits. Febby is sooo horny these gang bangers have a lot of work ahead of them in order to successfully treat this hot to trot whore. Upside down with nipple clamps and wrists tied to ankles Patient 365 gets a deep throat fucking from fat cocks and all the while they play with her pussy until she cums. Moving on to another position tied up with legs spread wide in full suspension the orderlies continue her treatment with the highly effective Hitachi, the crop and some good old fashioned pussy fucking. She gets fucked so good she begs to cum and squirts a geyser all over everybody. Ramon whips Febby with the flogger on her thighs and butt while the gang bangers keep fucking her slutty insatiable hole. All this shagging makes Patient 365 hornier so she begs to get her ass fucked. With no hesitation they stuff her ass with cock and then fill her pussy with another dick for some hardcore double penetration. Febby Twig can’t get enough of all this delicious cock pounding her out and she just might be starting to feel the benefits of her special cure. With her ass, mouth and pussy packed with cock Febby is loaded airtight and having the time of her life. Finally on all fours and a dick in her mouth Ms Twig gets DP’d from behind one thick dick after the other satisfying all her holes as her sexy ass bounces up and down. Flipped over on her back Febby opens her legs welcoming any cock that can get inside of her. All the orderlies fuck her slutty holes deep and hard until she cums again and finally with the vibrator she squirts a massive amount of cum while all 5 dicks shoot their hot load all over her pretty face. Patient 365 is cured! Oh, but she will be back for more restorative man-handling Gang Bang Therapy before you know it…",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Dillon Cox",
      "person_id": 61545
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    },
    {
      "name": "Febby Twigs",
      "person_id": 62548
    },
    {
      "name": "John Johnson",
      "person_id": 49204
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Robby Echo",
      "person_id": 55695
    }
  ],
  "release_date": "2020-03-04",
  "scene_id": 45550,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Crop",
    "Doctor",
    "Double Penetration",
    "Gangbang",
    "Hitachi",
    "masturbation",
    "muscular",
    "Nipple Clamps",
    "Role Play",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "Suspension",
    "Tattoo",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Patient 365: Gang Bang Therapy"
}