{
  "collections": [
    "Bound Gods"
  ],
  "description": "In a cold, dark dungeon. Locked up in a metal cage. A slut rat in leather cuffs and leather sensory deprivation mask is caught in a trap. Chance Summerlin is naked and alone and awaits his new master. New Kink Men dom, Max Konnor walks in. In full leather, this black muscle god demands your attention. His strong leather gloves slaps Chance across the face and pushes his head down to worship his boots. Chance licks and shines with his tongue as he boot worships his masters leather. Flipped around, Max takes his gloved hands and fingers Chance's hole. Deep leather pounds hard and gets Chance ready for his master. With his head tied in rope bondage and his hands cuffed behind his back, Max shocks Chance with a electric zapper. But, this is all just the beginning. The rat is strung up in fully restrictive rope bondage suspension. Rat traps are placed all over Chance's body. Tongue, ears, nipples and most sensitive, Chance's ballsack. Muscle god Max brings out the leather crop and brutally punishes Chance with corporal punishment. Max rips off the mouse traps and then ties Chance up flat on his back. His legs up and hole exposed, Max delivers a deep anal rimming. Next up is the fucksaw. This fucking machine is brutal and the fuck saw gets cranked up in Chance's ass. Finally Max's huge hard cock is ready to claim his prize. Chance's hole is fucked hard and deep with anal. Chance screams with each power thrust. Max cums on Chance's face before ordering his rat to cum on his boots.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Chance Summerlin",
      "person_id": 60103
    },
    {
      "name": "Max Konnor",
      "person_id": 62541
    }
  ],
  "release_date": "2020-02-06",
  "scene_id": 45562,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "Boot",
    "Cage",
    "Corporal Punishment",
    "Crop",
    "Deprivation",
    "Domination",
    "dungeon",
    "fucksaw",
    "Gay",
    "gloves",
    "Humiliation",
    "Latin",
    "Leather",
    "Leather Cuffs",
    "Leather Gloves",
    "Male Sub",
    "Mask",
    "master",
    "Muscle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "spit",
    "Submission",
    "Suspension",
    "Zapper"
  ],
  "title": "Rat in a Cage: Chance Summerlin Serves Leather Muscle God Max Konnor"
}