{
  "collections": [
    "Bound Gods"
  ],
  "description": "Big beefy boy Mac Savage breaks into Dominic Pacifico's apartment to sniff his underwear and jerk off. But when Mac gets caught up in the moment, he risks being found out as Dominic arrives home. Quickly Mac hides under the bed. Dominic enters, happy to be home. He plops down on the bed and pulls off his big boots and sweaty socks. He flexes his perfect feet as Mac hides inches away from the man he's been secretly jerking off to for months. Dominic pulls off his jumpsuit and stretches out on the bed. He drifts off to sleep giving Mac the opportunity to sneak out. Mac crawls out from beneath the bed. He lingers, taking in the magnificent site of chiseled hung man meat in front of him. He can't resist sniffing Dominic's pits. He's got to have his way with this stud. Mac suddenly jumps Dominic. They struggle and Mac ties Dominic to the bed. He licks Dominic's asshole and tastes his salty cock. He's so caught up he fails to notice Dominic freeing himself and he gets over powered. Dominic strings Mac up by his wrists, puts on his leather gloves, and gives this naughty boy a hard flogging. Mac cries out as the leather hits his body and he struggles to stay balanced on his toes. Dominic decides if Mac is going to break in his house, smell his clothes and act like some kind of animal, he should get treated like one. He collars Mac, vet wraps his hands, and puts a puppy hood on Mac. As soon as the hood goes on, Mac suddenly feels himself transforming into a puppy. He barks and whines beneath his mask as Dominic pushes his cock into Mac's wet mouth. Then he ties Mac down to the bed and fucks his sweet ass as Mac squirms in rope. Finally he cums all over this puppy's face and locks him away in a cage, just as dogs should be.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dominic Pacifico",
      "person_id": 14892
    },
    {
      "name": "Mac Savage",
      "person_id": 62569
    }
  ],
  "release_date": "2020-02-20",
  "scene_id": 45566,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "blond",
    "Blowjob",
    "Bondage",
    "Cage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Flogging",
    "Gay",
    "gloves",
    "Hairy",
    "Hood",
    "Humiliation",
    "Latin",
    "Leather",
    "Leather Gloves",
    "Male Sub",
    "Mask",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Sniffing",
    "Stud",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Housebroken: Beefy Underwear Pervert Breaks Into The Wrong House"
}