{
  "collections": [
    "Bound Gods"
  ],
  "description": "Colby Jansen is ready to teach buff stud Pierce Paris a lesson he’ll never forget. He sets up his camera before dragging Pierce into the room. He manhandles Pierce close to the camera. Pierce struggles futilely as Colby tells him that this video will be sent to every single one of Pierce’s contacts so everyone can see what a bitch boy Pierce really is. Pierce resists but has no choice to take what Colby gives him. Colby spanks his bare ass with his gloved hands. He pushes his fingers into Pierce’s mouth, making him taste the leather of his gloves. He pushes Pierce’s face into his pits, making Pierce take in the scent of a real man. Then he drags Pierce near the camera to shave because everyone knows boys don’t have beards, only Daddies do. Pierce struggles as Colby shaves his face and sputters as he dumps all the hair on his face. Next, Colby squeezes Pierce’s sensitive nipples and smacks his chest. He crops Pierce all over and works him over with a heavy flogging that has Pierce crying out. He zaps Pierce all over his body. He makes Pierce tell the camera what a whore he is for cock before gagging him with an open mouth gag. Seeing the inside of Pierce’s pretty pink boy mouth gets Colby hard. He shoves his cock into his wet hole and fucks Pierce’s face. Then he bends Pierce over and commands Pierce to push his balls into his own ass. Pierce obeys and gets spanked with his balls in his ass. Once his ass is red, Colby pushes his raw cock into Pierce’s ass along side Pierce’s balls. Pierce’s ass tight and stretched full as Colby fucks him bareback. Colby makes Pierce taste his ass before pounding his ass again. Finally he cums all over his boy’s face. Then Pierce sits on his Daddy’s lap and jerks off. Colby rubs his boy’s load all over his face and drags him away for more fun.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Colby Jansen",
      "person_id": 34457
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    }
  ],
  "release_date": "2020-01-30",
  "scene_id": 45561,
  "tags": [
    "Anal",
    "Bareback",
    "BDSM",
    "big dick",
    "blond",
    "Blowjob",
    "Bondage",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Crying",
    "Domination",
    "Flogging",
    "Gag",
    "Gay",
    "gloves",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Stud",
    "Submission",
    "switch",
    "top",
    "unshaved",
    "white"
  ],
  "title": "The Emasculation of Pierce Paris: Daddy Colby Jansen Stuffs Pierce RAW"
}