{
  "collections": [
    "Bound Gods"
  ],
  "description": "CEO and owner of The Savage Company Limited, Dale Savage sits at his office desk, proof reading a 'thank you' letter written by his new employee, DJ. When he spots a typo, he asks DJ to step into his office to talk to him about it. Nervous and new at his job, DJ sits at the other end of Dale's desk, and Dale scolds him about the typo. He has DJ get up and place his elbows on top of the table. DJ obeys and is asked to read the letter that he wrote, and DJ recites the poorly written note while Dale pulls down DJ's pants and spanks his bare ass hard. He commands DJ to get to his knees, and Dale whips out his hard cock and shoves it in DJ's mouth. He grabs DJ's head and fucks his face. After that, Dale gets a length of rope and ties DJ up with his arms behind his back. He lays him across his desk and kicks his feet up and tells DJ to clean his shoes. DJ licks his boss' shoes while Dale whips him hard with a leather crop. DJ strips Dale's shoes and sock off and licks his toes and the soles of his feet. Dale puts DJ to the ground, gets out his leather flogger, and hits his ass hard. He flips him over, grabs his cock, pulls it hard and flogs DJ's stomach and chest. In the final scene, completely naked except for the bit-gag in his mouth, DJ balances on one leg , bound in a multitude of ropes coming from the ceiling. Dale attaches clover clamps to the under-side of DJ's arms, comes up from behind him, and rams his hard cock inside DJ's asshole. He fucks DJ hard and fast. He takes the bit-gag out and uses DJ's mouth to finish off his cock, spraying his load all over DJ's face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "DJ",
      "person_id": 20225
    },
    {
      "name": "Dale Savage",
      "person_id": 62015
    }
  ],
  "release_date": "2020-01-23",
  "scene_id": 45560,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Feet",
    "Flogging",
    "Gag",
    "Gay",
    "Hairy",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "mixed",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "Tattoo",
    "top",
    "versatile",
    "white"
  ],
  "title": "The Savage Company Ltd: Dale Savage Punishes Employee, DJ"
}