{
  "collections": [
    "Bound Gods"
  ],
  "description": "Handsome newlyweds Vander Pulaski and Jack Hunter are finally on their honeymoon and enjoying each other's slim muscular body. The two men are breaking in that hotel bed like they should. While Vander takes a break and heads to the hotel bar, Jack is disturbed by a knock on the door. Vander's Step-Brother! This muscular third wheel decided to crash the honeymoon and take revenge. Pierce and Vander go way back. These step-brothers have been together for a long time and Pierce is feeling extremely jealous that his brother is getting married. Vander is his and it's time to punish Jack. Pierce overcomes his brother-in-law and ties him up in fully restrictive rope bondage to the hotel pillar. Pierce starts with corporal punishment and slaps Jack's tight ass red. Jack screams while getting beat. Vander comes in the room and see's his step-brother and tries to take him down, but Pierce is too powerful. Pierce's muscles easily overcome Vander and he throws him down on the couch and ties him up. It's time for Vander Pulaski to scream. Bringing out the flogger, Pierce starts on Vander's rock hard cock. Vander is gagged with a ball gag and tied up in rope bondage and is helpless to his Brother's torment. Jack gagged with a bit writhes in pain as he watches his husband get punished. Vander is flipped over and his brother brings out his huge muscle cock for a bareback fucking. Pierce brutally fucks Vander's tight ass as Jack watches the skin on skin. Jack screams for the cuckolding to stop. Jack get's what he asks for. All three men move to the bed. Jack is fucked raw and deep by Pierce as Vander rims Pierce's ass. Both men are helplessly tied in rope bondage. Finally Pierce double shoots his huge loads all over Vander and Jack as the two are made to cum. Pierce cleans them both up while getting his way.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jack Hunter",
      "person_id": 58734
    },
    {
      "name": "Pierce Paris",
      "person_id": 56974
    },
    {
      "name": "Vander Pulaski",
      "person_id": 61944
    }
  ],
  "release_date": "2020-03-26",
  "scene_id": 45568,
  "tags": [
    "Anal",
    "Ball Gag",
    "Bareback",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Cuckolding",
    "Domination",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Submission",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "For Better or For Worse Part 2: Step Brother Gets RAW Vengeance"
}