{
  "collections": [
    "Bound Gods"
  ],
  "description": "During a hot and heavy make out session with lots of sexy kissing, caressing and cock sucking Sharok discovers Nick has been cheating on him with another guy while he’s been away at college. Sharok is enraged with jealousy so he brings out the rope, ties Nick up and teaches him a brutal lesson in betrayal. Before Nick gets tied up Sharok bends this lying slut over his knee and slaps his perfectly cute ass until it turns bright pink. Sharok’s big muscular arms sure can pack a whack on Nick’s shapely sensitive ass. Sharok then ties Nick up in a precarious position, blindfolds him, stuffs his ass with an electric butt plug and disciplines him with the flogger. Nick can barely stand up as one leg is raised with rope and he can’t see anything from the sensory deprivation so he is totally disoriented while getting his ass whipped. Sharok does not hold back with the hardcore corporeal punishment and sends Nick spinning in circles as he squirms trying to deal with the beating. Then with Nick gagged and leg muscles contracting from electro-stimulation Sharok fucks his tight slutty ass senseless and shocks him with the zapper until he gets his fill. After all that ass pounding Nick spit shines Sharok’s cock until he blows his load all over Nick’s cheating face. And finally Sharok wants to make Nick cum so he looks him right in the eyes and jacks his cock off until he shoots his wad in a high arc across the room. This is Nick Milani’s first time with BDSM and he takes an intense beating like a wrecking ball of sexiness!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Nick Milani",
      "person_id": 62539
    },
    {
      "name": "Sharok",
      "person_id": 62054
    }
  ],
  "release_date": "2020-02-27",
  "scene_id": 45565,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Deprivation",
    "Domination",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "spit",
    "Submission",
    "Zapper"
  ],
  "title": "Cheating Slut: Nick Milani Submits to Sharok and His Hard Cock"
}