{
  "collections": [
    "Bound Gods"
  ],
  "description": "Kink Men newcomer Marco Napoli is bound in rope, legs spread open with a spreader. His leather harness shows off his muscular arms. Rope tied around his hairy legs down to his leather boots. His face is blindfolded in a full face leather mask. In a dark red dungeon he writhes in suspense of what to come. Hot muscle leather daddy Dale Savage walks in to inspect his toy. Leather harness and cuffs, leather pants, this smoking hot salt and pepper daddy wants to tenderize his submissive meat. He goes right to Marco's hard cock and begins to stroke it rock hard. He slaps Marco's hairy abs bright red. Nipple clamps tied to a vibrator sets up a painful predicament bondage. Two more hitachi's come out strapped to Marco's cock as Dale delivers a deep throat cock sucking. Marco begs to come as Dale denies him with a brutal edge. Not yet, as he rips off Marco's nipple cloverclamps and shoves Marco's head down on Dale's hard cock. Savage bends Napoli over and delivers a brutal anal Power Fuck. Dale unleashes his load on Marco, but the tides turn. Marco get's loose and overpowers Dale and takes him down. Dale is now tied up blindfolded with his ass in the air. Marco Napoli delivers a fucking brutal punishment flogging on Dale's ass before fucking him hard and deep. Dale still screams with a bit in his mouth. But this is just the beginning for his hole. Marco pulls out his gloves and punch fists Dale's asshole right open. Deep fisting, with clothespins on Dale's legs gets him screaming. One last Power Fuck gets Marco shooting a huge load on Dale's face. Who's in charge now!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dale Savage",
      "person_id": 62015
    },
    {
      "name": "Marco Napoli",
      "person_id": 62620
    }
  ],
  "release_date": "2020-03-05",
  "scene_id": 45564,
  "tags": [
    "Anal",
    "BDSM",
    "black hair",
    "Blowjob",
    "Bondage",
    "Brutal Punishment",
    "Clothespins",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Edging",
    "Fisting",
    "Flogging",
    "Gay",
    "gloves",
    "Hairy",
    "Hitachi",
    "Humiliation",
    "Latin",
    "Leather",
    "Male Sub",
    "Mask",
    "master",
    "Muscle",
    "muscular",
    "Nipple Clamps",
    "Pain",
    "Predicament Bondage",
    "harness",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Smoking",
    "Submission",
    "switch",
    "unshaved",
    "Vibrator"
  ],
  "title": "Power Fuck: Hot Leather Men Inflict Muscle Domination & Intense Pain"
}