{
  "collections": [
    "Bound Gods"
  ],
  "description": "This Valentine’s Day Ricky Larkin has something special in store for hunk Alex Mecum. Naked and blindfolded, Alex is tied to the bed. Latex clad Ricky Larkin emerges from shadows and approaches Alex. Alex moans as Ricky leans in to kiss him. After tasting Alex’s sweet lips, Ricky lavishes Alex’s nipples with kisses before wrapping his lips around Alex’s plump cock. After teasing Alex, Ricky lights a red candle and begins slowly pouring the wax across Alex’s toned chest and down his torso. Alex moans as the warm wax hits his bare skin. Ricky smiles as he covers Alex’s nipples with wax and makes his way to Alex’s cock and balls. As the hot wax drips on his sensitive balls and hard cock, Alex groans and arches off the bed. As Ricky covers Alex’s thighs, he takes Alex’s cock in his mouth, teasing the head. Then he slaps and crops the wax along Alex’s torso causing Alex to twist in bondage. Afterward Ricky drips hot wax along the length of his own cock before pushing it into Alex’s wet mouth. Alex gags as Ricky fucks his face and chokes him with his cock. Next, Alex is gagged and suspended in bondage. Ricky lays beneath him and slides Alex’s cock into a vibrating pump. Alex moans as the blood rushing to his cock makes it huge. Ricky puts clothes pins on Alex’s nipples and balls and makes Alex suck his dick. Finally he brings Alex down and gives him a hard pounding. Alex takes every inch of Ricky’s hard cock and moans as Ricky sets a relentless pace. Alex is so caught up in the cock moving in and out of his hole, his orgasm catches him by surprise. He cries out as he cums all over himself. Ricky takes both their cocks together and jerks off, covering Alex in his load.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Alex Mecum",
      "person_id": 59595
    },
    {
      "name": "Ricky Larkin",
      "person_id": 35556
    }
  ],
  "release_date": "2020-02-13",
  "scene_id": 45563,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "body builder",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "Hot Wax",
    "Humiliation",
    "Latex",
    "Male Sub",
    "master",
    "mixed",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaped",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Bound Valentine: Alex Mecum Covered in Wax, Suspended, Pumped, Fucked"
}