{
  "collections": [
    "Bound Gods"
  ],
  "description": "Muscle bound Max Konnor has Jon Darra at his mercy. Blindfolded with a ball-gag in his mouth, Jon Darra is led into Max's lair. Max brings Jon to a metal cross, turns him around and handcuffs his wrists behind is back. With his leather gloved hands, Max undresses Jon down to his underwear. He slaps Jon's face and chest and then chooses a leather flogger to hit Jon's stomach, thighs, and cock. With every whip to the dick, Jon's cock grows bigger and bigger. Max pulls out Jon's hard cock with one of his leather gloved hands, and flogs it with the other hand. Max turns it up and hits him harder with the flogger. He frees Jon's wrists and commands him to get on his knees. Jon rubs his face against Max's leather jock and sniffs. In the next scene, Jon is on his back with his wrists and legs secured to a metal bed frame. His knees are frog-tied with his asshole presented. Max approaches Jon's head and hits him in the face with his big hard cock. Jon tries to catch his cock in his mouth but Max wont let him suck it. He'll have to earn it. Max gets his cane and whips Jon's ass repeatedly making him writhe in pain. Finally earning his cock, Max slides his massive meat down Jon's throat and gets sucked. Max wants Jon's asshole and so he slides his fat dick inside Jon's and fucks him deep and hard. In the next scene, Jon's arms are tied behind his back, partially suspended in rope bondage. His mouth is getting fucked by a fucking-machine while he rides on top of Max's cock. Max gets out from under him and positions himself behind Jon and fucks his ass some more doggy-style, without adjusting any of the bondage. Max fucks him hard and in the end unleashes a massive hot load all over Jon's face.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jon Darra",
      "person_id": 62696
    },
    {
      "name": "Max Konnor",
      "person_id": 62541
    }
  ],
  "release_date": "2020-05-07",
  "scene_id": 45569,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "Humiliation",
    "jock",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "Pain",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "Submission",
    "top"
  ],
  "title": "Yes, Sir: Jon Darra Submits to Muscle-Stud, Max Konnor"
}