{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Dana Spit is a heavily-tattooed tough-ass bitch, and she's aching for anything. We open with Dana chained to a metal pipe in a dungeon, where the brutal and beautiful Cherry Torn is ready to dish out all the pain this girl can take. Cherry fits her with a ring gag to keep Dana's mouth open, since she won't need to utter a thing, but moans and screams. Cherry rips Dana's top off, exposing her tiny little titties, to slap and bite. Cherry pulls out a flogger, then adds nipple clamps. Dana's titties glow red from the heavy, repeated blows. Cherry then cuts away her panties and adds more clamps to Dana's sweet, tender pussy lips. How much pain can Dana take? Her tolerance seems bottomless, and her thirst for it unquenchable. Cherry then crops her clamped titties and pussy, and Dana eats it all up. Cherry works the flogger and crop, stinging hard now, against the back of Dana's legs and her thighs and her ass. Cherry is so generous with her blows and Dana is shivering and suffering through the intense pain. Cherry swings the flogger harder and harder until the clamps fall from Dana's nipples and pussy lips. But brutal pain is what this lil' slut loves more than anything, so Cherry slaps her face before pressing a vibrator up against her red and swollen pussy. Next, Cherry binds Dana in rope and suspends her. She dangles there, at the perfect level for Cherry to straddle Dana's head and make her worship her dripping we pussy. Dana is a dirty girl and knows what to do, using her tongue to suck and lick on that sloppy wet cunt. Cherry puts Dana back on the floor and sits on her face, riding her as she slurps up all that wet juice. Dana's finally put on her back, with her arms bound to her ankles, as Cherry fucks her sloppy cunt with a strap-on cock. Dana can only moan and squeal around her ball gag as her slutty pussy is fucked hard. Cherry flips her over and slides her cock into Dana's ass, plunging in and out, filling her completely. Finally, Cherry fists Dana, working her hand into the lil' slut's pussy, stretching her open and fist fucking her, making her cum like the filthy slut she is.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Dana Spit",
      "person_id": 62011
    }
  ],
  "release_date": "2020-02-27",
  "scene_id": 45575,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Pain",
    "Pain Slut",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "spit",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Lil' Pain Slut: Cherry Torn Tests Dana Spit's Need For Erotic Torment"
}