{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Nikki Hearts is the last guest left at Leigh Raven's Valentines day party. After the exhaustive task of hosting all night, Leigh and Chanel Preston are ready to get down and dirty. They begin by undressing Nikki on the couch. When they find she is wearing see-through panties they realize what a little slut their remaining guest is, and decide to take advantage of her, much to her whorish pleasure. Leigh and Chanel immediately dive in and play with all her holes. Nikki's head is pushed into the couch, ass-up and exposed for anything that may come. Chanel wields a flogger, turning Nikki's ass red while Leigh offers her sweaty feet for Nikki to clean with her hungry mouth. Chanel wants some attention too, so she orders Nikki to get on her back while Leigh exposes her ass and sits on Nikki's face. Leigh wields a crop, to make sure Nikki does a good job of sucking and licking her pussy. Chanel warns Nikki that if she enjoyed the party she should show some gratitude and make us cum. Chanel uses her feet on Nikki's pussy, toe fucking her. Chanel sits on Nikki's face and demands she suck on her clit and make her cum. She's not getting off that face until she cums. Then the girls turn the vibrator on Nikki's pussy and make her squirm and go crazy. They work Nikki into a frenzy, but as hostess, it's Leigh's job to decide if and when Nikki will cum, and they aren't done with her yet. Leigh gets out her strap on dildo and fucks Nikki. Chanel attaches a ball gag across their guests' mouth before sticking her strap-on cock in Nikki's ass, no romance here, just straight up fucking. Leigh completes the DP by filling up Nikki's pussy. Sandwiched between both women Nikki is filled and drilled before being flipped over doggy style so Chanel can drill her cock deep into Nikki's ass. She demands a thank you for such a fun party. Then its Leigh's turn to stretch Nikki's sweet ass. Chanel wields the vibrator, driving Nikki wild. She can only cum when Chanel tells her to cum. Nikki has barely a moment to enjoy her orgasm before having to go down on Chanel's pussy and service her, then on to Leigh, eating her pussy until she cums. It's the conclusion to a perfect party, and Nikki will definitely get invited back next year.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Leigh Raven",
      "person_id": 59527
    },
    {
      "name": "Nikki Hearts",
      "person_id": 52257
    }
  ],
  "release_date": "2020-02-13",
  "scene_id": 45574,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "romance",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "Vibrator",
    "white"
  ],
  "title": "Fuck Love Party 2: Leigh Raven and Chanel Preston Devour Nikki Hearts"
}