{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Charlotte petitioned to be a slut that is used, abused, and fucked, so we made her slutty little dreams come true. She begins standing with her hands above her head and completely vulnerable. Derrick enters with flogger in hand and ready to dish out some brutal punishment. He begins with establishing his dominance with Charlotte, by reddening her flesh with his hands and flogger. It's not long before we see tears from Charlotte because Derrick is being so viscous with this slut. This only excites her master more as he continues to punish her. After several minutes of torment, he lowers her down on her knees and fucks her face with a sadistic fury. Next Charlotte is in an inverted hogtie suspension that has her face in a perfect position for face fucking, and her pussy is exposed for torment or imposed orgasms. Derrick has fun with her as she is made to suck his cock without it coming out of her mouth as he issues nonstop orgasms. Charlotte is finding it hard to stick to the rules and is punished with a cat-o-nine to tenderize her flesh. Charlotte is finally let down, and then put in a doggy position with her holes ready for cock. Her master does not waste any time and goes straight for her tight little asshole. He slides his cock deep inside of her honey hole, and decides that this will be his primary fuck hole for the day. After fucking her ass into multiple orgasms, he comes around and has this slut clean is dick with a sloppy blowjob. The final scene is upon us and Charlotte is on a box and bound. Derrick enters and presses a vibe against her pussy to make her cum so hard that she begs for it to stop. He then begins to pound her ass with a vengeance. Charlotte is fucked harder than she has been fucked in a long time, and then Derrick finishes all over her tummy.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    }
  ],
  "release_date": "2020-03-02",
  "scene_id": 45579,
  "tags": [
    "Athletic",
    "black hair",
    "Blowjob",
    "bottom",
    "Brutal Punishment",
    "master",
    "multiple orgasms",
    "natural boobs",
    "other hair color",
    "shaved",
    "Straight",
    "Sub",
    "Suspension",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Pure Hell: Charlotte Sartre Viciously Used and Anally Fucked"
}