{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Struggling college student Gia Derza needs some extra money, so she signs up for random medical testing for a little payout. Gia finds herself up against latex nurse Aiden Starr, who runs a creepy dark medical facility. Aiden puts Gia through a battery of tests. She starts by fitting Gia with a gag, in order to do a proper inspection. She then tests Gia's senses with a Wartenberg wheel. She runs it from her sexy nipples down to her clit. Aiden then spreads Gia's hot wet pussy with a speculum, leaving it wide open for inspection. This inspection starts with rubbing her clit then fingering her hole. For further testing she adds more stimulus with a vibrator and pinwheel. She then tests Gia's pain tolerance with clothespins on her nipples and pussy. Aiden administers another dose of pleasure and observes a huge gush as Gia's massive orgasm explodes everywhere, leaving a huge wet mess. Aiden then flogs her pussy as she moves on to the second phase of trials. Gia is suspended upside down in the perfect position for Aiden to test her pleasure levels under stress. She vibrates Gia's pussy and makes her cum upside down. After a few orgasms she crops her chest for a little pain after pleasure. Aiden then makes Gia lick her ass until she has a big orgasm. For the final stages of testing, Gia is tied in pile driver where Aiden pounds her ass with her big strap on. Gia's ass is gaping so wide, Aiden goes in with her fist and does a full inspection. Then Gia is put in a doggy position where Aiden pounds her ass even harder until she orgasms again. After deep testing of Gia's holes, Aiden sends her used up test subject packing. On to the next!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Gia Derza",
      "person_id": 61617
    }
  ],
  "release_date": "2020-03-26",
  "scene_id": 45576,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Gag",
    "Gaping",
    "Humiliation",
    "Latex",
    "Lesbian",
    "LezDom",
    "Medical Fetish",
    "natural boobs",
    "Nurse",
    "Pain",
    "Pussy Eating",
    "Rope Bondage",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Speculum",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "The Test Subject: Latex Nurse Aiden Starr Experiments on Gia Derza"
}