{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Dana Spit is a heavily-tattooed tough-ass, who’s aching for anything. We open with Dana chained to a metal pipe in a dungeon, where the brutal and beautiful Cherry Torn is ready to dish out all the pain they can take. Cherry fits Dana with a ring gag to keep that hungry mouth open, capable of uttering only moans and screams. Cherry rips Dana’s top off, exposing their tiny little titties, to slap and bite. Cherry pulls out a flogger, then adds nipple clamps. Dana’s body glows red from the heavy, repeated blows. Cherry then cuts away their panties and adds even more clamps to Dana’s sweet, tender pussy lips. How much pain can Dana take? Their tolerance seems endless, and the thirst for it unquenchable. Cherry then crops those clamped titties and pussy, and Dana eats it all up. Cherry works the flogger and crop, stinging hard now, against the back of Dana’s legs, tenderizing their thighs and ass. Cherry is so generous with her blows and Dana is shivering and suffering through the intense pain. Cherry swings the flogger harder and harder until the clamps snap off painfully. But brutality is what this lil’ tough-ass loves more than anything, so Cherry slaps their face before pressing a vibrator up against that swollen pussy. Next, Cherry binds Dana in rope and hauls them up into a suspension. Dana dangles there, at the perfect level for Cherry to straddle Dana’s head and make her worship her dripping wet pussy. Dana is a dirty girl and knows what to do, using her tongue to suck and lick on that sloppy wet cunt. Cherry puts Dana back on the floor and sits on her face, riding Dana. Dana’s finally put on their back, with their arms bound to their ankles, as Cherry fucks Dana with a strap-on cock. Dana can only moan and squeal around the ball gag. Cherry flips Dana over and slides her cock into Dana’s ass, plunging in and out, filling it completely. Finally, Cherry fists Dana, working her hand deep inside, making them cum hard and loud.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Dana Spit",
      "person_id": 62011
    }
  ],
  "release_date": "2020-02-27",
  "scene_id": 45575,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Pain",
    "Pain Slut",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "spit",
    "Straight",
    "Strap On",
    "Sub",
    "Suspension",
    "Tattoo",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Lil' Pain Slut: Cherry Torn Tests Dana Spit's Need For Erotic Torment"
}