{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Hot and sexy dungeon assistant Christy Love was busy cleaning the dungeon when she got hot and wet with the site of leather and latex. She gets so turned on she could not resist but to play with her pussy. Domina Helena Locke walks in and catches slave Christy playing with herself instead of cleaning her erotic dungeon. She has no choice but to punish her. Helena demands she gets on her knees and prepare for a dose of corporal punishment. She makes Christy lick her latex boots, then her sexy toes. Then she bends Christy over and spanks her sexy hot ass as she pulls on her latex dress making her pussy wet. She then clamps her luscious nipples so she can have something to pull on as the hot and sexy Christy Love worships her feet. Domina Helena then sits on her face and makes Christy lick her sexy latex skirt. Domina Helena then pulls up her skirt, revealing her nice sexy round ass. She rides Christy's tongue until she cums all over her face. She still has to teach this sexy slave who is in charge, so Christy is tied up and suspended in mid air with her pussy and feet exposed. Domina Helena begins to crop her feet and works her way up to her pussy. After punishing her pussy, Domina Helena then pulls out the vibrator and makes Christy cum hard until she squirts, leaving a big wet mess on the floor. Helena then gives Christy one last dose of punishment with her big strap-on dildo. She fucks Christy doggy style nice and hard as Christy vibrates her pussy. Then Christy rides her big dildo until she orgasms hard. Helena then drips her spit into Christy's gagged mouth for her final payment of punishment.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Christy Love",
      "person_id": 61580
    },
    {
      "name": "Helena Locke",
      "person_id": 59793
    }
  ],
  "release_date": "2020-03-12",
  "scene_id": 45573,
  "tags": [
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Discipline",
    "Dominatrix",
    "dungeon",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Latex",
    "Latin",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "spit",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "Vibrator",
    "white"
  ],
  "title": "Latex Discipline: Helena Locke Punishes A Distracted Christy Love"
}