{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Casey Calvert knows her place in the BDSM world, and it is to serve. She is naturally submissive who wants nothing more than to please her master. Today she is in a place where she can flourish in this way, and Derrick is the one that will put her through her paces. She begins in a squatting position with her legs tied wide open, her hands are behind her back, and her neck is tied to a wooden column to make sure her head cannot escape the wrath of Derrick throat fucking her. He flogs her for a bit to turn her flesh a bright red before going balls deep in this slut's mouth. Orgasms are commanded out of her pussy, but her main goal is to serve the cock that's in her mouth. After a long throat fucking scene, Derrick feels that she needs more work, so she is suspended upside down for easy access to her mouth for more blowjob action, while her pussy is exposed for more imposed orgasms. When the time comes for Casey to get cock in more of her holes, she is bent over a table, with one leg pulled up for easy access to her holes. Derrick goes back and forth between fucking her pussy and fucking her ass. He takes a small break from fucking to torment her with his flogger, but then it's right back to abusing her holes with his cock. In the final scene, Casey has her arms bound in a box tie, and the rest of her body is free to be manipulated the way he sees fit. Derrick rips multiple orgasms out of her slutty pussy before going back to fucking her holes. The relentless fucking continues until he blows his load all over her pussy mound.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    }
  ],
  "release_date": "2020-04-27",
  "scene_id": 45583,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "Facefucking",
    "Flogging",
    "master",
    "multiple orgasms",
    "natural boobs",
    "other hair color",
    "shaved",
    "Straight",
    "Sub",
    "Suspension",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Casey Calvert: Bondage, Torment, and Sexual Servitude"
}