{
  "collections": [
    "Everything Butt"
  ],
  "description": "It’s Valentine’s Day and Dana Vespoli has invited London River to her house for what she hopes to be a romantic rendezvous. London enters Dana’s home and sits down next to her. Dana immediately gets to the point and tells London how much she’s attracted to her and that she’s the one for her, even though she may not know it yet. London, while at first put off by Dana’a honesty, she goes along with it and is a little turned on. Dana sinks her tongue down London’s throat and kisses her deep. Dana tells her to turn around and London sticks her big beautiful ass in Dana’s face. Dana lifts up London’s skirt and can’t believe what a gorgeous soft round ass she has. Dana whispers sweetly into London’s ass. She hugs and caresses it, spreads her cheeks, and licks her asshole. Dana gets a big purple butt-plug and lubes it up. She slides it slowly inside London’s asshole and it takes her breath away. Dana puts her ear up to London’s asshole and it tells her that it wants something bigger. Dana takes the purple plug out and cleans it off with her mouth. She grabs an even bigger clear glass plug and uses all her strength to pop it inside London’s hole. She has London turn over on her back and spread her legs. She gets another, more squishy butt plug and shoves it inside London’s ass while she presses an Hitachi vibrator against her clit. Dana gets a silicone tunnel-plug and pops it inside around the rim of London’s asshole, holding it open. She cums hard with the vibrator and London’s prolapse blossoms out from the hole in the plug. After that, Dana straps on her biggest dildo and fucks London deep and hard with it. After cumming with Dana’s entire fist inside her asshole, Dana fills London’s ass with cum-lube. Dana gets two champagne flutes and London serves up two glasses as the lube pours from her ass. They cheers, drink, and kiss.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Dana Vespoli",
      "person_id": 3321
    },
    {
      "name": "London River",
      "person_id": 56590
    }
  ],
  "release_date": "2020-02-07",
  "scene_id": 45587,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Gaping",
    "Hitachi",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Prolapse",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Crazy About You: A Lesbian Anal Love Story"
}