{
  "collections": [
    "Everything Butt"
  ],
  "description": "Gwen Vicious is late to meet and interview with Febby Twigs about the possibility of joining her and Avi Love for a hot anal three-way. Febby calls her stupid, grabs Gwen by the hair, and brings her to meet Avi. In her short purple latex dress, Gwen crawls on her hands and knees to Avi who sits at her big red leather throne. Avi tells her to stand up and strip naked. Febby and Avi agree that although pathetic, she'll do. They tell her to get on her knees and spread her ass. She grabs both of her big round ass cheeks and spreads them wide. Avi grabs a ribbed glass toy and slides it into Gwen's tight little asshole and fucks her deep with it. They switch to a bigger glass butt-plug and slide it in and out of Gwen's asshole, stretching it even further. They have Gwen get on her back and spread her legs and they see if she can handle one more toy. They get a big long purple butt-plug and try to fit the entire thing in her asshole, but her pathetic ass can only take the tip. They feel sorry for her and let her cum with a vibrator but they're far from done using her for their own pleasure. Avi strips from the waist-down and gets up on her throne. Febby shoves Gwen's face into her girlfriend's asshole and makes her lick it. Avi presses a big Hitachi vibrator against her clit and cums hard with Gwen's face buried in her asshole. After that, Febby makes Gwen get underneath Avi and lick her pussy while Febby fucks Avi's ass with a big pink dildo. After Avi's ass gets warmed up with the pink dildo, Febby straps on her biggest cock and shoves it in her girlfriends ass, fucking her deep and hard. Next, Avi gets on her back and has Febby shove the Slink as far as she can up her ass, and cums hard while filled up with almost two feet of toy. When its Febby's turn to take a big toy up her ass, she gets face-down, ass-up and gets fucked deep and fast with a monster of a cock. Stretched out by the large dildo, Febby commands Gwen to slide her entire fist up her ass. Gwen gets it in Febby's ass with ease and fist-fucks her ass until she cums hard.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Avi Love",
      "person_id": 60196
    },
    {
      "name": "Febby Twigs",
      "person_id": 62548
    },
    {
      "name": "Gwen Vicious",
      "person_id": 62601
    }
  ],
  "release_date": "2020-04-03",
  "scene_id": 45589,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Toy",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Feet",
    "Gaping",
    "Hitachi",
    "Latex",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "slim",
    "slink",
    "Straight",
    "switch",
    "unshaved",
    "Vibrator",
    "white"
  ],
  "title": "Stupid Little Bitch: Avi Love, Febby Twigs, Gwen Vicious' Anal 3-way"
}