{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Kristen Scott may have an innocent charm about her, but beneath that sweetness is a dirty slut who loves being manhandled, tied up, smacked around and fucked like a bitch. Tommy Pistol steps in, and without a word begins smacking this slut around, and she couldn’t be happier. He smacks her, spits on her face and in her mouth, chokes her and uses her body for every twisted, selfish purpose. He quickly flogs her, then finger fucks her pussy, adding a vibe along the way, making her shudder and cum, again and again. Kristen can hardly contain herself as she screams and cums while tied down to a wooden chair, unable to pull away or escape. Next she’s fully suspended upside down, while Tommy shoves his cock in her wet, drooling mouth. He face fucks her while using a vibe on her pussy. She cums again with his cock slamming in her throat, but still she takes more. Kristen is then put in a partial suspension with her hands tied behind her, as Tommy fucks her wet cunt from behind. He shoves his balls in her, then his cock again, feeding her twisted desires. The powerfucking really starts now, as he rails her from behind, plowing her and fucking the orgasms out of her relentlessly. She’s finally put on her back and absolutely slammed. She takes all the dick, screaming and cumming like a whore the entire time, until her perfect, slutty pussy makes Tommy cum so damn hard he can barely stand. She’s fully used and fucked, and left shaking and moaning, covered in cum and sweat.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kristen Scott",
      "person_id": 60734
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2020-03-30",
  "scene_id": 45582,
  "tags": [
    "Bondage",
    "brunet",
    "Brunette",
    "Latinx",
    "natural boobs",
    "slim",
    "Straight",
    "Sub",
    "Suspension",
    "white"
  ],
  "title": "Kristen Scott: Bondage Slut Powerfucked Into Massive Twitching Orgasms"
}