{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Completely naked, Victoria Voxxx stands with one leg on the ground and the other frog-tied with rope, fastened above her. Drool pours from the ball-gag in her mouth as she waits for Tommy Pistol to have his way with her, inside and out. Without saying a word Tommy creeps up from behind. He slaps her body from top to bottom. He grabs and pulls at her skin. Covered in pink hand prints, Victoria laughs through the ball gag, enjoying every second of it. Tommy gets out his leather crop and hits Victoria's tits with one hand while the other hand finger-fucks her pussy until she's begging to cum. Tommy shoves his hand down her throat to borrow some spit to use on her ass. He whips out his hard cock and makes her lick the tip of it while he stuffs his fingers in her ass. Once his cock is covered in her spit, he bends her over and fucks her pussy deep and hard. In the next scene, Victoria is in a full suspension on her side with one leg up, held tight in rope bondage. Tommy crops the bottoms of her feet. He pulls on her clit and hits it too with the crop, and she screams and then laughs. Tommy lubes up his gloved hand and fists Victoria's pussy. After she cums from getting fist-fucked, Tommy fucks her pussy some more with his hard cock. He shoves his dick in her mouth and then into her ass and fucks it hard. Next we find the lovely Victoria Voxxx bound with metal shackles to a wooden box with her ass in the air, and her arms awkwardly stuck between her legs. Tommy wastes no time and shoves his cock in her pussy, grabs two hand-fulls of ass, and fucks her hard. He moves her to a mattress on the floor and ties her up again with her hands behind her back, prone. He fucks her pussy and ass some more in a camel clutch hold. Victoria sucks and bites Tommy's cock and he shoots his load across her face.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2020-02-17",
  "scene_id": 45580,
  "tags": [
    "Ball Gag",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Crop",
    "drool",
    "Feet",
    "Gag",
    "Latin",
    "Leather",
    "natural boobs",
    "Pierced Nipples",
    "Rope Bondage",
    "spit",
    "Straight",
    "Sub",
    "Suspension",
    "toned",
    "top"
  ],
  "title": "Victoria Voxxx: Bound, Beaten, and Thoroughly Fucked by Tommy Pistol"
}