{
  "collections": [
    "Everything Butt"
  ],
  "description": "Anna DeVille sits alone on her couch with her laptop. She browses the web when all of a sudden a political ad pops up for Maya Kendrick who is running for Congress. Anna gasps at the ad because her and Maya used to date. She digs through her phone’s photo library and finds some very compromising pictures that they had taken together during one very kinky hook-up. She sends a pic to Maya and explains that if she comes over for one more sexy time, she’ll delete all of the photos from her database. Maya calls her back and tells Anna that she’s coming over. She tells Maya to take off her clothes, get on the couch and stick out her ass. Anna spreads Maya’s ass and shoves a big clear glass butt-plug inside and pops it in and out, making little gapes. Anna grabs an even bigger glass toy and Maya sits back on it while Anna pushes to get it all the way inside Maya’s pretty pink hole. Anna reaches for one more even bigger triple ripple glass toy and Maya gets the top two ripples deep in her ass. Anna fucks her with the toy while Maya uses a big vibrator on her clit and cums hard. Anna wants Maya to play with her own ass and so she has Maya pull down her panties and bends over the couch. She licks Anna’s asshole while Anna plays with her own pussy and Anna cums hard with Maya’s tongue in her ass. In the next scene, both girls are completely naked on the bed. Anna has a huge dildo attached to her strap-on and Maya spreads her legs and begs to get her ass fucked. Anna fucks her ass deep and hard, making her gape wide open. After that, Anna sticks her legs behind her head and tells Maya to shove the Pillar up her ass. Maya fucks her with the Pillar, letting us see all the way inside. Maya gets The Slink almost all the way in and cums hard on it. They take turns fisting each other’s assholes and Anna finally shows Maya mercy.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Anna De Ville",
      "person_id": 59053
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    }
  ],
  "release_date": "2020-03-06",
  "scene_id": 45588,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Blonde",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Fisting",
    "Gaping",
    "Kinky",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaved",
    "slink",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Anal Collusion: Candidate, Kendrick Anally Stretched by Anna DeVille"
}