{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Strong and gorgeous Ana Foxxx has her petite ebony body tied up in fully restrictive rope bondage. Her handler today is the tormented Tommy Pistol. He is ready to brutalize her body, take all of her holes and overwhelm her pain sensations. Starting with nipple play, Tommy tugs on her sensitive perky breasts. Tommy alternates from pulling and slapping them. She screams in pain. Next comes out the crop on her perfectly sensitive tight pussy. She begs him for pleasure but the screams of pain say otherwise. The cane finally comes out and torments her body as she writhes in the rope bondage. Next her mouth is tested. He stuffs his gloved hands down her throat getting that hole nice and wet. She slobbers spit all over her beautiful face. His cock is rammed down her lubricated mouth. He slaps her face hard to remind her that pleasure comes with pain. He brings out the Hitatchi and edges her over and over again, denying her orgasm. Next she is suspended and tied in rope bondage. He slaps her pussy and brings out the electric zapper. She scream in pain at every shock. Next her pussy is tested. The dripping wet tight hole begs for his cock and Tommy delivers. A deep pounding gets her screaming and begging for orgasm. Not yet. Finally Tommy uses her ass. He stretches her anal hole wide open for a sex. He goes back and forth between each hole using her body. He shoves his huge balls in her pussy and fucks her before shooting a huge load on her body.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2020-03-16",
  "scene_id": 45581,
  "tags": [
    "Anal",
    "Black",
    "black hair",
    "Bondage",
    "bottom",
    "brunet",
    "Caning",
    "Clothespins",
    "Crop",
    "Ebony",
    "Handler",
    "Latinx",
    "natural boobs",
    "Pain",
    "Petite",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "spit",
    "Straight",
    "Sub",
    "Zapper"
  ],
  "title": "Ana Foxxx: Destroyed with Bondage, Electricity, and Brutal Anal"
}