{
  "collections": [
    "Device Bondage"
  ],
  "description": "Alexis Tae is a young and very eager slut who's tired of watching things from afar. She's decided that she's going to go for it, and knew that the main reason she joined the porn industry was to work for Kink. Today she will take on the toughest channel we've got; Device Bondage! The bondage is more diabolical than any other on the internet, and the torment is going to be the most brutal that she has had to endure yet. Alexis begins her day in a brutal back bend with her young body locked into place with cold steel. The moment arrives when The Pope walks in with a leather flogger and begins to tenderize her flesh. At first she smiles because she is getting just what she wanted, but it quickly turns into more than she bargained for. The sounds of her wimpers and the surprised look on her face when he doesn't stop is priceless. Alexis is now completely aware that she has bitten off more than she can chew, but she's a brave slut and she's ready for whatever he has in store for her. Next, The Pope has Alexis in a scorpion hogtie, face-down on a wooden box. She is totally immobilized as she awaits her captor to enter and begin the next session of suffering. Her back is bent in a way that increases her suffering, but then he enters with a cane and begins a methodical bastinado session. He follows that with a crop to her already sensitive soles, and Alexis begins to show signs of breaking. The Pope sees this and moves the pain to her pussy as to not break her yet, but then goes back to her feet to finish her off. As the scene wraps up, she is made to cum uncontrollably to reward her for her suffering. The last scene begins with Alexis on her back and her feet exposed and the center point of this device. The Pope does not disappoint this time at all, and issues a brutal foot tormenting scene that leaves Alexis in severe pain. The day closes with several more imposed orgasms to finish her off.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Alexis Tae",
      "person_id": 62033
    }
  ],
  "release_date": "2020-03-19",
  "scene_id": 45586,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "Small Tits",
    "Straight",
    "Submission",
    "The Pope",
    "toned",
    "white"
  ],
  "title": "Alexis Tae: Exploring The Dark Side of Porn"
}