{
  "collections": [
    "Brutal Sessions"
  ],
  "description": "Katie begins her day naked, tied up, and fully available for\nwhat ever her captor wants from her. Derrick begins with some flogging to\nredden her skin before shoving his cock all the way down her slutty throat.\nHe makes good use of her mouth as he goes balls deep, and she just smiles\nbecause she wants to please her master. The intense blowjob and face\nfucking continues through the entire scene as Katie mouths off to Derrick,\nonly to get more face fucking as her punishment. The next scene has Katie in\na doggy style position with her pussy and mouth fully accessible so that he\ncan use both holes. There is more flogging to keep this brat in line, but as\nsoon as the pain goes away, she begins smarting off again. She is a tough\nlearner, but she has a patient trainer who is willing to abuse her holes and\nbody in order to get his point across. Next Katie finds herself in a missionary\nposition with her legs spread as far as they will go and her pussy on full\ndisplay. Derrick enters with the magic wand and begins to torment her\nsensitive pussy with powerful vibrations as he pounds her tight pussy into\nsubmission. Her brattiness overrides any good behavior she has had, so\nDerrick decides to use some fear tactics to settle his slut down. This seems\nto work briefly, so he goes back to fucking her pussy until he is ready for a\nchange again. The final scene is where this slut is expected to perform at her\nbest, and do some of the work, since she has been just taking dick all day.\nKatie is used like the slut that she is until Derrick has finally had enough of\nher, and blows his load all over her face.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Katie Kush",
      "person_id": 62547
    }
  ],
  "release_date": "2020-04-13",
  "scene_id": 45584,
  "tags": [
    "Athletic",
    "Blowjob",
    "Brunette",
    "Flogging",
    "master",
    "natural boobs",
    "other hair color",
    "Pain",
    "slim",
    "Straight",
    "Sub",
    "Submission",
    "Tattoo",
    "white"
  ],
  "title": "Katie Kush: Brat Submission"
}