{
  "collections": [
    "Families Tied"
  ],
  "description": "Helena Locke is the picture of serene suburban privilege, but her perfect bubble of calm is about to be destroyed by her sexually curious step-daughter Maya Kendrick who is left with her for a week before summer camp. Maya is a coltish red headed beauty, but very awkward in her virginal boy obsession. Helena tries to distract her by offering her car keys to go to the mall, but it's all a ruse to some time alone with the landscaper Tommy Pistol. Helena has been bored and relishes giving up her power and pussy to the rough hands of her gardener. He ties Helena up and strips away her clothing, leaving her hanging in a shibari partial suspension by her own pool. Taunting her with humiliating comments about her husband's cock and her taboo desire, Tommy works Helena's tight body over with a caning, alternating it with a vibrator so she strains against the ropes with desire. When she is about to burst, Tommy slides is cock into her trapped cunt and fucks her in the ropes while she drools and moans around her ball gag. They continue their play like this, flogging her athletic body red and then fucking passionately. They are enjoying themselves so thoroughly that they don't notice Maya arrive home early and watch them through the bushes while taking pictures with her phone. Maya is titillated by what she witnessed and spends the next afternoon trying to think up ways to ask Tommy on a date. When she finally gathers up the courage her advancements are quickly refused and she turns to blackmail and veiled threats. Tommy begins to play with Maya reluctantly, but when this little teen slut shows him everything she's learned from watching porn he finds she is more than worth his time. After fucking her throat and stuffing his balls in her mouth, he tricks her into handcuffs so he can really work her over. Maya soon realizes her mistake but hungrily endures a spanking and paddling on her creamy ass. Soon Tommy has her panties pulled around her ankles, grabs her long gorgeous hair and fucks her in a rough doggy, then turning her over and using her pussy while tormenting her pert little nipples with clamps. When Helena returns home, she finds a very nervous Tommy pacing around her leggy little teen step-daughter who he has restrained in the living room. She is annoyed with Tommy but furious with Maya for being such a nosey little whore and trying to blackmail them. Maya thinks she is saved with she sees Helena, but she is dead wrong and realizes it as soon as Helena begins degrading her and spanking her ass red. Tommy resumes face fucking Maya at Helena's request, and Maya slobbers and begs for relief from the strict paddling. To no avail, Helena is just getting started. She invites Tommy to shove his cock in her naughty teens ass and really teach her about boys. The rest of the afternoon is spent in rope bondage teaching Maya about the pleasures and perils of BDSM sex, anal, zippers, and keeping your very sadistic step-mother happy until you can escape to summer camp.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2020-02-28",
  "scene_id": 45595,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "Caning",
    "Curvy",
    "Family Roleplay",
    "Flogging",
    "Gag",
    "Latin",
    "muscular",
    "natural boobs",
    "Rope Bondage",
    "Spanking",
    "Straight",
    "Stud",
    "Suspension",
    "Threesome",
    "toned",
    "top",
    "unshaved",
    "Vibrator",
    "white"
  ],
  "title": "Maya's First Date: Curious Stepdaughter Gets More Than Bargained For"
}