{
  "collections": [
    "Families Tied"
  ],
  "description": "Kate Kennedy is living every woman’s dream as she wakes up to Valentine’s Day breakfast in bed and a hot BDSM fuck date with her fiance Ramon Nomar. Kate looks like a good girl, with a tight body, perky tits and ass, and a cloud of curly blond hair. She enthusiastically plays sexual submissive, swallowing Ramon’s cock and enduring a flogging of her perfect round ass. By the time she has his belt wrapped around her throat, Kate is begging for his cock like she hasn’t been fucked for weeks. When she finally gets pounded out she cums on command under Ramon’s foot. Ramon is an insatiable sadist and puts Kate on her back and ties her in a tight spread eagle rope bondage position, attaching clamps to her tender pussy and nipples, placing one of the roses he brought her in her mouth. Kate cums sweetly and ferociously as Ramon takes her cunt like a good Master should. Throughout this happy D/s sex, Kate’s phone keeps ringing, which she swears is just some bill collector. Ramon is curious, and when Kate gets up to get him more coffee he writes the offending number down to call on his way to work. He is more than a little surprised to hear the voice on the other end claim to be Kate’s Step-Sister. He is even more surprised and dismayed when he invites the imposter to meet him at his work and Kate’s secret step-sister Febby Twigs strolls into his workshop in a slutty outfit, demanding money for Kate’s con-job gone wrong in Vegas. Ramon tries to give Febby money to disappear, but she can’t resist digging in and telling Ramon all sorts of things he doesn’t want to know about his bride to be–including that he might just be another con job. When Ramon no longer know what to believe, he takes Febby to her knees, throwing her more money and and trying to fuck the truth out of her. But Febby is a devious slut, and she enjoys his cock down her throat and in her pussy. It’s only when Ramon finally has her tied up in a complicated shibari tie and he begins to work his huge dick into her ass that she realizes what kind of trouble she has truly gotten herself and her sister into. Febby tries to resist his interrogation, but Ramon moves between zapping her, caning her hot body, and fucking her ass, sending her into squirting screaming orgasms. Ramon is still unsure if he got the full truth about his fiance and her sister, but with his workshop soaking wet with squirt and his cock hungry for more fun he drags Febby home to see her long lost sister. Kate is shocked to find Febby tied naked to a chair in her dining room when she arrives home dressed for Valentine’s dinner. Kate tries to explain, but Ramon insists that she explain under duress in a hobbled shibari tie with his cock deep in her pussy. Hot red wax and a flogger bring Kate to the truth, that she in fact was planning to con him but fell in love instead and tried to outrun her old life. Ramon is touched, but it doesn’t keep him from punishing Kate and her sister with squirting rope restrained orgasms, zippers, spanking, flogging, and familial predicament. In the end Febby is Ramon’s Valentines day present from Kate, as she trains her step-sister to behave and service Ramon’s cock with her juicy bubble butt if she wants to stay.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Febby Twigs",
      "person_id": 62548
    },
    {
      "name": "Kate Kennedy",
      "person_id": 61558
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2020-02-14",
  "scene_id": 45594,
  "tags": [
    "Anal",
    "April Showers",
    "BDSM",
    "blond",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "Caning",
    "Curvy",
    "Family Roleplay",
    "Flogging",
    "Latinx",
    "master",
    "muscular",
    "natural boobs",
    "Rope Bondage",
    "Spanking",
    "Squirting",
    "Straight",
    "Stud",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Valentine's Day Ruined by Squirting Step-Sister's Anal Con Job"
}