{
  "collections": [
    "Families Tied"
  ],
  "description": "Seth Gamble is a city supervisor running as the incumbent. Despite having everything in the bag, he keeps getting caught hiring sex workers to fill the void left by his step-sister Keira Croft’s ass. Keira is the one thing he can’t have and it torments him every day, because she is his campaign manager and the taboo tension between them is palpable. She begs him to stop visiting brothels, but Seth can’t stop because his favorite mistress Paige Owens is the only woman who will play out his incest fantasy with him, relieving his dark desire. Paige is a gorgeous girl who keeps Seth coming back, draining his campaign account in exchange for letting him tie her up in rope shibari and fuck her throat while she calls him brother and begs to be fucked in all her holes like an horny little slut sister. Paige gets a visit from an irate Keira with an NDA and payoff to stop seeing Seth. Paige is not impressed and threatens to tell the world about Seth and Keira’s tryst, Paige demands that Keira drop the NDA and get in some handcuffs so Paige can humiliate and face fuck Keira like a cheap little whore until Seth shows up with a big fat check. Keira is covered in squirt with a welted red ass by the time Seth shows up. Seeing his sister with her ass stretched and pussy dripping he strikes a bargain with Paige. One last BDSM session and she can have her ransom money. They both set upon Keira’s creamy gorgeous body in a filthy passionate fuck session, trading out using her holes and draining her body of squirt. Seth is a raging fuck monster now that he finally has Keira under him, fucking her in bondage until she is screaming from orgasms while Paige begs for one last ride.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Keira Croft",
      "person_id": 62001
    },
    {
      "name": "Paige Owens",
      "person_id": 62346
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2020-05-01",
  "scene_id": 45597,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Crop",
    "Family Roleplay",
    "Flogging",
    "muscular",
    "Rope Bondage",
    "shaved",
    "Squirting",
    "Straight",
    "Stud",
    "Threesome",
    "white"
  ],
  "title": "The Incumbent's Anal Obsession: Paige Owens and Keira Croft"
}