{
  "collections": [
    "Everything Butt"
  ],
  "description": "Penny Pax is running a business. When she checks the outgoing orders to be shipped, she finds multiple mistakes. She summons new employee, Alexa Nova over to scold her for doing a poor job. Alexa apologizes but its not enough for Penny. She tells Alexa to strip her clothes off and bend over her padded saw-horse. Penny gets a big black butt-plug and tells Alexa to open her mouth wide. She shoves the butt-plug deep in her mouth and gets it full of Alexa’s spit and ready for her ass. Penny spreads Alexa’s cute round ass and starts pushing the black butt-plug inside her tight asshole. Alexa’s asshole while at first reluctant to receive the toy, finally gives in and swallows it up. Penny spanks Alexa’s ass with the toy still inside. Penny takes the plug out and tells Alexa to flip over and spread her legs. She gets a clear glass toy and pops it inside Alexa’s stretched asshole and makes her cum with a vibrator. Penny orders Alexa to get on her knees. Penny lifts up her tight latex skirt and makes Alexa tongue-fuck her asshole. Penny gets a big blue Bad Dragon dildo, hops up onto the padded saw horse, and fucks herself in the ass with it. She makes Alexa clean it off with her mouth and then orders her to fuck her ass hard and fast with it until her Mistress cums. After that, Penny straps on a huge dildo and has Alexa get on her knees. With the toy barely able to fit inside Alexa’s ass, Penny fucks her slow and steady until she loosens up and then fast and hard until Alexa cums. After that, Alexa gets on her back and spreads her legs to see how much of The Slink she can fit inside her. Once shes filled to capacity, she uses an Hitachi vibrator and has a huge orgasm. Penny grabs a clear glass toy called The Pillar and gets face down ass up. She instructs Alexa on how to fuck her with it and when it goes deep inside we can see all the way into her hole. In the end, they get cheek to cheek, and Penny fills her own ass with water, and sprays it all over Alexa.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "Alexa Nova",
      "person_id": 57359
    },
    {
      "name": "Penny Pax",
      "person_id": 38571
    }
  ],
  "release_date": "2020-04-17",
  "scene_id": 45590,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Blonde",
    "bottom",
    "Brunette",
    "buttplug",
    "Dildo",
    "Dominatrix",
    "Dragon Dildo",
    "Gaping",
    "Hitachi",
    "Latex",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "shaved",
    "slim",
    "slink",
    "spit",
    "Straight",
    "switch",
    "Tattoo",
    "Vibrator",
    "white"
  ],
  "title": "Penny Pax Punishes Alexa Nova's Asshole"
}