{
  "collections": [
    "Families Tied"
  ],
  "description": "Agent Bunny Colby is a gorgeous blond barbie doll, with huge tits, creamy skin, and a beautiful face. She’s been recruited to her sadistic step-brother’s department in the FBI, spending most of her days avoiding Seth’s bullying and pushing paper. Bunny’s recent surveillance job of a hot hacker babe has her hot and bothered, and if she wants to advance her career and save this beautiful woman from her brother she will have to go out in the field and bring Charlotte in herself.\n\nStealing her brother’s gun and ID is one thing, but apprehending an outlaw is another. Charlotte is ready for visitors from the FBI, and greets Bunny with a gun and a huge strap on. Once she has Bunny undressed and handcuffed for questioning, Charlotte uses her favorite tools for information extraction, a cane, a paddle, and 14 inches of a big strap on cock in combination with an electric zapper. Bunny cries and begs, claiming she has no information, but Charlotte is having too much fun and beats Bunny’s ass red, humiliating her with a face fucking, and then finishing the interrogation with an electro fucking. To make matters worse for Bunny, the hidden FBI cams are still on and her brother sees her stripped naked and fucked like a whore.\n\nBy the time Charlotte is ready to take a break, Agent Seth Gamble is waiting to ambush her outside of her warehouse. He immediately begins questioning, but Charlotte just teases him about how great a fuck his little sister is. Seth doesn’t like to be embarrassed, and immediately tears her clothes off and starts slapping her around and shoving his cock in her mouth. Charlotte glares up at him with her gorgeous eyes and refuses any information on her client list, driving Seth to bring her inside for further questioning with his sister.\n\nBunny is completely naked, tied uptight, and relieved to see her brother until she realizes he is angry at her for blowing his case and is about to teach her lesson. He handcuffs Charlotte and shoves her face into Bunny’s pussy, proceeding to cane, electro zap, and fuck her ass in order to get some answers. When Bunny’s protests grow to insistent, he grows even more fed up and comes around to shut her up with some fingers in her nagging cunt, then circles back around to enjoy some more brutal anal with Charlotte while enjoying his sister’s shocked face. He enjoys that pussy and shocked face so much, he hangs Charlotte upside down for questioning with electric pads and ties his hot sister up doggy style so he can fuck her pretty pussy while he questions the hacker with nipple clamps, a vibrator, and heavy electro insertables in her stubborn ass. Fed up with a lack of information and cooperation, he tells both ladies the only way one of them will survive is to impress him with some serious sexual service. Whoever makes him cum first will be kept safe, the other turned in. The resulting anal fisting, ATM, and sexual threesome for survival are truly desperate and hot.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Bunny Colby",
      "person_id": 61167
    },
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2020-01-31",
  "scene_id": 45593,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Ass To Mouth",
    "big dick",
    "Big Tits",
    "black hair",
    "blond",
    "Blonde",
    "bottom",
    "brunet",
    "Brunette",
    "Electrode Punishments",
    "fake boobs",
    "Family Roleplay",
    "Fisting",
    "Latinx",
    "Lesbian",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Paddle",
    "shaved",
    "Slapping",
    "slim",
    "Straight",
    "Strap On",
    "Stud",
    "Tattoo",
    "Threesome",
    "toned",
    "Vibrator",
    "white",
    "Zapper"
  ],
  "title": "FBI Agents Lesbian Step-Sister Blows The Case For Hot Hacker Pussy"
}