{
  "collections": [
    "Hogtied"
  ],
  "description": "Kira Noir and The Pope have been working together for years, so this time they decided things would be a little different. The bondage is going to push Kira harder than ever before, something Kira's wanted more then ever. She begins in a predicament with on leg pulled up, while her body weight rests on her upper body. Her tits and feet are brutalized with a crop to get her ready and primed for the day. Most times, The Pope takes it easier on the girls when the bondage is this extreme, but not today. Not with Kira. After a few minutes, he turns his attention to torment her pussy with non stop orgasms that fill the dungeon with her screams. The second scene opens and Kira is in another predicament, but this time it's even more diabolical than the last. This time she is in a hogtie type position with her neck tied to one of her feet. She is completely vulnerable, and nervously awaits The Pope's return. His entrance is a grand one as he shows her the different types of electrical devices he plans to use on her. Her face shows her fear, which he feeds on. She begs and pleads with him, but at this point it isn't about if he will, but rather how much damage he has planned for her. The tears start to flow as the intensity of the scene grows, but Kira is one tough bitch, and she isn't giving up that easily. In the final scene we get to see a lot of on-screen rope work, which is few and far between. The Pope slowly weaves a web on inescapable bondage that has Kira completely helpless. Once she is secured, he spends the rest of the day having his way with her. He fucks her pussy and throat, non stop orgasms, and breath control round out the remainder of the day.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Kira Noir",
      "person_id": 58892
    }
  ],
  "release_date": "2020-04-08",
  "scene_id": 45599,
  "tags": [
    "BDSM",
    "Black",
    "black hair",
    "Bondage",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "dungeon",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Rope Bondage",
    "shaved",
    "Straight",
    "Submission",
    "The Pope",
    "toned",
    "Vaginal Penetration"
  ],
  "title": "Kira Noir: Hard Bodied Goth Slut in Extreme Bondage and Tormented"
}