{
  "collections": [
    "Families Tied"
  ],
  "description": "Kasey Warner and Casey Calvert have been a package deal since their parents married in high school. As best friends and step-sisters they dated together, lived together, and shared everything, until one day Casey took a leave of absence from school and stopped returning her step-sister’s calls. Unknown to her step-sister she had been fostering a long hidden desire for a taboo life of sexual submission, 24/7 service, and worship at the feet of a dominant man. When Casey found that man in Derrick Pierce, she gave up everything and went to train in his beautiful home as an anal servant and masochistic fuck toy. Living the life she had always dreamed of, Casey finds herself tied spread eagle to the master bed in a tight shibari tie. She balances carefully on her high heels, which have clamps attached to her labia, pulling painfully every time she shifts her weight. More clamps pinch her nipples as she drools around a ring gag and waits for her Master to administer another lesson in pain and pleasure. She doesn’t wait long before Derrick comes her side with a crop and proceeds to put her through her paces with face fucking, orgasm denial, and a brutal and passionate anal fucking a pretzel tie. The only thing that stops him is the doorbell ringing incessantly, which he sends Casey to go answer. At the door Casey is surprised to see Kasey, who is furious but also relieved to find her sister. Kasey demands answers about why Casey disappeared, but when Derrick comes into the foyer she has all the answers she needs and leaves as quickly as she appeared. Casey recovers and is soon back in service, which Kasey finds her in when she circles back around to spy on her sister’s new lover. Incensed, Kasey walks right into the house and tries to shame Casey into leaving with her. Casey has grown very confident in her position as Derricks submissive and finally has the power to stand up to Kasey’s controlling personality. Placing Kasey in a choke hold, Casey offers her the choice to see for herself why Casey has chosen this life, or she can leave Casey and forfeit their relationship. Kasey snarls and talks back, but relents to an afternoon of submission. She is immediately placed on the bottom of the hierarchy with an ass welted by spanks and a mouth filled with Derricks cock. Casey takes great pleasure in flogging her arrogant sisters ass with a heavy hand while Kasey chokes on Derricks dick, and then begs to cum into Casey’s pussy while being fucked into total submission in doggy. The training day has just started for Kasey, and she is placed in a heavy ebi tie and made to control her orgasms so that her sister is not brutally shocked and punished. Kasey can hardly control herself with a vibrator on her sensitive clit, but when Derrick begins fucking her trapped pussy, all hope is lost for Casey in her punishment predicament. She is untied and lead to the bedroom for an easier lesson in posture and position, holding a silver tray in one hand a vibe in the other while Casey pleasure Derrick with an anal fuck and pulls her sisters zippers off on command. Both women take turns pleasuring Derrick with their holes and sharing his cock like loving sisters should. Kasey is welcomed back into Casey’s life, and Derrick’s household.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Kasey Warner",
      "person_id": 56865
    }
  ],
  "release_date": "2020-03-13",
  "scene_id": 45596,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "bottom",
    "brunet",
    "Brunette",
    "Crop",
    "Family Roleplay",
    "Feet",
    "Flogging",
    "Gag",
    "High Heels",
    "master",
    "muscular",
    "natural boobs",
    "Orgasm Denial",
    "other hair color",
    "Pain",
    "shaved",
    "slim",
    "Straight",
    "Stud",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "A Tale of Kasey and Casey"
}