{
  "collections": [
    "Sex And Submission"
  ],
  "description": "London River has been neglected at home by her husband for a long time. After he comes home demanding that she throw a dinner party to impress his boss, she completely loses patience with him. She sneaks off to an abandoned warehouse to get cropped, flogged and fucked by Ramon Nomar. Her husband doesn't know how to please her, but Ramon uses and abuses her every way she likes. Ramon strips London and exposes her shaved pussy. After tying up her full rack, he squeezes her perky nipples into tweezer clamps and pulls her tit flesh tight in lots of clothes pins. London is locked into a device bondage head cage so Ramon can use it to choke her while he fucks her slutty pussy. He mercilessly beats her into submission at the end of his huge, uncut cock. London's sexual torment continues as Ramon ties her on her back exposing her clamped pussy. He makes her orgasm over and over. Her pleasure is so intense that it causes her asshole to rosebud. Ramon, of course, punishes her for being such a greedy slut by cropping that rosebud repeatedly. He leaves her a sloppy, mess with all her holes fucked. Days later at her dinner party, her husband's boss walks in. To London's shock it's the same stranger she's been fucking. She panics and runs to the restroom. The boss corners her and convinces her that she needs to take his hard cock in every hole, right then and there, or he will tell her husband about their tryst. He fucks her mercilessly over the bathroom counter while all of her guests pretend not to hear it. Ramon greedily cream pies her slutty asshole, pulls up her panties, and sends her back to the party with all those holes fucked wide open.",
  "directors": [
    {
      "name": "Kirin Kurai",
      "person_id": 104
    }
  ],
  "models": [
    {
      "name": "London River",
      "person_id": 56590
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    }
  ],
  "release_date": "2020-03-13",
  "scene_id": 45608,
  "tags": [
    "BDSM",
    "Blonde",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Cage",
    "Corporal Punishment",
    "Domination",
    "fake boobs",
    "Humiliation",
    "muscular",
    "natural boobs",
    "Prolapse",
    "rack",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Straight",
    "Stud",
    "Submission",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Dinner Party: Cheating Wife London River Gets Anally Creampied"
}