{
  "collections": [
    "Men On Edge"
  ],
  "description": "Dressed in a red plaid kilt and black leather harness, Colby Jansen waits in his dungeon for his submissive who seems to be running late. Colby leaves the room for a minute and comes back to find his dungeon in disarray. His floggers are all over the place, a steel drum has fallen over, and a strange mysterious green goo covers some leather cuffs. He sees a gold coin on the ground, picks it up and marvels at its peculiarity. When he stands up we see two little hands reaching for his leather boots. Colby hits the ground and wakes up, bound to a steel cross, his arms and feet wrapped in bright green medical wrap. A leprechaun named Sebastian walks up from behind Colby and grows to a normal man's height. Colby freaks out and the leprechaun asks where his gold is. Colby denies taking his gold so Sebastian begins tickling him. Colby laughs and writhes and screams for him to stop. Sebastian notices that the tickling has given Colby a raging boner and drops to his knees to remove Colby's kilt and see if there's any gold hiding in there. Finding no gold but instead a delicious hard cock, Sebastian wraps his leprechaun lips around it and sucks Colby's cock like only a leprechaun can. He gets a stroker and jacks Colby's cock with it. Colby begs to let him cum but Sebastian wont let him until he tells him where the gold is. In the next scene, Sebastian sticks a green ball-gag in Colby's mouth and has him bound to his own throne, strapping Colby down with leather belts across his thick muscly torso. Sebastian sucks Colby's cock some more, then gets a vibrator with a stroker attached to it with an even tighter fit, and slides it onto Colby's hard cock, and begins stroking until Colby begs again to let him cum. Sebastian attaches clover clamps to Colby's nipples and ties a pulley and string to a pot of gold as a counter-weight. Sebastian slides a vibrating prostate toy inside Colby's asshole and turns it on high. Sebastian finally lets Colby shoot his load but only while in terrible pain from the nipple clamps.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Colby Jansen",
      "person_id": 34457
    }
  ],
  "release_date": "2020-03-17",
  "scene_id": 45603,
  "tags": [
    "BDSM",
    "big dick",
    "blond",
    "Bondage",
    "Clover Clamps",
    "dungeon",
    "Edging",
    "Feet",
    "Gag",
    "Gay",
    "Hairy",
    "Leather",
    "Leather Cuffs",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Nipple Clamps",
    "Oral Sex",
    "Pain",
    "Prostate Stimulation",
    "harness",
    "Rope Bondage",
    "Tickling",
    "top",
    "unshaved",
    "Vibrator",
    "white"
  ],
  "title": "Edge of the Rainbow: Colby Jansen Bound and Edged by a Leprechaun"
}