{
  "collections": [
    "Men On Edge"
  ],
  "description": "Muscle stud Ricky Larkin is at the mercy of hot experienced leather clad handler Dillon Diaz. Head enclosed in leather, Ricky is trapped in darkness. His arms are encased in leather bondage sleeves and pulled behind him with thick heavy chain. He can only smell the leather of his leather muzzle and feel the heavy chains holding him in place. Dillon glides his gloved hands over Ricky's leather encased cock, squeezing lightly as Ricky groans. He squeezes Ricky's sensitive nipples and kisses the mask covering Ricky's mouth. He sinks to his knees and reveals Ricky's rock hard cock. Ricky moans as Dillon strokes his cock and takes it into his mouth. Dillon takes his time tasting every inch of Ricky's delicious cock. Soon Ricky is straining to fuck Dillon's warm wet mouth. Dillon laughs, grabbing a ball parachute and snapping it around Ricky's balls. He ties it to a point in front of Ricky. The tugging sensation on his balls makes Ricky even more desperate to cum. Dillon puts nipple suckers on Ricky's nipples and continues edging Ricky. Ricky squirms as Dillon teases the head of his cock with his hands and his mouth. He asks to cum but Dillon isn't done with him yet. Dillon strips him down and ties him up. He takes off Ricky's boots and smells his sweaty socks before taking them off revealing Ricky's feet. He licks up Ricky's arch and sucks on Ricky's toes. Then he starts tickling! Ricky laughs loudly, squirming as Dillon's fingers find his sensitive spots. Then Dillon breaks out a toothbrush to continue tickling Ricky's feet. Ricky throws his head back as he cackles in delight. Dillon gets Ricky's feet and armpits at the same time, making Ricky laugh uncontrollably. Then Dillon brings out the violet wand and runs it over Ricky's feet. Ricky's toes curl as Dillon teases him with it. Finally, Dillon stops tickling Ricky and pushes a vibrating prostate toy into Ricky's ass. The vibrations have Ricky ready to shoot and he begs Dillon to take his load. Dillon takes mercy on Ricky and lets him blow his load. Before Ricky can relax, Dillon starts tickling him again!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Ricky Larkin",
      "person_id": 35556
    }
  ],
  "release_date": "2020-02-04",
  "scene_id": 45602,
  "tags": [
    "BDSM",
    "big dick",
    "black hair",
    "Bondage",
    "Chains",
    "Edging",
    "Feet",
    "Gay",
    "Handler",
    "Leather",
    "Male Handler",
    "Male Sub",
    "Mask",
    "mixed",
    "Muscle",
    "muscular",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "shaped",
    "Stud",
    "switch",
    "Tattoo",
    "Tickling",
    "versatile",
    "Violet Wand"
  ],
  "title": "Larkin's Load: Ricky Larkin Bound in Leather, Tickled, and Drained"
}