{
  "collections": [
    "Men On Edge"
  ],
  "description": "Brand New to Kink Men, the absolutely stunning latin muscle god Zario Travezz. Sebastian Keys and Chance Summerlin, quickly get this stud out of his clothes and tied up in restrictive rope bondage to show off his muscular trim physique. This body was made for bondage! Chance starts by rimming Zario’s perfect tight hairy asshole. Sebastian brings out the scissors and cuts off Zario’s briefs exposing his rock hard giant cock. This muscle monster cock begs for bondage and bdsm, and gets harder with every edge. Chance does his best to swallow this cock whole as Zario is blindfolded and his nipples have suction clamps applied. The stimulation gets Zario begging to cum right up to the edge. It’s time to test out his hole. A vibrating cock on a stick is used to fuck Zario while in bondage. Sucking and fucking get him rock hard and again he begs to cum. After being denied, the men get Zario bound to a fuck table. Sebastian puts a huge glass buttplug up Zario’s ass. Chance knocks on that buttplug while stroking off Zario’s monster cock. Zario is gagged with a bit gag and his screams of pleasure are muffled. Finally Sebastian bings out a toy Zario cannot resist. An electric shocking vibrating dildo. They quickly turn this toy up as it fucks and shocks Zario. The men try to edge him one more time, but Zario’s cock explodes with cum. Unable to resist he begs the two men for more, don’t stop. Zario’s monster cock cums again! Of course, this isn’t the ending. Zario tries hard to resist the endurance tickling but it overcomes him.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Zario Travezz",
      "person_id": 62570
    }
  ],
  "release_date": "2020-03-03",
  "scene_id": 45604,
  "tags": [
    "BDSM",
    "bit gag",
    "Bondage",
    "buttplug",
    "Dildo",
    "Edging",
    "Gag",
    "Gay",
    "Hairy",
    "Latinx",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "muscular",
    "Oral Sex",
    "Prostate Stimulation",
    "Rimming",
    "Rope Bondage",
    "Stud",
    "Swallow",
    "Tickling"
  ],
  "title": "Zario Travezz: Bound, Shocked, Fucked & Edged"
}