{
  "collections": [
    "Men On Edge"
  ],
  "description": "Max Konnor’s looking for an unconventional mode of treatment for his medical practice. Dominic Pacifico offers his new device, The Super Milker Deluxe Stroking Machine. But before Max signs on, Dominic insists that he test it out. Intrigued, Max agrees. Immediately, Max is stripped naked, and his huge muscled body is tied to his office chair, blindfolded with his wrists bound. Dominic jerks his big thick dick, playing with it and sucking it, until he’s huge and hard. He then slides the Super Milker over that giant dick and turns it on. The machine starts working Max’s cock, stroking it and sucking it simultaneously, almost making him cum right away. But Dominic yanks it off, teasing Max and denying him, as his huge, lubed up cock sticks straight up into the air. Next, Dominic stands Max up, binds his hands behind his back and fits him with a bit gag. While Max flexes and sweats, Dominic jerks and sucks that fat hard cock, slides a lubed up stroker on it and edges him again and again. Max trembles and convulses each time, as drool runs out his mouth over the gag. Dominic continues sucking his dick as Max thrusts into his mouth, desperate to shoot. But he doesn’t get to cum just yet. Dominic slides the Super Milker back on that cock, which is now so hard it barely fits in the machine. Dominic finally jerks Max off, as Max shakes and moans, unable to contain his hot load. He sprays it all over the floor of his office, while every muscle in his giant body flexes.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Max Konnor",
      "person_id": 62541
    }
  ],
  "release_date": "2020-02-19",
  "scene_id": 45601,
  "tags": [
    "BDSM",
    "bit gag",
    "Bondage",
    "drool",
    "Edging",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Straight",
    "Tickling"
  ],
  "title": "Super Milker: Max Konnor Gets His Huge Hard Cock Milked Dry"
}