{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Ana Foxxx is questioning her relationship with hubby Eddie Jaye. Even though she loves him more than anything there is something lacking in the sex and she's thinking about other men.\nWearing a silky kimono with hardly anything underneath Ana writes all about her secret desires in her private diary but Eddie senses something odd or different about her lately so he takes a risk and sneaks a peak at her journal. Sure enough his worst fears have come true so he devises a plan to see just how loyal his sexy wife is. When Eddie sends best friend Donny Sins over to visit Ana he convinces her he's been fantasizing about getting together and Ana takes the bait! At first she is reluctant but then all hell breaks loose and she and Donny are hitting it hard on the bed in the master bedroom. Donny spreads Ana's long, smooth, toned legs and licks her pussy . He peels her dress off and reveals her small firm natural tits and then flips her over on her stomach to suck his dick with gusto. She jerks his cock with her hands and takes it deep down her throat to get him rock hard. Finally he fucks her with his long firm cock and she is loving it. She plays with her clit as he fucks her and she almost cums. But while they are passionately kissing Mr. Eddie Jaye busts in and catches them in the act. Uh oh things are gonna get crazy. Eddie takes charge and tells them both what is going to happen and kinkiness ensues. First foxy Ana is gonna get tied up cuz thats how she likes it. They bind her up with rope and take her from both ends. Eddie fucks his wife's already wet, fucked pussy while Donny stuffs his cock down Ana's throat and gets a solid, sloppy knob job. They take turns with her slutty holes and then put her on all fours in doggie and keep fucking her brains out. She sucks dick while getting her pussy pounded and then she mounts Eddie and bounces her little ass all over his thick dick. While she's cowgirl fucking her man Donny fills Ana's asshole with his long hard cock and she savors the hardcore double penetration. Back on the bed Eddie and Donny fill her holes and they fuck and suck and get this dirty slut off in all the best ways until they each shoot their hot loads all over her pussy. What a good husband to give his wife exactly what she needs. This Sex and Submission is brought to you by JP 'The Pope\".",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ana Foxxx",
      "person_id": 39134
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Eddie Jaye",
      "person_id": 60457
    }
  ],
  "release_date": "2020-04-24",
  "scene_id": 45609,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blowjob",
    "bottom",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Double Penetration",
    "Humiliation",
    "Kinky",
    "master",
    "mixed",
    "muscular",
    "natural boobs",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "smooth",
    "Straight",
    "Submission",
    "The Pope",
    "toned",
    "top",
    "Vaginal Penetration"
  ],
  "title": "Dear Diary: Ana Foxxx gets tied up and double fucked"
}