{
  "collections": [
    "Hogtied"
  ],
  "description": "Ivy LeBelle has been captured by a sadistic fuck whose one goal is to make her suffer and cum uncontrollably. She is on her back with her legs tied together and up in the air. Her arms are bound in a box tie to immobilize them and keep her helpless. The Pope enters and begins to grope and molest her body. He grabs a crop and begins to strike her, intent on finding out what makes her scream... and what makes her purr. Her feet fall prey to his sadistic ways as he issues a nasty bastinado session. The vibe is used to make her cum, and torment her all at the same time. Once he has had his fill of her in this position, we move on to something even more grueling on her body. Ivy is suspended in a side suspension that has her legs spread as wide as they will go. The crop is back and this time, more of her flesh is terrorized with it, until she can no longer handle the torment. The Pope moves on to plucking her pubic hair, until she begs for the crop to come back. Next he takes turns fucking her pussy and throat until she is so overcome with orgasms that she barely knows her own name. In the final scene, Ivy is in a doggy position with her amazing ass on full display. Her ass is spanked until she begs for it to stop, then the crop is brought back out to use on her sensitive soles. The next move is to make her cum so much that she taps out, but instead we got one better. She admitted that no one has ever made her cum that hard in her life. We'll take that!",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Ivy LeBelle",
      "person_id": 60683
    }
  ],
  "release_date": "2020-05-06",
  "scene_id": 45600,
  "tags": [
    "BDSM",
    "Big Tits",
    "black hair",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Crop",
    "Curvy",
    "Domination",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Rope Bondage",
    "Straight",
    "Submission",
    "Suspension",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Ivy LeBelle: Curvy Slut in Bondage Tormented and Made to Cum"
}