{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Levi owns a swanky house that he rents out for sex parties. One morning, while cleaning up after a wild night, he listens to his voicemails, one of which is from Skylar Snow. She says that she got his number from his friend Donny. Donny told her about how Levi wants a kinky live-in \"House Girl\", and that he's accepting applications. Skylar is more than interested at the opportunity and wants to schedule a meeting, which she does and meets Levi later at his house. She hands her checklist to Levi and he goes over it. He asks if she's ready and nervously she says yes. He slowly comes up from behind her and rips her dress off. He spreads her legs, rubs her pussy, and spits in her mouth. Skylar gets bent over a chair. Levi pulls her panties aside, spanks her and spreads her ass. After her pussy and ass get probed by his gloved fingers, Levi grabs a leather flogger and hits Skylar's ass hard and true. Skylar shows her gratitude by saying,\"Thank you sir\" after every hit. Levi turns her around to face him and spreads her legs. He hands her an Hitachi vibrator, places a rocks glass by her pussy and tells her to pour him a drink. Skylar works herself up to orgasm and squirts into his glass and they both drink it. In the next scene, Levi has tied Skylar up with rope on her side, with her hands behind her back, and one leg up, in a full suspension. Skylar's mouth, perfectly placed at dick-level, Levi takes advantage and uses it to pleasure his cock. Covered in Skylar's spit, Levi shoves his cock in her pussy and fucks it deep and hard. After that predicament, Levi takes her down and has her get on her hands and knees on top of his black leather couch. She begs for him to fuck her ass and he obliges. While fucking her ass, his friend Donny Sins shows up as a surprise for Skylar. Donny whips out his huge cock and Skylar gets to sucking it while she gets fucked in her ass. They double penetrate her holes, Donny covers her eyes in cum, and Levi creampies her pussy.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "H3ll4SL00tz",
      "person_id": 61686
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2020-02-28",
  "scene_id": 45607,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Double Penetration",
    "Hitachi",
    "Humiliation",
    "Kinky",
    "Leather",
    "mixed",
    "natural boobs",
    "other hair color",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "slim",
    "spit",
    "Squirting",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "Threesome",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "The House Girl: Skylar Snow Tied Up and Fucked in Bondage"
}