{
  "collections": [
    "TS Seduction"
  ],
  "description": "Stunning model Ryder Monroe has been summoned for a service check. This Submissive has been disobeying protocol and needs a full system reboot. Cynical scientist H3llSL00tz has a theory that Artificial Intelligence can never beset humanity, humans will always control the A.I. Ryder Monroe was designed to submit. In a latex skirt, thigh high fishnets and high heel boots, Ryder reports for her servicing. The doctor gets right to work. Ryder Monroe crawls up on her hands and knees and presents her ass. With black gloves on, he goes right for anal fisting. Only one way to get to that hot button to reset the A.I. Next he tests the sensors. Pain and Pleasure. While stroking her beautiful cock, he brings out the Violent Wand. Shocks of pain and strokes of pleasure. She is bound to the bed and her mouth is gagged with a red ballgag. Her screams are muffled. While choking her he decided the only way for this to work is to fuck the submission back into her. First is a deep sloppy wet blowjob. This deep throat cock sucking gets her gagging. He slaps her ass then flips her over. Spread open and show it to me he says before going in for deep anal fucking. He pounds away at his toy before shooting his load and going in for another round of fisting.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "H3ll4SL00tz",
      "person_id": 61686
    },
    {
      "name": "Ryder Monroe",
      "person_id": 62576
    }
  ],
  "release_date": "2020-04-14",
  "scene_id": 45615,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Ball Gag",
    "Blowjob",
    "Choking",
    "Cock Worship",
    "Doctor",
    "Electrical Play",
    "Fishnets",
    "Fisting",
    "Gag",
    "gloves",
    "Latex",
    "Male Fucks TS",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Spanking",
    "Straight",
    "Submission",
    "TS",
    "Violet Wand"
  ],
  "title": "Submissive A.I. - Sexy Ryder Monroe is Punished by Cynical Scientist"
}