{
  "collections": [
    "TS Seduction"
  ],
  "description": "Smoking hot babe Eva Maxim has beefy hunk Draven Navarro bound, gas-masked, and at her mercy. His balls in a mouse trap, Draven shivers as his Mistress approaches. He catches a quick glimpse of his Mistress before she takes away his sight and runs her hands along his muscles. She uses to leather slapper to test his muscles and before taking off his mask and pressing her shiny stiletto boot heel right into his cock. Draven cries out as the heel digs into him. Painful though her boot may be, Draven is hopelessly turned on and eagerly drinks in the sight of his beautiful Mistress in her tight underbust corset and latex skirt. Eva tells him to be a good boy and open his mouth. He obeys and Eva slides her fat cock between his lips. She fucks his face, taking pleasure from Draven’s muffled whimpers. She straddles his face and lets this lucky boy taste her glorious ass as she rides his face. Next Draven is collared and on his hands and knees. Eva flogs him mercilessly and Draven cries out his flesh is tenderized. Then Eva commands him to suck her cock. Draven obeys and gets a brutal face fucking before Eva commands him to lick her shoes. Draven’s tongue cleans her shoes and he sucks on her heel as he does her cock. Finally, she commands him up on the couch so she can slide her cock into his ass. Draven moans as his Mistress’ dick penetrates his tight hole. Eva plunders her slave’s ass and gives him a hard pounding. Draven profusely thanks his Mistress for fucking him so good. He cums on command and Eva takes his cum, smears it across her cock, and sticks it right back into his hungry hole. She continues fucking him until she’s satisfied and then blows her load all over him.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Eva Maxim",
      "person_id": 62480
    }
  ],
  "release_date": "2020-03-31",
  "scene_id": 45616,
  "tags": [
    "Anal",
    "Big Tits",
    "Blowjob",
    "body builder",
    "Boot",
    "bottom",
    "brunet",
    "Chains",
    "Cock Worship",
    "Corset",
    "Flogging",
    "Latex",
    "Leather",
    "Mask",
    "Metal Bondage",
    "mixed",
    "Muscle",
    "Role Play",
    "slapper",
    "Slave",
    "Smoking",
    "Straight",
    "Tattoo",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Fierce Busty Goddess Eva Maxim Fucks Man Meat Draven Navarro"
}