{
  "collections": [
    "TS Seduction"
  ],
  "description": "Welcome the sexy incomparable Melanie Brooks to Kink.com! Melanie is a dirty cop who has some last minute cleanup to do to ensure her and her partner don’t go to jail. She goes to retrieve the evidence from her last case only to encounter lazy cop Mike Panic. When the evidence appears to be missing, Melanie uses her womanly wiles to seduce Mike so he’ll help her recover the missing evidence. Mike is grumpy at first but after Melanie gives him some attention and shows off her gorgeous long legs and absolutely perfect feet, Mike becomes more amenable in the hopes he’ll get to worship this goddess before him. Melanie instructs Mike to get on his knees and remove her shoes. She makes him sniff her dirty feet before giving him permission to kiss and lick them. Melanie moans as Mike’s clever tongue moves in between her toes. She lets him kiss up her long legs and pulls aside her latex panties. Mike inhales deeply, taking in the scent of her beautiful cock. He moans as Melanie gives him permission to suck on the head. Pleased with his obedience, Melanie pushes his head down on her dick. Mike takes every inch, gagging on Melanie’s cock as Melanie wraps her legs around his head to push him down even further. Next, Melanie makes him smell and eat her ass. Mike loves it and eagerly buries his head in her ass. Then Melanie makes him strip and get on his desk. She plows into his ass and fucks Mike with such force the desk strains beneath them. Melanie’s cock feels amazing in Mike’s ass and he tells her how much he loves it. She has Mike flip over so she can spank his ass while she fucks him good. Mike promises she’s his new boss. Pleased, Melanie has him taste his ass on her cock and bends him over the desk to pound his ass more. Unable to take any more, Mike begs to cum and blows a load all over his belly. Melanie feeds it to him while she fucks him and then blows her load all over his face. Now it’s time to find that missing evidence.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Melanie Brooks",
      "person_id": 62550
    },
    {
      "name": "Mike Panic",
      "person_id": 41034
    }
  ],
  "release_date": "2020-02-25",
  "scene_id": 45612,
  "tags": [
    "Anal",
    "Athletic",
    "Blowjob",
    "bottom",
    "brunet",
    "Cock Worship",
    "Cop",
    "Feet",
    "Latex",
    "Role Play",
    "shaped",
    "Straight",
    "Tattoo",
    "TS",
    "TS Fucks Male",
    "white"
  ],
  "title": "Pulling Rank: Dirty Hot Cop Melanie Brooks Fucks Evidence Room Boy"
}