{
  "collections": [
    "TS Seduction"
  ],
  "description": "Casey Kisses is having a stressed out day at work. When custodian, Dale Savage asks her whats wrong, she gives him a wink and shoves her books on the ground so that he’d have to bend over and pick them up. Dale sneaks up from behind her and puts a ball-gag in her mouth. He strips her naked and lays her on her back, on top of her desk. With leather ankle cuffs, Casey’s legs are lifted up and attached to a spreader bar. Dale rubs and squeezes her big perfect tits and helps himself to a mouthful of her hard cock. Casey gets clover clamps attached to her nipples and loves the pain mixed with pleasure. Dale spanks her ass, deep-throats her big cock and then gets out a leather flogger to hit her ass and thighs. He kisses her over the ball-gag, lets her out of her restraints, and tells her to get on her knees. Dale fucks her mouth while she strokes her hard cock, loving every second of it. They get up onto the leather couch and into a hot 69 position and fuck each others throats. After that Casey presents her ass to Dale and he goes to town licking her asshole while he strokes her cock. Dale then slides his hard cock inside her pretty asshole and fucks her fast, hard, and raw. After she takes a pounding in doggie she flips over and puts her long legs behind her head and gets her ass fucked some more. Dale fucks her ass while stroking her hard cock and he fucks the cum right out of her. He uses her cum as lube and continues fucking. Casey is told to get on her knees and Dale fucks her mouth until he cums.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Casey Kisses",
      "person_id": 59560
    },
    {
      "name": "Dale Savage",
      "person_id": 62015
    }
  ],
  "release_date": "2020-04-28",
  "scene_id": 45617,
  "tags": [
    "69 Position",
    "Anal",
    "big dick",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Clover Clamps",
    "Cock Worship",
    "Gag",
    "Leather",
    "Male Fucks TS",
    "mixed",
    "natural boobs",
    "Pain",
    "Role Play",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "top",
    "TS",
    "white"
  ],
  "title": "A Helping Hand: Dale Savage Helps Relieve Stressed Boss Casey Kisses"
}