{
  "collections": [
    "TS Seduction"
  ],
  "description": "Big star Khloe Kay is not having a good day. Opening night is tonight and Khloe refuses to leave her dressing room. Luckily Dillon Diaz shows up apologetic and eager to make things right. Khloe takes one look at Dillon and knows exactly how this beefy boy can make it up to her. She has Dillon get on his knees to worship her heels and her stocking-clad feet. After removing her stockings, Dillon sucks on her toes and rubs her perfect feet. Then she orders Dillon to take his shirt off. Dillon isn't sure now is the best time but when his star threatens to walk out, he obeys and lays down on the floor before her. After admiring his muscular built body, Khloe steps onto his chest and tramples his upper body as Dillon gazes up at her gorgeous nude body. He loves being beneath this glowing goddess. Dillon moans as Khloe lowers herself onto his face and smothers him with her ass. Next Khloe makes Dillon suck her cock and tells him he should've been doing this the moment she arrives. Dillon agrees and continues to worship her cock and bury his tongue in her ass. Finally Khloe has Dillon presenting his ass on his hands and knees. He groans as Khloe stretches his ass open with her hard cock and fucks him good. Khloe fucks him to her heart's content and then allows him to cum before blowing her load all over him. Perhaps the show will go on after all.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    },
    {
      "name": "Khloe Kay",
      "person_id": 61949
    }
  ],
  "release_date": "2020-03-10",
  "scene_id": 45614,
  "tags": [
    "Anal",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Feet",
    "Handler",
    "muscular",
    "natural boobs",
    "Role Play",
    "Straight",
    "Tattoo",
    "TS",
    "TS Fucks Male"
  ],
  "title": "Serving Ms. Kay: Diva Khloe Kay puts handler through the wringer"
}