{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Daizy Cooper is new to Kink.com and excited for her first shoot, and she's working with none other than the gorgeous, big-dicked Aspen Brooks. Aspen owns this new slut, but she also takes good care of her, making sure she's happy sucking cock and getting fucked. Daizy is all-in for whatever Aspen decides to give her, including cropping, spanking, and fucking that sweet, slutty pussy full of huge, hard cock. Aspen arrives home to find that her girlfriend has left her a Valentine's Day present, wrapped up in a big, red velvet sack. Aspen can hardly wait to open it up and see what's inside. Daizy pops out, chained up, decked in black and red latex, with a ball gag shoved in her mouth, and a desperate need to please The Duchess. Aspen starts her out with a little cropping on her perfect, round ass. Daizy may be squealing through her gag, but she loves this treatment, especially from a woman as perfect and lithe as Aspen. Aspen shoves a vibrator on Daizy's pussy, making her cum again and again with her hands chained above her head. She then lets Daizy down and makes her suck that big thick cock. Aspen lays back while her Valentine's Day whore sucks and slurps that giant dick, getting it soaked with spit. When it's good and sloppy, Aspen puts Daizy on her hands and knees and slams her rock solid cock into Daizy's hungry, horny cunt. Daizy can't get enough of this fucking, as she rides back on Aspen's dick, wanting it deeper and deeper. Aspen puts Daizy on her back and pounds her out, opening that pussy and filling it with cock. She finally shoots a huge load all over Daizy's beautiful ass, giving her what she wanted, but still taking it all for herself.",
  "directors": [],
  "models": [
    {
      "name": "Aspen Brooks",
      "person_id": 59054
    },
    {
      "name": "Daizy Cooper",
      "person_id": 62352
    }
  ],
  "release_date": "2020-02-10",
  "scene_id": 45621,
  "tags": [
    "Ball Gag",
    "big dick",
    "Blowjob",
    "Cock Worship",
    "Gag",
    "Latex",
    "Role Play",
    "shaved",
    "Spanking",
    "spit",
    "Straight",
    "tea2020",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Daizy Chained: New To Kink Daizy Cooper Deep Fucked by Aspen Brooks"
}