{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "The Smut Peddlers Part Three features the lovely Korra Del Rio and Skylar Snow in a hot and kinky update surrounding the sordid, sexy tales that take place in the backroom of a fetish photography studio in the late 1960's. Meet Korra. She is a pornographer and owner of an underground bookstore that specializes in the production of sadomasochistic and fetishistic film loops and stills. She is always on the lookout for fresh recruits who are drawn to this salacious style of smut and sexuality. She transforms these lost ladies into vile vixens to make up the talent roster at her \"Movie Star News Studio\". When fresh off-the-bus from the mid-west Skylar Snow visits the store Korra introduces her to a whole new world of filthy, lewd eroticism in the form of one of her x-rated 8mm films. Skylar is immediately excited, turned on and more than anything wants to be one of those girls in the movies! After an afternoon of sexy lingerie, tight bondage and test shoots Korra is convinced Skylar is perfect for the part so the test shoot turns into a deliciously dirty day of hardcore sex and debauchery. Both of these lusty ladies are decked out in black garter belts, stockings and high heels and while Skylar is gagged and tied up on the bed squirming to get out of the tight restraints Korra can't resist getting in on the action. They kiss passionately and Korra directs Skylar to keep struggling as she chokes her and fingers her cunt. She busts out the Hitachi and vibes Skylar's clit while she licks her pussy voraciously until Skylar squirts all over her face. Korra sits on Skylar and fills her mouth with cock. Skylar takes it deep down her throat as Korra fucks her face and they are both getting so hot Skylar begs for Korra's dick in her pussy. Skylar feels right at home getting fucked filthy and thanks Korra\nfor treating her like the slut she is. Next Korra face fucks Skylar's innocent little face harder and faster until she flips Skylar onto all fours and licks her ass and pussy to get her all wet and ready for more cock. Korra loves the taste of pussy and fucks Skylar into a frenzy. Skylar grinds her curvy ass up and down on Korra's hard cock as her big tits bounce back and forth with every thrust. Skylar sucks Korra's nipples and then she flips on her back with legs spread wide open for more relentless pussy pounding. These two sexy sirens of sin fuck all day with enthusiasm until they are both gloriously over the top with pleasure moaning and cumming and completely satisfied. Smut Peddlers Part Three will thrill and delight you and all of your deviant desires.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    },
    {
      "name": "Skylar Snow",
      "person_id": 60403
    }
  ],
  "release_date": "2020-04-20",
  "scene_id": 45627,
  "tags": [
    "BDSM",
    "Big Tits",
    "Black",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "Cock Worship",
    "Curvy",
    "Fetish",
    "foreskin",
    "High Heels",
    "Hitachi",
    "Kinky",
    "Lingerie",
    "natural boobs",
    "other hair color",
    "Petite",
    "Role Play",
    "shaped",
    "shaved",
    "slim",
    "Smut Peddlers",
    "Straight",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Smut Peddlers Part Three: Korra Del Rio and Skylar Snow"
}