{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Helena Locke and Natalie Mars star in part two of kinky retro series The Smut Peddlers. All hell breaks loose when fetish model Natalie Mars opens the door on the photography studio dark room while Helena is developing photos from their shoot earlier that day. Doesn't Natalie know that letting light in the room will ruin the pictures? Or wait, maybe she just wants some attention. Constant attention! So Helena decides to give her all the attention she wants and then some. Time to put Natalie in her place so Helena brings Natalie to her knees to see what she is made of. She sticks her fingers down her throat and makes her gag and drool all over Helena's hand and then she makes Natalie lick and worship her black patent leather heels. This day is going to be a full of dirty, sordid things to satisfy Natalie's insatiable need for pain, pleasure and sexual attention. Helena expects Ms. Mars to be a filthy fucking whore if she is going to take up any of her time. After demanding Natalie remove her robe real slow she bends her over in doggie to use the flogger on her firm pale ass until it turns nice and red. Then she removes her leopard print bra to reveal her tits which Helena flogs and flicks and pulls until Natalie is wincing. Little Ms. Mars doesn't know what she has gotten herself into today but she is up for the challenge. Helena gags, ties and straps Natalie down on her back with her legs pulled far back exposing her asshole. She crops her ass and sensitive thighs and tightens nipple clamps on her firm tits. Ms. Locke bangs her sub up real good with some ball busting, hardcore caning and verbal humiliation. Then its time for some serious ass fucking with a huge strap on dildo. Helena fills Natalie's tight ass up with a thick dick and fucks her into submission. Natalie loves it and spreads her hole open to get it as deep as she can. Helena pounds her slutty ass with her cock until Ms. Mars is moaning and yes yes yes yes-ing. But she can take more, she wants more so Helena drives her fist right up Natalie's butt and fists her little ass until she cums and sends her over the top with pleasure. Kinky thrills and delights abound in part two of The Smut Peddlers.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    }
  ],
  "release_date": "2020-04-06",
  "scene_id": 45626,
  "tags": [
    "Blonde",
    "Blowjob",
    "Brunette",
    "Caning",
    "Cock Worship",
    "Dildo",
    "Dominatrix",
    "drool",
    "Fetish",
    "Gag",
    "Humiliation",
    "Kinky",
    "Leather",
    "Lesbian",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Role Play",
    "shaped",
    "slim",
    "Smut Peddlers",
    "Straight",
    "Strap On",
    "Sub",
    "Submission",
    "switch",
    "toned",
    "top",
    "TS",
    "TS Fucks Female",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Smut Peddlers: Part Two Helena Locke and Natalie Mars"
}