{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "Model Magazine Empress Korra Del Rio interviews prospective model Bunny Colby. Bunny is young, blonde, and eager to start her modeling career and become a star. She’s come to Korra because she knows Korra is the best. She’s willing to do anything for a big break and Korra delights in shaping young models and bringing out their potential. She tells Bunny to put on an outfit that countless other starlets have tried on. Excited, Bunny hurries to get everything on but once she realizes the outfit leaves her bare, she gets nervous. Korra promises they can work through her fears together and asks Bunny to trust her. Bunny agrees and takes Korra’s training to heart. Korra corrects her posture, teaches her how to pose strongly, and has her strip so she can perform a thorough inspection of Bunny’s body. Once the inspection is complete, it’s time to test Bunny’s endurance. Korra ties Bunny up and crops her sweet cunt. She places a rubber band around Bunny’s feet and snaps it hard before sliding a finger into Bunny’s pussy. Confused but undeterred, Bunny moans as Korra fingers her cunt before kneeling before her to get her mouth on her interviewee’s pussy. Korra uses a vibrator and her talented tongue to push Bunny to her limits. Bunny begs to cum but Korra knows it’s not time yet. She releases Bunny and pushes her cock into Bunny’s mouth. Bunny takes every inch of Korra’s dick and lets Korra fuck her face and spank her. Once her cock is wet, Kora has Bunny get on her hands and knees. Bunny gasps as Korra’s rock hard cock pushes into her and moans as Korra pounds her young wet pussy. Korra fucks Bunny every which way before blowing her load in Bunny’s cunt. It seems there’s potential in Bunny after all.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Bunny Colby",
      "person_id": 61167
    },
    {
      "name": "Korra Del Rio",
      "person_id": 56019
    }
  ],
  "release_date": "2020-01-27",
  "scene_id": 45622,
  "tags": [
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Brunette",
    "Cock Worship",
    "Crop",
    "fake boobs",
    "Feet",
    "foreskin",
    "Gag",
    "natural boobs",
    "Role Play",
    "shaped",
    "slim",
    "Straight",
    "tea2020",
    "top",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "The Audition: Korra Del Rio Puts Young Model Bunny Colby to the Test"
}