{
  "collections": [
    "TS Pussy Hunters"
  ],
  "description": "The beautiful Arielle Aquinas is slacking at her job, again. Dressed in her tight latex maid uniform, she loosely performs her duties of cleaning her mistress' dungeon. This petite blonde could really use a little discipline. The dominating Roxxie Moth enters her dungeon and inspects this mess. Does Arielle really think this dark filthy dungeon is respectfully clean or is Arielle slacking on her duties for another reason. Go get the flogger Roxxie demands and Arielle gleefully fetches. Roxxie delivers a brutal corporal punishment on Arielle's tight natural body turning her ass red. She screams in delight for each hit by her mistress. Is Arielle wet, is she dripping more of her filth on this dungeon. Well just how dirty can we get this room? After slapping Arielle's ass, she is flipped over and blindfolded. Tied up in restrictive rope bondage she is tormented and tickled with the feather duster. She screams when the red electric zapper comes out. Her high heels are removed and her stockings ripped off her toes exposing her perfect arches. Roxxie paddles Arielle's feet. It's time for a little bit of pleasure between the pain. Roxxie goes down on Arielle's dripping wet pussy. Licking it til she screams for more. Roxxie fingers Arielle and then brings out the Hitatchi. Next Arielle is put into her cage, only her hands and mouth are free to worship her mistress. Please Mistress Roxxie, let me clean your cock with my tongue, she begs. Arielle delivers a deep throat cock sucking on Roxxie's rock hard cock. Roxxie face fucks Arielle to get her cock nice and wet. Arielle is on her hands and knees, pussy exposed. Roxxie fucks Arielle hard and fast while beating her with a belt. She uses the belt to choke Arielle as she cums for her mistress. Arielle begs for her Mistress to fill her up with cum.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Arielle Aquinas",
      "person_id": 59748
    },
    {
      "name": "Roxxie Moth",
      "person_id": 62272
    }
  ],
  "release_date": "2020-02-24",
  "scene_id": 45624,
  "tags": [
    "Blonde",
    "Blowjob",
    "Bondage",
    "Cage",
    "Cock Worship",
    "Corporal Punishment",
    "Creampie",
    "Discipline",
    "dungeon",
    "Feet",
    "Fingering",
    "High Heels",
    "Hitachi",
    "kink-dirtymaid",
    "Latex",
    "natural boobs",
    "Pain",
    "Petite",
    "Pussy Eating",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "Slapping",
    "Straight",
    "Tattoo",
    "TS",
    "TS Fucks Female",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "The Filthy Maid: Roxxie Moth Disciplines Incompetent Arielle Aquinas"
}