{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "With their cocks bursting out of their jockstraps, Tony Buff and Chris Yosef show off\ntheir boots and brawn in the opening shots. On his knees with his hands bound\nbehind him, the goateed Yosef opens wide for a steady stream of piss from Buff, who\nalso gets a taste of his own load. The tan top’s huge cock soaks his boy’s hairy chest\nbefore finding its way into Yosef’s eager mouth. With spit dripping from his chin, the\ngrunting Yosef repeatedly deep-throats his master. Buff smiles and whips his cock on\nYosef’s face, spitting down on him as he issues more orders. Buff then positions\nYosef atop a leather block to feast on the bottom’s smooth hole, his own stiff slab\nthrobbing by itself as he eats.\nAfter warming up Yosef’s ass with a deep fuck, Buff lubes up his hands as the bottom\nfingers himself. The two look into each other’s eyes as Buff starts to slide his hand\ninside, getting steadily deeper and faster. Buff sucks on Yosef while fisting him, then\ngets the bottom to pucker his rosebud for a stream of piss before fisting him some\nmore. Buff then ties Yosef up with tight rope, creating a human sling that hangs from\nthe ceiling. The suspension bondage sequence includes more fisting and fucking by\nBuff, who varies his rhythm from slow and steady to fast and furious. Yosef sways on\nand off Buff’s dick or hand (“Fucking punch that ass!”), grunting loader with each\nthrust as a great aerial shot captures the action. Once free, Yosef pees on Buff\nbefore the top takes control again, pulling on the bottom’s sac as he fucks him. Buff\nsquirts on Yosef and licks his cum up before the bottom squirts-followed by an\nunforgettable finish with Buff literally drenching Yosef, a massive stream of piss\nsurprising both men.",
  "directors": [],
  "models": [
    {
      "name": "Chris Vosef",
      "person_id": 62502
    },
    {
      "name": "Tony Buff",
      "person_id": 62499
    }
  ],
  "release_date": "2019-12-17",
  "scene_id": 45629,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Anal Stretching",
    "BDSM",
    "Bondage",
    "Boot",
    "bottom",
    "Collar",
    "Deepthroat",
    "Facefucking",
    "Fetish",
    "Fisting",
    "Gaping",
    "Gay",
    "Hairy",
    "Jockstrap",
    "Leather",
    "master",
    "Oral Sex",
    "Pierced Nipples",
    "Piss Play",
    "Prolapse",
    "Rimming",
    "Rope Bondage",
    "smooth",
    "spit",
    "Suspension",
    "Partner Studio",
    "top"
  ],
  "title": "Fist and Piss: Tony Buff and Chris Yosef"
}