{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Released from his cage, Steven must show off his obedience skills to a kennel club judge. After passing the test, the pup is unleashed and lured with a chew toy to his master. The encouraging Tony wants to reward his pet: “Where’s your bone?” he asks, soon whipping out his monster cock to feed the hungry pup. Steven opens wide and laps up his treat as Tony pets him. As his tail wags, Steven works his mouth all the way down Tony’s tool, an impressive deep-throat display that gets the collared pup drooling. Out of breath with the vein on his neck bulging, Steven shows off his training. Tony gives a kiss of approval, his monster cock throbbing as he strokes Steven. Their cocks touch and Tony feeds his best friend again as Steven’s shaft pulses. After clipping his pup’s tail, Tony fills up the hole with his big dick as the bottom’s tongue laps in approval. Soon on his back as a great aerial shot looks down, Steven stays stiff as he gets rammed again. Tony strokes him as he fucks, soon holding on to his pup’s paw. In a final display of power, the top brings Steven to the brink - making him come into a tube as he tortuously pets the canine’s shaft, soon injecting the cum into the bottom’s hole. Tony unloads on Steven’s ass, then wraps his arm around him and rubs his bud’s belly as the two smiling studs end the energetic effort.",
  "directors": [],
  "models": [
    {
      "name": "Steven Daigle",
      "person_id": 41046
    },
    {
      "name": "Tony Buff",
      "person_id": 62499
    }
  ],
  "release_date": "2019-12-20",
  "scene_id": 45632,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Athletic",
    "big dick",
    "Blowjob",
    "bottom",
    "brunet",
    "buttplug",
    "Cage",
    "Discipline",
    "Domination",
    "Fetish",
    "Gay",
    "Mask",
    "master",
    "Puppy Play",
    "switch",
    "top",
    "unshaved",
    "versatile",
    "Whipping",
    "white"
  ],
  "title": "Kennel Master: Tony Buff and Stephen Daigle"
}