{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "On his knees and bound in the woods, the panic on Erik Glock’s face is immediately\napparent. The struggle against his kidnapper’s grip is futile, and soon the muscular\nTyler Saint aims his gun at him. After punching Erik in the chest, Tyler shoves the\nbarrel inside the panicked man’s mouth: “Taste that metal, boy!” Tyler pulls Erik’s\nshirt up to cover his face, then cocks the gun-causing the frightened Erik to piss his\njeans. “Just let me go,” he pleads. The assertive stud then unleashes his monster\ncock, pissing on Erik and making him to suck it. Tyler unzips Erik, whose big boner\nthrobs out of his jeans. Tyler grazes it with his gun, which he then uses to slap Erik’s\nsac. Erik is made to feed on Tyler’s huge slab, the two rock hard cocks caught in an\namazing side shot that captures the deep and wet oral action. Tyler delivers a heated\nface fuck, controlling Erik’s head from behind. After rim jobs, Erik is on all fours as\nTyler fucks him with the barrel as the bottom’s boner is stretched underneath his\nlegs. Tyler then fucks him with flesh, getting Erik to moan in a deep pounding. The\ntop rubs the piece on Erik’s hole, then drips the juice on the bottom’s face. The\nexcited Erik leaks pre-cum, which Tyler also wipes on the barrel and feeds to him.\nThe top jacks off Erik from behind, making him squirt on the slide before face fucking\nhim with it. After pissing on Erik, Tyler dumps his load-ending an intense scene that\nwill be talked about for years.\n\nDirectors Note: For safety, a non-firing prop gun was used for filming this scene. Exit interviews at the end of the scene talk about safety with the performers.",
  "directors": [],
  "models": [
    {
      "name": "Erik Glock",
      "person_id": 62518
    },
    {
      "name": "Tyler Saint",
      "person_id": 17416
    }
  ],
  "release_date": "2019-12-18",
  "scene_id": 45631,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "bottom",
    "brunet",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Fear Play",
    "Gay",
    "Humiliation",
    "Muscle",
    "muscular",
    "Pain",
    "Piss Play",
    "Punching",
    "Rope Bondage",
    "Rough Sex",
    "Stud",
    "top",
    "white"
  ],
  "title": "Abuse of Power: Tyler Saint and Eric Glock"
}