{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Rhiannon Ryder is the kind of sub who crosses her arms behind her back the moment her knees drop to the floor. Yep, we're going hardcore this week, friends. In fact we're going double-hardcore because not only is Rhiannon an outstanding submissive example of the female species, she's also dragged her boyfriend along for the fun. That fun, in black and white, is:\n- Physical domination & verbal abuse\n- Threesome\n- Vaginal fucking\n- Orgasms\n- Facefucking & deepthroat\n- Choking\n- Face-slapping\n- Spitting\n- Spanking with marks\n- Squirting\n- Toys\n- Cumshots & swallowing\nThe boyfriend's called Sam. He's a porn performer as well (surname Bourne) and he's worked with Pascal on many a shoot before, usually playing his step-son. Rhiannon's worked with P too but never shot the kind of sub-dom scene with him that she's always craved. Apparently, Sam isn't great with the dom stuff in bed and Rhiannon wants him to learn a thing or two from the master. It's safe to say that by the end of the day he has. The scene begins with Pascal pushing Rhiannon down onto the sofa, demanding that she get up, then pushing her back down again. And again. And again. He slaps, chokes her, and spits in her face. Gets Sam to do the same and spank her. Rhiannon submits totally, panting and groaning, losing it fast. Next they take turns fucking her face, pushing their dicks all the way down her throat. Then the fucking starts and it just doesn't let up. Rhiannon gets rammed and double-stuffed, pushed and pulled and ordered this way and that in a frenzy of merciless sexual domination that makes her cum too many times to count. Her final act is to orgasm with Sam's cock stuffed deep in her mouth, swallowing his spunk as she explodes. A goodie, boys and girls.",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Rhiannon Ryder",
      "person_id": 62366
    },
    {
      "name": "Sam Bourne",
      "person_id": 62365
    }
  ],
  "release_date": "2019-12-19",
  "scene_id": 45648,
  "tags": [
    "Athletic",
    "big dick",
    "brunet",
    "Choking",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Facial",
    "foreskin",
    "Hitachi",
    "master",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Spit Roast",
    "Squirting",
    "Straight",
    "Sub",
    "Submission",
    "thirdparty",
    "Threesome",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Rhiannon Ryder: \"Teach My Boyfriend To Be A Cunt\""
}