{
  "collections": [
    "My Dirtiest Fantasy"
  ],
  "description": "Excuse the pun, but it’s very highly unlikely that you’ll have come across James Oakleigh before - unless, of course, you live in southern England and have had need of an electrician. That’s his day job, of course. When he’s not busy wiring houses and changing sockets, this horny fucker fantasises about being totally abused and sexually humiliated, which in this particular instance involves being taken blindfold to some quiet corner of the Spanish countryside, and picked up by a couple of masked hunks. They then proceed to hold him in a metal cage, piss on him, hose him down with water, spank his ass until it’s a nice crimson color, and then spit-roast him like a cheap tart. Clearly thinking he’s not been humiliated enough, they then open his arsehole up with a metal clamp and piss directly into his guts; before fucking him bareback once again, and then finally spewing the contents of their balls all over his back. It’s not gonna be to the taste of everyone, of course, that’s for sure, but the handsome Brit clearly loves every fucking second of it, and doesn’t so much as quibble when he’s put back in the cage and left to stew in his sodomized misery whilst his captor’s sup beer!",
  "directors": [],
  "models": [
    {
      "name": "James Oakleigh",
      "person_id": 62084
    },
    {
      "name": "Jordan Fit",
      "person_id": 62339
    },
    {
      "name": "Josh Milk",
      "person_id": 62338
    }
  ],
  "release_date": "2019-12-18",
  "scene_id": 45646,
  "tags": [
    "Anal",
    "Anal Stretching",
    "Bareback",
    "Blindfold",
    "british",
    "Cage",
    "Couple",
    "Gay",
    "Humiliation",
    "Mask",
    "Outdoors",
    "Piss Play",
    "southern",
    "Spanking",
    "spit",
    "Spit Roast",
    "Partner Studio",
    "Twink",
    "Uncircumcised"
  ],
  "title": "British Twink Used Outdoors by Two Spanish Masters RAW"
}