{
  "collections": [
    "Str8Hell"
  ],
  "description": "In Airport Security Nikol Monak is in charge today. He works at his desk when Petr Cisler arrives, explaining that he failed some security test. He sits on the chair in front of Nikol’s desk and hands over his luggage. Nikol opens the bag and rifles through the contents, where everything seems fine. So he has to search Petr. Petr stands and Nikol hands his hands all over him, still finding nothing. So he tells Petr to strip, including his underwear. Petr is shy, but eventually removes the underwear and Nikol then see why he was shy, he has a cock harness on. Nikol tells him to remove it or he cannot travel. But it is padlocked and wont come off. Nikol has an idea though and pulls out his cock and shoves it in Petr’s mouth. The cock gets good and hard as Nikol fucks it into Petr’s mouth. Then Petr is made to bend over the desk and Nikol examines his ass, shoving a finger deep inside. The hole takes that finger easily, so Nikol then pushes his nightstick in. Removing the nightstick he then shoves his stiff cock deep inside that hole. Petr moans as his ass gets fucked nice and deep. Nikol fucks that ass really well. Then he lays on the floor and has Petr sit his ass down on that stiff dick. Nikol fucks his cock up into Petr’s ass, making him moan as he takes it. He spanks the ass too, as he keeps fucking. Then Petr turns and sits on the dick again, taking Nikol’s cock all the way in his hot hole. Nikol moves him again, so he lays on a chair with his legs up, and fucks his dick deep into that ass. Petr keeps moaning as the cock pounds his hole.Nikol is ready to cum and pulls out to shoot his creamy load over Petr’s face. He then shoves the sticky cock back into Petr’s mouth to be cleaned off. Before he finishes with him Nikol finds a key and unlocks Petr’s cock so that he can wank himself and deliver a lovely cumshot. Then he is sent on his way.",
  "directors": [],
  "models": [
    {
      "name": "Nikol Monak",
      "person_id": 60771
    },
    {
      "name": "Petr Cisler",
      "person_id": 61957
    }
  ],
  "release_date": "2019-12-20",
  "scene_id": 45652,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "blond",
    "Blowjob",
    "Brunette",
    "Confined Cock",
    "Cop",
    "Facefucking",
    "Facial",
    "foreskin",
    "Gay",
    "harness",
    "Submission",
    "Tattoo",
    "the chair",
    "Partner Studio",
    "white"
  ],
  "title": "Nikol Monak and Petr Cisler RAW - AIRPORT SECURITY"
}