{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "The Flogging. Aaron, wearing a parachute harness, is attached to chains that hang from ceiling to floor. Jason spanks his ass and flogs his ass and back and demands that Aaron thank him every time he smacks him. Jason hangs weights from the parachute harness, makes Aaron swing them. At the end of the flogging Jason embraces Aaron. Aaron melts into his arms.\nThe Edging. Aaron is tied on his back on the bar. He sucks Steve's dick as Jason, behind the bar, sucks his. They play with him. Steve starts edging Aaron, warning him not to cum without permission. When Aaron gets too close, Jason hoses him down with the bar spritzer. They edge him again. Every time he gets too close they hose him down.\nThe FuckFest. Aaron lies on his back on the covered pool table, his head hanging over the edge as he sucks first Jason's cock, then Steve's. They lube up his asshole. Jason fucks him and jerks his dick, then hands him over to Steve. Fade to the three men in front of the pool table, Jason fucking Aaron who bends over to suck Steve's cock. Aaron begs to be fucked. Fade to Aaron jerking off on the pool table while Jason fucks him. Aaron cums with permission, Jason cums next. Steve blows his load last. Their cum is all swirled together. Aaron smears it over his chest and takes it to his mouth, then asks if he's got the job. Blackout. A guy enters the bar and orders a beer from Aaron, who serves him, muzzled. Final shot: Steve flips through Bound & Gagged, asks Jason what he thinks of a picture of himself. \"Ah, he's not my type,\" Jason says, giving Steve a kiss.",
  "directors": [],
  "models": [
    {
      "name": "Aaron Parker",
      "person_id": 62517
    },
    {
      "name": "Jason Branch",
      "person_id": 61117
    },
    {
      "name": "Steve Ross",
      "person_id": 61118
    }
  ],
  "release_date": "2019-12-26",
  "scene_id": 45655,
  "tags": [
    "Anal",
    "big dick",
    "black hair",
    "body builder",
    "brunet",
    "Chains",
    "Edging",
    "Flogging",
    "Gay",
    "Leather",
    "harness",
    "Rope Bondage",
    "thirdparty",
    "Threesome",
    "Weights",
    "white"
  ],
  "title": "Boy On Tap: When I smack You You Say Thank You"
}