{
  "collections": [
    "Str8Hell"
  ],
  "description": "Paul Hunter and Dave Cargo, both such hot guys, are paired in a submission wrestling match. They both look so good as they warm up, wearing only their underwear. Each has a very good body and seem to be well matched, at least as far as body size is concerned. They work through a few exercises, with Dave showing Paul some tumbling moves. Paul does some too, such as cartwheels, but doesn't duplicate some on the more complicated moves. Then they begin the wrestling match. They are quickly grappling with each other, rolling over the mats as they try to gain a decent hold on each other. Although it takes him some time Dave is the one who eventually gains the first submission. For round two the each remove their underwear, allowing full exposure of their sexy asses and cocks. Paul shows determination in this round as he gets a very good neck hold and takes the point. With their hot bodies entwined and their asses exposed as they grapple they continue the match, straining every sinew and sharing the rounds quite evenly. After some rounds we can see how tired they are becoming as they need to rest a little. But Dave builds a very healthy lead at 8-4, when they take a longer break to oil each other's sweaty bodies. When they resume, it is Dave who continues to have the upper hands, and he runs out to be the winner at 10-5. Paul is generous in defeat, holding Dave's arm in the air to acknowledge his victory. Then they settle down for a wank off. As they get hard, they also wank each other briefly. Then they wank themselves in earnest, and it is Paul who wins the race to dump some cum. His creamy load splashed onto the mats as he cums. Then Dave continues to wank his big dick, and he unloads a nice big load too. They clean off each other's cocks and then go off to the shower to clean up.",
  "directors": [],
  "models": [
    {
      "name": "Dave Cargo",
      "person_id": 62514
    },
    {
      "name": "Paul Hunter",
      "person_id": 60768
    }
  ],
  "release_date": "2020-01-02",
  "scene_id": 45669,
  "tags": [
    "Athletic",
    "big dick",
    "black hair",
    "erotic wrestling",
    "foreskin",
    "Gay",
    "masturbation",
    "Muscle",
    "Submission",
    "thirdparty",
    "Twink",
    "Uncircumcised",
    "white",
    "Wrestling"
  ],
  "title": "Dave Cargo vs Paul Hunter"
}