{
  "collections": [
    "Sweet FemDom"
  ],
  "description": "Casey Calvert is checking out an old antique store when the owner, Draven Navarro appears. He creeps on her and implies that he would love for her to fuck him with a strap on, then quickly stammers and is embarrassed that he would say such a thing to a stranger.\n\nCasey surprisingly says that she is down. He happens to have a strap on handy. First, she wants to play with his cock. She’s impressed at how big his cock it and decides to tease him. She brings him to edge of cumming over and over, just to squeeze his balls and deny him. She wants to get him to fully submit to her before she fucks his ass. She smothers his face with her perfect ass.\n\nFinally, it’s time. She slides the giant pink cock in his ass and whimpers. She fucks him slow at first, then fucks his brains out hard. While fucking him she makes him say out loud that his ass and cock and balls and entire body is hers forever to keep and do what she pleases with. He doesn’t know, but he just entered into a contract with a sexy alien, sent to Earth to abduct male sex slaves. She continues to pound his ass before telling him that she’s taking him to her home planet to live the rest of his life being used by sexy alien women like her.\n\n(based on a true story)\n\nCasey Calvert has her captive Draven Navarro on her alien space ship. They are heading to her home planet, where he will be used as an Earth Male Sex Slave. They have a long ride ahead, so she decided to play with him a bit.\n\nShe fucks his ass with her giant pink dick until he can’t take it anymore. His balls are overly full and blue. She takes mercy on him. He’ll be used for all kinds of sex acts when he arrives, so she better train him anyway. She smothers his face with her ass, then rips her fishnets open and makes him lick her pussy until she is satisfied. Then she uses his cock for her pleasure, and eventually milks out every drop of his cum all over her fishnets.\n\n“You ready to get fucked in the ass some more…?”\n\nHe whimpers but agrees.",
  "directors": [],
  "models": [
    {
      "name": "Casey Calvert",
      "person_id": 36437
    },
    {
      "name": "Draven Navarro",
      "person_id": 59640
    }
  ],
  "release_date": "2020-01-02",
  "scene_id": 45668,
  "tags": [
    "Blowjob",
    "body builder",
    "bottom",
    "brunet",
    "Brunette",
    "Femdom",
    "Fishnets",
    "Handjob",
    "mixed",
    "Muscle",
    "natural boobs",
    "Pegging",
    "Pussy Eating",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Tattoo",
    "Partner Studio",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Casey Calvert Alien Abduction"
}