{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Dee Williams is a legit Grappler. She is a Purple Belt in Brazilian Jiu-Jitsu and she has a lot of mat\nexperience under her belt. She’s super competitive but she’s also super submissive. She also is a big\nwhore for orgasms and if she is close to getting some guys face on her cunt or buried into her pussy, she\neasily gives up control just to get her sexual satisfaction fulfilled. This is all fun and games until she starts\nlosing in the Judge’s eyes. This is a Winner fucks loser style sex fight. The better sex fighter WILL win\nand HE WILL be able to do whatever he wants to her. Jay West is one of our smaller gentlemen, but he\nhas magnificent balls of steel that can be pulled, stretched, slapped, and punched, and all it really does to\nhim is give him a boner, and when he gets a boner, he actually starts to wrestle harder. Darling puts Jay\ninto some insanely painful holds. She gets him into a banana split and slaps his balls, slapping and\ntugging them. She holds him down by the throat and torments his nut sack with her hand and her teeth.\nJay’s boner powers activate, and his wrestler starts to come out. He is able to pin Dee, shoulders down,\nnipples getting licked, Dee panics and turns into a damsel in distress. Is This enough to win Jay West the\nmatch? The loser is announced, the Winner takes their prize. The loser is made to cum with squirting\norgasm all over the place. The winner gathers all the cum and makes the loser eat their own cum",
  "directors": [],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Jay West",
      "person_id": 53166
    }
  ],
  "release_date": "2019-12-31",
  "scene_id": 45662,
  "tags": [
    "Anal",
    "Big Tits",
    "black hair",
    "blond",
    "Blonde",
    "bottom",
    "erotic wrestling",
    "Facesitting",
    "MILF",
    "mixed",
    "natural boobs",
    "Pegging",
    "Rimming",
    "sex fight",
    "shaped",
    "shaved",
    "Slapping",
    "slim",
    "Squirting",
    "Straight",
    "Strap On",
    "Partner Studio",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Blond Big tittied MILF destroys little Man's Balls"
}