{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "As this wet orgy opens, tall and handsome Colin Steele sits in a tub waiting for a\ngolden shower from his jockstrap-clad friends. Tony Buff is joined by beefy Peter Axel\nand two muscular, smooth-headed studs: tanned piggy Chase Alters and light-skinned\nClay Donovan. They all pee into the tub, with Donovan catching some of\nBuff’s piss in his mouth before spitting it on Steele-who then pisses on himself. The\nfive then open wide, sucking and rimming each other. Axel shows off his deep throat\non Buff, who busies himself with Steele’s stiff rod. The two then switch as Steele\nplants his lips on Buff’s pubes, getting the top to smile and bend down for a kiss. Buff\nthen grabs hold of Steele’s balls, pulling on them as he aggressively whips their hard\ncocks against each other. Donovan then deep throats Buff as all five men continue to\nrub and tongue each other.\nBuff then balances himself on the tub, sucking Steele as his cock and hole are\ndouble-tongued by Alters and Donovan. Steele then takes his turn atop the tub, his\ndeep voice getting louder as Buff fucks him. Axel pounds Donovan before the two\nswitch positions, and soon Alters wants Buff inside him. That leads to an arresting\nsequence: Steele pisses on Alters, who slides into a sit-down position on Buff. The\nbottom stays stiff as he bounces, his bod and cock getting worked over by Buff and\nSteele. Buff squirts his spooge on the versatile Alters, who then tops Steele. As the\nmoaning Axel fucks the stiff Donovan again, Buff returns to soak them with piss.\nAn interlude has Alters on his knees, his head in a gas mask attached to tubes and\nfunnels soon filled with four streams of piss that soak his face and chest. “Nasty!\nNice!” he smiles once free, soon bending over to get fucked by Axel and Donovan.\nThe finale explodes with cum-and-piss fireworks, including some huge yet gloriously\ncontrolled piss streams from Axel and Buff that fly high into the air before showering\nover the men.",
  "directors": [],
  "models": [
    {
      "name": "Chase Alters",
      "person_id": 62501
    },
    {
      "name": "Clay Donovan",
      "person_id": 62500
    },
    {
      "name": "Colin Steele",
      "person_id": 19077
    },
    {
      "name": "Peter Axel",
      "person_id": 62503
    },
    {
      "name": "Tony Buff",
      "person_id": 62499
    }
  ],
  "release_date": "2020-01-10",
  "scene_id": 45678,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "bottom",
    "brunet",
    "Fetish",
    "Gay",
    "Jockstrap",
    "Kinky",
    "Mask",
    "Muscle",
    "muscular",
    "Orgy",
    "Pierced Nipples",
    "Piss Play",
    "Rimming",
    "smooth",
    "switch",
    "Tattoo",
    "top",
    "versatile",
    "white"
  ],
  "title": "Fist and Piss: Piss Party"
}