{
  "collections": [
    "Device Bondage"
  ],
  "description": "Vanessa Vega is a gorgeous brunette, brand new to Kink.com, and pretty new to the porn industry overall. Why Kink? Well, she decided that if she was going to do this thing, then she’d do it with the best in business. The Pope is may hold her hand through the process, but he doesn’t to take it easy on her by any means. Just because she’s new, doesn’t mean it’s going to be a cakewalk. Vanessa begins in a strappado squatting position, gagged, and completely helpless. The first step is always the most difficult in these situations, because if The Pope’s too fierce with her,she could break, and we don’t want that! Lassos are tied around her nipples, secured and then weights are hung from them. Her comfort lies in the orgasms The Pope allows her to have during the process, rather than only as a reward. Her tits are flogged before more orgasms are imposed. The next scene has our little slut Vaness in a doggy type position with her arms in another strappado which pushes her face against the box, keeping her from moving. The Pope introduces a few more implements of torment before fucking her pussy and mouth and giving her squirting orgasms! The final scene is designed around a particular kink of Vanessa’s: she’s fascinated with zippers, and although she is new to this, she wants to try. The Pope guides her through the process, encouraging her along the way. But her fear has taken hold and she is now full of doubt, but that doesn’t stop the inevitable. The zipper will be coming off. Quickly or slowly, it’s coming off with a scream.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Vanessa Vega",
      "person_id": 62549
    }
  ],
  "release_date": "2020-04-02",
  "scene_id": 45687,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "Squirting",
    "Straight",
    "Submission",
    "The Pope",
    "Weights",
    "Zipper"
  ],
  "title": "Vanessa Vega: Fresh Meat Lays It All On The Line"
}