{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Dirk Caber abducts Mack Manus – clad in suit and tie – at the door to his car. Mack wakes later in a dim room, tied to a chair with rope in his boxer shorts, as Dirk and Alessio Romero punch his beefy chest and spit in his open mouth. Terrified, Mack pisses all over his boxers. Dirk and Alessio work their captive over ‘till his face is dripping with their piss and spit, then gets him to swallow each of their turgid rods. Mack’s uncut cock betrays him as it rises under their abuse. Dirk and Alessio mark their prey, buzzing Mack’s head with a pair of clippers as his thick muscles struggle against the ropes, his hair falling in clumps onto the piss-stained floor until he looks like a captive soldier. With Alessio out of the room, Mack yanks free of the ropes and overpowers his captor, pushing Dirk down on his back with the rope around his neck, making Dirk rim his hairy hole and shoving his thick uncut meat into Dirk’s mouth. Alessio returns and, turned on by the scene, feeds his hard cock to Dirk. Mack tongues Dirk’s furry hole, working it open with spit-slick fingers before soaking all of Dirk’’s chiseled body with his piss. Mack and Alessio spit-roast Dirk, taking both of his holes. Mack’s balls slap against Dirk’s upturned ass as Alessio pisses all over the two studs. Mack takes his aggression out on his abductor’s ass, roughly slamming in and out of his hole. Then it’s Alessio’s turn as Mack works his meat into the Latin’s hole. Alessio urges his top on with moans and curses until Dirk and Mack dump thick white loads all over Alessio’s hairy tattooed chest, triggering Alessio’s own geyser of cum",
  "directors": [],
  "models": [
    {
      "name": "Alessio Romero",
      "person_id": 20463
    },
    {
      "name": "Dirk Caber",
      "person_id": 27341
    },
    {
      "name": "Mack Manus",
      "person_id": 62532
    }
  ],
  "release_date": "2020-01-17",
  "scene_id": 45702,
  "tags": [
    "BDSM",
    "blond",
    "brunet",
    "Deepthroat",
    "Facefucking",
    "Fetish",
    "Gay",
    "Hairy",
    "Hand Gagging",
    "Head Shaving",
    "Kidnapping Play",
    "Latinx",
    "muscular",
    "Piss Play",
    "Punching",
    "Rope Bondage",
    "Rough Sex",
    "Slapping",
    "spit",
    "Swallow",
    "switch",
    "Tattoo",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Fist Deep: Mack Manus, Dirk Caber, Alessio Romero"
}