{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Lucy Love is 33. She had her first baby a few months ago. We were reminded of this when, shortly after arriving at Baxter Towers, she got her breast-pumping kit out, hiked up her jumper and began to attach it to her swollen breasts to milk herself. 'Swollen breasts' is a term that's common in pornographic text but is even more specifically appropriate to, and probably indeed derives from, tits that are awash with creamy goodness, and we're pleased to have the opportunity this week to celebrate both at the same time with Lucy's videos during which we literally milk the bitch for all she's worth. If you don't get turned on watching a woman suffer the indignity of being lactated while she's masturbating, being spanked, choked, throat-fucked with a black dildo and fucked then you're going to be bored shitless this week. (Besides, what's wrong with you?) Because we do it a lot. All the way through, ad nauseum. We've never had a PascalsSubSlut with mammalian protuberances full of leaking white liquid before and we jolly well get our money's worth. Lucy seemed to enjoy herself. She's sub from the tip of her nose down to her little toe, a top-notch deep-throater, and all the way through her cunt was dripping nearly as much as her thick, hard mummy nipples were. She declared at the end of the day that she hadn't cum as hard for, literally, years. And could we do it all again tomorrow? Well, perhaps not tomorrow but might be a good idea arranging that second shoot pretty pronto before you dry up, luv. Here's what we got up to with her:\n- Vaginal fucking\n- Orgasms\n- Physical & verbal domination\n- Deepthroat & face-fucking\n- BDSM\n- Choking\n- Spanking\n- Toy\n- Cumshot (CIM and swallow)!",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Lucy Love",
      "person_id": 62359
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2020-01-16",
  "scene_id": 45705,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "Bondage",
    "brunet",
    "Brunette",
    "Choking",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Facefucking",
    "Facial",
    "foreskin",
    "Hand Gagging",
    "lactation",
    "Rough Sex",
    "Spanking",
    "Squirting",
    "Straight",
    "Sub",
    "Swallow",
    "thirdparty",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Lucy Love: Lactating Mum Craves Brutal Trashing"
}