{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Doug and Diego naked except for boots. Diego is rope-bound and suspended from a trapeze upside down. Doug removes his ball gag and lowers him to the right cocksucking/asslicking height. He orders Diego to fuck his ass with his tongue, then suck his nipples, then his cock\nDiego, gagged with a thick pecker gag and blindfolded, stands in an upright spreadeagle, leather wrist restraints attached to chains that hang from the ceiling. Doug attaches weights to his rope-bound balls, clover clamps to his nipples. Doug makes Diego swing the weights on his balls as he plays with the chain attached to the clover clamps. He removes the pecker gag from Diego's mouth, then fucks Diego's mouth with it. When he tires of that, Doug makes Diego hold the clamp chain in his mouth, and a moment later starts applying clothespins in zipper formation to each side of Diego's chest. He adds more weights to Diego's balls, then makes Diego drop the clamp chain he's holding in his mouth. As Doug applies more pins, Diego groans and then cries out but does not ask for mercy, in fact starts licking out at him. More pins, louder groans. After more slapping, smacking and licking, Diego begs Doug to take one of the weights off his balls. Doug complies, then licks Diego's mostly stiff cock, then sucks it. Swinging his body, Diego Diego fucks Doug's mouth. He is clearly in pain but loving it as Doug teases and slobbers over his cock. Doug squeezes Diego's balls. An amazing display of erotic pain and desire, culminates in the slow and painful removal of the clothespins, accompanied by yelps, howls, kisses, spitting, licking and sucking. Doug prepares for the pain that will come when he removes the nipple clamps, and when it happens Diego howls and writhes and kisses Doug deeply. Doug rubs Diego's nipples. Diego is furious at him and full of desire for him. After they embrace, Doug pushes the cock gag back in Diego's mouth, caresses Diego, stands back to observe him, applies a weight to his balls, then kicks it to make it swing. As Doug walks away, an exhausted Diego stands spreadeagled, gagged and blindfolded, swinging the weight hanging from his balls.",
  "directors": [],
  "models": [
    {
      "name": "Diego Alvarez",
      "person_id": 62561
    },
    {
      "name": "Doug Jeffries",
      "person_id": 61819
    }
  ],
  "release_date": "2020-01-16",
  "scene_id": 45709,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Blindfold",
    "Blowjob",
    "Bondage",
    "CBT",
    "Chains",
    "Clothespins",
    "Clover Clamps",
    "cock and ball torture",
    "Domination",
    "dungeon",
    "Gag",
    "Gay",
    "Latin",
    "Leather",
    "Nipple Clamps",
    "Pain",
    "Rope Bondage",
    "Slapping",
    "Suspension",
    "thirdparty",
    "Weights",
    "Zipper"
  ],
  "title": "BONDAGE BUDDIES: MILITARY TIES - Scene 2 \"Pain and Desire\""
}