{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Hard-muscled, shaved head studs Leo Forte and Race Cooper swap spit before Leo bends Race over a sling. Race’s latex jock frames his muscular ebony cheeks, which Leo pries apart to rub his buzzed scalp against his hole. Sexy, smirking Leo, in his rubber jock and red hankie, takes his time tonguing Race’s tight hole, barely started on the full-out ass assault he has planned. He throws Race into the sling and fastens Race’s booted feet up against the chains as Race hungrily fingers his own wet hole. Leo crouches down and greases up Race’s hole before working first one, then two, three, and four fingers inside Race, stretching him into a state of agonized bliss. Leo relishes Race’s tight and willing grip on his slick fist as Race closes his eyes, lost on a mind trip, grunting and screaming as Leo shoves in deeper, Leo strokes his thick, uncut meat as he slowly works his fist up to the wrist, totally owning Race’s ass. Race makes noises like a rutting animal as Leo slides a series of enormous veined dildos up his ass, inching them in by slow degrees, knocking his fist against their bases, roughly jolting the deepest parts of Race. Then Leo finally slides his aching, uncut slab of meat into Race’s eager manhole. Leo grabs hold of the sling chains and jackhammers away until he pulls out and sprays white cum all over Races six-pack. Race screams as Leo’s epic ass his load spurts all over his chest. Leo wets him down with a stream of piss before learning in and swapping spit with his satisfied bottom.",
  "directors": [],
  "models": [
    {
      "name": "Leo Forte",
      "person_id": 22142
    },
    {
      "name": "Race Cooper",
      "person_id": 19341
    }
  ],
  "release_date": "2020-01-24",
  "scene_id": 45717,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "Big Toy",
    "Black",
    "black hair",
    "body builder",
    "bottom",
    "Chains",
    "Dildo",
    "Ebony",
    "Feet",
    "Fetish",
    "Fingering",
    "Fisting",
    "Gay",
    "Hairy",
    "Interracial",
    "jock",
    "Jockstrap",
    "Latex",
    "Latinx",
    "muscular",
    "Piss Play",
    "shaved",
    "spit",
    "Stud",
    "Tattoo",
    "top",
    "unshaved",
    "white"
  ],
  "title": "Loud and Nasty: Leo Forte and Race Cooper"
}