{
  "collections": [
    "The Upper Floor"
  ],
  "description": "The heat is on Ashley Lane for having given her busty partner Lauren Phillips the house rules during Lauren’s interrogation. If there is anything that brings out the sadistic lesbian urge in Aiden Starr, it’s cheating little sluts. She ties Ashley’s hot little ballerina body up in a tight ebi shibari tie and begins placing tight clamps all over Ashley’s vulnerable pink pussy. Ashley whimpers apologies, but those apologies get much louder when Aiden begins to rip off the clamps, vibrating the ones left until Ashley is begging to cum with painful punishment orgasms. But Aiden isn’t done with this pretty little submissive liar yet, caning her tender feet, zapping her sensitive pussy lips, and fisting her tight little hole. Ashley promises never to lie to Aiden again just to suffer through multiple orgasms around Aidens dominant fist. Guests all over the room are exploring each others bodies with canes, electrical toys, and suspending each other in intricate rope bondage. Barbary Rose has her curvy creamy body tied up by Stefanos, who proceeds to mark her skin with red hand prints and welts from his single tail. Beaten and wet, Barbary cums like a horny little bitch. Lauren Phillips has crawled her way under a massive cock and begins sucking it hungrily as the surrounding guests clap. Stefanos treats this attention whore to a reverse cowgirl cock ride while the pretty ladies of the party write degrading names on her huge tits. She is made to cum on the floor like a horny little puppy, licking Stefanos’ boot. No rest for this anal slut, Lauren is immediately thrown on her back in a pretzel to be anally fisted and then fucked as Ashley licks up the cum and begs to have her tight little cunt railed with cock so she can earn her house collar and a load of cum.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2020-04-10",
  "scene_id": 45743,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Boot",
    "bottom",
    "brunet",
    "Caning",
    "Collar",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "fake boobs",
    "Feet",
    "Female Slave",
    "Fisting",
    "Humiliation",
    "Lesbian",
    "master",
    "mixed",
    "multiple orgasms",
    "natural boobs",
    "Oral Sex",
    "Orgy",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Single Tail",
    "slim",
    "Straight",
    "Swingers",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "white"
  ],
  "title": "Anal Sluts Subjugated at BDSM Swinger Orgy"
}