{
  "collections": [
    "The Upper Floor"
  ],
  "description": "Ashley Lane is a gorgeous masochistic rope slut that has been gracing The Upper Floor with her hot body and intense play scenes for years. After repeatedly petitioning The House she has been allowed to suffer, squirt, and serve on a trial basis. Her senior submissive for the night is a selfish sexual slut, Lauren Phillips. Lauren is less interested in helping Ashley learn the rules than she is in using her giant tits and ruby red dick-sucking lips to get back on the bottom of the power hierarchy where she likes it. The first chance she gets, Lauren is groveling and licking Governess Aiden Starr's boot until she is allowed to slobber and choke on a guest's massive cock. This leaves Ashley dangling in a terribly painful spread eagle shibari suspension with her sensitive clit trapped under a hitachi and her milky skin pinned with multiple zipper lines. Aiden Starr is eager to question Ashley on how she could have possibly come to The Upper Floor for some many years and she still not know the house rules. Ashley doesn't have a good answer so Aiden and Stefanos decide she should spend her time screaming instead and set about tormenting her feet, pressing her into painful orgasms, and ripping clamps from her tender flesh. Soon Ashley is being fucked with her eyes rolling back in her head as Lauren Phillips laps at her clit and toes. Promising to get the house rules and suffer well, Ashley is made to squirt and scream and cum like a good little bitch as the crowd cheers her on. The guests are very turned on and set about spanking their submissives, and many beautiful swinger couples start to swap partners. The room is alight with moans and threesome blowjobs when Barbary Rose and Stefanos get into a long overdue play session that finds Barbary in a quick and dirty rope bondage position leaving her glorious curves vulnerable to hot wax, zappers, and cruel vibrators. Meanwhile Lauren has been tied in an inverted pile driver and is having her ass fucked deep and hard while Ashley is sweating and begging for another house rule while trying to hold chains out as so many submissives have before her. Will Ashley manage to dirty talk, learn all the house rules, cum on command, and act as a perfect oral accessory to Lauren's anal reward fuck? Watch to find out in this first installment of Ashley Lane's Initiation.",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "Donny Sins",
      "person_id": 55693
    },
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    },
    {
      "name": "Maestro Stefanos",
      "person_id": 17148
    }
  ],
  "release_date": "2020-03-13",
  "scene_id": 45742,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Boot",
    "bottom",
    "brunet",
    "Chains",
    "Corporal Punishment",
    "Discipline",
    "fake boobs",
    "Feet",
    "Female Slave",
    "Hitachi",
    "Hot Wax",
    "Humiliation",
    "master",
    "mixed",
    "natural boobs",
    "Oral Sex",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Suspension",
    "switch",
    "Tattoo",
    "Threesome",
    "toned",
    "top",
    "white",
    "Zipper"
  ],
  "title": "Babe BDSM Swinger Becomes Sexual Submissive For The House"
}