{
  "collections": [
    "Pascals Sub Sluts"
  ],
  "description": "April Paisley likes it really rough. Slapped around, thrown around, spanked hard, fucked hard. Wiggles a lot, and yelps. It’s a wet afternoon in November, it’s cold and miserable. April sweetheart, you’re just what I needed. I play an old flame of her mum’s. I used to live with the pair of them, got on well with April (know what I mean, heh heh), now she’s all grown up and left home and she’s shacked up with this bad boy and her mum’s phoned me up to ask if I can pop round and have a quiet word with her because she’s worried. Except that darling little April doesn’t do quiet. No sooner have I turned up at her door than she’s yap-yap-yapping, freaking out and saying it’s all just an excuse for me to fuck her again. Which is probably a bit of play-acting to piss me off and turn me on at the same time so that I’ll jump on top of her and ravage her and she’ll fight back a bit, etc etc. In which case consider my buttons well and truly pressed, you nasty little slag. We go at it Looney Tunes then the bitch submits and I punish her. Wallop the crap out of her buttocks til they’re a nice shade of purple and blue. Fuck the face off her, lots of gagging, lots of drool. Fuck her like she’s, well – just a nice tight hole on the end of my willy really. Hard and rough. It’s a very becoming scene. Please note that the price we had to pay to shoot with April was another scene that we did for her a few weeks’ later, which involved me being her slave and getting chained up in a dog’s kennel. Don’t think I don’t suffer for my art or for your entertainment, mes chers amis.",
  "directors": [],
  "models": [
    {
      "name": "April Paisley",
      "person_id": 62353
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2020-07-01",
  "scene_id": 45740,
  "tags": [
    "April",
    "Athletic",
    "big dick",
    "Blonde",
    "Blowjob",
    "brunet",
    "Deepthroat",
    "drool",
    "Facefucking",
    "Facial",
    "foreskin",
    "Hair Pulling",
    "Rough Sex",
    "shaved",
    "Slave",
    "Small Tits",
    "Spanking",
    "Straight",
    "Sub",
    "Partner Studio",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "April Paisley: Takes The Abuse She Deserves"
}