{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Sade Rose is 25 and studying to be an accountant, which she subsidizes by being a lady of the night. This is always very erotic, because a whore is as beautiful, graceful and intelligent as Sade, has a thirst for sucking and fucking rock hard cocks as much as Sade does. When she agrees to be a PascalsSubSlut she happily and eagerly submits herself to the following...\n- Vaginal fucking\n- Physical domination & verbal abuse\n- Orgasms\n- Spanking\n- Squirting\n- Deepthroat & face-fucking\n- Choking\n- Face-slapping\n- Face-spitting\n- CIM & swallowing\n... well, that's when the cork really pops.\nSade's got an itch she wants to scratch. She's been a bit kinky in the bedroom in her private life but not as much as she'd like. She doesn't state it explicitly but she's definitely here to have intensely rough sex, the strongest she's ever had before, to discover what she likes. That doesn't stop her from being nervous and on guard though. A couple of other things about Sade. She loves older guys. We didn't set up any specific Daddy's girl riff for the scene, or ask her to call Pascal Daddy, but she just starts calling him that anyway, then referring to Mummy, and she's getting into this whole role-play that me and P have a bit of trouble catching up with. The other thing that Sade loves is spit and slobber. She loved letting all her gob juice run down over her tits and body when P was fucking her face, and she really loved it at the end when he turned up her upside-down to give her some Ozzy. Well, perhaps not so much the deepthroat but certainly all the goo covering her face. She said she found it liberating and that it felt great. And the noises she makes when she's sucking a cock are blissful. The scene's a bit arse-over-tit actually but no worse for that.",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Sade Rose",
      "person_id": 62369
    }
  ],
  "release_date": "2020-01-30",
  "scene_id": 45741,
  "tags": [
    "Athletic",
    "big dick",
    "Black",
    "Blowjob",
    "brunet",
    "Choking",
    "Couple",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Facial",
    "Fishnets",
    "foreskin",
    "Interracial",
    "Kinky",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "spit",
    "Squirting",
    "Straight",
    "Sub",
    "thirdparty",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Sade Rose: The Goo Girl"
}