{
  "collections": [
    "Royal Fetish Films"
  ],
  "description": "Kitty’s boyfriend left her to wander the hotel and casino alone by herself in Vegas. On a walk through the hall back to her room she heard it again, that couple thats been fucking and what sounds like whipping people for the last two days. Her curiosity pulls her to the door. She listens closer with a smile on her face and a drip down her leg. She has wanted them both just from the sounds of their moans alone, so passionate, exactly what she has been missing. After taking a few steps away she figures she has nothing to lose and knocks on the door. Vivienne jumps up and runs to the door for her room service order and there Kitty is nervous but obviously in need. She invites her in just as King walks up naked except for the mask he has on face. The ladies exchange compliments King remains quiet just a stare through the mask a dick that’s getting harder by the second with the possibilities of the new prey they have lured into their web. Kitty does not make it past the hallway before her clothes are removed and she is on her knees sharing King’s heavy cock with Vivienne. They pull her into the tub and as Vivienne continues to lick, kiss and suck the submerge Kitty beneath the water, already pushing her limits and bringing her closer to that body freeing orgasm that had her wandering alone in Sin City. They proceed to stroke, lick, fist and pound every one of her languishing holes until she is completely “Bathed In Ecstasy”.",
  "directors": [],
  "models": [
    {
      "name": "King Noire",
      "person_id": 59129
    },
    {
      "name": "Kitty Jaguar",
      "person_id": 62132
    },
    {
      "name": "Vivienne Vai",
      "person_id": 62615
    }
  ],
  "release_date": "2020-02-21",
  "scene_id": 45781,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Asian",
    "Ass To Mouth",
    "bbc",
    "BDSM",
    "big dick",
    "Couple",
    "cum kissing",
    "Deepthroat",
    "Facefucking",
    "Facial",
    "Interracial",
    "Kinky",
    "Mask",
    "mixed",
    "muscular",
    "other hair color",
    "Rimming",
    "shaved",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "Threesome",
    "top",
    "Vaginal Penetration",
    "Water Boarding",
    "Whipping"
  ],
  "title": "Bathed In Ecstasy"
}