{
  "collections": [
    "Royal Fetish Films"
  ],
  "description": "This was it…I was finally going to have a voyeuristic experience. It’s something that I’d thought of doing while in Amsterdam, but just never got up the nerve. As I waited, I wondered what she’d look like. She was stunning. I was immediately drawn to her laugh, her smiles, her love of champagne, her endearing awkwardness and just how overly polite she was. My favorite moments were not what I expected. It wasn’t the nudity or the sex. It wasn’t the filming or watching her get collared. It was the chess game full of wit and a little smack talking. It was the intimacy and passion in each kiss. I couldn’t take my eyes away as she tried on each piece of lingerie and posed for pictures. King Sir wanted her in black…I preferred the burgundy, but it was no matter…as nothing stayed on for long. I expected to be excited. I expected to be aroused. I didn’t expect to hate the intrusion of the camera. I didn’t expect the envy or the longing. I envied how natural this was for both of them…how sure they were in their skin, how comfortable with their nakedness. I loved watching her wrap her lips around his cock, sloppy, wet, gagging and choking. I loved watching him jerk the chain and drizzle wax on her. While I wasn’t convinced of her submission, I appreciated her experimentation. As I stood in the corner, I felt aroused yet adrift. I wanted to be there caressing, nibbling, feeling the heat of the wax, the smack of the paddle. I wanted to explore her… to explore him…to be explored. My breathing sounded loud to me as her panties were removed and I stifled a moan as her bottom was bared and the smoothness of her mons was made visible to my eyes. Fascinated, I saw that from behind - with her legs splayed, I could see the dark crevice of her pussy, King Sir’s cock seemed to be nodding at it as it bounced slightly… as if in anticipation of what was to come. But not yet. King Sir took time to savor her, lapping hungrily between her thighs, nuzzling greedily at each pierced nipple. He positioned himself and I clearly saw his prick slide smoothly into her. He let out a deep sigh and she held her breath momentarily, clearly wondering if she could take him in. No fantasies, no porn had prepared me for the dance to which I would bear witness…he pulled back, exposing most of his cock which was now shining as if dipped in cream…he rammed back into her with a slap and she let out a deep grunt as she was jerked forward by the thrust, then was reduced to stifled little gasps as he did it again and again. The rawness of it was shocking in its beauty. And it took everything in me not to touch myself…to remember they were working and I was merely there as witness, voyeuse. There were so many times I wanted them to finish, to be done with it…to leave, so that I could lick my hand, plunge it down my panties and slip a finger inside me, imagining I was her and that King Sir was plunging into me…or that I was displayed in my naked glory while she savored me, devoured me and taught me to submit. The finish came on the balcony, with the lights of Las Vegas Blvd and the Bellagio fountains in the background…that’s a wrap…the packing of gear…the opening and closing of a bathroom door…the sounds of a quick shower. Cast and crew out, off to other endeavors, other explorations. Voyeuse alone and aroused, nipples stiff, panties wet with juice, as if it had all been extended foreplay…an exercise in edging…and now it was my turn.",
  "directors": [],
  "models": [
    {
      "name": "Amirah Styles",
      "person_id": 62619
    },
    {
      "name": "King Noire",
      "person_id": 59129
    }
  ],
  "release_date": "2020-02-14",
  "scene_id": 45790,
  "tags": [
    "bbc",
    "Bear",
    "big dick",
    "bottom",
    "Choking",
    "Collar",
    "Ebony",
    "Edging",
    "Flogging",
    "High Heels",
    "Hot Wax",
    "Lingerie",
    "mixed",
    "muscular",
    "other hair color",
    "Outdoors",
    "Paddle",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "top",
    "Vaginal Penetration"
  ],
  "title": "Vegas Voyeur"
}