{
  "collections": [
    "Men On Edge"
  ],
  "description": "Blindfolded and tied up tight Adrian Hart is about to have a very good day his first time on MOE. Micha Martinez teases Adrian's monster cock with his mouth and hands sucking and stroking and licking the tip. Adrian moans with pleasure and wants to cum but its way too soon for that. The day has just begun so Micah jacks Adrian stiff cock while Sebastian stimulates his nipples with suction cups. They glide Adrian's big lubed up dick into a tight flesh-light connected to a fucking-machine that immediately starts moving back and forth jacking him to the edge again and again. Adrian begs Micah to please put it back in cuz he can't get enough. After all that delicious torment Micah and Sebastian gag his mouth and tie Adrian up with one leg raised so his ass is spread open. A dildo attached to another fucking-machine slides in and out of Adrian's tight ass while Micha deep throats his huge cock. Adrian is loving every second of this and wants to cum so bad but every time he is about to they stop everything and make him wait. Fully suspended Micah crams Adrian's giant dick deep down his throat sucking, drooling and feasting like a voracious animal while Sebastian fucks his ass with a vibrating dildo. Oh he wants to cum too bad but still not yet. Now tied to a cage with arms and legs spread wide Adrian's muscle bulge and contract as Micah jerks his cock with a vibrating flesh-light. Adrian can barely contain himself at the masterful hands of Micah and begs him to please finally let him cum so Micah strokes his rock hard cock until Adrian blows his hot load.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Adrian Hart",
      "person_id": 62383
    }
  ],
  "release_date": "2020-04-14",
  "scene_id": 45807,
  "tags": [
    "BDSM",
    "Bondage",
    "Cage",
    "Dildo",
    "Edging",
    "Gag",
    "Gay",
    "Male Handler",
    "Male Sub",
    "Muscle",
    "Oral Sex",
    "Prostate Stimulation",
    "Rope Bondage",
    "Tickling"
  ],
  "title": "Adrian Hart Gets His Monster Cock Sucked, Stroked and Drained"
}