{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "I've always had a soft spot for women of a certain age but when they come packaged like Shannon Boobs then my tongue just hangs down on the floor making a pool of bubbly drool. Mamma mia!! Blonde, massive tits, beautiful eyes, massive tits, wham-bam bottom, massive tits. Did I miss anything? Oh yes, a dripping wet vagina. With rings on it. And fucking massive tits. Christmas comes early. A mother of three and twice divorced, Shannon was always a randy minx but found it a little difficult to really enjoy the fruits of her lust until she got together with her current partner. He was kinky, they got kinky together, and now she's got very kinky indeed doing PSS for only her second porn shoot. And she's taking it up the ass too! She told us before we shot that a big thing she likes when her man's domming her is not knowing what's coming next. To this end, we put a blindfold on her, a ball gag in her gob, and cuffed her hands together. Then we just got her tits out and started abusing them and one thing led to another and the bitch got verily fucked and spanked and came lots. Beautiful to behold. Here's Shannon's naughty list:\n- Anal & vaginal fucking\n- Physical & verbal domination\n- Orgasms\n- Deepthroat & face-fucking\n- Face-slapping & spitting\n- Choking\n- Spanking\n- Toy\n- Cumshot",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Shannon Boobs",
      "person_id": 62371
    }
  ],
  "release_date": "2020-02-13",
  "scene_id": 45812,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "big dick",
    "Big Tits",
    "Blindfold",
    "Blonde",
    "bottom",
    "brunet",
    "Choking",
    "christmas",
    "Deepthroat",
    "Dildo",
    "Domination",
    "drool",
    "Facefucking",
    "Facial",
    "foreskin",
    "Gag",
    "Hitachi",
    "Kinky",
    "Leather Cuffs",
    "Pierced Nipples",
    "Pierced Pussy",
    "Slapping",
    "Spanking",
    "Straight",
    "Sub",
    "thirdparty",
    "Vibrator",
    "white"
  ],
  "title": "Shannon Boobs: Punishment Of An Anal Bimbo Whore"
}