{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Mistress Chanel Preston sits before you wearing a tight fitting striped mesh bodysuit, sheer nylon thigh high stockings and beautiful clear platform stiletto heels. Her feet are visibly squeezed into the translucent straps as she runs her hands up and down her legs to her toes. She’s getting worked up and begins to kiss her pumps and then she deep throats her own heel. Kissing, licking, spitting, sucking– Chanel is getting more and more turned on with every little bit of interaction with her feet and shoes. She just loves the way they smell after wearing them all day. After lots of spitty kisses and toe tonguing, she works the shoes off of her feet. She drizzles lube all over her stocking-clad feet and moans as she starts massaging those little piggies. Then she plunges one foot into her mouth, sucking and licking nice and hard until she reaches an orgasm. Don’t you just wish you could taste and smell them? Mmm wasn’t that nice? Now for the other one. After setting aside the foot that made her cum she starts on liberating her toes on the other by tearing her stockings up. Just watch as her toes burst out from behind the sheer nylon. She spits some more and lets in drip all over her getting those feet nice and slippery. Now there is a perfect dildo in view, it’s thick and long, and she’s gonna fuck it. That’s right, with her feet. She simply can’t resist that big cock for her to wrap her wet arches around. Leaned back with her pussy spread wide open she fucks the dildo with her feet, sliding them back and forth. Then she takes her toes in her mouth and sucks them. She moans in such pleasure that she must be a Goddess. The sexiest foot Mistress there is.",
  "directors": [],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    }
  ],
  "release_date": "2020-02-14",
  "scene_id": 45815,
  "tags": [
    "Bondage",
    "Brunette",
    "Cuckolding",
    "Dildo",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fetish",
    "foot fetish",
    "Foot Worship",
    "High Heels",
    "Kinky",
    "Nylons Stockings",
    "slim",
    "Solo Female",
    "Straight",
    "Partner Studio",
    "white"
  ],
  "title": "Kiss Mistress Preston's Feet"
}