{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Today is the day. Mona Wales is dressed in a sexy latex outfit, getting her dirty slut slave Tony Orlando ready to leave their hotel room. The filthiest people in the world have gathered to see Tony paraded around as a shiny spectacle. Will Tony behave? Will he embarrass Mona? An electrified butt plug stuffed in Tony’s fuck hole will guarantee his compliance. Luckily Tony’s head is covered in latex so we are spared the sight of his disgusting face. Mona leads a collared Tony by the leash, walking on all fours like a shiny, sleazy, greasy beast. Down the hall to the elevator and down to the convention below. “Make way for the pervert”, Mona warns. Tony is slapped and spit upon by random women. His face rubbed in another woman’s ass. Tony’s bare torso is a canvas – women laugh and write what a filthy pig he is, a disgusting filthy piggy slut. Mona orders Tony to lay on his back on the dirty carpet and people take pictures of the filthy slut. Mona flogs the freak gimp for all to see. Tony’s back and ass take a hard flogging. Mona’s idea of a treat, lick the boots of a strange woman. More hits on his back, Tony must announce he is a disgusting pervert. This filthy piece of trash is a real spectacle. He whimpers, ‘thank you mommy’. Who does Tony want to play with next? Mona pulls out her zapper, hits Tony across the chest. Other women approach, pulling his nipples and kicking his ass with their high heels. Make way for the freak show – the most disgusting man on the planet. Tony is flat on the floor, belly exposed to the zapper, humiliated in front of the crowd. He’s called a pervert. Scum! Back to the hotel room, an exhausted Tony now must defend his title of filthiest human on the planet. She fucks his ass with her strap-on cock. The disgusting little scum bucket lays on his stomach, getting drilled from behind. Now that his little fuck hole is nicely stretched out it’s good and ready for Mona’s fist. She’s going to shove her whole hand in his ass. Tony loves this, he wants to cum but he has to beg first. The little maggoty cum whore is not allowed to cum but Mona won’t stop stroking his hard shaft. He can’t help but fail his mistress. Now he must suck her dick clean and swallow her pubic hair. Can this filthy gimp prove to Mona that he will do anything for her cunt? Mona sits on his face, zapping his balls, he better give her a nice hard orgasm. Mona doesn’t hold back on the zapper while she rides his face.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2020-04-03",
  "scene_id": 45823,
  "tags": [
    "BDSM",
    "Blonde",
    "Boot Worship",
    "brunet",
    "buttplug",
    "Corporal Punishment",
    "Dominatrix",
    "Electrical Play",
    "Facesitting",
    "Femdom",
    "Flogging",
    "Gimp",
    "High Heels",
    "Latex",
    "natural boobs",
    "Public",
    "shaped",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "spit",
    "Straight",
    "Strap On",
    "Swallow",
    "switch",
    "Tattoo",
    "versatile",
    "white",
    "Zapper"
  ],
  "title": "The Filthiest Fucking Slut: Mona Wales Degrades Tony Orlando in Public"
}