{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Jet Setting Jasmine has a date tonight with Dillon Diaz. They made plans to meet up at a popular nightclub. Jasmine is here but no Dillon. The club’s owner, King Noire, can’t help but notice a lovely lady sitting all alone in a dark corner. He offers her a drink to make her wait easier. Later, after the customers have gone and the club is closing, King is surprised to find Jasmine still waiting for her tardy date.\n\nOne thing leads to another, and soon King is making Jasmine forget all about her date, that is until Dillon Diaz finally makes his appearance. Dillon begs for forgiveness, but his attitude only makes Jasmine angrier. If he truly wishes to make it up to Jasmine he will have to make amends. This is going to be a long night for Dillon, but for Jasmine the party is just getting started. First Dillon has to rub and lick and worship Jasmine’s feet. She has him strip and then she attaches painful nipple clamps. With crop in hand, Dillon is exposed naked, suffering under the stinging blows. Jasmine uses a flogger on his ass, all the while King Noire watches with bemused interest.\n\nDillon’s humiliation is far from finished, as Jasmine attaches her strap-on dildo and penetrates Dillon’s butt hole. As if he couldn’t be humiliated further, Jasmine welcomes King’s big hard cock while she pounds Dillon. King Noire fucks Jasmine from behind. Jasmine lets Dillon know how good King feels, how much he is pleasuring her, something Dillon had a chance to do but failed by arriving late. Jasmine’s punishment knows no limits, now Dillon must get on his hands and knees, head bowed, while Jasmine lays on his back and spreads her legs wide for King Noire to fuck her long and hard. Jasmine screams with delight and beneath her Dillon can feel every shudder, every moan and every twitch of Jasmine’s hot sexy body. Jasmine straddles poor Dillon while she sucks King’s cock and Dillon can feel her wet pussy on his back, a pussy that will forever be denied him.\n\nThe night is still young and now Dillon is tied up flat on his back. Jasmine hopes he’s learned his lesson. His punishment is over and now she simply wants Dillon to see what he missed by making her wait all night. Jasmine straddles his head, doggy style, her pussy right over Dillon’s face. King enters her from behind. Dillon has the best seat in the house for this late night humpfest. After a long hard fucking Jasmine slaps Dillon’s useless dick. She frees one of his arms so he can jack off for her amusement, while she and King watch. The final insult comes when Jasmine licks King’s cock until he cums, dropping his load right on Dillon’s face. This is what happens when you waste Jet Setting Jasmine’s time. And she even thinks Dillon is cute, can you imagine what she would do to your useless ass if you disappointed her like this?",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    },
    {
      "name": "Jet Setting Jasmine",
      "person_id": 59795
    },
    {
      "name": "King Noire",
      "person_id": 59129
    }
  ],
  "release_date": "2020-03-06",
  "scene_id": 45824,
  "tags": [
    "big dick",
    "Black",
    "black hair",
    "Crop",
    "Cuckolding",
    "Dildo",
    "Feet",
    "Femdom",
    "Humiliation",
    "Leather",
    "mixed",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "shaved",
    "Straight",
    "Tattoo",
    "top"
  ],
  "title": "Club Cuck: Jet Setting Jasmine Humiliates Dillon Diaz at King Noire's"
}