{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Daisy Ducati is sick and tired of her slimy boss making passes at her on the job and decides to team up with her friend, Chanel Preston, to teach him a lesson. Chanel impersonates a rideshare driver, abducts Dante Colle on his way to work, and takes him to a secret location. The two dominant women ball gag and tie Dante up before teasing, tormenting, and treating him the same way he treats his female coworkers, like a piece of meat. After some humiliating antics, Daisy reveals that she’s gotten help from the IT guy to rig the office with evidence of his misconduct and if he wanted to leave her hideout politically and professionally unscathed he must comply with what the women demand. After a firm cropping, flogging, and seductive teasing, they untie Dante to further objectify and use him for their own pleasure. Daisy ties his grabby hands to his thighs so she can more easily control him with her strap-on dick up his ass. Chanel takes full advantage of his other available orifice with smothering, face sitting, and sexually gratifying pussy licking. After her pussy gets nice and wet from the power of dominating him, Chanel rides Dante’s hard cock while Daisy continues to skillfully fuck him in the ass with her strap-on dildo. Chanel comes really hard before its Daisy’s turn to take a ride. Daisy takes full advantage of Dante, pumping up and down on his cock, controlling his orgasm to prioritize hers. Only after Daisy is satisfied and Dante agrees to the blackmail terms for financial compensation and improved behavior towards female subordinates, do the ladies allow Dante to come all over himself.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Dante Colle",
      "person_id": 61292
    }
  ],
  "release_date": "2020-02-21",
  "scene_id": 45821,
  "tags": [
    "Athletic",
    "Ball Gag",
    "brunet",
    "Brunette",
    "Dildo",
    "fake boobs",
    "Femdom",
    "Flogging",
    "Gag",
    "mixed",
    "natural boobs",
    "Redhead",
    "shaped",
    "slim",
    "Smothering",
    "switch",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Shakedown: Chanel Preston Helps Daisy Ducati Blackmail Her Slimy Boss"
}