{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Sherman Maus and Kacie Castle are supposed to be sitting silent, in bound punishment, imposed by the fierce and sexy Isis Love, but Sherman can’t keep his mouth shut. He mocks Kacie and calls her a brown-noser and a kiss-ass since she’s generally an obedient little slave. They bicker back and forth until Isis Love catches them in the act. Startled by her presence, they blame each other for the disturbance. Isis has no choice but to punish both of her subs.\n\nShe begins with corporal punishment just to warm things up, flogging and whipping them into redemption. Then she clamps these two little slaves together with their tongues and nipples so they learn to get along. After all, “teamwork makes the dream work”. Kacie then gets a little imposed pleasure with the vibrator as Sherman is made to watch. Tied up and with his cock in chastity, poor little Sherman can’t do anything but helplessly watch Kacie orgasm. Isis then pulls out a huge strap-on for Kacie to suck on. Kacie gets it nice and wet so Isis can pound Sherman’s ass with it. Sherman then gets pounded hard by Isis’s huge dildo as he eats Kacie’s pussy. He gets flogged and pounded and close to orgasm but he is denied. Isis then makes Sherman fuck Kacie’s hot wet pussy.\n\nThis steamy punishment gets hotter and hotter as Isis makes Kacie lick her pussy too, so she doesn’t forget who is in charge. Isis then uses the vibrator on herself and squirts all over Kacie, as Kacie gets pounded by Sherman. Now that the team is coming together, Isis lets Sherman bust his load all over Kacie’s wet mouth. Now that these little slaves have been taught a lesson in teamwork, they are ready to serve.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "Sherman Maus",
      "person_id": 62063
    }
  ],
  "release_date": "2020-04-17",
  "scene_id": 45825,
  "tags": [
    "bottom",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "fake boobs",
    "Femdom",
    "Flogging",
    "mixed",
    "natural boobs",
    "shaped",
    "shaved",
    "Slave",
    "Straight",
    "Strap On",
    "Tattoo",
    "toned",
    "Vibrator",
    "Whipping",
    "white"
  ],
  "title": "Teamwork: Isis Love Sadistically Trains Kacie Castle and Sherman Maus"
}