{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "When the devastatingly sexy Gia DiMarco picks up hunky Draven Navarro during a night out at the club, she thinks she’s found the hyper-masculine pounding she’s been craving. Thick, rock-hard cock. Bulging biceps. Draven seems to have it all! Except the skills to deliver… He clumsily thrusts, grunting over Gia as she fakes as much enjoyment as she can muster. Finally, unable to stand his embarrassing attempts any longer, Gia flips Draven onto the bed and takes control of the pleasure she’s owed! Riding his cock in cowgirl, Gia uses Draven for all he’s good for – a human dildo. Shocked and humiliated when he cums immediately, Draven gets a face full of his own spunk straight from the condom while Gia cackles and plots her revenge for his disappointing performance… Snapping her whip as she waits for the next puddle of a man to ooze into her dungeon, Mistress Blunt hears a knock. Gia has brought over her new toy as a surprise! The two dominant ladies drool over Draven’s muscles, demanding that he strip naked and kneel before them and beg for the pain from their flogger, cane, and zapper. Having broken him in, Gia and Blunt truss Draven from the ceiling – pinching their little piggy with clothespins as he squirms. Once he’s begging to be fucked, the two dommes spit roast their man-meat, giving Draven a deep anal pounding before using the dripping filth from his own ass to fuck his mouth until he gags. Delighting in the squeals of their obedient hog, Gia and Blunt smother Draven with their juicy tits and ass cheeks, using his tongue to make themselves orgasm. Finally, they extract the last bit of juice from this used-up beefcake – feeding it to Draven as he whimpers and begs for more.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Mistress Blunt",
      "person_id": 62625
    }
  ],
  "release_date": "2020-03-20",
  "scene_id": 45822,
  "tags": [
    "Anal",
    "body builder",
    "bottom",
    "brunet",
    "Brunette",
    "Clothespins",
    "Dildo",
    "drool",
    "dungeon",
    "fake boobs",
    "Femdom",
    "mixed",
    "Pain",
    "shaved",
    "spit",
    "Spit Roast",
    "Straight",
    "Tattoo",
    "toned",
    "white",
    "Zapper"
  ],
  "title": "Man Training: Gia Dimarco and Mistress Blunt Dominate Clueless Man"
}