{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Hot scruffy redhead JR lies immobilized on a bench, wrapped in a rubber sleepsack, suspended from the ceiling with chains. Shay Michaels, his thick beefy muscles encased in a rubber wrestling singlet, uses the chains to rock the helpless JR’s wet mouth up and down the length of his hard shaft. Shay releases JR’s own rock-hard cock from its rubber prison, teasing JR, fitting a vacu-pump over JR’s shaft and pumps it until JR’s cock expands with the pressure, JR moaning as Shay then pisses all over JR’s tubed cock and rubber suit, spraying what looks to be a full gallon of piss up and down the full length of JR’s entombed body. JR’s cock stays rock hard as Shay strokes the own piss out of him, Shay bending down to swallow the spray. Shay pushes JR onto his side and unzips the back of the sleepsack, exposing JR’s crack, which he teases with his wet fingers before pushing JR over on his stomach, priming JR’s hole for a hard helpless fuck as JR lets the rest of his piss splatter on the concrete floor. Then Shay pushes his cock all the way into the helpless man’s ass, holding tight to the chains and pounding away, JR begging to get fucked harder. Shay fucks him like a machine, grunting out in pleasure. SM slows down to fully feel JR’s tight hole grip the length of his sensitive shaft, his big arms flexing as he holds tight to the chains. Then Shay picks up speed again, pile-driving JR until, grunting loudly, he pulls out and sprays thick globs of cum all over the black rubber encasing JR’s ass. Finally, Shay flips JR over on his back, JR’s thick red cock pointing up at the ceiling as Michael’s strokes out a huge load from his captive.",
  "directors": [],
  "models": [
    {
      "name": "JR Matthews",
      "person_id": 50467
    },
    {
      "name": "Shay Michaels",
      "person_id": 57341
    }
  ],
  "release_date": "2020-02-21",
  "scene_id": 45837,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "Chains",
    "Fetish",
    "Gay",
    "Latex",
    "Mask",
    "Piss Play",
    "Redhead",
    "shaped",
    "Swallow",
    "top",
    "unshaved",
    "white"
  ],
  "title": "VIOLATED: JR Matthews and Shay Michaels"
}