{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Bearded and tattooed Alessio Romero stares at tall and tattooed Tibor Wolfe. Their boners bursting from their leather jockstraps, the two soon trade deep sucks that leave Tibor’s sac dripping with spit. The two have a clear connection, their animalistic display heating up the screen. They take turns pissing and spitting on each other-including a filthy sequence with Tibor pissing into Alessio’s open mouth, bending down for a piss-transferring kiss and then spitting it back down on his bud. Now soaked, Alessio’s tan, hairy body glistens. The two continue their messy play as Alessio’s breathless moans fill the darkroom. Soon in a sling, Tibor shows off his boner as he gets finger-fucked before a grunting Alessio plows his rod deep inside. Tibor releases a huge load of piss, firing it up into both of their mouths-an amazing visual caught from a few angles. Alessio then fucks Tibor with a few massive dildos, grinding them inside as the excited bottom squirts-then pisses on his stuffed hole as excited voyeur Tony Buff watches, unleashing a huge load of piss. Not satisfied, Tibor sits on Alessio’s arm, bouncing up and down as his butt muscles clench. Soon lying down, Tibor gets treated to a back-and-forth fisting session with both of Alessio’s arms-which get deep penetration, causing the top’s forearm hair to get wet and clingy. Tibor shows off his rosy red hole before two more loads and a kiss-where their stubbly chins graze against each other-leave us wanting more.",
  "directors": [],
  "models": [
    {
      "name": "Alessio Romero",
      "person_id": 20463
    },
    {
      "name": "Tibor Wolfe",
      "person_id": 39831
    },
    {
      "name": "Tony Buff",
      "person_id": 62499
    }
  ],
  "release_date": "2020-02-28",
  "scene_id": 45843,
  "tags": [
    "Anal",
    "BDSM",
    "Big Toy",
    "Blowjob",
    "bottom",
    "brunet",
    "Deepthroat",
    "Fetish",
    "Fisting",
    "Gay",
    "Hairy",
    "Jockstrap",
    "Latinx",
    "Leather",
    "muscular",
    "Piss Play",
    "spit",
    "Tattoo",
    "top",
    "unshaved",
    "Voyeur",
    "white"
  ],
  "title": "FILTHY FUCKERS: Alessio Romero & Tibor Wolfe"
}