{
  "collections": [
    "Str8Hell"
  ],
  "description": "Erik Drda is blindfolded, gagged and tied. He is on the sofa on his back as his tormentor arrives and starts to spank his ass. The feet are in the air and they get spanked as well as the ass. Borek Sokol is Erik’s tormentor and he finds a hole in Erik’s underwear, he pulls the hole open wider to expose the hot hole. He keeps spanking the ass and makes the hole in the underwear larger. Erik’s hole looks so hot as a whip starts landing on it.Borerk pulls the underwear open more and releases Erik’s cock and balls and then continues to whip his ass. He soon as the ass fully exposed and removes Erik’s blindfold as well. That ass feels the hands land on it as Borek keeps up his spanking. Then he ties Erik’s balls and cock and pulls on the rope. The gag in Erik’s mouth holds it open and we hear him moan as the whip lands on his ass and as his balls are stretched. Borek applies oil to Erik’s hole and slips a hook inside, spanking some more as well. He turns Erik over onto his knees and spanks that sexy ass some more. He whips it as well before sliding the hook in again and tying it in place. Then Borek stars plucking hairs from Erik’s balls before returning to spanking the ass. He stands Erik up, slapping on his massive chest. Then he sits him back down and tells him to wank his cock. Erik takes hold of his dick and wanks it as Borek’s hand keeps landing on his chest and his thighs. As Erik keeps up his wankign his rock hard cock shoots its’ creamy load off over his left thigh.",
  "directors": [],
  "models": [
    {
      "name": "Borek Sokol",
      "person_id": 60756
    },
    {
      "name": "Erik Drda",
      "person_id": 60773
    }
  ],
  "release_date": "2020-02-27",
  "scene_id": 45846,
  "tags": [
    "Ass Hook",
    "Athletic",
    "BDSM",
    "black hair",
    "Blindfold",
    "blond",
    "Bondage",
    "CBT",
    "Feet",
    "foreskin",
    "Gag",
    "Gay",
    "Nipple Clamps",
    "Rope Bondage",
    "Slapping",
    "Spanking",
    "Partner Studio",
    "white"
  ],
  "title": "Erik Drda - SPANKING"
}