{
  "collections": [
    "Hogtied"
  ],
  "description": "Emma Hix begins in a standing position, but with one leg pulled high and wide allowing perfect access to her pussy. The Pope caresses her flesh and inspects her before tormenting her. She grinds and writhes as he touches her, showing us that this little slut wants it BAD. The drool slowly runs down her tanned body from the bright red gag keeping her mouth open. Every touch turns her on even more, yet surprises her with the aggression that he uses to caress her. Clamps are put on her nipples and her pussy lips. The Pope finger bangs her pussy with the clamps on until she can no longer deal with the pain, then they are removed and the vibe is brought in to push her over the edge. The next scene has Emma in a beautiful suspension that shows off her flexibility, as well as her amazing body. The crop is used for its precision and ability to get to the hard-to-reach places. Every exposed inch of her body is abused as she hangs from rope, helpless and unable to stop the suffering. Even at its most brutal, Emma finds a way to sexualize her pain and stare down her captor as he inflicts more pain. Once the fucking starts with her face and pussy, Emma begins to tremble from the pleasure. The orgasms continue until she is so overwhelmed she doesn’t know what to do with herself. The final scene is upon us, and it begins with some bastinado with the knitting needle, and rubber bands. At this point, Emma is so sexually charged that the slightest touch from The Pope excites her. He takes full advantage of this and does everything in his power to push her over the edge, but something’s missing… the only thing left to do is fuck her slutty ass, so he shoves a dildo deep in her ass and fucks her ass into oblivion.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Emma Hix",
      "person_id": 59561
    }
  ],
  "release_date": "2020-05-20",
  "scene_id": 45851,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "drool",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "natural boobs",
    "Pain",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "The Pope",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Emma Hix: Sexy Slut Suffers Sensually"
}