{
  "collections": [
    "Device Bondage"
  ],
  "description": "Katie is proving that she a tough little slut, and her bratty nature continues to inspire The Pope to torment her. She begins in a standing back-bend position that exploits her flexibility. The leather flogger is used to redden her skin, then the cat-o-nine tails is brought in to inflict more pain. The torment continues until he sees fit to give her the first of many orgasms. She struggles to achieve the first one because of the brutality of the position. Next we have Katie in a full split on her back, and bound with leather straps and steel traps. The Pope uses the crop to precisely torment her pussy and tits. Our little brat whines and complains, but her pussy is dripping wet, so we all know she wants it. Katie hits her breaking point, and The Pope sees this, so he pulls back and focuses on orgasms so as to not push her any harder right now. Her pussy is fucked hard and fast and then a vibe is pressed against her pussy to ensure multiple orgasms. In the final scene, Katie is in a standing predicament with chains pulling her body in every direction. Any time our brat tries to find relief she hurts herself by moving. The Pope helps with the suffering by using a taser to make her squirm, which inflicts more pain. He eventually blindfolds her to play a little mind fuck game with her. This is what makes her pussy drip and the dungeon is fills with her screams. The final orgasm are the most powerful, and Katie has made it through another session with The Pope.",
  "directors": [
    {
      "name": "The Pope",
      "person_id": 60
    }
  ],
  "models": [
    {
      "name": "Katie Kush",
      "person_id": 62547
    }
  ],
  "release_date": "2020-05-14",
  "scene_id": 45855,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Chains",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "dungeon",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Leather",
    "Metal Bondage",
    "mind fuck",
    "multiple orgasms",
    "Pain",
    "Straight",
    "Submission",
    "Taser",
    "The Pope",
    "Vibrator"
  ],
  "title": "Katie Kush: The Brat is Back"
}