{
  "collections": [
    "DDF Network"
  ],
  "description": "In today’s roleplay we see a young woman played by Samantha Bentley being subjected to the humiliating treatment of two masked men. When they finally take her out of her cage in a bleak wooden room, it is to use her like a human playground for their expression of sexual power. They tug on her pubic hair in this extreme sex scene, then get her kneeling and apply the inches of their meat into her face. Her hands bound before her, they pinch her nose as they attempt to stuff both of their shafts into her mouth. Drool slides off her lips. Laying her on the top of her cage, they strap her bare feet with a belt as they play with her pussy and continue to fuck her face. Then one guy gets underneath her and the other behind her for the double penetration they must have. Further defilement of her crotch follows with deep penetration with many fingers in her vagina as well as more ass fucking and gaping. As they double penetrate her again, her mouth is filled with one of the masked men’s fingers. Finally, they vanquish her with their loads, one on her pussy, the other on her face, and leave her to sleep it off on top of the cage as this intense video comes to a close.",
  "directors": [],
  "models": [
    {
      "name": "Choky Ice",
      "person_id": 61881
    },
    {
      "name": "Sabby",
      "person_id": 62671
    },
    {
      "name": "Samantha Bentley",
      "person_id": 52954
    }
  ],
  "release_date": "2020-03-13",
  "scene_id": 45889,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blowjob",
    "bottom",
    "british",
    "Brunette",
    "Cage",
    "Deepthroat",
    "Double Penetration",
    "drool",
    "Facefucking",
    "Facial",
    "Feet",
    "Fetish",
    "Gaping",
    "Hair Pulling",
    "Kinky",
    "natural boobs",
    "Rough Sex",
    "shaved",
    "Spit Roast",
    "Straight",
    "Partner Studio",
    "Threesome",
    "toned",
    "top",
    "white"
  ],
  "title": "Their Human Playground"
}