{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Muscular Tony Buff cradles dark and handsome Leo Alarcon’s head as they kiss. Tony licks Leo’s pit and rubs his hairy chest as Leo’s boner grazes the aggressor’s stomach. The two stare into each other’s eyes, Tony soon punching Leo’s chest. Under Tony’s spell, Leo happily submits to the red ropes that soon tie his hands behind his back. Now on his knees, Leo looks up as Tony unleashes his massive meat. The submissive stud dives down to show off his deep throat, his aggressive display creating a smile from Tony-who whips his cock on Leo’s face, holding on to the sucker’s head as he plows his mouth. As spit strands form, the veins on Leo’s forehead and neck burst as he opens wide. Tony spits on Leo, who gags and gasps for breath as a spit wad clings to his chin. Tony brings in his own replica dildo, getting Leo to suck both cocks before tying up the bottom’s legs. Tony feasts on Leo’s hole before sliding his dick inside-getting Leo to suck the dildo as he fucks him faster. The top takes turns fucking Leo (now on his back) with the dildo and his cock before shoving both inside for a hot DP that gets the bottom moaning. Leo shoots-hitting his own nipple-before Tony rubs the load onto the dildo: “Ride your own cum for me!” As the bottom bounces, Tony squirts and leans in for a kiss to end the heated pairing.",
  "directors": [],
  "models": [
    {
      "name": "Leo Alarcon",
      "person_id": 62536
    },
    {
      "name": "Tony Buff",
      "person_id": 62499
    }
  ],
  "release_date": "2020-03-13",
  "scene_id": 45895,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "bottom",
    "Deepthroat",
    "Dildo",
    "Facefucking",
    "Fetish",
    "Gay",
    "Hairy",
    "muscular",
    "Punching",
    "Rimming",
    "Rope Bondage",
    "spit",
    "Stud",
    "top"
  ],
  "title": "FILTHY FUCKERS: Pretty Boy Leo Alarcon takes Tony Buff's Cock Twice!"
}