{
  "collections": [
    "My Dirtiest Fantasy"
  ],
  "description": "Aaron is a hot, horny Spanish twink with a very dirty fantasy. He wants to be locked in a room with a bunch of equally horny bastards, who will quite literally fuck the life out of him and douse him with oodles of spunk and piss. It might not be everyone’s cup of tea, of course; but the short interview at the start of the scene is surely enough to convince anyone watching that this is a boy who knows what he wants and who won’t be happy until he gets it. So it’s a veritable pleasure for the MDF team to blindfold the young pup, take him to a warehouse in the middle of fuck-knows-where, and present him to a gang of six equally dirty-minded fuckers for the service of a lifetime! Being new to the porn scene, however, we thought it would probably be best to make the introductions in stages; first one fellow, then the next, then the next. You don’t need to be too much of an expert, however, to realize that this young beauty is very much a natural when it comes to serving cock with his mouth, and for taking load after heavy load of pent-up piss all over his pretty little body. It all serves as the truly perfect warm-up session to the hardcore fucking that is just around the corner!",
  "directors": [],
  "models": [
    {
      "name": "Aaron Lautner",
      "person_id": 62693
    },
    {
      "name": "Aaron Twink",
      "person_id": 62692
    },
    {
      "name": "Abraham Montenegro",
      "person_id": 62694
    },
    {
      "name": "Alec Loob",
      "person_id": 62690
    },
    {
      "name": "Cesar Diowood",
      "person_id": 62695
    },
    {
      "name": "Mike Cole",
      "person_id": 62689
    },
    {
      "name": "Titus Snow",
      "person_id": 62691
    }
  ],
  "release_date": "2020-03-11",
  "scene_id": 45890,
  "tags": [
    "Bareback",
    "Blindfold",
    "BlowBang",
    "Blowjob",
    "Gay",
    "Jockstrap",
    "Piss Play",
    "Partner Studio",
    "Twink"
  ],
  "title": "Spanish Twink is a Dirty Piss Slut RAW (Part 1 of 2)"
}