{
  "collections": [
    "Pascal's Sub Sluts"
  ],
  "description": "Jesus this girl's got a hunger on her. Catching up for lost time maybe. Monica Bollocksy was in a crap marriage till she was 36 (she's 42 now) then pretty quickly found hubby no.2 who turned out to be a kinky bastard. They've been swinging ever since and she's just started doing porn. But maybe it's not just lost time. Check her out in this scene when she's gyrating even when I haven't got my dick in her. A couple of times I actually tell her to stop humping and stay still. Imagine having that kind of sex drive and being able to do fuck all about it.\nMonica stressed to us beforehand that she didn't want the scene to be brutal and that she wanted to kick things off nice and sensual. Trouble is she loves getting facefucked and spanked. So after a bit of initial snogging, and after she's got down on her knees, showed off her excellent deepthroat skills and started to take over, it all accelerates a whole lot faster than what we were expecting. This woman just LOVES to get facefucked and I ended up pushing it and pushing it and pushing it and she didn't even say yellow to slow things down. It got her so turned on.\nAlso, a quick word of explanation about Andy asking about the time at the end of the scene. We had to be out of their place by 3:30 at the latest because her son was coming back home from school at four. Bad mummy. Oh yeah, and she loves being a daddy's girl, hence the title! Anyway, enough yapping. Go watch. You're going to love this one, guys.",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Monica Bollocksy",
      "person_id": 62360
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    }
  ],
  "release_date": "2020-03-12",
  "scene_id": 45893,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "brunet",
    "Couple",
    "Cuckolding",
    "Deepthroat",
    "Facefucking",
    "Facial",
    "foreskin",
    "Kinky",
    "Nylons Stockings",
    "Pierced Nipples",
    "Rough Sex",
    "Straight",
    "Sub",
    "thirdparty",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Monica Bollocksy: Mummy's Got A New Daddy"
}