{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Stunning petite wife Mia Gold is enjoying her poolside sun bathing. Little does she know this brunette's privileged wealthy lifestyle is about to get fucked. Her husband owe's a lot of money and it's time to pay up. Muscle stud Karlo Karrera shows up and drags Mia into the house. Throws her on the couch and demands she tell him where her husband is. This innocent wife has no clue what is about to happen to her. As Karlo chokes Mia, he pulls off her clothes and demands sexual payment. His hard huge cock gets rammed down her wet throat for a deep throat cock sucking. He pulls her hair harder as he gags her on his dick. He flips her over and holds her down as she screams. He shoves his hard cock deep in her wet pussy and pounds her for hard fucking. This isn't all about pleasure, there must be sexual pain and punishment. He handcuffs her and brings out the flogger and she screams for corporal punishment. Nipple clamps come out and the clover clamps are applied to her sensitive nipples. She is bound in BDSM rope bondage and her mouth is gagged with a red ball gag. Her screams are muffled as he fucks her deep in her ass. Deep anal pounding gets her squirting all over the place. With her pussy and ass fully pounded he unloads his huge load all over her body. Her husband better pay up soon. Enjoy this original Kink scene from our archives, released for the first time!",
  "directors": [
    {
      "name": "Marty",
      "person_id": 50
    }
  ],
  "models": [
    {
      "name": "Karlo Karrera",
      "person_id": 35221
    },
    {
      "name": "Mia Gold",
      "person_id": 46816
    }
  ],
  "release_date": "2020-03-27",
  "scene_id": 45917,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "Brunette",
    "Clover Clamps",
    "Corporal Punishment",
    "Domination",
    "Flogging",
    "Gag",
    "Hitachi",
    "Humiliation",
    "mixed",
    "Muscle",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Petite",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "slim",
    "Squirting",
    "Straight",
    "Stud",
    "Submission",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Drowning in Debt: Hot Wife Gets Sexual Punishment for Husband's Debt"
}