{
  "collections": [
    "House of Taboo"
  ],
  "description": "In today’s House of Taboo update, Yanick Shaft aka Ian Scott teaches his human watchdog Sophia Laure a lesson. The submissive French brunette babe is wearing a black latex dress, an open bra, presenting her medium tits and has her wrists pinioned at her back. She finds herself in this restrained position, kneeling like a dog on a chair in front of Yanick, her owner. After taming this defiant human watchdog over the past couple of months, he decided to wrap a leather strap around her neck and fixes the other end to his chair. Then he crams her mouth with a glass dildo while pulling firmly on her tight leather back bondage. After he is done with the horsetail sex toy, he starts spanking the sub’s ass until her butt cheeks start blushing deep red. Yanick penetrates that asshole with the glass dildo like a maniac, still in his grey suit when he decides to feed her his hard meat deep throat style. Sophia, now kneeling on the grass like a dog still has that glass dildo inside her asshole while Yanick makes her lube up his cock for that tight red butthole. He makes her ride him reverse cowgirl style on the leather couch in the backyard. Then he shifts her over and bangs her butt from behind in doggy style, constantly slapping and spanking that sub’s ass cheeks. After this hardcore anal insertion, he pulls his dick out of that asshole and shoots his cum in her mouth.",
  "directors": [],
  "models": [
    {
      "name": "Ian Scott",
      "person_id": 61852
    },
    {
      "name": "Sophia Laure",
      "person_id": 60326
    }
  ],
  "release_date": "2020-03-23",
  "scene_id": 45922,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Brunette",
    "Couple",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Facefucking",
    "Facial",
    "fake boobs",
    "Female Slave",
    "Kinky",
    "Latex",
    "Leather",
    "Outdoors",
    "Slapping",
    "slim",
    "Spanking",
    "Straight",
    "Sub",
    "Partner Studio",
    "white"
  ],
  "title": "Human Watchdog: Submissive Gets Some Outdoor Education"
}