{
  "collections": [
    "Men On Edge"
  ],
  "description": "This weeks MOE brings you a kinky workplace abduction themed update called Working Stiff including scenes with Vander Pulaski, Jeremy Spreadums, Jacen Zhu and Adam Ramzi. We start with Vander who is stripped down to his white boxer briefs, blindfolded and tied up. He struggles in bondage, but despite his toned muscles, can't escape from the wandering hands of Tony Orlando. Vander tells Tony to get away, but Tony only laughs and squeezes the hard length of Vander's cock through his briefs. They cut Vander's briefs off him, revealing his a flushed hard cock. Tony can't wait to taste every inch of this fresh meat. He licks Vander's balls and runs his tongue along Vander's shaft, teasing the sensitive head with his tongue and a fuck sleeve. Vander doesn't know what is happening but all the sensations are starting to feel good. He begins to thrust his hips forward, seeking release. But Sebastian and Tony just pull away laughing every time he gets close until finally his captors allow him to blow his hot load.\nNext the intensely sexy Adam Ramzi arrives for a photo shoot with Sebastian Keys and his assistant Lukas Tyler. But Adam's not quite the agreeable sort so they tackle him and string him up into a full suspension, and work his cock to the edge, tormenting him with repeated orgasm denial. Lukas begins licking his nipples, driving him wild instantly, then moves on to that hard dick, sucking it and teasing it as Adam hangs there immobile. Sebastian spanks his butt, then slides a dick-on-a-stick into his tight hole. Adam can only squirm as his cock gets sucked and his ass gets fucked, right up to the moment when he's about to cum. They deny him that pleasure, then tickle him, sending him into a twisting, writhing fit. They take him down and tie him to a chair, with a bit gag in his mouth and his arms bound behind his back. In this position they suck his cock, work it in a jack toy, apply nipple suction cups, and work the head of his dick with a vibrator attachment. Adam is led right up to orgasm again and again, but denied each time. Finally, he's allowed release, but only if he shoots his load on his precious guitar. Sebastian holds it in front of him while Lukas jerks Adam's dick until he cums all over his prized possession. And if that isn't humiliating enough, Adam is then made to lick his own load off the guitar.\nJeremy Spreadums has hit the jackpot big time but Sebastian Keys and Dominic Pacifico are hot on his trail for stealing. After capturing him during a nap they decide to teach him a lesson. Blindfolded and tied up on his knees Jeremy cries out as they squeeze his sensitive nipples and smack his cock. He can't shield himself from their blows and soon his cock starts to get hard. Laughing at the pervert they've caught, Sebastian ties up Jeremy's balls and Dominic deep throats his cock. Jeremy can't believe this is happening. His cock is leaking and he's so close to cumming he could burst. Every tug on his balls makes him harder and harder. And feeling Dominic's talented mouth on his cock and his wet tongue on his balls is driving him wild! But his captors aren't done with him yet. They blindfold him and stuff him from both ends. Dominic fucks his mouth with a dildo before sliding his own rock hard cock into Jeremy's mouth. Jeremy takes every inch of Dominic's fat cock while Sebastian fucks his ass with a vibrating cock and strokes his cock. Jeremy wants to cum so badly he's shaking, but he's at the mercy of his sadistic captors. When Dominic starts licking his feet and sucking on his toes, Jeremy can't hold it any more. He cums hard and then gets tickled until he screams! Maybe he'll think twice before he robs a casino again. Maybe.\nAfter conducting a building assessment, contractor Jacen Zhu gives his professional opinion to Sebastian Keys and Chance Summerlin. Their place is in need of a full remodel and it won't be cheap. When Sebastian suggests a trade of some kind, Jacen refuses to accept but Sebastian and Chance have other ways of making Jacen say yes. They grab him and soon Jacen is stretched out and tied atop a table. They gag him and cut his clothes off, revealing his rock hard cock. Jacen struggles to get away, but there's no way he's getting out of these ropes. Helpless, Jacen watches as Sebastian licks his armpits and toys with his nipples. He moans as Chance swallows his cock. His back arches up off the table as he fucks Chance's wet mouth, seeking release. Next, Jacen is tied with his ass exposed. The boys start teasing his cock with a vibrating sleeve. When Chance starts teasing the head, Jacen is about to loose it. He begs to cum, but the guys aren't done with him yet. They worship his beautiful feet with their mouths, and stretch open his asshole with a dildo. Jacen moans as the dildo breaches him. He can't believe it feels so good, and it feels even better when Chance swallows his cock again. With a cock in his ass and mouth on his cock, Jacen is ready to blow, but every time he gets close, he is denied. The boys keep teasing him until finally they let him cum and he blows a fat load. Immediately they start tickling him and ask him again about cutting a deal. Jacen agrees as he thrashes around, unable to stop laughing as the boys' fingers find all his ticklish spots. Being a Working Stiff isn't so bad after all!",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Adam Ramzi",
      "person_id": 53722
    },
    {
      "name": "Jacen Zhu",
      "person_id": 61943
    },
    {
      "name": "Jeremy Spreadums",
      "person_id": 61296
    },
    {
      "name": "Vander Pulaski",
      "person_id": 61944
    }
  ],
  "release_date": "2020-03-31",
  "scene_id": 45925,
  "tags": [
    "BDSM",
    "bit gag",
    "black hair",
    "Blindfold",
    "Bondage",
    "Compilation",
    "Dildo",
    "Edging",
    "Feet",
    "foreskin",
    "Gag",
    "Gay",
    "Hairy",
    "Kinky",
    "Male Handler",
    "Male Sub",
    "muscular",
    "Oral Sex",
    "Orgasm Denial",
    "Prostate Stimulation",
    "Rope Bondage",
    "Suspension",
    "switch",
    "Tattoo",
    "Tickling",
    "toned",
    "unshaved",
    "versatile",
    "Vibrator",
    "white"
  ],
  "title": "Working Stiff! A kinky MOE Compilation"
}