{
  "collections": [
    "Electrosluts"
  ],
  "description": "After a night out, the beautiful Bella Rossi brings home another sexy toy from the club to share with her blazing hot partner Cherry Torn, who's been waiting in the dungeon with her implements. Cute and innocent Koko has no idea what she's in for. All she knows is that she was promised a good time, but she didn't expect it to be this energized. Electrified with excitement, Cherry can't wait to start exploring their new toy's assets. Cherry starts testing their new toy with the violet wand. She runs it up and down Koko's amazing hot body, teasing her senses with electricity and spanking her juicy round ass. Then Bella and Cherry tie Koko's arms and leg, leaving her wide open and vulnerable. Cherry flogs and plays with Koko's pussy while Bella zaps her. They warm up Koko's pussy some more so Cherry can get her fist deep inside of her, stretching her wide open. Then they suspend Koko and take turns with her tongue until they cum. After pushing her senses they give Koko's pussy a little more pleasure. Bella strap on fucks Koko with her electric dildo connected to a tens unit. Koko gets her pussy zapped and fucked at the same time. Then they make her turn up the intensity of the unit as she rides the hard cock. She fucks it hard while also getting fucked in her nice round ass by a dick on a stick. Double penetrated and electrified, Koko can't help but scream in pleasure. Bella and Cherry then pull out the cattle prod and zap her nipples while Koko is on Bella's cock. She has a huge electric orgasm she will never forget. Another toy for the count for these two sexy ladies.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Koko",
      "person_id": 60278
    }
  ],
  "release_date": "2020-05-07",
  "scene_id": 45928,
  "tags": [
    "BDSM",
    "Big Tits",
    "Bondage",
    "Brunette",
    "Cattle Prod",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Electric Dildo",
    "Electrical Play",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "Tens Unit",
    "Violet Wand",
    "white",
    "Zapper"
  ],
  "title": "The Hookup: Bella Rossi and Cherry Torn Devour Fresh Electroslut Meat!"
}