{
  "collections": [
    "House of Taboo"
  ],
  "description": "In today’s Full HD BDSM fetish XXX video, our beautiful innocent model Sophie Lynx from Hungary comes home from her day at college. She finds her apartment door open and sneaks in when suddenly the cunning red-haired dominatrix Aylin Diamond from Romania takes advantage of her. She drags her into her bathroom and later, as she lays handcuffed in her bathtub, Sophie is rudely awakened by a splash of cold water thrown on her face and chest by the merciless Mistress Aylin who stands at the end of the bathtub, dressed in black fetish wear and sporting an evil expression. Sophie is afraid, and the shock leaves her speechless when the domina starts stripping that drenched captive, giving her a firm spanking that really reddens Sophie’s young tight curvy nice ass. That’s just a little warm-up and there is more to come. Watch the 5’8” tall domina rubbing that tiny pink twat in her face and spanking those arse cheeks right before chaining her girl to the shower holder. Yes, oh yes, that’s the correct and ideal position she wants her toy college girl to be in, right before Aylin starts her lipsticked but biting and pussy probing. Gaping that rosebud wide-open turns her on and it gets wilder and wilder when she starts hard whipping that already red asshole. The mistress drags her out of the bathtub and spanks the girl in front of the toilet bowl when she’s kneeling cheeks out on the bathroom floor! She tightly grasps Sophia’s soaking wet white shirt while slapping her butt cheeks with her black long leather whip, then turns the long red-haired cunt’s head around and slots the grip of her whip between her jaws. Sophie reluctantly opens her mouth and feels that hard cold stick between her teeth.",
  "directors": [],
  "models": [
    {
      "name": "Aylin Diamond",
      "person_id": 62509
    },
    {
      "name": "Sophie Lynx",
      "person_id": 62186
    }
  ],
  "release_date": "2020-03-30",
  "scene_id": 45930,
  "tags": [
    "BDSM",
    "Bondage",
    "Crop",
    "Curvy",
    "Dominatrix",
    "Fetish",
    "Fingering",
    "Gaping",
    "Leather",
    "Lesbian",
    "LezDom",
    "Slapping",
    "Spanking",
    "Straight",
    "takedown",
    "Partner Studio",
    "Whipping",
    "white"
  ],
  "title": "Humiliated In The Red Chamber"
}