{
  "collections": [
    "TS Seduction"
  ],
  "description": "At first we have Jamie French dressed from head to toe in an all black tight latex bodysuit. Her boy toy to play with today is Sebastian Keys, who’s trapped in a garbage bag by her feet. Sitting on her dungeon throne, Jamie commands Keys to claw his way out of the bag. Wearing a gas mask, Keys is immediately in position, ready to please his master. First she orders him to shine her latex boots up so he licks, kisses, and oinks like a pig as he polishes her shoes with his tongue. She inspects his pork-butt and slaps his dirty little piggy ass to get it nice and pink. He removes her latex boots,sniffs, and licks her rubber covered sweaty feet. All this wet tongue action is getting Jamie hot but no cock for Sebastian until she is all shiny. With his filthy mouth the little piglet unzips her body suit and polishes her hard cock with some slow, deep dick sucking.\n\nIn the Next scene, Duchess Aspen Brooks, dressed in a latex corset and bra with latex panties, has Draven Navarro remove her stockings and worship her feet and legs. She giggles as Draven snakes his tongue between her perfect toes and lavishes them with attention. Then she takes Draven over her knees for a firm spanking. Draven squirms in her lap, gasping with every hit, and thanking her for punishing him. She spits in his ass and then makes him get on his hands and knees so she can get a taste. After a little bit of rimming, she slides her hard fat cock into his ass. Draven moans as her cock enters him. He loves how it fills up his ass. The Duchess gives this bitch boy what he craves, a hard pounding with her rock hard cock. Draven cries out as the Duchess pummels his ass. He cums while she fucks him, and then eagerly takes The Duchess’ load on his face.\n\nGorgeous figure drawing model, Natassia Dreams shows up for a job her agent booked. Dressed in a short, tight, pink latex dress. The artist Jonah Marx gets to work, wasting her valuable time. She strips this loser down naked and bends him over her knee. He needs to be taught a lesson and hard corporal ass spanking is where this begins. After his ass turns bright red, it’s time for him to kiss her ass. She pulls up her latex dress naked exposing her perfect round ass and tight asshole. He goes to town eating that ass. She turns around and shoves her rock hard cock down his throat.\n\nIn nothing but a red latex corset and bra, Roxxie Moth commands Tony Orlando to suck her cock. He swallows every inch, choking as he deep throats her cock. Then he buries his face into her ass and laps at her asshole with his greedy tongue. Finally, Ms. Moth bends him over and plows his tight ass. Tony moans as Ms. Moth fucks him hard and deep. She flips him onto his back and continues fucking her new slut. Tony cums hard as Roxxie fucks him, but Roxxie isn’t about to stop just because Tony came. She drives into him harder, faster, and deeper than before until she’s had her fill and blows her load all over his face.\n\nFinally we find Natalie Mars dressed in an all black, tight latex catsuit, she lifts her legs in the air and tells Dillon Diaz to lick her asshole. He licks long licks from her asshole all the way up to her hard cock and sucks it. She orders him to put a finger in her ass and so he fucks her ass with his thumb while he sucks her cock. She puts a dildo gag in his mouth and makes him fuck her ass with it. After Natalie gets her ass fucked well with the dildo-gag, she has Dillon get on his knees. She sinks her rock hard cock deep into his asshole and fucks it. She flips him over onto his back and spreads his big muscular legs, and once again begins pounding his hole. She sits on his face and smothers his mouth and nose with her asshole while she strokes his cock. She strokes his cock and makes him cum with her hands. She collects his sperm into a specimen jar, just before unleashing her own hot load across his face.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Aspen Brooks",
      "person_id": 59054
    },
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    },
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Jamie French",
      "person_id": 47848
    },
    {
      "name": "Jonah Marx",
      "person_id": 51893
    },
    {
      "name": "Natalie Mars",
      "person_id": 60280
    },
    {
      "name": "Natassia Dreams",
      "person_id": 16310
    },
    {
      "name": "Roxxie Moth",
      "person_id": 62272
    },
    {
      "name": "Sebastian Keys",
      "person_id": 20316
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2020-04-07",
  "scene_id": 45937,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "Black",
    "Blowjob",
    "body builder",
    "bottom",
    "brunet",
    "Brunette",
    "Choking",
    "Cock Worship",
    "Corset",
    "Dildo",
    "dungeon",
    "fake boobs",
    "Feet",
    "Gag",
    "Latex",
    "Mask",
    "master",
    "mixed",
    "muscular",
    "natural boobs",
    "Rimming",
    "Role Play",
    "shaped",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "TS",
    "versatile",
    "white"
  ],
  "title": "Luscious Ladies In Latex: A TS Seduction Collection"
}