{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Your gaze begins by scanning up Mona Wales' entire body. From her gleaming black heels up to her beautiful breasts, she is completely clad in shiny rubber latex save for a purple leather corset. She's feeling herself, up and down, letting the sticky smooth texture of the latex massage her fingertips as she starts to acknowledge you. You, her slave, with an eager tongue that wants to explore every inch and fold of her perfect body. With a nose that wants to smell the sweet aroma of latex rising off of her, the mixture of lube, and her sheer omnipotent sexual prowess. You sit and you watch as she feels herself occasionally stopping to look at you seated just beneath her throne. With her hands gripping her legs she can see that you're turned on and that you want to jack off already. She instructs you to stroke yourself with lots and lots of lube. She wants your hands to be shiny and glide up and down your quivering cock. She tells you to grip yourself nice and hard, which is difficult with all that lube. Then she reaches for her breasts and makes a deal with you. She tells you to stop jerking off and to sit on your slippery hands. Don't touch yourself at all. She's going to show you your reward. Mona continues to tease you and you're not allowed to touch yourself. No, she wants you to suffer. She chides for you to come closer as she reveals her perfectly hard nipples. She plays with them as she teases you. Don't you just wish you could cum all over her beautiful, slippery breasts? She's about to make one thing completely clear...that your cum will never, ever get close to her. Now continuing her instruction she wants to play some more. Go ahead touch your cock. Make it nice and hard for her. Remember that tight grip she mentioned earlier? Be sure to squeeze your dick really tight as she stands up and turns around. Her hands graze her round ass as she begins to peel the latex away from her lower back. The tight rubber gripping her perfect body as she reveals her ass and commands you to lick the sweat out of her ass crack. Now she wants you to start working up that cock of yours because she wants to drain it. She tells you to jerk yourself faster and faster worshipping her ass even harder than you're stroking your cock. She tells you to cum now. Do it. That orgasm is your reward and now it's time for your punishment. Get down on all fours like a good slave and put your face that pathetic little puddle of cum that you made and stay there until she's ready to use you again.",
  "directors": [],
  "models": [
    {
      "name": "Mona Wales",
      "person_id": 51511
    }
  ],
  "release_date": "2020-03-25",
  "scene_id": 45936,
  "tags": [
    "Blonde",
    "Bondage",
    "Corset",
    "Cuckolding",
    "Dominatrix",
    "dungeon",
    "Femdom",
    "Fetish",
    "High Heels",
    "JOI",
    "Kinky",
    "Latex",
    "Leather",
    "natural boobs",
    "shaped",
    "Slave",
    "slim",
    "smooth",
    "Solo Female",
    "Straight",
    "switch",
    "thirdparty",
    "white"
  ],
  "title": "KINKY JOI: Mona's Dungeon"
}