{
  "collections": [
    "Hardcore Gangbang"
  ],
  "description": "Tegan Tate is tired of being a good girl. She’s had her eyes on a gang called The Bad Seeds, who are always up to some mischief. She sits at a picnic table near where The Bad Seeds hang out and tries to get noticed. The gang’s leader, Princess Donna sits at the table with Tegan. She talks to her and convinces Tegan that if she fucks the whole gang, she’ll become a member. Tegan agrees to meet the boys on the weekend, same time, same place. As Tegan approaches the meeting point, she suddenly gets a leather jacket thrown over her head and is immediately swooped up and taken inside the building by the boys from The Bad Seeds. They take her to the men’s bathroom, shove her face in the urinal, and flush it. They strip her clothes and give her a major wedgie before carrying her off to another room to get their cocks sucked. She gets on her knees, they crowd around, and one by one they stuff her face with their big cocks while making her jerk off the other’s with her hands. One of the guys picks her up, flips her over, and fucks her upside-down mouth. They throw her on a leather couch, spread her legs, and take turns fucking her tight pussy rough and raw while she keeps the other dicks hard in her mouth. Her tits and face are slapped while she gets fucked. The guys then flip her over into doggie and spit-roast her with one fat cock in her ass and another down her throat. Next they double-penetrate her holes in several positions, fucking her airtight until they ultimately stretch her out, cover her face with all of their hot loads, and send her out the door, naked and glazed. Enjoy this Kink Classic from our archives, released for the first time.",
  "directors": [
    {
      "name": "Princess Donna Dolore",
      "person_id": 47
    }
  ],
  "models": [
    {
      "name": "Dane Cross",
      "person_id": 21442
    },
    {
      "name": "John Strong",
      "person_id": 17050
    },
    {
      "name": "Jordan Ash",
      "person_id": 42543
    },
    {
      "name": "Tegan Tate",
      "person_id": 42885
    },
    {
      "name": "Tommy Pistol",
      "person_id": 12663
    }
  ],
  "release_date": "2020-05-13",
  "scene_id": 45957,
  "tags": [
    "Airtight",
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "BlowBang",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Corporal Punishment",
    "Double Penetration",
    "Gangbang",
    "Latinx",
    "Leather",
    "muscular",
    "natural boobs",
    "Role Play",
    "Rough Sex",
    "shaved",
    "slim",
    "spit",
    "Straight",
    "top",
    "unshaved",
    "white"
  ],
  "title": "The Bad Seeds: Tegan Tate Brutally Takes Four Cocks"
}