{
  "collections": [
    "Sex And Submission"
  ],
  "description": "Kink.com is proud to present this classic shoot from the archive, released for the first time. Busty brunette Ashli Ames looks stunning in her business suit. She has been working her ass off all year and deserves this promotion. But, unbeknownst to her a colleague Mark Davis ego has been shattered. He feels this was easily his promotion. There's only one way to make him feel better. He'll use shaming and blackmail to get what he wants. In Ashli's new office he rips off her clothes and reveals her big tits in a black bra. He pulls down her skirt to show off her perfect ass. It's time for punishment. He starts by bending her over the desk and spanking her ass. Her legs look perfect in stockings and high heel shoes. Next comes the rope and he ties her up helpless in rope bondage. Her mouth is used to deliver a full deep throat cock sucking. He bends her over again and fucks her deep in her wet pussy. Mark takes Ashli to her new fancy bedroom and brings out some more toys. A red ball gag shuts her up as he uses the cane on her precious body. She is still able to scream when the electric zapper comes out. Punishment isn't always about pain, and Mark uses the Hitachi to punish Ashli with uncontrollable orgasms. The flogger is taken to her body as she is bound in rope on the bed. Finally he fucks her pussy hard and raw before shooting his load on her massive tits. Congratulations on the promotion!",
  "directors": [
    {
      "name": "Marty",
      "person_id": 50
    }
  ],
  "models": [
    {
      "name": "Ashli Ames",
      "person_id": 33058
    },
    {
      "name": "Mark Davis",
      "person_id": 8200
    }
  ],
  "release_date": "2020-05-08",
  "scene_id": 45955,
  "tags": [
    "Ball Gag",
    "BDSM",
    "big dick",
    "Big Tits",
    "black hair",
    "Blowjob",
    "Bondage",
    "british",
    "Brunette",
    "Caning",
    "Corporal Punishment",
    "Curvy",
    "Domination",
    "fake boobs",
    "Flogging",
    "foreskin",
    "Gag",
    "Hitachi",
    "Humiliation",
    "muscular",
    "other hair color",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Spanking",
    "Straight",
    "Submission",
    "top",
    "unshaved",
    "Vaginal Penetration",
    "white",
    "Zapper"
  ],
  "title": "Punishment: Coworker Gets Revenge on Submissive Brunette"
}