{
  "collections": [
    "Bound Gods"
  ],
  "description": "Three muscle studs battle for dominance in this newly found shoot from the Kink vault. Rick Bauer and Alfredo Castaldo catch Enrico Bellagio in a glory hole booth, strip him to his leathers, and drag him downstairs to the dungeon beneath the club. Enrico puts up a good struggle but is no match for Rick and Alfredo. They lock a collar around his neck, leash him, and lock him in a cell where he has no choice but to service them. Rick reveals Enrico’s thick cock and drops to his knees to get a taste while Alfredo holds him in place. Next, these two studs tie young Enrico up. They tenderize his flesh sweet ass and muscled shoulders with a heavy leather flogger and their hard fists. Then they push him down on his knees and make him suck their cocks. Enrico takes every inch of their cocks, gagging as he struggles to please his captors. Next, Rick and Alfredo bend Enrico over and stuff him from both ends, using his holes for their pleasure. Once they’ve had their fill, they flip him over, gag him and continue taking turns fucking his sweet hole. Finally these boys let Enrico up and cum all over his chiseled chest. After getting covered in cum, Enrico is pulled to his feet and he shoots a fat load all over the dungeon floor.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Alfredo Castaldo",
      "person_id": 18207
    },
    {
      "name": "Enrico Bellagio",
      "person_id": 18205
    },
    {
      "name": "Rick Bauer",
      "person_id": 18206
    }
  ],
  "release_date": "2020-05-21",
  "scene_id": 45965,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "Blowjob",
    "Bondage",
    "brunet",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "dungeon",
    "Feet",
    "Gag",
    "Gay",
    "glory hole",
    "Humiliation",
    "Leather",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Submission",
    "white"
  ],
  "title": "Budapest Bound 2: Never-Before-Seen Fuckfest in Budapest Dungeon"
}