{
  "collections": [
    "Bound Gods"
  ],
  "description": "Kink is proud to present this never-before-seen Bound Gods shoot with Van Darkholme and three hot studs from Budapest, each of them excited to explore BDSM and each other for the first time! First, we present the sexy Renato Dellagio with smooth muscle stud Rick Randy. We find the two of them working out at the gym, before we tie up Renato, and Rick gets to use and abuse his ripped, muscular body. Renato is tied up in rope with his hands behind his back and his eyes blindfolded. Rick worships his body, slaps his ass and legs, punches his abs and chest. He then ties up Renato's cock and fits him with a rope gag. He sucks his cock and paddles him, then unties him so he'll suck his cock in return, slurping down on that long dick. Then it's Renato's turn on top. He puts Rick on a bench press and fucks his beautiful ass, filling that hole with his thick cock, before they both shoot their loads all over Rick's tight body. Finally, Van Darkholme takes advantage of the young stud Antonio Rinaldi. Antonio is tied up as Van slaps his body all over, worshiping him and using him for his own desires. Antonio is then blindfolded and tethered with his hands tied behind his back. He's not tied down, so he thinks he can resist, but in reality, he's still Van's little bitch. Van bends him over and fills his ass with cock, fucking this hot stud before shooting his load all over cock and balls. Antonio is finally allowed to cum, and shoots it all over Van's thick chest.",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Antonio Rinaldi",
      "person_id": 18197
    },
    {
      "name": "Renato Dellagio",
      "person_id": 18196
    },
    {
      "name": "Rick Randy",
      "person_id": 18195
    },
    {
      "name": "Van Darkholme",
      "person_id": 15862
    }
  ],
  "release_date": "2020-04-09",
  "scene_id": 45964,
  "tags": [
    "Anal",
    "Asian",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Gag",
    "Gay",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "muscular",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "smooth",
    "Stud",
    "Submission",
    "top",
    "white"
  ],
  "title": "Budapest Bound: Never-Before-Seen Bound Gods with Van Darkholme"
}