{
  "collections": [
    "Hogtied"
  ],
  "description": "Good girl Ella Nova spreads her legs for Sergeant Major. In his low gravely voice he commands her to vibe her clit with the Hitachi and feel herself up.\nSergeant has lots of plans for Ella today and the fun has just begun. After bending Ella over his knee to give her a good spanking she is gagged and bound to a chair. Mr Major cuts Ella’s bra and sexy leotard off so she is only wearing see-through black stockings and thigh- high leg warmers. Sergeant Major pulls a tight rope between her legs which raises her hips up high in the air creating quite the fetching bondage position. He vibes her clit with the Hitachi and clips a bunch of clothes pins on her tits while he fucks her pussy with a dick on a stick. He goes deep and hard in Ella’s cunt making her wiggle and moan and when he adds the vibrator she cums hard. Next laying on her stomach with arms and ankles bound behind her Sergeant has his way with Ella’s pussy again. First he flogs her tender ass and teases her sensitive slit with the long leather strands of the flogger. Ella’s perfect little ass wriggles in the air while Major fucks her pussy and makes her cum with the vibrator. He whips her with the crop, single tail, flogger and slaps her butt turning it bright pink. Flipping back and forth between stinging pain and pussy pounding pleasure Ella is getting the royal treatment today. Now on her back tied up tight and gagged Sergeant Major puts Ella through her paces with more intense vibration on her clit, cunt fucking with the dick on a stick. Major is having a good ole time with his little plaything and Ella just takes whatever he gives because she wants to please him. Finally bent over on her knees Mr. Major tickles Ella making her squirm and plays with her pussy to get her all hot and bothered. Hardcore pussy fucking and vibration takes Ella way over the top as she begs Sergeant Major to cum and boy does she!",
  "directors": [],
  "models": [
    {
      "name": "Ella Nova",
      "person_id": 51866
    }
  ],
  "release_date": "2020-06-03",
  "scene_id": 45967,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Crop",
    "Domination",
    "Fingering",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "natural boobs",
    "Pain",
    "Rope Bondage",
    "shaved",
    "Single Tail",
    "Spanking",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Adorable Slut Ella Nova gets fucked up by Sergeant Major"
}