{
  "collections": [
    "Hogtied"
  ],
  "description": "It’s last call at The Dark Corner Saloon. Bartender, Miley May sweeps up after a long night. One creepy customer remains slumped over in his chair, wearing mechanic’s coveralls and a creepy mask. Miley approaches with caution and tells the man that he has to leave. The man gets up immediately, throws down his chair, and grabs Miley by the neck. He tells her in his creepiest voice that if she does everything he says, she’ll be okay. He lays her down on a bar table and rips off her clothes. He binds her arms and legs with black zip-ties, and secures the ties to the table. The scary man makes her stare him in the eyes while he fucks her pussy with an empty wine bottle. After that, he gets a leather crop and hits her in the pussy repeatedly. After taking a beating with the crop, Miley gets a shock when the scary guy slides a big dildo inside of her pussy. He cuts the zip-ties and tells her to stand up, and drags her to the bar, lifts her up, and places her face down on top of it. Her hands are bound behind her back, her legs are bound together, and her mouth is covered with duct tape. He lifts up her hips, spanks her ass, and continues fucking her pussy with a big dildo. In the next scene, Miley is face-down on a dirty mattress, bound in rope with her arms tied behind her back. The scary man slowly climbs on top of her and zaps her with electricity. He hits her again with the leather flogger and unties the rope just from her legs. She flips over onto her back and is told to spread her legs. He fucks her again with his big dildo and presses an Hitachi vibrator against her clit. In the final scene, he puts a ball-gag in her mouth, binds her in a plethora of rope and pulls her up in a full suspension. He fucks her some more with his dildo until she can’t take anymore and lets her down.",
  "directors": [],
  "models": [
    {
      "name": "Miley May",
      "person_id": 56126
    }
  ],
  "release_date": "2020-04-22",
  "scene_id": 45966,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Crop",
    "Dildo",
    "Domination",
    "Fingering",
    "Gag",
    "Handler",
    "Hitachi",
    "Humiliation",
    "Leather",
    "Mask",
    "natural boobs",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "Tattoo",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "The Dark Corner Saloon: Miley May Taken, Tied Up, and Tormented"
}