{
  "collections": [
    "Families Tied"
  ],
  "description": "Five gorgeous MILFs are here to train five hot disobedient young girls on how to properly pleasure their families. First we have the stunning Cherie DeVille popping in to visit her naive step-daughter Ella Nova and husband to be Derek Pierce. However, Cherie needs to teach Ella a few things, Ella is setting the wrong precedence with Derek. Of course mommy knows best and all bad girls need a firm spanking on their ass. Cherie pulls up her daughters dress and begins to spank Ella’s ass red. Thank you mommy. After some discipline it’s time to teach Ella just how to please her man. Derek get’s his cock sucked by the mother daughter duo dressed in rope bondage and leather cuffs. Both mother and daughter take an anal ride on Derek’s dick before he shoots his load on his bride to be and mother-in-law. Next up the powerful Helena Locke catches her bratty step-daughter Kacie Castle running around with Rod Piper. It’s time to teach that disobedient little one a few manners. Kacie is bent over her mother’s knee and Helena starts a firm slapping on her daughter’s tight young ass. Rod comes in a gets a proper deep throat cock sucking before fucking mom and daughter and shooting his huge load. Bust Veronica Avluv needs to teach Victoria Voxxx some manners. Tied up in rope bondage and gagged with a ball gag, Veronica and Ramon Nomar use Victoria. Veronica gets a deep deep anal fucking while Victoria is made to eat pussy. Veronica squirts all over Victoria’s young face. Veronica Avluv gets fisted by Ramon while Victoria is fucked hard. Finally Victoria is anal fisted and Ramon cums on her ass. Rich stubborn Amilia Onyx thinks she runs the place, but the beautiful India Summer knows how to train this young girl. India and Derek use clothespins and electric zapper on Amilia’s huge natural tits to deliver pain, while the Hitachi is used for pleasure. Both Derek and India dominate this young slut. Derek fucks the hot MILF India, before the young slut Amilia sucks him off. Inida is tied up in rope bondage and hot wax is dripped on her tits before Derek fucks her with deep anal and cums on Amilia. Finally queen MILF herself Dana DeArmond needs to train her slutty disobedient step-daughter Abella Danger. She bends over her daughter and slaps her beautiful round ass red. Dana puts clothespins on Abella’s perky little tits and tight pussy lips. She fucks Abella’s asshole with a metal dildo. Nipple clamps come out and get Abella screaming. Abella is made to rim Dana’s MILFy asshole. Finally Juan Lucho comes out to fuck Abella tied up in rope bondage and gagged with a ballgag. His huge hard cock fucks Abella’s tight asshole with deep hard anal, while Dana trains this young slut with a corporal punishment. The cane comes out and torments Abella’s naked bare feet. Abella is fed Juan’s dick as he cums a huge load on her face. Maybe these young sluts will finally learn their lessons that Mommies Know Best!",
  "directors": [
    {
      "name": "Ex Libris",
      "person_id": 55
    }
  ],
  "models": [
    {
      "name": "Abella Danger",
      "person_id": 56157
    },
    {
      "name": "Amilia Onyx",
      "person_id": 61275
    },
    {
      "name": "Cherie DeVille",
      "person_id": 40439
    },
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Derrick Pierce",
      "person_id": 14403
    },
    {
      "name": "Ella Nova",
      "person_id": 51866
    },
    {
      "name": "Helena Locke",
      "person_id": 59793
    },
    {
      "name": "India Summer",
      "person_id": 16909
    },
    {
      "name": "Juan Lucho",
      "person_id": 59517
    },
    {
      "name": "Kacie Castle",
      "person_id": 59236
    },
    {
      "name": "Ramon Nomar",
      "person_id": 35412
    },
    {
      "name": "Rob Piper",
      "person_id": 54778
    },
    {
      "name": "Veronica Avluv",
      "person_id": 22663
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2020-04-10",
  "scene_id": 45960,
  "tags": [
    "Anal",
    "Athletic",
    "Ball Gag",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Discipline",
    "fake boobs",
    "Family Roleplay",
    "Feet",
    "Fisting",
    "foreskin",
    "Gag",
    "Hitachi",
    "Hot Wax",
    "Latinx",
    "Leather",
    "Leather Cuffs",
    "Lesbian",
    "MILF",
    "muscular",
    "natural boobs",
    "Nipple Clamps",
    "other hair color",
    "Pain",
    "Pierced Nipples",
    "Rimming",
    "Rope Bondage",
    "shaped",
    "shaved",
    "Slapping",
    "slim",
    "Spanking",
    "Straight",
    "Stud",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "white",
    "Zapper"
  ],
  "title": "Mommies Know Best: Gorgeous MILFs Train Disobedient Young Girls"
}