{
  "collections": [
    "Ashley Fires SciFi Dreamgirls"
  ],
  "description": "Violet (Jade Thomas) was working hard on the new Creation project for Dr. Fires. Having only been there a few days and still had no idea why she had been hired. Doctor Fires barely spoke to her and if she did it was only to tell her that her clothes were far to mousey for such a pretty girl. Violet was top of her class and was recruited directly by Dr. Fires the day she graduated. She accepted because it was the famed Dr. Fires and it was a lot of money! And she would have a chance to explore Replicant Technology which Dr. Fires was very close to developing. It was almost lunchtime although Violet never took a lunch, she still felt the need to impress Dr. Fires by her dedication to the project. Fires stood behind her as she worked away then Dr. Fires actually spoke to her and said what a fine job she was doing. She then leaned in to Violet to get a closer look at the monitor and out of nowhere she started grabbing Violet’s breast and kissing her neck. Violet stood up and moved away saying how inappropriate Dr. Fires was being.\n\nShe had always heard stories about Dr. Fires but always thought they were just rumors from jealous colleagues. But now she had to wonder if they were all true. Dr. Fires immediately apologized and said that she should take the rest of the day off because she had been working too hard. But before she goes if she could help her with one last thing. She lead Violet to this head device and had her stand there. Now this might pinch a little bit said the Doctor. But before Violet could say anything everything went dark. “What is your command” Dr. Fires looked at the computer screen and smiled. It worked. Violet was under her complete control. Now before I put you in the body caster I want to make sure you have the goods to get the job done. I am going to touch your breasts, would you like that? Violet spoke “Yes Master.” After Dr. Fires had her fill of posing and groping her mindless toy she put her in the caster. Once finishing her mold she removed her and decided to have some more fun with her. She then gave her very specific instructions and sent her away. Later that night Dr. Fires stands and patiently watches as “Violet” Alpha Replicant is completed. She’s perfect. Now begins the real work of making sure Violet will be able to complete her new assignment!\n\nDr. Fires orders her to lay down, go into repair mode, and open her central panel. Dr. Fires repairs her circuits and Violet seems to enjoy the doctor fingers in her panel. Then she had Violet download a new program which should fix things along with enhance her sexual functions as well. When completed she looks at the Doctor and tells her how beautiful she is and she must make love to her right now! Dr. Fires agrees and they start in on each other. Fires wants to see how her new sexbot cums! She puts the magic wand on her and almost makes her squirt her robot oil all over the place! Violet grabs the doctor and tell her that she wants to make her so hard that she will blow her circuits! They go back and forth until the the Doctor tells her that she has had enough and Violet should go into hibernation mode. The Doctor returns later and wakes up Violet and give her her new mission. “Retrieve ASHLEY 3000 from the HRX Corporation! I don’t care who you have to fuck or what you have to do, just bring her back to me!” Violet smiles “YES MASTER!”",
  "directors": [],
  "models": [
    {
      "name": "Ashley Fires",
      "person_id": 20856
    },
    {
      "name": "Kitty Glitter",
      "person_id": 62892
    }
  ],
  "release_date": "2020-04-02",
  "scene_id": 45962,
  "tags": [
    "black hair",
    "Blonde",
    "Doctor",
    "Hitachi",
    "Lesbian",
    "master",
    "natural boobs",
    "slim",
    "Straight",
    "switch",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Ashley Fires SciFi Dreamgirls: Violet - The Creation"
}