{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Muscle men Spencer Reed and Jessie Colter wrestle in jockstraps till massive Spencer pins Jessie to the mat, then strings him up, arms tied overhead, like a punching bag. Jessie’s cock hardens as Spencer ties up his legs and ankles, then pulls out a hose and funnel that he fills to the brim with his piss. He slides the tube into Jesse’s tight, perfect ass, and pumps the entire funnel of piss into his captive, before slapping a plug into Jesse’s clenched hole. Spencer pulls on boxing gloves and works over Jessie’s inked chest and abs with heavy uppercuts as Jesse struggles to keep Spencer’s piss up his ass. Spencer pulls out Jesse’s plug and tastes his own piss as it comes streaming out of Jessie’s muscular ass. Jessie drops to his knees and swallows his top’s big cut meat and Spencer fucks his handsome face, relishing Jessie’s warm mouth, before spinning him around and working his huge tool into Jesse’s piss-slick hole. Jesse grunts as Spencer slams his cock all the way in and out, before flipping Jesse over, legs high in the air. Spencer plows him deeply, till Jessie’s cock erupts, spraying wads of cum over his spit and piss-soaked chest, and the sight triggers Spencer’s own explosion, blasting a huge load all over Jessie’s neck and chest. (A special edit of just the wrestling sequence follows the scene.)",
  "directors": [],
  "models": [
    {
      "name": "Jessie Colter",
      "person_id": 34311
    },
    {
      "name": "Spencer Reed",
      "person_id": 19086
    }
  ],
  "release_date": "2020-04-03",
  "scene_id": 45976,
  "tags": [
    "Anal",
    "big dick",
    "body builder",
    "bottom",
    "brunet",
    "Deepthroat",
    "Facefucking",
    "Fetish",
    "Gay",
    "gloves",
    "Kinky",
    "Muscle",
    "muscular",
    "Piss Play",
    "Punching",
    "Rimming",
    "Rough Sex",
    "shaped",
    "shaved",
    "Slapping",
    "spit",
    "Tattoo",
    "top",
    "white",
    "Wrestling"
  ],
  "title": "PUNCHED AND POUNDED: Spencer Reed and Jessie Colter"
}