{
  "collections": [
    "Whipped Ass"
  ],
  "description": "Decadent Dyke Bar Delights is a classic Whipped Ass compilation of the hottest, sexiest, most audacious all-girl gang bang Dyke Bar delicacies. Starting with the daring Darling who wanders into the bar where sassy gals Daisy Ducati and Mona Wales are visiting the lusty bar owner Mistress Kara. It doesn’t take long for Darling and her bounteous bosom to succumb to the advances of the three ladies who take her to the basement, sit on her face, finger her cunt and run an orgasmic lesbian strap-on train in all of her slutty holes! Adventures include flogging, cropping, spanking, pussy licking, pussy clamps and lots of pussy, anal and DP strap-on fucking. Next up is the lovely Lorelei Lee who is seduced by three hot and horny beguiling babes Cherry Torn, Daisy Ducati and Mistress Kara. Each one of these slinky sluts have their way with Lorelie’s holes, first they fuck her shaved, pink pussy and then bend her over into doggie and fuck her ass until she is begging to cum. More face sitting, cunt licking, strap-on cock sucking and over the top DP induced orgasms. Then hot tough chicks Mona Wales and Mistress Kara close up the bar and head over to a late night party where Phoenix Marie is dominating hot young thing Abella Danger. The evening escalates from spanking, foot worship and pussy licking to flogging, severe humiliation and strap-on pussy fucking.\nNext buxom beauties Bella Rossi, Chanel Preston and Arabelle Raphael get it on all night long after a wet and wild t-shirt contest. All parties enjoy a ruckus night filled with pussy licking, face sitting, woman handling, finger banging, pussy pounding, anal and tons of hot lesbian orgasms! Finally gorgeous, buttoned-up business woman Ingrid Mouth shows up at the dyke bar where Mistress Kara, Daisy Ducati and Nikki Darling descend upon her in the ladies room for some after hours shenanigans. These masterful mistresses dominate Ingrid with all of their best moves including stuffing her hungry holes with strap-ons, squirting orgasms, a zipper and more! Watch all these insatiable, voracious sluts fuck and get fucked into submission again and again in Decadent Dyke Bar Delights!",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Abella Danger",
      "person_id": 56157
    },
    {
      "name": "Arabelle Raphael",
      "person_id": 22128
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Chanel Preston",
      "person_id": 26542
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Ingrid Mouth",
      "person_id": 53766
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    },
    {
      "name": "Mistress Kara",
      "person_id": 19043
    },
    {
      "name": "Mona Wales",
      "person_id": 51511
    },
    {
      "name": "Nikki Darling",
      "person_id": 42508
    },
    {
      "name": "Phoenix Marie",
      "person_id": 17093
    }
  ],
  "release_date": "2020-05-20",
  "scene_id": 45972,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Compilation",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Dyke Bar",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "Flogging",
    "Foot Worship",
    "Humiliation",
    "Latinx",
    "Lesbian",
    "LezDom",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "Redhead",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "Strap On",
    "Sub",
    "Submission",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "white",
    "Zipper"
  ],
  "title": "Decadent Dyke Bar Delights: A Classic & Creamy Whipped Ass Compilation"
}