{
  "collections": [
    "Ashley Fires SciFi Dreamgirls"
  ],
  "description": "If you love hot sexy Android Women obeying your every command, then you have come to the right world. For the first time Technosexuals, ASFR (Alt.Sex.Fetish.Robots), and Robot Fetishists alike now have a movie series that caters to their specific technological sexual proclivity.\n\nEpisode Description: HRX Surrogate 1 is a brand new prototype. This android has 2 modes. In Surrogate mode, humans and other robots may control them. In Autonomous mode, they are able to function like any other HRX model.\n\nHRX Surrogate 1 (Lily) stands frozen, motionless. Sonya (Chelsea) enters and switches her on and commands her to enter Autonomous mode. HRX Surrogate 1 greets her master and inquires how she may pleasure her this morning. Sonja explains that she is a robot as well and not her master. She is not programmed for pleasure and she is only there to run program Alpha testing on her. Sonja commands HRX Surrogate 1 to assume position M, open her C-Panel, and stand-by to begin testing. HRX Surrogate 1 asks Sonja if she will enjoy the testing? Sonja explains that she will because she is programmed to enjoy it. Dr. Pierce enters the lab and sees both robots frozen, awaiting his presence. They greet him simultaneously and he orders the testing to begin. Sonja starts thrusting her large dilator apparatus in and out of the Surrogate’s pussy. Dr. Pierce asks the statist of the Surrogates V Cannel. Sonja recommends an increase of pressure by 15% for user sensitivity. There seems to be issues with her pleasure sensors so the Doctor makes some adjustments to her open panel and asks the Surrogate how she feels. The android starts screaming in ecstasy! Dr. Perce is pleased with the Surrogate and decides it was time for some human trials. First the Doctor orders Sonja to lick her robot pussy. Both Sonja and the doctor have their way with the Surrogate until the doctor explodes all over the robots face. She is ordered to self cleaning mode and then freezes. Dr. Pierce then commands Sonja to prepare for Surrogate Integration testing.\n\nCast: FemBot Surrogate 1, Sonya, Dr. Pierce",
  "directors": [],
  "models": [
    {
      "name": "Iron Balls",
      "person_id": 62891
    },
    {
      "name": "Lilly Ligotage",
      "person_id": 55115
    },
    {
      "name": "Sonya",
      "person_id": 62894
    }
  ],
  "release_date": "2020-04-03",
  "scene_id": 45975,
  "tags": [
    "black hair",
    "Blonde",
    "Blowjob",
    "Doctor",
    "Facial",
    "Fetish",
    "master",
    "natural boobs",
    "Nylons Stockings",
    "Straight",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Ashley Fires SciFi Dreamgirls:HRX Surrogate Autonomous Mode"
}