{
  "collections": [
    "PegHim"
  ],
  "description": "Buff blonde babe Riley Reyes has a great love of butt slutts like her good friend Michael Vegas. They have wanted to get together to explore the depths of Michael’s hole for many years, but Siouxsie Q was finally able to make it happen. Michael watches Riley show off her athletic body and the gigantic cock she’s strapped on just for the occasion. She warms him up slowly at first with her black gloved fingers, and eventually gets her entire hand inside him. Siouxsie is behind the camera cheering Riley on, and asking Michael how it feels as his overwhelmed face contorts with pleasure and pain. She slides her fist in and out of him and jerks off his cock too before leaning over and kissing him while she fucks his ass from behind. She then lubes up her the arm-length cock she strapped on to fuck him with and begins to work its massive length into his forever hungry hole. She eventually bends him over the couch, sliding the elephant sized member deep inside his body. She then switches back to stretching him open with both her hands and then pulls out a huge grey plug that she plunges in and out of his asshole, making his overwhelmed sphincter gape, helplessly, open. She finishes by flipping him over onto his back and sliding her huge cock all the way inside his man hole, and bouncing her big round booty at Siouxsie Q’s camera. She extends her perfectly pointed toes towards Michaels big slutty lips and he eagerly wraps his tongue around her pedicured piggies while taking every inch of her cock. She shows off her perky natural tits and begins to jerk off his cock, which grows larger with arousal every second. She flips him over once more and fucks him doggy style while he frantically jerks his hard cock until he cums. The two friends kiss and revel in the sweat, lube and cum.",
  "directors": [],
  "models": [
    {
      "name": "Michael Vegas",
      "person_id": 47624
    },
    {
      "name": "Riley Reyes",
      "person_id": 55057
    }
  ],
  "release_date": "2020-04-09",
  "scene_id": 45997,
  "tags": [
    "Anal",
    "Anal Stretching",
    "Athletic",
    "Big Toy",
    "blond",
    "Blonde",
    "Dildo",
    "Femdom",
    "Fisting",
    "Gaping",
    "natural boobs",
    "Pain",
    "Pegging",
    "shaved",
    "spit",
    "Straight",
    "Strap On",
    "switch",
    "toned",
    "top",
    "white"
  ],
  "title": "\"Princess Daddy\" Riley Reyes and Michael Vegas"
}