{
  "collections": [
    "PegHim"
  ],
  "description": "Epic Blonde Babe, Ashley fires shows off her stunning pussy as she models her strap on and dances around the stripper pole, teasing Michael Vegas from behind the camera. She spreads her legs and begins to masturbate, holding a vibrator to her engorged wet pussy and jerking off the massive cock strapped to her. Michael can’t help himself and reaches from behind the camera to finger her cunt and even bury his bearded face into her bush. He whips out his big dick and plunges it into her slick pussy while she rubs her clit and sucks on the massive cock she’s wearing. He eventually has to hop on and ride her huge cock while she continues to masturbate with the vibrator. He twerks his bubble butt as he takes the length of the cock she wears. As she fucks him, she pulls out his still hard cock from his jockstrap and licks her pussy juice off of it. She then bends him over and alternates fucking his ass with the monster cock, and double fisting his hungry hole with her black latex gloved hands. She fucks him so hard he begins to leak, so she knows it’s time for him to hop back on and take the entire length of her dick, while she vibrates her pussy, along with his balls, and the strapped on cock itself, so Michael feels her cock vibrating inside his asshole. She then enthusiastically begins to jerk off his big hard cock until he cums. She bends him over to marvel at how quickly his miraculous hole tightens back up after being opened up so wide.",
  "directors": [],
  "models": [
    {
      "name": "Ashley Fires",
      "person_id": 20856
    },
    {
      "name": "Michael Vegas",
      "person_id": 47624
    }
  ],
  "release_date": "2020-04-10",
  "scene_id": 45991,
  "tags": [
    "Anal",
    "Anal Stretching",
    "big dick",
    "Big Toy",
    "blond",
    "Blonde",
    "Bush",
    "Domination",
    "Dominatrix",
    "Femdom",
    "Fisting",
    "Jockstrap",
    "Kinky",
    "Latex",
    "natural boobs",
    "Pegging",
    "shaved",
    "Straight",
    "Strap On",
    "switch",
    "toned",
    "top",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Ashley Fires and Michael Vegas"
}