{
  "collections": [
    "PegHim"
  ],
  "description": "Tiny redhead cutie Zoe Sparx enthusiastically models a massive uncut cock, along with a slutty fishnet outfit and braided pigtails for her butt slutt date with Michael Vegas. She begins by licking and sucking on his already puckered asshole, and jerking off his perfect cock. Then she begins to slide her black latex gloved fingers into his hole, warming it up with plenty of thick, creamy lube. She eventually gets her whole hand inside him, followed by her other hand. Once she is able to easily double fist him, she hops onto his back and begins to plunge her gloved fists in and out of his eager hole. Then she gets behind him and heaves the giant uncut cock attached to her tiny body into Michael’s hungry asshole. It slides in easily about half way, and Zoe pushes with all her might to get the huge uncut beast further into Michael’s already stretched hole. She pushes and pushes, until Michael eventually decides to get on top and ride her strapped on dick so he can push down on it with his full strength. He works his meaty ass on the giant dick, pushing and stretching further and further down, until the length of the massive dick finally disappears inside his body. As his ass hits her hips, and he feels the horse sized cock stretch him all the way open, he reaches for his now hard, engorged cock and jerks it off as he sprays hot cum all over the adorable red head’s face and open mouth.",
  "directors": [],
  "models": [
    {
      "name": "Michael Vegas",
      "person_id": 47624
    },
    {
      "name": "Zoe Sparx",
      "person_id": 62035
    }
  ],
  "release_date": "2020-04-13",
  "scene_id": 46005,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Anal Stretching",
    "Big Toy",
    "blond",
    "Dildo",
    "Femdom",
    "Fetish",
    "Fishnets",
    "Fisting",
    "Gaping",
    "gloves",
    "Latex",
    "Pegging",
    "Redhead",
    "Rimming",
    "shaved",
    "Small Tits",
    "Straight",
    "Strap On",
    "top",
    "white"
  ],
  "title": "Zoe Sparx and Michael Vegas"
}