{
  "collections": [
    "House of Taboo"
  ],
  "description": "Be prepared for today’s BDSM fetish lesbian thriller shot in Full HD. Meet our dominant green-eyed mistress from Kyrgyzstan Dominica Phoenix and her submissive little slut from Portugal, the skinny hot brunette, named Susana Melo. This movie takes place in a hidden wooden shed somewhere far of civilization and there’s definitely no escape possible. Susana looks afraid and anxious when the domina enters the empty room. She humiliates her with her looks and talks, even if she initially tells her over and over again, not to be afraid. Does that mean Susana will be free soon? Maybe there’s help on the way? Susana’s thoughts of freedom go up in smoke immediately when Dominica bounds her wrists with a rope attached to the ceiling. She slaps her twat and small tits, and starts attaching clothespins to her vag, skin, tits and nipples while slapping that pie over and over again. Dominica needs to teach her slave a lesson of who’s in charge here and gets her on her knees to fix her onto that bare mattress. She starts stretching that pussy, gapes her rosebud and widens her hole with her fingers. To discipline her even further, she now starts to slowly remove all the pins from her body while rubbing and fingering that wet fuck hole. Finally, that beautiful dominant goddess sits on the face of her slave and rubs her shaved pussy all over it while feeling her pierced tongue licking her clit back and forward. She grasps a handful of Susana’s pussy and squeezes it before gaping that slut wide open. The domina doesn’t even take off her purple garter corset or her hot black nylons when rubbing her knee deeply into the sub’s moist box while slapping those hard pink nipples over and over again. Come back in a few days and check out Part 2 of this amazing fetish BSDM thriller!",
  "directors": [],
  "models": [
    {
      "name": "Dominica Phoenix",
      "person_id": 43023
    },
    {
      "name": "Susana Melo",
      "person_id": 62686
    }
  ],
  "release_date": "2020-04-13",
  "scene_id": 46007,
  "tags": [
    "BDSM",
    "Brunette",
    "Clothespins",
    "Corset",
    "Discipline",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "Fetish",
    "Fingering",
    "Fishnets",
    "Gaping",
    "High Heels",
    "Kinky",
    "Lesbian",
    "LezDom",
    "Pain",
    "Pussy Eating",
    "Rope Bondage",
    "Sadism",
    "shaved",
    "Slapping",
    "Slave",
    "Small Tits",
    "Straight",
    "Sub",
    "Partner Studio"
  ],
  "title": "BDSM Fantasies - The Hidden Shed You Won't Escape, Part 1"
}