{
  "collections": [
    "Evolved Fights"
  ],
  "description": "Charlotte Sartre is Laughing at the fact that she is wrestling Billy Boston. She is small and got destroyed\nby Lance Hart but now that she is impregnated by Lances Power seed, she has a new set of skills and\npower to show off. Billy Boston thinks he just hasn’t been able to get a break with his match ups. Evolved\nFights has been throwing him to the wolves his previous pairing with the likes of Cheyenne Jewel and\nTori Avano who both have formal wrestling training. Billy is certain that because Charlotte is so\nsubmissive and small that he will finally be able to get his win and prove he’s not a worthless male. He\nshows off a little in round 2 which puts him in a good position for round 3. Round 3 is do it time for both\nwrestlers. No one wants this sex fight to go to the judges decision so they are going all out to inflict the\ncoveted OOTM (Orgams on the Mat). One wrestler fails completely and gets the utter humiliation. The\nwinner uses the loser for pain only. The loser must endure over the knee OTK Spanking and painful\ncamel clutch submission holds. The Winner Squats over the losers face as if they are sitting on a toilet\nand makes the loser like their asshole clean with their “toilet paper tongue” then gets Piss in the mouth\nwithout ever getting the chance to cum. Loser is cut from the roster, and will not return after this utterly\nhorrific loss and humiliation. Humiliation and Banished until proven worth of returning",
  "directors": [],
  "models": [
    {
      "name": "Billy Boston",
      "person_id": 61397
    },
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    }
  ],
  "release_date": "2020-08-19",
  "scene_id": 46046,
  "tags": [
    "black hair",
    "bottom",
    "brunet",
    "erotic wrestling",
    "Facesitting",
    "Humiliation",
    "mixed",
    "natural boobs",
    "OTK",
    "Pain",
    "Piss Play",
    "Pussy Eating",
    "Rimming",
    "sex fight",
    "shaved",
    "Spanking",
    "Straight",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "toned",
    "white",
    "Wrestling"
  ],
  "title": "Goth Girl Destroys man in Wrestling and Pisses on him for\nlosing"
}