{
  "collections": [
    "Evolved Fights"
  ],
  "description": "We have Two New wrestlers on our mats today. Nathan “Bonesaw” Bronson has decades of martial arts experience. He is taking Maya “Killsdick” Kendrick who is too humble to brag about her experience…or maybe she simply has none. Either way, Maya comes in with a black belt in shit talking. She is ready to take on Nathan and whoop his ass. Nathan is ready to fuck shit up.\n\nThe match is pretty one-sided for the first two rounds. Nathan dominated Maya easily. He is able to pin her and penetrate her while she struggles to get his dick out of her pussy. He submits her over and over again and gets his sexual penalties often. Maya knows this is a sex fight though. She is willing to sacrifice the first two rounds as “foreplay” so that Bonesaw is overly aroused in the third round, Maya’s strategy is to keep Nathan turned on, boner blazing from start to finish so that she can get him cumming fast in round three when orgasms on the mat are an instant victory. It’s a good plan\nif\nshe can get on top and have her way with him. This match displays power play, Pinning and Penetration, submissions, sexual penalties and utter domination.\n\nThe winner is called and gets to do whatever they want to the loser. the Loser is fucked good and hard with no mercy and the gets their face squirted on. The winner lifts the loser up and carries the loser of the mats.",
  "directors": [],
  "models": [
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Nathan Bronson",
      "person_id": 58786
    }
  ],
  "release_date": "2020-11-11",
  "scene_id": 46049,
  "tags": [
    "Blowjob",
    "Deepthroat",
    "Domination",
    "erotic wrestling",
    "Facefucking",
    "mixed",
    "PIV",
    "Redhead",
    "sex fight",
    "Straight",
    "Partner Studio",
    "top",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "All Natural red head female Gets Owned by male Athlete"
}