{
  "collections": [
    "Evolved Fights Lesbian Edition"
  ],
  "description": "Daisy “Lethal Legs” Ducati has some of the most dangerous legs in the game. Once she wraps those\nbad boys around you, it’s “Goodnight Irene!” Kelli Provocateur is laughing herself to the bank when she\nlooks at Daisy’s legs compared to her own. Kelli is Petite but she has some serious muscle belly on every\nmuscle group. Kelli is so confident that her muscles will dominate Daisy today that Kelli is putting her ass\non the line…literally. She is giving up anal today if she loses. Not to be shown up for anything, Daisy\nDucati also antes anal. Kelli has a very interesting strategy for this match and it’s so fucking crazy that it\nmight just work. Kelli knows that the only way Orgasms are instant victory is when they occur in the third\nround. Because Kelli is so fucking horny, she actually let’s Daisy make her cum in rounds one and two\nand Daisy legitimately does wear herself out working so hard to rip those orgams out of this little\nchocolate slut, Kelli. It all cums down to round 3, pun intended. One girl walks out of round 3 a horny\ncumdrunk mess, the other is wearing a strap on cock. Loser promised to give up the ass and that is just\nwhat happens. After a good hard fucking and trib fuck session, The winner picks up the loser and carries\nher off the mats.",
  "directors": [],
  "models": [
    {
      "name": "Cheyenne Jewel",
      "person_id": 22734
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Kelli Provocateur",
      "person_id": 39587
    }
  ],
  "release_date": "2020-04-24",
  "scene_id": 46052,
  "tags": [
    "Anal",
    "Black",
    "black hair",
    "Brunette",
    "Ebony",
    "erotic wrestling",
    "fake boobs",
    "Lesbian",
    "LezDom",
    "mixed",
    "Muscle",
    "muscular",
    "natural boobs",
    "Petite",
    "Pussy Eating",
    "Redhead",
    "sex fight",
    "shaped",
    "shaved",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "Two Ebony muscle babes have an erotic lesbian wrestling\nmatch"
}