{
  "collections": [
    "Evolved Fights Lesbian Edition"
  ],
  "description": "Please give a warm welcome to Sailor Luna. She’s a tall Blond all natural sweetheart from Sioux Falls.\nShe’s just a sweet darling and that makes for some really sex moments when we get to see her trapped\nunder the wicked goth girl, Charlotte Sartre. Sailor comes to us with ZERO wrestling experience. She is\nyour typical tall girl who thinks her size is going to win her the match today. She is so blown away by\nCharlotte’s tenacity that Sailor has nervous giggles. Charlotte takes no mercy on Sailor and shuts those\ngiggles up fast with hang gags ang pussy in the face. Sailor gets thrown around like a rag doll by the\npetite brunette goth girl. It’s pretty lop sided until we enter round 3 where orgasm on the mat can finish\nthe match in a blink of an eye. Sex fighting is a tricky business, you cum, you lose and if you have too\nmuch fun in the first two rounds that you get yourself turned on, it can be game over for you. The winner\ndrops the loser down to her feet and makes the loser worship her sweaty toes. Loser is strapon fucked in\nthe pussy and then in the asshole. The ass is fucked so hard it gapes open. Loser is thrown into a camel\nclutch submission hold, Her hair pulled, her chick torqued. The loser is in terrible pain while the winner is\nin pleasure riding the back of the loser and coming all over her.",
  "directors": [],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Sailor Luna",
      "person_id": 60911
    }
  ],
  "release_date": "2020-08-05",
  "scene_id": 46058,
  "tags": [
    "Anal",
    "black hair",
    "blond",
    "Blonde",
    "bottom",
    "Brunette",
    "Dildo",
    "erotic wrestling",
    "Facesitting",
    "Feet",
    "Gaping",
    "Lesbian",
    "natural boobs",
    "Pain",
    "Petite",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "toned",
    "white",
    "Wrestling"
  ],
  "title": "Goth Girl destroys Girl Next Door"
}