{
  "collections": [
    "Evolved Fights Lesbian Edition"
  ],
  "description": "Maya “killsdick” Kendrick is making her Lesbian wrestling Debut. She didn’t do so well in her mixed wrestling match against Nathan Bronson which can be found at\nevolvedfights.com\n. Maya thinks she just had bad luck with a man and that going against a female will be a walk in the park. Victoria Voxx on the other hand did very well with her mixed wrestling match against Will Havoc. She thinks that if she can beat a guy in wrestling then handling a female pornstar will be a no-brainer. From the first round, we see that the wrestling is one-sided. There is a clear dominant wrestler in this match however the greatest thing about Evolved Fights is its Sex fighting. You can still win by being the more sexually aggressive from the bottom without any wrestling ability and that’s what happens here today.\n\nMaya Kendrick is a horny redheaded porn star with eyes that say “come fuck me” She’s extremely seductive and seems to put love spells on her opponent. Victoria Voxxx is a horny collegiate athlete who just loves a sexy submissive female. Orgasms on the mat in round 3 are instant victory and Maya believes she can get Victoria to cum by allowing Victoria to get on top and grind on her. It looks like trouble for victoria. The winner wants to humiliate the loser badly. The winner goes directing to ass fucking the loser. Then takes the cock from the ass to the pussy. Loser is face sat and trib fucked until the winner gets her prize",
  "directors": [],
  "models": [
    {
      "name": "Maya Kendrick",
      "person_id": 60355
    },
    {
      "name": "Victoria Voxxx",
      "person_id": 61202
    }
  ],
  "release_date": "2020-12-23",
  "scene_id": 46063,
  "tags": [
    "bottom",
    "Domination",
    "Lesbian",
    "mixed",
    "sex fight",
    "Straight",
    "Partner Studio",
    "top",
    "Wrestling"
  ],
  "title": "Lesbian Wrestling with utter sexual domination"
}