{
  "collections": [
    "Kink Classics"
  ],
  "description": "In this 4-way Whipped Ass, originally shot in 2012, Homecoming queens Anikka Albrite and Ash Hollywood are the princesses of the academy, but bad girl Gia DiMarco and her friend Isis Love disagree. The two of them set out to steal the coveted homecoming queen crown by challenging Anikka and Ash to a fight. The bad girls win and subject the two princesses to a day filled with swirlies, hair pulling, humiliation and lesbian domination. Spanking, clothespins, ass worship, breath play, pussy licking, squirting and strap-on fucking are all included! They start in the school’s main hallway, where Anikka and Ash are stripped and spanked, and made to lick each other’s tight, pink assholes. They’re taken to the bathroom where they get their heads dunked in the toilet like filthy pig sluts, and they’re made to eat the bad girls’ wet slutty pussies. Back in the hallway, Anikka and Ash are clamped, bagged in plastic, and tied together with rope, while Gia and Isis use their bodies and two vibrators to cum repeatedly. The two little princesses are then further humiliated by choking down big strap-on dildos. They’re then fucked and destroyed, plowed in their stuck-up little cunts.",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Anikka Albrite",
      "person_id": 37246
    },
    {
      "name": "Ash Hollywood",
      "person_id": 25931
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    }
  ],
  "release_date": "2020-04-24",
  "scene_id": 46072,
  "tags": [
    "Blonde",
    "bottom",
    "Brunette",
    "Choking",
    "Clothespins",
    "Curvy",
    "Domination",
    "fake boobs",
    "Hair Pulling",
    "Humiliation",
    "Lesbian",
    "mixed",
    "natural boobs",
    "remastered",
    "shaped",
    "shaved",
    "slim",
    "Spanking",
    "Squirting",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Destroying The Homecoming Queen"
}