{
  "collections": [
    "KinkMen Classics"
  ],
  "description": "In this hot 30 Minutes of Torment, originally published in 2016, muscle god Jordan Boss is savaged in bondage with punching, slapping, flogging and electricity. First: THE WALL! After stripping out of his clothes, Jordan stands exposed against the wall as Sebastian quickly and skillfully binds his arms and legs. After a brief warm-up with punches and smacks, Jordan receives the cropping of a lifetime. Up next: THE PIT! Unforgiving black ropes bind Jordan in place as he stands exposed in the middle of the pit, awaiting more punishment. Sebastian flogs him mercilessly, raining hits down on Jordan’s muscular chest, abs and gorgeous meaty ass, before placing clover clamps on Jordan’s nipples and tying them overhead, effectively rendering him motionless as each smack of the flogger worsens the pull of the clamps on his nipples. Jordan continues to play the tough guy, but will being hoisted into the air and flogged finally break him? Finally: THE ELECTRIC CHAIR! Jordan has never played with electricity before, so Sebastian is even more motivated to show him the wide range of torments that electrical toys have to offer. Strapped in place, Jordan squirms and struggles as the electrodes on his thighs send shock waves up into his body – he can only watch in horror as Sebastian runs the violet wand across his legs and into his tight hole before zapping him repeatedly with the terrifying cattle prod. Finally, Jordan receives a brutal fucking from the Shockspot with the electrodes still strapped to his legs, and blows a huge load all over the machine as it pounds deep into his ass.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Jordan Boss",
      "person_id": 59434
    }
  ],
  "release_date": "2020-04-24",
  "scene_id": 46076,
  "tags": [
    "big dick",
    "Bondage",
    "brunet",
    "Cattle Prod",
    "Clover Clamps",
    "Flogging",
    "Gay",
    "Muscle",
    "muscular",
    "Punching",
    "remastered",
    "Slapping",
    "Straight",
    "switch",
    "Tattoo",
    "the pit",
    "the wall",
    "unshaved",
    "versatile",
    "Violet Wand",
    "white"
  ],
  "title": "Straight Hunk Jordan Boss Mercilessly Beaten and Made to Cum"
}