{
  "collections": [
    "House of Taboo"
  ],
  "description": "Are you ready for Part 2 of this amazing brand new BDSM lesbian bondage fetish XXX movie? Of course you are! Watch our stunning beautiful brunette dominatrix Dominica Phoenix using her shiny new sex object to make her dirty wild porn dreams come true. The green-eyed mistress from Kyrgyzstan already primed her submissive little slut from Portugal in Part 1 of this episode extraordinaire, and she is now about to show her who’s in charge by slapping that little shiny twat’s ass cheeks until they are all red. The film starts of with the domina walking into her hidden wooden room of taboo sex practices, inspecting her new young toy from all possible angles. Her slave Susana Melo is a red-haired skinny teen from Southern Europe. She is trapped and that’s exactly how she loves it and wants it. Bound hand and foot on a bare mattress on the floor in this empty hidden shed, she tries to escape, but simply has no chance to get away from what’s coming. And here she is! The strong dominant Dominica slides that large thick black sex dildo right into the helpless sub’s gaping shaved little pink pussy, then turns her over on her tummy to prepare Susana’s asshole with the vibrator and fingers. Dominica can’t wait to open up that little rosebud and making a huge gape out of that amazing moist butthole. Then the mistress gradually crams most of her hand in there, oh yes, it’s butthole fist fucking time! To fulfill her inner desires, she gets the tattooed submissive on her knees in doggie style for even more intensive deep fisting and also starts rubbing that clit massively. When she’s finally done giving Susana that total probing, as well as an intense pussy masturbation, she feeds her pussy-and-ass moistened hand to her slave, before walking out and leaving her alone, still strapped onto that mattress in the secret cabin of taboo fantasies! PART 1\nhttps://www.kink.com/shoot/46007",
  "directors": [],
  "models": [
    {
      "name": "Dominica Phoenix",
      "person_id": 43023
    },
    {
      "name": "Susana Melo",
      "person_id": 62686
    }
  ],
  "release_date": "2020-04-24",
  "scene_id": 46080,
  "tags": [
    "Anal Fisting",
    "BDSM",
    "Big Toy",
    "Bondage",
    "Brunette",
    "Dildo",
    "Dominatrix",
    "dungeon",
    "Fetish",
    "Fisting",
    "Gaping",
    "Lesbian",
    "LezDom",
    "masturbation",
    "Pussy Eating",
    "shaved",
    "Slapping",
    "Slave",
    "southern",
    "Straight",
    "Sub",
    "Partner Studio",
    "Vaginal Penetration",
    "Vibrator"
  ],
  "title": "BDSM Fantasies - The Hidden Shed You Won't Escape, Part 2"
}