{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Hey sweetie, welcome home. Your hot girlfriend, Lauren Phillips, has been waiting for you. She’s all dressed up in a beautiful sheer robe and has matte acrylic nails to match her perfectly plump, femme lips. She instructs you to sit down and relax, as her nails peel away the slit in her skirt to reveal her beautiful pussy. Just look at her gorgeous feminine body as she whispers delicious instructions for pleasuring yourself in your ear. Take your finger and trace your pussy, tease her, and do exactly what Lauren does… Then start rubbing that clit a little bit on the sides. Feel your clit in between your fingers and listen to the slow breathy moans that come from Lauren’s mouth. You can feel your pussy getting wet as you rub it a little more. You’re aching inside but she instructs you to slap your pussy and stop. Lauren wants to milk your orgasm as she pulls out a toy. Put the buzzing vibrator on your nipple and get it nice and hard. She knows you like it. Now move to your pussy, good girl. Feel the vibrations along your stomach all the way down to your clit. Do little circles and tease your pussy as you build that orgasm. Make yourself shake and beg. Feeling your pussy lips getting even more swollen. She wants you right at that tip where you can’t hold it in anymore and you just have to cum. And then you do, so hard while Lauren instructs you to hold the vibrator right on your clit. You feel it in your whole body. Now whose pussy is that? That’s right, your pussy belongs to Lauren.",
  "directors": [],
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2020-04-23",
  "scene_id": 46082,
  "tags": [
    "Big Tits",
    "Bondage",
    "Cuckolding",
    "Dildo",
    "fake boobs",
    "Femdom",
    "Fetish",
    "JOI",
    "Kinky",
    "masturbation",
    "Redhead",
    "shaved",
    "Solo Female",
    "Straight",
    "switch",
    "Partner Studio",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "KINKY JOI: Female Instruction"
}