{
  "collections": [
    "DDF Network"
  ],
  "description": "In Part 2 of our fetish lesbo movie, the British submissive Latex Lucy is again receiving some special treatment from her Hungarian Mistress Kayla Green. Brought to you in Full HD, our today’s BDSM XXX video will make you wanna jump right in and participate in that hardcore bondage and latex adventure. Watch domina Kayla enter the room with a very realistic-looking flesh-colored sex toy wrapped in her purple fingernails. That dildo will be sucked by Lucy while Kayla holds her by the head and gets her slave to do some deep throat on the huge cock with her red-lipsticked mouth. Then, she decides it’s time for Lucy to get her shaved pussy banged so she inserts that giant cock into her quim. The lesbian bondage action goes on as Lucy’s wrists are bound together and the zipper of her black latex bodysuit is opened so the dominatrix can access the pink twat of her slave! Watch kinky Kayla in this gothic style outfit when she plows her sub from behind during standing sex and spoon styles that cunt just moments before some doggy style action. Ultimately Lucy must once again bow before her mistress to show her obedience, the domina wants her to suck that dildo, and then lay her head on her inexorable goddess’s lap as a sign of her total surrender.",
  "directors": [],
  "models": [
    {
      "name": "Kayla Green",
      "person_id": 61516
    },
    {
      "name": "Latex Lucy",
      "person_id": 61550
    }
  ],
  "release_date": "2020-05-22",
  "scene_id": 46089,
  "tags": [
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "british",
    "Brunette",
    "Corset",
    "Dildo",
    "Dominatrix",
    "fake boobs",
    "Fetish",
    "Fishnets",
    "High Heels",
    "Kinky",
    "Latex",
    "Lesbian",
    "LezDom",
    "Nylons Stockings",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "Strap On",
    "Sub",
    "Tattoo",
    "Partner Studio",
    "Vaginal Penetration",
    "white",
    "Zipper"
  ],
  "title": "Indoor Sub - Latex Slave Chastised By Domina, Part 2"
}