{
  "collections": [
    "Device Bondage"
  ],
  "description": "Kink.com Presents FLOOD: Five of our hottest Device Bondage scenes that flood the floor with squirting orgasms. First up is the tight and perky blonde Lilly Lit. She is put in bondage that has her bent over in a doggy position to show off her magnificent ass. She is held in place with wooden stocks and steel to ensure proper suffering. Nipple clamps are added and then lots of weight, to which Lilly just smiles more. The Pope then adds three clothes pins to this whore's tongue and again we get a big smile. After some torment, he begins to fuck her pussy and she explodes with one squirting orgasm after the next. She is made to have squirting orgasms until her slutty pussy is drained of all of its juices. Next up is the stunning gorgeous new girl Janice Griffith. This slut uses giggles as a defense mechanism to deal with the pain which works fine for The Pope. She is bound to a wooden table with her legs spread wide open. Mouse traps are put on her nipples for pain and torment. Her feet are submitted to brutal punishment. Finally her tight pussy is hand fucked and over stimulated with the Hitatchi. This gets Janice soaking the floor with intense squirting orgasms. The beautiful girl next door true pain slut Ashley Lane is placed in the throne of suffering and locked into place with steel traps. Her head is covered and her sight is taken away. Another leather belt is added to immobilize her head, then the suffering begins again. Her body is subjected to multiple forms of brutal torment like caning and cropping. Finally the Hitatchi comes out and now her orgasms will be what drains from her in a squirting mess all over the floor. Next up is a special scene where Roxanne Rae is bound to a table and tormented by Daisy Ducati and The Pope. Roxanne is terrorized with extreme punishment. Daisy uses Roxanne's face as a squirting receptacle while The Pope brutalize the rest of her body. Next we have Roxanne on her back with her legs spread open and the brutality continues. It seems Daisy has spent a little too much time as a top and forgot her place, so she is taken down a notch and made to lick Roxanne's pussy. Roxanne is utterly fucking destroyed. Finally Bonnie Rotten is tormented in a straight jacket by Orlando. She is made to squirt and soak the floor. As a final rinse cycle don't miss out on The Wettening!",
  "directors": [],
  "models": [
    {
      "name": "Ashley Lane",
      "person_id": 52112
    },
    {
      "name": "Bonnie Rotten",
      "person_id": 39064
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    },
    {
      "name": "Janice Griffith",
      "person_id": 54140
    },
    {
      "name": "Lilly Lit",
      "person_id": 61378
    },
    {
      "name": "Roxanne Rae",
      "person_id": 50987
    }
  ],
  "release_date": "2020-04-30",
  "scene_id": 46088,
  "tags": [
    "BDSM",
    "black hair",
    "Blindfold",
    "Blonde",
    "Bondage",
    "bottom",
    "Brunette",
    "Brutal Punishment",
    "Caning",
    "Corporal Punishment",
    "Domination",
    "fake boobs",
    "Feet",
    "Fingering",
    "Handler",
    "Humiliation",
    "Latin",
    "Leather",
    "Leather Belt",
    "Metal Bondage",
    "mixed",
    "natural boobs",
    "Nipple Clamps",
    "Pain",
    "Pain Slut",
    "Petite",
    "Pierced Nipples",
    "Pussy Eating",
    "Redhead",
    "shaped",
    "shaved",
    "slim",
    "Squirting",
    "Stocks",
    "Straight",
    "Submission",
    "switch",
    "Tattoo",
    "The Pope",
    "toned",
    "top",
    "unshaved",
    "white"
  ],
  "title": "FLOOD: Submissive Women Bound in Metal and Made to Squirt"
}