{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Swarthy, goateed David Anthony, in rubber vest and jock, drags studman Dirk Caber, his wrists bound with rope, into his dungeon. David pushes Dirk down on the ground, Dirk’s ass, clad in rubber chaps, up in the air. David covers Dirk’s mouth with one hand and roughly slaps Dirk’s ass with the other until Dirk’s cheeks are bright red. David pushes Dirk’s wet mouth down on his cock, then bends Dirk over a sling, where he tongues and fingers Dirk’s abused ass, the two keeping up a constant stream of dirty talk, working each other up into a frenzy. David shoves a thick black dildo up Dirk’s slathered hole, stretching it out, before pushing his own hard tool up into his muscular bottom’s round red ass, only pulling out long enough to blast warm piss all over Dirk’s ass, then sprays even more into Dirk’s mouth. David manhandles Dirk into another position, on his back now in the sling, so he can look down at Dirk’s hard smooth chest, glistening with sweat, and handsome mug as he rough fucks him some more. Dirk guides his tied hands down to stroke his own cock as David hammers his still-red ass until Dirk’s load shoots out over his roped hands and hairy cut abs. This pushes David over the edge - he pulls out of Dirk’s tight hole just and blasts his own load all over Dirk’s cock.",
  "directors": [],
  "models": [
    {
      "name": "David Anthony",
      "person_id": 62531
    },
    {
      "name": "Dirk Caber",
      "person_id": 27341
    }
  ],
  "release_date": "2020-04-24",
  "scene_id": 46087,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "blond",
    "bottom",
    "Deepthroat",
    "Dildo",
    "dungeon",
    "Facefucking",
    "Fetish",
    "Gay",
    "Hairy",
    "jock",
    "Jockstrap",
    "Leather",
    "muscular",
    "Piss Play",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "smooth",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "VIOLATED: David Anthony and Dirk Caber"
}