{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "In his camouflage shorts, a shirtless Spencer Reed beckons over jockstrapped Cullen Cable. The stud plants his head on Spencer’s bulging shorts-and soon finds himself worshipping the muscle man’s thick throbber. The cock-hungry pig gets to work, deep-throating Spencer with ease as he looks up at the alpha male, gasping for air in between thrusts. Spencer whips his dick on Cullen’s face before fucking it again, spit strands dangling from his cock. Spencer spits into Cullen’s mouth and the hungry fucker pounces on his shaft again, barely having time to breathe. Now standing with his back to Spencer, Cullen gets his hands tightly tied to a Saint Andrew’s Cross. With his uncut and pierced juicy boner pulsing underneath, Cullen gets a long and intense flogging session that he takes like a man. Jacking his own big boner, Spencer uses a few floggers to bring the sub to the brink as yells fill the air. As his own muscles get sweatier, Spencer whips Cullen’s tight back and ass-which grow increasingly red. “C’mon boy, maintain yourself!” says Spencer as Cullen grits his teeth and grimaces, his face telling the story in revealing closeups that take us inside his cathartic journey. Their deep connection intensifies as Spencer kisses his captive again before getting back to work, finally untying him before Round 2. A shirtless and smiling Tony Buff stands ready with rope as Spencer brings Cullen to him. “You worked him over pretty good,” says Tony, who proceeds to tie the captive up from behind in a tight grip, the knots soon hanging from a suspension ring. As a rock-hard Spencer watches, Tony ties up Cullen’s left leg and also connects it to the ring, rendering the sub practically immobile as he’s left to balance on his right leg. With a vulnerable body to play with, the twisted duo attach 10 heavy clamps to the stud’s tight flesh: four on his chest, four on his stomach and one on each of his big biceps. The two pinch his flesh, pat his chest and flick the clamps, his body a playground for their abuse. Tony takes out his huge cock and strokes it, then eats and fingers Cullen’s hole before pinching his pec flesh some more, eliciting a “Yes sir!” from his captive after whispering to him. The two remove the clamps to reveal red welts all over Cullen’s body-which they proceed to finger, causing him to unleash more verbal anguish. Tony offers his own forearm for temporary relief (“Bite hard!”) before Spencer fucks the bottom. Veins burst from Cullen’s forehead, neck and shoulders as he grunts and groans. His other leg finally free, he’s turned around and rammed by Tony. Spencer spreads the bottom’s cheeks with his man hands, opening the hole up for Tony. The two tops then coat Cullen’s cheeks with cum as their own sweaty bodies shine on camera, the defined line between Spencer’s giant pecs shimmering on screen. From the movie “Bound, Flogged and Fisted” A cast interview follows the scene",
  "directors": [],
  "models": [
    {
      "name": "Cullen Cable",
      "person_id": 62529
    },
    {
      "name": "Spencer Reed",
      "person_id": 19086
    },
    {
      "name": "Tony Buff",
      "person_id": 62499
    }
  ],
  "release_date": "2020-05-01",
  "scene_id": 46137,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Deepthroat",
    "dungeon",
    "Facefucking",
    "Fetish",
    "Flogging",
    "Forceps Clamps",
    "Gay",
    "Muscle",
    "muscular",
    "Nipple Clamps",
    "Pain",
    "Predicament Bondage",
    "Rope Bondage",
    "shaved",
    "spit",
    "Stud",
    "Sub",
    "Suspension",
    "Tattoo",
    "Threesome",
    "white"
  ],
  "title": "Cullen Cable gets Bound Flogged & Fucked by Spencer Reed and Tony Buff"
}