{
  "collections": [
    "House of Taboo"
  ],
  "description": "Welcome back to Part 2 of our fetish XXX Full HD lesbian roleplay with Blanche and Lucia Love. It’s all about how to tame your maid and the 5’8” blonde Romanian mistress shows you how it’s done. Blanche straps her submissive’s wrists to her ankles with a purple rope before probing her box for some fisting. That tight shaved young pussy needs some insertion and this is when she starts fingering her cunny while using a Magic Wand vibrator to stimulate her clit. Then she crams a red dildo sex toy between Lucia’s glossy lips and makes her lube that stick for her butthole. Bend to the side, the domina starts penetrating this cornhole in spoon position before shifting her into doggy style for an even bigger flesh-colored plastic cock. The crams that asshole with this sex toy and makes Lucia wetting another one while still inserting that cock into her gaping anus. Finally she starts some double penetration, one flesh-colored latex penis up her ass and her fingers in that maid’s pussy, almost fisting her to gain respect. This excessive housekeeping lesson ends with Lucia licking her domina’s pussy and some tits sucking before she is left alone and think about what she has done. Better behave next time!",
  "directors": [],
  "models": [
    {
      "name": "Blanche",
      "person_id": 27098
    },
    {
      "name": "Lucia Love",
      "person_id": 58209
    }
  ],
  "release_date": "2020-05-08",
  "scene_id": 46140,
  "tags": [
    "Blonde",
    "Bondage",
    "Brunette",
    "Dildo",
    "Discipline",
    "domestic",
    "Domination",
    "Dominatrix",
    "Double Penetration",
    "Fetish",
    "Fingering",
    "Fisting",
    "Gaping",
    "Hair Pulling",
    "High Heels",
    "Hitachi",
    "Latex",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nylons Stockings",
    "Pain",
    "Pussy Eating",
    "Rope Bondage",
    "shaved",
    "Spanking",
    "Straight",
    "Partner Studio",
    "uniform",
    "Vaginal Fisting",
    "Vibrator",
    "white"
  ],
  "title": "Vacuum Bondage - Mistress Tames Her Maid During Housekeeping, Part 2"
}