{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Your wife, Sinn Sage, is hot and ready for you to come home from a long day at work, but instead she receives a text from you, saying you will be late again! Tired of waiting, your wife calls your neighbor, Drake ManO’War, to come over and keep her company. She decides to record every steamy moment with her and Drake so you, her loser husband, can see how she really likes to get fucked. He’s cooler and more handsome than you, and his dick is bigger and better than yours. After a hot make-out session, Drake pulls Sinn’s panties aside and starts rubbing her pink pussy, licking her up and down then sliding his fingers inside. Sinn won’t let you forget every minute of pleasure and how much better he is than you at eating pussy. Drake then slides his long tongue up and down her voluptuous ass before she takes Drake’s big cock and shoves it down her throat. She sucks and licks his hard dick while reminding you how worthless and pathetic yours is. Drake then takes the camera in his hands so you the cuckold can get a POV of what you are missing out on. After a hard cock sucking session, Sinn makes Drake shove his big cock in her hot wet pussy. Sinn takes Drake’s big cock while telling you how good Drake’s dick is. Drake pounds her pussy and makes Sinn cum so good even you can feel it through the screen. Your wife is so horny and hot, she asks drake to fuck her hard and dump his hot load inside of her. You get the perfect view of the neighbors big load dripping from your wife’s swollen pussy. With a big cock as a neighbor there are no lonely nights for your horny housewife.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Drake ManO'War",
      "person_id": 62906
    },
    {
      "name": "Sinn Sage",
      "person_id": 19154
    }
  ],
  "release_date": "2020-05-22",
  "scene_id": 46156,
  "tags": [
    "Blowjob",
    "Brunette",
    "Creampie",
    "Cuckolding",
    "Deepthroat",
    "Facefucking",
    "Femdom",
    "Fingering",
    "natural boobs",
    "POV",
    "Pussy Eating",
    "Rimming",
    "Straight",
    "Tattoo",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Cuck Tape: Your Wife and Your Neighbor Make a Porno"
}