{
  "collections": [
    "Ashley Fires SciFi Dreamgirls"
  ],
  "description": "Having her government funding taken away, Dr. Fires has tured to taking on other projects from the civilian sector to fund her own research. The very well paying ones of course. The techs roll in the box and unload it off the dolly. Dr. Fires opens it to find her new project. A very important client from Brazil has sent her his personal service android. It seems that he has fallen in love with her but she is not programmed for sexual purposes. And Dr. Fires is known for her sophisticated sexual programs. Her new client knows if he wants his service robot to be the lover he requires then Dr. Fires is the only choice. She commands the android to power on and stand. No response. She then realizes the robot is not programmed for English. Remembering she learned some Portuguese many years ago from her assistant turned lover. In her best Portuguese she commands the android to stand. Finally, the robot obeys. She looks over her new project head to toe.\n\nShe is impressed with the quality of this android. Well built and very very life like. She takes her time to really inspect the frozen robot. Feeling her perfect breasts, tone legs, and her pussy. Well everything I need to upgrade is there. She smiles in anticipation of programming such a sexy creature. She commands the robot to move and no response. Well first things first. Let’s get your language settings changed. After a few clicks on the computer she orders the robot to lay down on the table. The robot yes master in Portuguese and moves to the table and starts to left it up and down. “Well this is going to be a bit more difficult then I thought but I am always up for the challenge.” Dr. Fires thought to herself. After some trial and errors they finally begin the process of programming the android for sexual pleasures. Then on to the field testing. Dr. Fires teaches the brazilin beauty how to receive pleasure by giving her many orgasms. Then Dr. Fires moves on to seeing how the robot does at giving her master pleasure. After Dr. Fires third orgasm she was surprised on how well the programming took to this particular robot. Dr. Fires was fascinated by this android. She then commands her to go back in her box and thought before she sends her home to her master she has to make a replica of her first.",
  "directors": [],
  "models": [
    {
      "name": "Ashley Fires",
      "person_id": 20856
    },
    {
      "name": "Ashley Whitfield",
      "person_id": 62886
    }
  ],
  "release_date": "2020-05-05",
  "scene_id": 46151,
  "tags": [
    "Big Tits",
    "Blonde",
    "Brunette",
    "fake boobs",
    "Fingering",
    "Hitachi",
    "Lesbian",
    "master",
    "natural boobs",
    "Pussy Eating",
    "Straight",
    "switch",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Ashley Fires SciFi Dreamgirls Episode: Special Delivery"
}