{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Mistress Gia DiMarco is enjoying her time at home by reading a magazine and listening to music. A bold Peeping Tom, Anthony Cruz, snoops on her through a window and decides to take the questionable action of walking into her home to snap some more pictures. What a creep! To his surprise, Gia knows exactly what he is up to. He’s caught red-handed and Gia puts him in handcuffs. Anthony is now at the mercy of his mistress, who’s in an awfully generous mood this evening. Gia decides to use his body for all her sexual needs while making him record the session on her cellphone. She threatens to release the video of his sick perverted acts to his employers and family members if he doesn’t do exactly as she says. Seated in a chair, Anthony shoots a POV movie of Mistress Gia teasing his cock with her talented mouth. He’s helpless against her. Her beauty and sexual prowess take over any sense of self he snuck into her house with. After a mind blowing blowjob, Gia throws Anthony on the floor, because before he gets an ounce of satisfaction, Gia needs to repeatedly cum on his face. The extended facesitting session includes Gia grinding her perfect pussy on Anthony’s mouth. Gia’s camera, precisely placed on a tripod, captures her ass bouncing up and down, smothering him in between thrusting her cunt against his mouth. Just when you think she’s had enough, she flips over for more pussy and ass worship, and brings in her magic wand to add even more intense ass licking and vibrator orgasms to the multiple orgasmic position. Finally, the insatiable Mistress Gia demands to use Anthony’s cock for even more hot orgasms. She demands Anthony hold the camera again to get the best angels of his cock pounding in and out of her cunt. This raw sexual moment includes even more orgasms. Once Gia has come enough times for the evening. She milks Anthony’s cock with her perfect stockinged feet. She demands his come and he blows his load all over her stockings. We get the feeling that Mistress DiMarco will use this sex tape to her advantage in the future, using Anthony to satisfy her every sexual whim.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Anthony Cruz",
      "person_id": 26675
    },
    {
      "name": "Gia DiMarco",
      "person_id": 21436
    }
  ],
  "release_date": "2020-07-17",
  "scene_id": 46158,
  "tags": [
    "Blowjob",
    "bottom",
    "Brunette",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "footjob",
    "Orgasm Denial",
    "POV",
    "shaved",
    "Smothering",
    "Straight",
    "Tattoo",
    "toned",
    "Twink",
    "Vibrator",
    "white"
  ],
  "title": "The Snooper: Gia DiMarco Uses Peeping Tom As Her Sex Toy!"
}