{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Goddess Daisy Ducati teases her poor little beta cuck, Christian Wilde, as he sits watching remotely through his lap top while locked in chastity. Alone, he fantasizes about what it would be like to be able to please the sexy and powerful Daisy Ducati. The teasing goes on for weeks, driving Christian wild. Daisy taunts and teases him, humiliating him over and over again for not being able to please her. She then ramps it up and brings in Chazz Razz’s big pleasing cock to cuckold her desperate slave. She continues to humiliate Christian for being useless to her. Now that Daisy has Chazz’s big cock, she is about to show Christian how she likes to get fucked. Daisy starts with riding Chazz’s face, smothering him with her wet pussy and hot ass. Daisy plays to the camera so Christian can get a good look at how Chazz licks her sweet wet pussy up and down. Beta cuck Christian gets hot and bothered watching Chazz’s big dick slide into Daisy’s hot wet pussy, he can’t help but to rub on his cock as it gets harder with every stroke. It turns Daisy on to think about Christian sitting there and watching Chazz’s hard cock go in and out of her wet pussy, giving her pleasure while she tells him how good it feels. Daisy then rides Chazz nice and hard until she erupts with squirting orgasms. Poor Christian can only stroke his cock as he takes direction from Daisy. Daisy then sucks on Chazz’s dick before shoving his cock back in, letting him cum inside of her, and she shows her creampie to the webcam. Christian sits there alone with his messy load and is ordered back into chastity until Daisy decides to let him free.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Chazz Razz",
      "person_id": 62933
    },
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Daisy Ducati",
      "person_id": 50939
    }
  ],
  "release_date": "2020-06-05",
  "scene_id": 46157,
  "tags": [
    "Athletic",
    "big dick",
    "blond",
    "Creampie",
    "Cuckolding",
    "Femdom",
    "mixed",
    "natural boobs",
    "Redhead",
    "shaped",
    "Slave",
    "Smothering",
    "Squirting",
    "Straight",
    "switch",
    "Tattoo",
    "toned",
    "top",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Beta Cuck"
}