{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Hello Dear, welcome home. Your beautiful wife Dresden has been waiting for you all day. She’s dressed to the nines in a beautiful lingerie set and looks like a pinup model straight from one of your filthy magazines. Unfortunately for you, your frequent work schedule has left her quite bored, neglected, and just plain pent up. Let’s just say your gorgeous wife isn’t going to sit around and waste her perfect pussy on not getting fucked. That’s why she’s found a solution-The Husband 2000, a state of the art fucking machine that ensures she gets hers. She reveals a shiny, robotic contraption that is topped with a purple dildo. The dildo mounted out the end slides perfectly into Dresden’s dripping wet cunt. She’s not the only thing turned on. As the machine gains power it also increases in speed and the purple dildo pounds her gorgeous pussy over and over again while you watch. You didn’t think your long hours at the office were going to lead to this did you? Well that’s just what happens when you lose track of your wife’s needs. When you leave a woman to fend for herself she has no choice but to find someone, or something to fuck her nice and deep. You certainly aren’t doing the work. And now that you’re here you just get to watch. No touching, no fucking, no nothing. You’ve lost your privileges and now you get to sit and watch her get pounded over and over and over again. Watch as she puts a fully charged vibrator on her throbbing clit while that thick dildo plunges her deep in her pussy hole. You never fucked her so good did you? No you were only thinking about yourself. Well now it’s finally her turn! She makes herself cum over and over again and with each orgasm her pussy clamps down on that shiny, thrusting, fucking machine. That could have been your cock getting squeezed between those gorgeous, wet pussy lips. But no, now she’s found something better. And there’s no going back.",
  "directors": [],
  "models": [
    {
      "name": "Dresden",
      "person_id": 58978
    }
  ],
  "release_date": "2020-05-07",
  "scene_id": 46161,
  "tags": [
    "Blonde",
    "Bondage",
    "bottom",
    "Cuckolding",
    "Dildo",
    "Femdom",
    "Fetish",
    "JOI",
    "Kinky",
    "Lingerie",
    "natural boobs",
    "shaved",
    "Straight",
    "Partner Studio",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "KINKY JOI: The Husband 2000"
}