{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "While you were away, your wife, Ryan Keely, decided to work on a gift for you. Not only does she get impregnated by her hot boxing coach Stirling Cooper, she records it so you truly understand how inadequate you and your penis are. Stirling is tall, strong, and masculine, and more importantly he knows exactly how to please your wife. Watch while a masterful pussy licker makes your wife come over and over again. He stretches her out with his big fingers making her wetter than you ever could!\n\nStirling manhandles your wife in ways you would never dare. To show you what you are missing out on, he makes sure to record the POV angles of your wife deepthroating his huge cock. Your wife begs for Stirling to fuck her wet pussy before he fucks her doggy style, on her back, and in ways you never even dreamed she could be fucked. She has multiple orgasms before climbing on top of him and riding him hard, spreading her glorious ass to give you a perfect view of what she’s denying you. After your wife cums so many times you lose count, she begs for Stirling to squirt his hot load inside of her pussy. His load is so huge, she reaches inside, shows you a little bit of his potent splooge before she wipes it on your pillow. You feel lucky to play any part in this conception and will take pleasure in knowing that the child you raise is a result of the pleasure a better man gave your wife.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Ryan Keely",
      "person_id": 15370
    },
    {
      "name": "Stirling Cooper",
      "person_id": 61419
    }
  ],
  "release_date": "2020-06-19",
  "scene_id": 46164,
  "tags": [
    "Athletic",
    "Brunette",
    "Cuckolding",
    "Femdom",
    "foreskin",
    "Latinx",
    "multiple orgasms",
    "natural boobs",
    "other hair color",
    "POV",
    "slim",
    "Straight",
    "top",
    "white"
  ],
  "title": "The Conception: Your Wife Breeds With Another Man"
}