{
  "collections": [
    "DDF Network"
  ],
  "description": "Helpless naked slave Linda Sweet is cuffed in place on a special sofa and nervously awaits the arrival of her cruel mistress Billie Star in this exercise in extreme sex and lesbian bondage, all presented to you in a Full HD fetish XXX video by the kink erotica masters at DDF Productions! Handcuffed and ankle-cuffed so she can’t escape and will be totally controlled, the nude innocent-looking young Czech redhead has her mouth kept open by a spreader bar. The girl feels her hair tugged mercilessly by her dominatrix who then whips her butt with a black flogger. But inventive Czech dominatrix Mistress Billie also gives Linda a spanking, even while the handle of the flogger is stuck in Linda’s crack. The spreader bar is removed from Linda’s face so that she can lick the slit of her goddess, who sits haughtily over her head while smoking a cigarette. Mistress Billie then blows smoke in Linda’s face, before the final degradation of shaved pussy whipping is applied, relentless double penetration in her young veeg and butthole with silver bullet dildo and flogger handle even while biting the slave’s snatch, and then some high heel worship to keep this newbie sub totally up to par with her oral skills!",
  "directors": [],
  "models": [
    {
      "name": "Billie Star",
      "person_id": 60461
    },
    {
      "name": "Linda Sweet",
      "person_id": 62792
    }
  ],
  "release_date": "2020-05-15",
  "scene_id": 46191,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Brunette",
    "Curvy",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Double Penetration",
    "Facesitting",
    "Facial",
    "Femdom",
    "Fetish",
    "Flogging",
    "High Heels",
    "Lesbian",
    "LezDom",
    "mmf",
    "Mouth Spreader",
    "natural boobs",
    "Pussy Eating",
    "Redhead",
    "shaved",
    "Slave",
    "slim",
    "Smoking",
    "Spanking",
    "Straight",
    "Sub",
    "Partner Studio",
    "Threesome",
    "uniform",
    "Vibrator",
    "Whipping",
    "white"
  ],
  "title": "Cuffed and Controlled"
}