{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "A.J. and her son T.J. have come to the cemetery to pay their respects to Tommy. Now that Tommy is gone, T.J. wants to know who his real father is, and that’s where our story begins. Flashback: It was the 70s. Tommy Toscano and A.J. Applegate own a small club in the Valley. Tommy is happy with their situation, but A.J. has dreams of being the Studio 54 of Van Nuys. When Moe Johnson comes in to interview for a bartender’s position, something clicks. Moe is a man with vision and enthusiasm, and A.J. doesn’t care what Tommy thinks, he’s hired. Its obvious that Moe and A.J. are hitting it off, and there’s nothing that Tommy can do about it. He’s made to stand back and watch as Moe takes charge, spanking A.J.’s beautiful round ass. She makes Tommy kneel behind her and worship her shoes and feet as she and Moe make out. When Moe pulls down his pants and reveals why they call him The Monster, A.J. gets excited and Tommy starts to panic. She licks up and down the shaft of Moe’s giant cock before taking as much as she can in her mouth. She strokes and sucks and Tommy has to watch. How far is this going to go? Moe takes charge, smacking A.J.’s luscious ass with his huge cock. She has Tommy help her take her shoes and jeans off, then humiliates him further by bending over in front of Moe so he can fuck her tight little pussy. (Part 1 of 2)",
  "directors": [],
  "models": [
    {
      "name": "AJ Applegate",
      "person_id": 45997
    },
    {
      "name": "Moe Johnson",
      "person_id": 55839
    },
    {
      "name": "Tommy Toscano",
      "person_id": 61205
    }
  ],
  "release_date": "2020-05-21",
  "scene_id": 46219,
  "tags": [
    "bbc",
    "Big Ass",
    "big dick",
    "Bisexual",
    "Black",
    "black hair",
    "Blonde",
    "Blowjob",
    "brunet",
    "Cuckolding",
    "Feet",
    "Interracial",
    "muscular",
    "natural boobs",
    "shaved",
    "Spanking",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "Threesome",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Disco Cuck (Part 1 of 2)"
}