{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Muscle God Spencer Reed, booted and harnessed, drags a bound, half-naked Adam Knox into a warehouse and ties him bent over an oil drum. Spencer pulls out his thick meat and marks his prey, blasting a geyser of hot piss all over Adam, before shoving his cock into the bottom’s mouth. Adam chokes on the girth, trying to please his top, his spit dripping off the man’s meat. Spencer turns to his captive’s upturned ass, slapping and fingering it until the bottom’s smooth cheeks turn red. Spencer taps a bamboo cane against Adam’s ass, thighs, and balls until his skin grows flushed, Adam crying out as the cane leaves its marks, and pulling hard against the ropes, seeking escape. The muscle top relishes the young man’s helpless body, getting Adam to count out the punishing strokes from a new bentwood cane. Adam bears up under the assault, impressing his top, who gets a thick finger, and then his impatient cock into Adam’s abused hole, grunting as he gives Adam his hard-earned reward, taking pleasure in his captive’s tight, jockstrapped ass. Then Spencer pulls Adam off the drum and guides him back onto his meat, Adam’s cock bouncing, his sack pulled tight by a steel ballstretcher. His hands still bound, Adam works the ropes until he can jerk himself with one hand, before Spencer pushes him down on the ground and covers Adam’s hard, smooth body with thick wads of cum. Gentler now, Spencer holds Adam against his massive harnessed chest and allows Adam release, Adam still gazing up at Spencer for approval as he shoots his load all over his own chest.",
  "directors": [],
  "models": [
    {
      "name": "Adam Knox",
      "person_id": 22095
    },
    {
      "name": "Spencer Reed",
      "person_id": 19086
    }
  ],
  "release_date": "2020-05-22",
  "scene_id": 46225,
  "tags": [
    "Anal",
    "BDSM",
    "big dick",
    "body builder",
    "Bondage",
    "bottom",
    "brunet",
    "Caning",
    "Crying",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Fetish",
    "Fingering",
    "Gay",
    "Jockstrap",
    "Muscle",
    "muscular",
    "Pain",
    "Piss Play",
    "Rimming",
    "Rough Sex",
    "shaved",
    "Slapping",
    "smooth",
    "spit",
    "Tattoo",
    "top",
    "unshaved",
    "white"
  ],
  "title": "HARDCORE:Adam Knox and Spencer Reed"
}