{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Just look at you, sitting there. Mimosa can tell that you’re just waiting for her to give you a little attention. Well you’re going to have to prove that you’re even worth being in the same room with her. You sit there with nothing to say, nothing of value, taking up space and breathing her air. So now you’re going to have to work for what you desire. “Shut your mouth, stay quiet, and put your hand on your disgusting little cock.” Do not stroke it at all. You see Mimosa has a proposition for you. You see if you can handle holding your breath long enough while being smothered by her incredible ass, she might let you worship her feet. Mimosa turns around to show you her big, juicy, bubbly ass meat. She twerks her cheeks and then gets ready to sink her giant, gorgeous booty down on your stupid face. The scent of her pussy and ass swirl together to create a nice aroma for you to shove your face into. Now that you’re underneath her, she want you to put your hand on your tiny little cock and start stroking it. You wish had a cock big enough to fill her dripping pussy and tight asshole with but no, what you have going on is hardly big enough to fill your hand. After a while Mimosa changes her tune. She’s so tired of wearing her heels and begins removing her shoes from her sweaty, stocking clad feet. She starts to rip her fishnets to release each little toe. She shows you her arches, her soles, they’re just dying to be rubbed. Have you ever had your hands on feet this lovely? She pushes her feet together and wiggles her toes right it your face, putting toes in your nose. She instructs you to keep touching your pathetic little cock. Next to her foot it just looks like another one of her toes. She tells you to grab your balls, stroke your cock, and feel her foot going up and down until you cum all over her perfect feet. And you better enjoy it because after that she’s going to make you lick all that cum off of her toes.",
  "directors": [],
  "models": [
    {
      "name": "Mimosa",
      "person_id": 57584
    }
  ],
  "release_date": "2020-05-29",
  "scene_id": 46238,
  "tags": [
    "Bondage",
    "Cuckolding",
    "Curvy",
    "Feet",
    "Femdom",
    "Fetish",
    "Fishnets",
    "Foot Worship",
    "High Heels",
    "JOI",
    "Kinky",
    "Lingerie",
    "mixed",
    "natural boobs",
    "Nylons Stockings",
    "Pierced Pussy",
    "POV",
    "Redhead",
    "shaved",
    "Straight",
    "switch",
    "Tattoo",
    "Partner Studio"
  ],
  "title": "KINKY JOI: Mimosa's Phenomenal Ass"
}