{
  "collections": [
    "Man Up Films"
  ],
  "description": "Evil Ruckus is at home doing villain stuff. Specifically, he’s making a list of evil stuff to do when Super Draven confronts him. Super Draven is a very powerful hero with superhuman strength. He confidently grabs Ruckus and slams him against a wall.\n\nRuckus pulls out a magic pocket watch which he can use to subdue even the strongest heroes. Super Draven tries to resist, but he’s quickly subdued by the villain’s suggestions.\n\nFirst Ruckus tests his power by making Super Draven stand on one foot and act like a puppy. He snaps the hero in and out so he can really feel the power. Ruckus tells Super Draven that every time he hears “Cock Sucker” he’ll immediately suck the nearest cock to him.\n\nRuckus enjoys a sloppy blow job from the hero, snapping him in and out while he’s on his knees with a mouth full of big dick. Finally he cums in his mouth then snaps Super Draven out so he is aware and conscious his mouth full of the villain’s cum.\n\nHe sends the hero away after he gives him one final suggestion.\n\nRuckus is at home again, now working on his evil calendar when he sees on his calendar that it’s his day to fuck Super Draven in the ass. Right then, the muscle bound hero shows up fully nude, ready to get filled with dick.\n\nRuckus revels in fucking the powerful god-like hero in the ass right over his dining room table. He snaps Super Draven in and out just to watch him squirt while he’s full of villain dick.\n\nRuckus fills the hero’s ass with cum, then sends him away with on final suggestion.",
  "directors": [],
  "models": [
    {
      "name": "Draven Navarro",
      "person_id": 59640
    },
    {
      "name": "Ruckus",
      "person_id": 48209
    }
  ],
  "release_date": "2020-05-27",
  "scene_id": 46234,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "big dick",
    "Blowjob",
    "body builder",
    "bottom",
    "brunet",
    "Facefucking",
    "Gay",
    "Gay Superhero",
    "Latex",
    "mixed",
    "Muscle",
    "switch",
    "Tattoo",
    "Partner Studio",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Ruckus vs Super Draven RAW"
}