{
  "collections": [
    "House of Taboo"
  ],
  "description": "Surprise, surprise! In today’s hardcore fetish episode of DDF Network’s House of Taboo, Mugur comes up with a great surprise idea for his buddy Antonio. He delivers a wooden box to his living room and his curious friend is asked to guess what’s in it. Mugur clears up the mystery and opens the box. Inside is a human doll from Russia named Lola Taylor aka Baby L.This young blonde doll-like face makes the two lads wanna try out that human sex toy immediately and so they arrange her movable arms and hands to form them around their dicks. Mugur opens up her mouth and crams it with his meat while Antonio checks out what’s underneath that doll dress and starts fingering her hairy pussy. The doll seems to enjoy that special submissive treatment and blinks with her green eyes every here and there. She is a slim beauty with high heels and a very gorgeous dress, which is soon taken off by the two studs. Antonio inserts another sex toy into the doll’s asshole and lubes up her quim before cramming her doll box with his giant cock. They shift her around from cowgirl to reverse cowgirl and even give her some double penetration and leave her with a gaping pussy and anal gape. Finally, both dicks blow their jizz all over the doll face and use her fingers to feed her their sperm into the doll mouth.",
  "directors": [],
  "models": [
    {
      "name": "Antonio Ross",
      "person_id": 33540
    },
    {
      "name": "Lola",
      "person_id": 51468
    },
    {
      "name": "Mugur",
      "person_id": 33526
    }
  ],
  "release_date": "2020-05-29",
  "scene_id": 46242,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Blonde",
    "Blowjob",
    "brunet",
    "buttplug",
    "Clothespins",
    "Corset",
    "Deepthroat",
    "Double Penetration",
    "Facefucking",
    "Fetish",
    "Fingering",
    "foreskin",
    "Gaping",
    "Hairy",
    "High Heels",
    "Kinky",
    "Lingerie",
    "natural boobs",
    "Nipple Clamps",
    "slim",
    "Straight",
    "Partner Studio",
    "Threesome",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Submissive Surprise - Two Guys Penetrate Young Doll"
}