{
  "collections": [
    "Ashley Fires SciFi Dreamgirls"
  ],
  "description": "This was her first job interview with such a prominent scientist. Just out of MIT and already, she had an opportunity to work for one of the most respected scientists in the field of Applied Robotics. Dr. Fires had been her inspiration for studying robotics. Reading all of her published journals, research papers, books, and attending all of her lectures. When she emailed her resume for the position, she never thought someone so fresh out of college would even be considered.\n\nEven though it was just a Lab Assistant Internship, she would still be working directly for the famous Dr. Fires. Who truth be told had become a bit of a recluse over the past few years. There were rumors she had gone crazy while working on a Top Secret government project then she disappeared. But that’s what happens to geniuses, I guess. So going in for her interview she was a bit nervous to say the least. Actually, meeting her idol in person was almost as good as getting the internship would be. She was early and dressed in her best outfit when she was introduced to the great Dr. Fires. Kim starts to ramble on about her adoration for Dr. Fires before she was cut off and told to be seated.\n\nObviously the Doctor was a busy woman and did not have time for such pleasantries. The doctor looked over her resume and said she was impressed. Now the question was would she be paid for her internship and Dr. Fires instructs her to look at the ipad and all of her questions would be answered. She looked at the Ipad and within moments something very strange started happening. Dr. Fires told her to watch closely and to repeat the words on the screen. Something was being projected on to her. She kept saying “OBEY” over and over. And then she was out. Blank. “HOW MAY I SERVE YOU MASTER?” Dr. Fires smiles and asks her a few questions. Her new intern responses all are monotone. Dr. Fires knew she was under her control.\n\nShe has her stand and take off her clothes. She poses and plays with her like a Dirty Sex Doll. She commands her to play with herself. She also kisses her and touches her all over. She then orders her to put on her clothes and leave but to be back at 9 am tomorrow. This is the first time Dr. Fires was able to successfully upload into a human subject her new brain control program, which pleases the doctor very much. It’s one thing to have control over robots but quite another to be able to have the same control over a human.",
  "directors": [],
  "models": [
    {
      "name": "Amy",
      "person_id": 62887
    },
    {
      "name": "Ashley Fires",
      "person_id": 20856
    }
  ],
  "release_date": "2020-06-02",
  "scene_id": 46254,
  "tags": [
    "Asian",
    "Blonde",
    "Doctor",
    "Fetish",
    "Fingering",
    "Hitachi",
    "Kinky",
    "Lesbian",
    "LezDom",
    "master",
    "masturbation",
    "natural boobs",
    "Nylons Stockings",
    "Straight",
    "switch",
    "toned",
    "top",
    "Vibrator",
    "white"
  ],
  "title": "Ashley Fires SciFi Dreamgirls Episode:The Unsuspecting Lab Assistant"
}