{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "Sister Kiki brings Charlotte into the chapel for a serious talk. Sitting in the pews, Sister Kiki lectures Charlotte on her behavior. Charlotte may look innocent in her school uniform, but it’s well-known that she has been straying from the path of righteousness. Charlotte ignores the lecture, and flips the nun over her knee for a spontaneous spanking and paddling. Sister Kiki is taken by surprise! She attempts to talk some sense into the wild girl, but is paid no heed. And they’re being watched. Charlotte shoves Sister Kiki into a kneeling position, pulls her head between her legs and makes her eat furry pussy. With a hard grip on her subject’s head, Charlotte aggressively humps her hips against the mouth of the helpless nun. Suddenly priest D. Arclyte steps out of the confessional and opens his pants. He grabs her head and shoves her mouth onto his erect cock. Having established dominance over his flock, he looks on as Charlotte puts the rosary beads up Sister Kiki’s butthole! Leaving them dangling from her derriere, the three then embark on a wild orgy of fucking and sucking right there in the chapel. (Part 1 of 2)",
  "directors": [],
  "models": [
    {
      "name": "Charlotte Cross",
      "person_id": 58806
    },
    {
      "name": "D. Arclyte",
      "person_id": 59025
    },
    {
      "name": "Kiki Daire",
      "person_id": 178
    }
  ],
  "release_date": "2020-06-04",
  "scene_id": 46263,
  "tags": [
    "big dick",
    "Big Natural Tits",
    "Big Tits",
    "Blowjob",
    "bottom",
    "brunet",
    "Brunette",
    "Curvy",
    "Facefucking",
    "fake boobs",
    "Fetish",
    "Fingering",
    "High Heels",
    "Kinky",
    "mixed",
    "muscular",
    "natural boobs",
    "Orgy",
    "OTK",
    "Paddle",
    "Pierced Pussy",
    "Pussy Eating",
    "Role Play",
    "shaved",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "Partner Studio",
    "Threesome",
    "toned",
    "uniform",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Father I Have Sinned!"
}