{
  "collections": [
    "Sweet FemDom"
  ],
  "description": "Lance Hart was taken, thrown in a van, and now he’s in some shady hospital looking room getting pushed around by a sexy tattooed goth girl in red pantyhose and heels. She drags him into a room, throws a hospital gown at him and orders him to put it on. He tries to talk to her and she just kicks him in the balls and walks away…\n\nLater on, Charlotte Sartre returns to Lance to explain things. She pulls back the curtain and reveals the hottest TS Lady Lance has ever seen (Lena Kelly). “You see, I make sex toys here with real humans. She is one, and you’re next…”\n\nLena tells Lance that she loves her new life as a bimbo woman. Lance pleads for mercy, but they just grab him and stand him up. Charlotte somehow has superhuman strength and he is helpless. They explain that the first part of the process is brutal. They need to completely destroy his balls. Lena shows Lance how she no longer has balls then kicks him hard.\n\nThey go back and forth kicking him and holding him. They give him a break for a minute and tell him to suck Lena’s cock. They explain that after he’s castrated, he’ll be sucking a lot of dick…\n\nAt first, he doesn’t want to suck dick, but when they tell him to stand back up for more kicks, he begs them to let him keep sucking. They laugh, and kick him in the nuts anyway.\n\nAfter some more kicks and some gas peddling, they leave him and tell him to rest. They’ll be back in an hour for more…\n\nIt’s been a while since Lance was taken to the Transformation Clinic. Charlotte Sartre and her prime creation, Lena Kelly, have been working over his balls. Now they are ready to be removed. To ensure that the brainwashing takes full effect, they need him to ejaculate while getting fucked up the ass. They let him know that as soon as he cums, they will be taking his balls and turning him into a sexy girl like Lena whose only purpose is to suck dicks and get fucked…\n\nThey take turns. First, Lena fucks him up the ass while he sucks on Charlotte’s pink cock. Then they switch.\n\nLance desperately tries not to cum, but Charlotte is an expert with her dildo and her hand. Lena whispers, encouraging things to Lance while he’s on the edge of cumming, trying not to explode like: “You’ll love being a girl… you’re going to be the biggest slut ever…”\n\nEventually Lance can’t hold out anymore. Charlotte milks out all of his cum, then feeds it to him.\n\nIt’s time for the procedure…",
  "directors": [],
  "models": [
    {
      "name": "Charlotte Sartre",
      "person_id": 57874
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Lena Kelly",
      "person_id": 61007
    }
  ],
  "release_date": "2020-06-03",
  "scene_id": 46260,
  "tags": [
    "Anal",
    "Athletic",
    "black hair",
    "Blonde",
    "bottom",
    "brunet",
    "CBT",
    "Dildo",
    "fake boobs",
    "Femdom",
    "Fishnets",
    "natural boobs",
    "Nylons Stockings",
    "Pegging",
    "Pierced Nipples",
    "shaved",
    "Sissification",
    "slim",
    "Straight",
    "Strap On",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "TS",
    "ts cock",
    "TS Fucks Male",
    "versatile",
    "white"
  ],
  "title": "Transformation Clinic"
}