{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Here you are sitting at the feet of Lauren Phillips. “Come here bitch” This luscious shiny PVC clad dominatrix with long flowing red hair is ready to make sure you know just how inadequate you are. You see, she’s been in these heels all day long. And she wants to make sure that you collect every speck of dirt with your tongue. She can already see that you’re drooling. Don’t just sit there, get to work, and clean those sweaty, dirty feet that have been trapped in her thigh-high boots. You see because it’s all about her toes, her soles, not about you. So you can proceed by slowly, very slowly licking up and swallow her disgusting foot dirt as you admire every inch of Lauren Phillips’ feet. You see being in her presence, cleaning her toes, is all you have, otherwise, you’re completely worthless. Lauren’s big tits are heaving out above her corset and her legs are covered in sticky sweat. Now you’re admiring her beautiful heels and painted toes. Open your mouth, and stick her foot deep inside your mouth and suck it clean. It’s about Lauren and what she wants, and what she wants is for you to do is to trace your tongue along all the edges. Your tongue feels so good in between her toes. She spreads her toes and instructs you to lick up all the sweat. “Excuse me, don’t you dare spit it out” Lauren wants you to swallow every last bit of her stinky, sweaty, foot juice as you massage her feet with your tongue. Now that her feet are clean and you’ve properly serviced her she’s gonna be generous with you. She puts her feet together to make a cute foot pussy for you to put your cock in. That’s right. Don’t you want to just stick your hard cock in between her soles as her feet go up and down? Go ahead, fuck her feet like the little foot freak that you are. Bust your nut, and then GET OUT!",
  "directors": [],
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2020-06-04",
  "scene_id": 46262,
  "tags": [
    "Big Tits",
    "Bondage",
    "Boot",
    "Corset",
    "Cuckolding",
    "Domination",
    "Dominatrix",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fetish",
    "foot fetish",
    "Foot Worship",
    "JOI",
    "Kinky",
    "Redhead",
    "shaved",
    "Solo Female",
    "spit",
    "Straight",
    "Swallow",
    "switch",
    "Partner Studio",
    "toned",
    "white"
  ],
  "title": "KINKY JOI: Clean Lauren's Filthy Feet"
}