{
  "collections": [
    "Pascals Sub Sluts"
  ],
  "description": "This is Scarla Swallows’ first porn shoot. She only wanted to shoot for PSS. She’s the most shameless, brazen and promiscuous woman we’ve ever worked with. This is what she did - and got done to her - in her vids:\n\n\nPhysical domination & verbal abuse\n\nAnal & vaginal fucking\n\nOrgasm\n\nDeepthroat & face-fucking\n\nSquirting\n\nSpanking\n\nFace-slapping\n\nFace-spitting\n\nDouble penetration with toy\n\nCum-in-mouth & swallowing\n\nCreampie\nThe scene itself kicks off with her getting warmed up with a fantasy about her being exposed and humiliated in front of all the inmates of the prison she used to work in, exposing her by cutting the front of her top off with a pair of scissors. P then steps in to fuck her face really brutally. And pretty much everything after that is just as brutal because Scarla just wants to be used and abused, in all three holes, and treated like the slag she loves to be and for everyone to know it. When she cums, with P fucking her hard in mish, she squirts so hard it jets straight up into her mouth. When she squirts it’s the longest and strongest squirt we’ve shot in ages. We couldn’t get enough of Scarla Swallows, guys, and we’re betting you won’t either. It’s not for nothing that she’s got a tramp stamp inked just above her arse that says ‘FILTHY SLUT’. Enjoy her.",
  "directors": [],
  "models": [
    {
      "name": "Andy Baxter",
      "person_id": 60614
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Scarla Swallows",
      "person_id": 62370
    }
  ],
  "release_date": "2020-06-04",
  "scene_id": 46265,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "Blonde",
    "brunet",
    "Creampie",
    "Deepthroat",
    "Domination",
    "Double Penetration",
    "Facefucking",
    "Facial",
    "Fingering",
    "First Porn Shoot",
    "foreskin",
    "MILF",
    "natural boobs",
    "Nylons Stockings",
    "Rough Sex",
    "Slapping",
    "Spanking",
    "Squirting",
    "Straight",
    "Sub",
    "Partner Studio",
    "top",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Scarla Swallows: So Cheap, She's Priceless"
}