{
  "collections": [
    "House of Taboo"
  ],
  "description": "In today’s episode of DDF Network’s House of Taboo series we introduce to you our mistress Cathy Heaven from Hungary and her submissive office coworker Rachele Richey from the United States. The two busty bombshells have been working together since a couple of days but somehow Cathy is not happy with her work. She needs to teach her a lesson and starts today’s fetish porn with spanking Rachele’s tight butt cheeks with a black leather whip.The brunette curvy teen opens her glossy lips so Cathy can cram her mouth with the whip’s grip. Cathy has a drawer with all sorts of sex toys and after taking off her black dress, she poses in front of her sub, showing off her big tits to that young girl. She orders her to turn around so she can insert a butt plug into her tight asshole after letting her suck on that dong for a while. Cathy dominatrix then wraps a gagball around her sub’s head and starts slapping her ass with her bare hands.Then she crams Rachele’s beautiful face with her butthole and makes her lick that gaping ass before stuffing her sub’s mouth with a large black strap-on dildo. She bends her sub forward and ass fucks her with that hard dong, makes her ride her like a cowgirl and finally makes her knee in front of her so she can pee into her dirty mouth. Rachele obviously loves her today’s golden office shower and sucks in that yellow fountain until her tits are all wet from spilling!",
  "directors": [],
  "models": [
    {
      "name": "Cathy Heaven",
      "person_id": 61179
    },
    {
      "name": "Rachele Richey",
      "person_id": 58862
    }
  ],
  "release_date": "2020-06-05",
  "scene_id": 46275,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Brunette",
    "buttplug",
    "Couple",
    "Curvy",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Femdom",
    "Fetish",
    "Gaping",
    "High Heels",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Nylons Stockings",
    "Piss Play",
    "Pussy Eating",
    "shaved",
    "Slapping",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "switch",
    "Tattoo",
    "Partner Studio",
    "toned",
    "white"
  ],
  "title": "Golden Office Shower: Lesbian Mistress Ass Fucks Her Sub With Strap-On"
}