{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Inked and shaved-headed Aymeric Deville, in a latex tank top and jock, swaps spit with Lance Navarro, looking lean and smooth in leather chaps and harness. Aymeric’s huge-headed cock stands proud, a thick steel ball stretcher wrapped around his balls. Lance fucks the Frenchman’s face with his long slab of uncut, thick-veined pipe, slapping it against the bearded man’s lips. Then Aymeric’s returns the favor, letting Lance feast on his fat engorged cock. Lance pushes Aymeric down a bench, punching his chest while fucking and slapping his face. He pulls Aymeric’s jock off, pushes his legs back, and tongues Aymeric’s smooth hole. Ordering Aymeric on all fours, Lance slaps his ass, teasing the stud for the hard fuck he’s about to endure. Lance slowly pushes his huge cock in the perfect round ass, Aymeric groaning while trying to take the monster. Lance pushes all the way up to his pierced scrotum and slaps Aymeric’s ass while he piston-fucks him. Lance pulls out, flips Aymeric on his back, then aims a steady stream of piss all over his face, chest, and latex tank before aiming it into his mouth. Then Aymeric flips his top, shoving Lance down all fours before slowly pushing the massive head of a dildo up Lance’s smooth ass. Aymeric pummels him with the toy as the bottom moans in stunned pleasure. Aymeric pushes Lance on his back, spreads his legs, and lathers up his own fist. One finger at a time, Aymeric probes Lance’s smooth hole, adding a finger with each thrust, the two men gazing hard at each other as Aymeric pushes all the way into his thick, tanned forearms. Switching positions, Lance eases his ass lower and lower on Aymeric’s upturned arm, grunting out as he inches closer to the top’s elbow. Worked up to a frenzy, the two finish by jerking thick loads all over their piss-stained boots.",
  "directors": [],
  "models": [
    {
      "name": "Aymeric Deville",
      "person_id": 62825
    },
    {
      "name": "Lance Navarro",
      "person_id": 29113
    }
  ],
  "release_date": "2020-06-05",
  "scene_id": 46279,
  "tags": [
    "Anal",
    "big dick",
    "bottom",
    "brunet",
    "CBT",
    "Deepthroat",
    "Dildo",
    "Facefucking",
    "Fetish",
    "Fisting",
    "foreskin",
    "Gay",
    "jock",
    "Kinky",
    "Latex",
    "Leather",
    "muscular",
    "Piss Play",
    "Punching",
    "harness",
    "Rimming",
    "Rough Sex",
    "shaved",
    "Slapping",
    "smooth",
    "spit",
    "Stud",
    "Tattoo",
    "top",
    "unshaved",
    "white"
  ],
  "title": "FIST DEEP: Aymeric DeVille and Lance Navarro"
}