{
  "collections": [
    "House of Taboo"
  ],
  "description": "Mouth wash Mondays are usually not something you might expect at a gym. Today’s episode of DDF Networks House of Taboo introduces a new class to our fetish gym. Sit back and watch our stunning models Mea Melone and her Czech friend Wendy Moon getting stuffed by David Perry. The French fitness instructor finds it quite disturbing when Wendy accidentally pees on the gyms hardwood floor. Mea and David decide to humiliate and educate that young curvy brunette by making her lick up that golden shower mess. In today’s hardcore fetish XXX porn scene, you are about to see some amazing ass gapes and ass licking when the threesome scene heats up and David fucks that young hottie doggy style on the bench while Mea crams her shaved pussy with her young face. While getting her anus filled with that hard cock, she keeps eating her dominant friends twat and gets her ass fingered before David inserts his dong deep into that asshole, again and again! We deliver breath-taking close-up shots in Full HD of that face sitting moment of fetish joy, right before Mea rides David like a cowgirl while Wendy gives him some ball licking and pleases Meas derriere. The two flexible and athletic babes get a sex toy inserted into their fuck holes before David blows his cum into Wendys mouth and Mea provides a final golden shower at the gym, right into Wendys mouth, which is filled with white spunk",
  "directors": [],
  "models": [
    {
      "name": "David Perry",
      "person_id": 33542
    },
    {
      "name": "Mea Melone",
      "person_id": 60621
    },
    {
      "name": "Wendy Moon",
      "person_id": 62903
    }
  ],
  "release_date": "2020-06-08",
  "scene_id": 46281,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Athletic",
    "big dick",
    "black hair",
    "brunet",
    "Brunette",
    "Choking",
    "Curvy",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Facefucking",
    "Facial",
    "Fetish",
    "Fingering",
    "foreskin",
    "Humiliation",
    "Kinky",
    "natural boobs",
    "Pierced Pussy",
    "Piss Play",
    "Pussy Eating",
    "shaved",
    "Slapping",
    "Squirting",
    "Straight",
    "Partner Studio",
    "Threesome",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Mouth Wash Mondays - Threesome With Golden Shower At The Gym"
}