{
  "collections": [
    "Man Up Films"
  ],
  "description": "Evil Dante Colle has teleportation powers. He uses them to trap and humiliate his nemesis, Spiderman. While Spidey could easily defeat him, Dante threatens to use his powers to teleport directly into the buttholes of the one’s Spiderman loves, so he agrees to do whatever Dante wants him to do.\n\nFirst, Dante makes Spiderman worship his stinky villain feet. Then he starts to rub on Spiderman’s crotch with them, humiliating him for getting erect. He lubes up his feet and gives Spidey a foot job, bringing him right to the edge of cumming.\n\nSpiderman begs for release. Dante makes a deal with him. He’ll let him cum, but only if Spiderman lets him fuck his ass right after, which will completely ruin his orgasm. Spiderman has no choice, he agrees. Dante teleports a Cowboy in, who begrudgingly sucks off Spiderman until he cums.\n\nNow that Spiderman has agreed to let the evil Dante Colle fuck his ass, Dante takes wants to relish the moment. He makes Spidey suck his cock first. Spiderman gets very sensual and gives Dante an amazing blowjob until the villain figures out his plan. Spiderman was hoping to suck the cum out of Dante so he wouldn’t have to get ass fucked.\n\nDante bends Spidey over and takes his time sliding his big evil cock inside him. Spiderman moans while his ass gets stretched out. Dante fucks his brains out then flips him over to fuck him while Spiderman jerks off all over his own spandex. After Dante cums on his spandex suit as well, he teleports away, leaving Spiderman defeated and humiliated.",
  "directors": [],
  "models": [
    {
      "name": "Dante Colle",
      "person_id": 61292
    },
    {
      "name": "Lance Hart",
      "person_id": 37346
    },
    {
      "name": "Michael DelRay",
      "person_id": 61138
    }
  ],
  "release_date": "2020-06-10",
  "scene_id": 46289,
  "tags": [
    "Anal",
    "Athletic",
    "Bareback",
    "big dick",
    "Blowjob",
    "brunet",
    "Facefucking",
    "Feet",
    "Fishnets",
    "Foot Worship",
    "Gay",
    "Gay Superhero",
    "Mask",
    "Oral Sex",
    "Role Play",
    "shaved",
    "Suspension",
    "switch",
    "Partner Studio",
    "Threesome",
    "versatile",
    "white"
  ],
  "title": "Spiderman vs Dante Colle RAW"
}