{
  "collections": [
    "House of Taboo"
  ],
  "description": "Today’s brand new episode of DDF Network’s famous House of Taboo series is all about a spanking agreement between dominatrix Dolly Diore and her submissive playmate Talia Mint. Dolly can’t wait to educate her lovely brunette friend from the Ukraine. Our new face Talia has an amazing body, puffy nipples and that teen look. She can’t wait for her domina to give her instructions. Her flexible small body makes her the perfect sex toy for Dolly and she starts of the scene with some intense pussy lip squeezing followed by snapping her hard nipples with her fingernails.Dolly bites her amazing natural tits and chews her teats and starts spanking that curvy ass after wrapping a pink and white rope tightly around Talia’s wrists. She slaps that tight butt until it blushes red, bends her over and spreads her butt cheeks. Dolly lubes up her pink butthole by licking it and also inserts her fingers deep into her derriere. After fixing her sub to the bed, she sucks her tongue in and licks her lips while Talia endures that educational treatment.Dolly later crams her shaved pussy with a purple dildo and inserts that rubber sex toy deep into her sub’s face for some deep throat penetration. Dolly can’t wait to get naked but keeps her latex boots on while sitting on her subby’s face and making her ass gape so Talia can give her some pussy and ass licking, ‘cause she’s eager to please her Master. Finally, Dolly bangs Talia with a strap-on and fucks her doggy style while squeezing her clit for that extra sensation!",
  "directors": [],
  "models": [
    {
      "name": "Dolly Diore",
      "person_id": 60704
    },
    {
      "name": "Talia Mint",
      "person_id": 62900
    }
  ],
  "release_date": "2020-06-12",
  "scene_id": 46308,
  "tags": [
    "Boot",
    "Brunette",
    "Curvy",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "Fingering",
    "Kinky",
    "Latex",
    "Lesbian",
    "LezDom",
    "master",
    "natural boobs",
    "OTK",
    "Pussy Eating",
    "Rimming",
    "Rope Bondage",
    "shaved",
    "Spanking",
    "Straight",
    "Strap On",
    "Sub",
    "Partner Studio",
    "Vaginal Penetration",
    "white"
  ],
  "title": "A Spanking Agreement: Dominatrix Educates Young Brunette"
}