{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "“You sit at boot level like the little boot bitch you are, while gazing up at the ethereal goddess that is Dresden. She is dressed from head to toe in black and pink latex complete with ruffles and pearls. She looks as if she were a villain from an anime series called “Sailor Poon”, and doesn’t waste one second on coddling your pathetic self. You see she likes having you at her feet so you can get to work on worshipping those delicious black patent thigh-high boots of hers. Then maybe (if you’re good) you can work your little piggy tongue up her legs and dive that nose of yours right into her sweaty dripping ass crack. Perfect salty sweat drops emerge beneath the latex panties that trap her beautiful, pink pussy lips and tight, little asshole. You’re practically begging to sniff it. Not so fast. Did you really think she was going to let you get close to her? What have you done for her lately? Nothing but writhe around like a horny little piece of meat breathing all of her air. Time to make yourself useful if you want to stick around. Now she’s rubbing her pussy and instructing you to keep breathing her smells in. Her pussy, her sweat, her arousal. Ugh, you are so predictable. Now she’s reading your mind. She knows simple slaves like you are just too easy and begins to taunt you with her breasts. She’s using her gloved hands to squeeze and pull at those perky tiddies of hers to tease and toy with you. She pulls out one breast and then another and soon begins to tug at her nipples. While she chastizes you for being a disgusting, sniveling worm she’s also milking herself. Deep, swooping tugs punctuated with a pinch eventually bring her delicious breast milk to the surface of her swollen tits. One drop drips and then another and she collects it with her fingers and laps her milk up with her tongue. Did you really think you were going to get a taste? Silly slave you’ve hardly done a thing other than sit here with your mouth gaping open begging for scraps. You’ve proven yourself to be quite boring. Now go!”",
  "directors": [],
  "models": [
    {
      "name": "Dresden",
      "person_id": 58978
    }
  ],
  "release_date": "2020-06-11",
  "scene_id": 46302,
  "tags": [
    "Blonde",
    "Bondage",
    "Boot",
    "Boot Worship",
    "bottom",
    "Cuckolding",
    "Domination",
    "Dominatrix",
    "Feet",
    "Femdom",
    "Fetish",
    "Gaping",
    "JOI",
    "Kinky",
    "lactation",
    "Latex",
    "natural boobs",
    "POV",
    "shaved",
    "Slave",
    "Solo Female",
    "Straight",
    "Partner Studio",
    "toned",
    "white"
  ],
  "title": "KINKY JOI: Lactating Bratty Domme"
}