{
  "collections": [
    "PegHim"
  ],
  "description": "It’s a quiet evening at home for real life couple, Siouxsie Q and her boyfriend Michael Vegas. Tonight they both want nothing more than to stretch his asshole and fuck him until he gapes uncontrollably. Siouxsie tries on a new leather strap-on harness that frames her shaved pussy and even rubs her clit a little bit when she thrusts into him. She starts by bending Michael over in the living room and lubing up her black gloved hand with thick, creamy vegetable shortening and beginning to tease his hole and work it open, making it beg to be filled, while she rests her smiling face on his golden butt cheeks. Tonight she chose a medium sized thick brown cock, so she could really fuck him the way she likes to, thrusting in and out of him hard and fast so his sphincter doesn’t have a chance to close or relax. Once she’s able to open him up and get her entire hand inside him, she lubes up her strapped on cock and begins to slide the tip of it into her boyfriend’s ass. She mounts him and slides further into his hungry hole and alternates using her cock and her fist to stretch him open wider. She gets on her knees and begins to fuck him faster and harder, making him gape when she pulls out to spit in his hole and bury her face in his ass. She eventually is able to get both her cock and her hand inside his asshole at the same time, stretching him almost to his limit. She then smiles with joy as she bareback punch fucks his hole, while she kisses his ass cheeks and jerks off his cock until he cums all over the floor.",
  "directors": [],
  "models": [
    {
      "name": "Michael Vegas",
      "person_id": 47624
    },
    {
      "name": "Siouxsie Q",
      "person_id": 34821
    }
  ],
  "release_date": "2020-06-17",
  "scene_id": 46332,
  "tags": [
    "Anal Fingering",
    "Anal Stretching",
    "black hair",
    "blond",
    "bottom",
    "Couple",
    "Dildo",
    "Femdom",
    "Fisting",
    "Gaping",
    "Leather",
    "mixed",
    "natural boobs",
    "Pegging",
    "harness",
    "shaved",
    "spit",
    "Straight",
    "Strap On",
    "Tattoo",
    "Partner Studio",
    "top",
    "white"
  ],
  "title": "Home Movies: \"The Gape Gatsby\""
}