{
  "collections": [
    "Pascals Sub Sluts"
  ],
  "description": "Usually when you chat with a girl on the phone to organize a shoot, if she asks if her boyfriend can come along it means trouble. It means he’s over-protective, perhaps controlling. You steer clear. So when Roxy mentioned it to Andy he was immediately suspicious. But when she started talking about how her bloke (Dan) loved being a cuckold it became a whole other conversation. We’d already defined Roxy as a total slag - she wanted me to do everything to her, no holds barred. But having her guy watch me annihilate her? And not even wanting any money to be in the movie? Fucking bingo. And what made it all the more sweet was that I’d always really wanted to do some cuckold stuff with a couple but never had the chance. So we came up with this idea of doing a TV thing called Wimp Of The Month, with wives writing in to complain about their limp-dick husbands and how I should come along and use and abuse them in front of their fellas. I knock on the door, Roxy answers, screams in delight when she realizes what’s going on and rushes upstairs to slut up, and I give a bemused Dan the lowdown while I shackle him to a chair with my cuffs. What happens next is utter fucking mayhem (which the whole square outside must have heard because it was a hot day and Roxy and Dan forgot to close the windows). I facefuck Roxy so hard and for so long she ends up looking like a goo-dunked zombie, get Dan flat on his back in the chair so she can squirt fountains over him while she’s riding me in reverse, get her to snog him after I’ve been ploughing her shit-hole, lots of jolly stuff. And then we turn the tables. I uncuff Dan and first get him to finger his slag-wife, then whip her with my belt. (A little anti-climactic for all you hardcore cuckolds out there but this being PSS there probably aren’t too many of you and we just wanted to have fun with the dynamics.) It ends up with me fucking her in doggy and Andy ordering Roxy to apologize to Dan and tell him she loves him. She gets the first part right but forgets the second so Andy tells him to start slapping her in the face. And boy does he give her a wallop (or four)! Then I brand her (of course), spunk in her gob (of course) and get her to swallow it (of course). Christ knows how many times Roxy came during the day. She just didn’t stop and she kept on squirting everywhere. They both had a great time. You will too when you watch them.",
  "directors": [],
  "models": [
    {
      "name": "Dan",
      "person_id": 62368
    },
    {
      "name": "Pascal White",
      "person_id": 60611
    },
    {
      "name": "Roxy Mae",
      "person_id": 62367
    }
  ],
  "release_date": "2020-06-18",
  "scene_id": 46341,
  "tags": [
    "Anal",
    "Athletic",
    "big dick",
    "Blonde",
    "brunet",
    "Choking",
    "Couple",
    "Cuckolding",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Facial",
    "Fishnets",
    "foreskin",
    "Hair Pulling",
    "Hand Gagging",
    "Rough Sex",
    "Shackle",
    "shaved",
    "Slapping",
    "spit",
    "Squirting",
    "Straight",
    "Sub",
    "Swallow",
    "the chair",
    "Partner Studio",
    "white"
  ],
  "title": "Roxy Mae: Wimp Of The Month, Slag Of The Year"
}