{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Doug lifts a still bound-and-gagged Tag out of the box and puts him on his knees. He puts a lid on the closed box and a padded square bondage board with eyebolts at all strategic points on that. Having untied Tag, he makes him get up on the board on all fours, spanks his ass, then puts locking restraints on Tag’s wrists and ankles and secures them to the four corners of the board. He ties up Tag’s cock and balls, slaps them to roars from Tag and ties them down to an eyebolt between Tag’s feet. He spanks Tag’s ass soundly before putting on rubber gloves to play with Tag’s hole. Tag fucks himself into Doug’s hand, half of which is in his hole. Then Doug pushes a medium-sized butt plug into Tag’s asshole. Tag, drooling heavily around the ball gag, swallows it up and keeps it in. Doug has Tag spit out the plug and tries a large, fat one, but it won’t go all the way, so he next inserts a long, fat ribbed dildo. Tag groans and roars as Doug jiggles the dildo around in his ass, then at Doug’s urging fucks himself on the dildo. Doug pushes the dildo in a second and thern a third time. Tag drools and drools. Doug tries the fat butt plug again but still without success, so plays with anoher dildo, then puts the medium-sized plug up Tag’s ass again. Doug taunts Tag’s gagged mouth with his hard dick before removing the gag and having Tag suck his cock all the way down. He pauses for Tag to lick his nipples, then has him go down on his cock, then his asshole, and then his cock again. Tag can;t get enough of Doug;s body, and thirsts hungrily for all that;s available to him, Doug;s nipples, arms. Doug removes the plug and spanks Tag hard before making Tag suck his cock and eat his ass again. Tag is voracious. Doug regags Tag with the ball gag and leaves Tag alone, attached to the board.",
  "directors": [],
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 61819
    },
    {
      "name": "Tag Adams",
      "person_id": 62428
    }
  ],
  "release_date": "2020-06-18",
  "scene_id": 46345,
  "tags": [
    "Anal Fingering",
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Bondage",
    "Dildo",
    "Domination",
    "drool",
    "dungeon",
    "Feet",
    "Gag",
    "Gay",
    "gloves",
    "Leather Cuffs",
    "spit",
    "Partner Studio"
  ],
  "title": "TAG TIED: The Square Bondage Board"
}