{
  "collections": [
    "Severe Sex Films"
  ],
  "description": "Tony is cleaning up at the bar when the rest of the staff (Bella Bathory, Elena DeLuca and Cybill Troy) confront him. They’ve figured out that he’s been stealing tips from them, and they’ve got video proof. But they suggest handling the matter internally. They strip Tony’s shirt off and make him dance on the pole. Once he’s naked and dancing, they make him hold their tips between his ass cheeks. Cybill smashes the video cassette evidence, but Tony’s not off the hook, as the ladies use the tape inside to bind his wrists and cock! Once Tony is tied to the pole, Cybill uses an electric prod to zap his cock and balls. Tony screams and squirms, but there is no escaping these vicious women. Cybill decides to give him a break, swapping a crop for the zapper and beating his nipples until they are bright red. He tries to shield his cock and balls from the impact, but it’s no use. It’s not long before all three ladies are cropping and caning him mercilessly from all angles, making him dance in a futile effort to escape their blows! He wiggles and squirms, but they’ve got him surrounded, there is no escape. And they’re not nearly done yet! (Part 1 of 2)",
  "directors": [],
  "models": [
    {
      "name": "Cybill Troy",
      "person_id": 61206
    },
    {
      "name": "Elena De Luca",
      "person_id": 57322
    },
    {
      "name": "Mistress Bella Bathory",
      "person_id": 59846
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2020-06-18",
  "scene_id": 46342,
  "tags": [
    "Big Tits",
    "black hair",
    "Blonde",
    "Bondage",
    "Boot",
    "brunet",
    "Caning",
    "CBT",
    "Crop",
    "Domination",
    "fake boobs",
    "Femdom",
    "Gangbang",
    "Male Sub",
    "natural boobs",
    "Nylons Stockings",
    "Pain",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "Partner Studio",
    "versatile",
    "Whipping",
    "white",
    "Zapper"
  ],
  "title": "Strip Club Gangbang (Part 1 of 2)"
}