{
  "collections": [
    "Torment Time"
  ],
  "description": "Miss Fires makes a bitch of the male babysitter sent to her despite her female request. Naturally protective, his sacrifice and humiliation are necessary tools of training. Shoved into a latex dress, a dainty wig, and locked away in chastity: he’s less a man than ever before.. But the worst has yet to come. Before their time is done, his ass will be sore in more ways than one. Miss Fire makes her cancelled plans for punishment worth it by tormenting her bound babysitter relentlessly. Suspended upside-down and nude all except for his excruciating chastity, left to her mercy… of which she seems to have none. Toying with every inch of his body, every hole will be defiled, and the only silver lining is the smell of her ass and pussy as she restricts his only free sense: breathing. Punishment and pleasure collide as their moans twist together like silk in the still, cold air of her home dungeon, earning his freedom from chastity with every inch. The lust only seems to build from here…And the reward is worthy of any risk. Weak, feeble, and mentally displaced bitch babysitter finds himself groaning in the ecstasy of the wet and sensual handjob he foolishly believes is the final step in this coerced playtime. Relaxing into this position was his greatest mistake yet, but his mind can’t seem to comprehend anything outside the building orgasm and the smell of Miss Fires’ perfect feet. Relishing in his reward ends abruptly, it’s time for him to learn…No good deed goes unpunished.",
  "directors": [],
  "models": [
    {
      "name": "Ashley Fires",
      "person_id": 20856
    },
    {
      "name": "Slave Fluffy",
      "person_id": 58760
    }
  ],
  "release_date": "2020-06-22",
  "scene_id": 46351,
  "tags": [
    "Anal",
    "big dick",
    "Blonde",
    "bottom",
    "brunet",
    "Chastity Play",
    "Dildo",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Feet",
    "Femdom",
    "Fetish",
    "Fishnets",
    "Foot Worship",
    "Handjob",
    "Humiliation",
    "Kinky",
    "Latex",
    "natural boobs",
    "Pegging",
    "Pussy Eating",
    "Rope Bondage",
    "shaved",
    "Sissification",
    "Spanking",
    "Straight",
    "Strap On",
    "Suspension",
    "switch",
    "Partner Studio",
    "toned",
    "white"
  ],
  "title": "Ashley Fires And Her Big Nanny Mixup"
}