{
  "collections": [
    "DDF Network"
  ],
  "description": "Let’s get ready for another one of a kind DDF Network scene, packed with BDSM humiliation and a stunning babe getting banged with a double strap-on. Banging the Box features Mugur and Anissa Kate. The hot babe with incredibly gorgeous natural tits is a French stunner and loves BDSM role-plays with her boyfriend. She plays a living furniture and has a cupboard around her sexy body. The good-looking stud ties her wrists with a red rope and starts spanking her curvy butt. He later puts an enormous strap-on on and crams both her tight fuckholes in standing sex position. One dong goes up her tiny asshole, the other one is stuffed deeply into her tight cunny. The hot-blooded submissive bombshell enjoys the ass fucking delight and the extra stimulation of her twat. Time to make that ass gape! He unplugs the huge double-dong and inserts his cock into her fuckholes, fucking her ass and pussy until she cums! After having her suck that plastic cock one more time, it’s time for him to shoot a huge amount of spunk into one of the two pipes. He pours his cum in her mouth, and Anissa thankfully accepts the energizing protein shot!",
  "directors": [],
  "models": [
    {
      "name": "Anissa Kate",
      "person_id": 39140
    },
    {
      "name": "Mugur",
      "person_id": 33526
    }
  ],
  "release_date": "2020-06-22",
  "scene_id": 46352,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "Athletic",
    "BDSM",
    "Big Tits",
    "black hair",
    "Blowjob",
    "Bondage",
    "bottom",
    "brunet",
    "Curvy",
    "Deepthroat",
    "Domination",
    "Facefucking",
    "Facial",
    "Female Slave",
    "foreskin",
    "Gaping",
    "Humiliation",
    "Kinky",
    "master",
    "MILF",
    "mixed",
    "natural boobs",
    "Rough Sex",
    "shaved",
    "Spanking",
    "Straight",
    "Strap On",
    "Stud",
    "Partner Studio",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Banging The Box - BDSM Humiliation With Double Strap-On"
}