{
  "collections": [
    "House of Taboo"
  ],
  "description": "Today’s fetish examination takes place at the DDF Network genital hospital. The dominant Doc David Perry and his hot nurse Jasmine Webb prepare their submissive patient Gina to fuck her hard with several medial tools. The petite babe with small natural tits gets her mouth crammed with steel, receives some serious shaved pussy stuffing by the Perry prick, and is allowed to give Jasmine some ass licking while she receives the Doc’s hard meat. The bondage scene is shot in Full HD and starts with the sexy college student being tied up on the examination table. The nurse double penetrates her anus and cunny with some medical pipes while giving her some titty sucking. That small ass is soon to be banged by the Perry dong and while he leaves the submissive student with a gaping asshole, he gets his meat jerked off by the dark-skinned nurse. He blows his jizz all over the subbys face! This episode of House of Taboo gives you some outstanding hardcore fetish shots and leaves you with your jaws dropped down when the Russian teen gets ass fucked while Jasmine gives her some serious face sitting!",
  "directors": [],
  "models": [
    {
      "name": "David Perry",
      "person_id": 33542
    },
    {
      "name": "Gina",
      "person_id": 61470
    },
    {
      "name": "Jasmine Webb",
      "person_id": 61188
    }
  ],
  "release_date": "2020-06-19",
  "scene_id": 46350,
  "tags": [
    "Anal",
    "Anal Stretching",
    "Athletic",
    "big dick",
    "Black",
    "Blowjob",
    "Bondage",
    "brunet",
    "Brunette",
    "Deepthroat",
    "Dildo",
    "Doctor",
    "Ebony",
    "Facefucking",
    "Facial",
    "Fetish",
    "foreskin",
    "Gaping",
    "Interracial",
    "Kinky",
    "Medical Fetish",
    "natural boobs",
    "Nurse",
    "Petite",
    "shaved",
    "slim",
    "Small Tits",
    "Speculum",
    "Straight",
    "Partner Studio",
    "Threesome",
    "uniform",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Fetish Examination - Dominant Doc And Nurse Fuck Young Patient"
}