{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "There you are, you filthy little pig. Are you excited? Of course you are, look how beautiful Mistress Lily Lane is. You must be so lucky to even be in her presence. She notices that little bulge you have in your pants and instructs you to take it out. Go ahead pull out your cock and stroke it for her. She wants you to tease that cock, she wants you to go up and down that shaft. She wants you to squeeze those balls of yours and tease the head. Look how hard that pathetic little dick of yourself is getting and how full your balls look. Mistress Lily Lane knows you’ve probably got a nice, big, fat load to work up and that you’d love to just explode it all over her big beautiful tits. That you’re stroking your cock thinking about her gorgeous body, her yummy lips, and that delicious slippery tongue. That you’d love to have her tongue on your cock, licking, sucking, and stroking up and down that shaft of yours. You don’t deserve her tongue, all you get is your filthy little hands. Now take your hands and go up and down, but go slow. Take your time, she wants you to really enjoy this. Now watch her squeeze her tits and squeeze your balls. Now stop, no stroking just watch her, don’t touch your cock. Control yourself and watch her hand touch her beautiful pussy and then watch her hand move all the way up her tits and then to her gorgeous mouth. Now take your hand and smack that cock. You just can’t contain yourself can you? You should be so grateful to be in her presence. She usually never puts up with scum like you but today you’re in luck because she’s feeling generous. She’s gonna let you cum and she’s gonna give you a countdown. Now starting at 10 she counts you down to 1 and then you make a big fucking mess. Who do you think is gonna clean that mess up? You are! Now take that tongue and lick up every last drop of your cum. Eat that filthy mess. Good boy.",
  "directors": [],
  "models": [
    {
      "name": "Lily Lane",
      "person_id": 50199
    }
  ],
  "release_date": "2020-06-26",
  "scene_id": 46380,
  "tags": [
    "Big Tits",
    "Bondage",
    "bottom",
    "Brunette",
    "Cuckolding",
    "Domination",
    "Dominatrix",
    "fake boobs",
    "Femdom",
    "Fetish",
    "High Heels",
    "Humiliation",
    "JOI",
    "Kinky",
    "Latex",
    "Latinx",
    "Nylons Stockings",
    "shaved",
    "slim",
    "Solo Female",
    "Straight",
    "Tattoo",
    "Partner Studio"
  ],
  "title": "KINKY JOI: Cum Eating Instructions"
}