{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "It is a morning like any other morning for Mistress Lydia Black’s live-in sex toy, FX Tim. He follows his routine of spit shining Mistress Lydia’s high heeled boots before Lydia pulls him out of his dark closet quarters to use him for her enjoyment. He begins by oiling Lydia’s latex, enjoying the cool touch and crinkly noises, before she takes his breath away by sitting on his face, smothering him with her perky ass. FX licks and sucks on her latex clad feet while staring at her pink pussy. He is craving the sweet taste of her cunt and asshole but he knows he must contain himself until he is instructed to taste her divine pussy. Lydia takes delight in his angst and teases him mercilessly. She spanks him with a red leather paddle before moving on to her crop while he stoically takes his punishment. Lydia strokes his hard dick so that she can use them in all her holes. She edges her sex toy with a handjob and blow job. He knows she owns his orgams and that his main role is to be her human dildo. This day, and everyday, is all about her sexual satisfaction and naturally, his pleasure is far from her concern. He begs her to let him cum only to get laughed at and denied. This game turns Lydia on endlessly. She has one orgasm after another as she rides his thick cock. He works tirelessly to satisfy her. He plows deep inside her pussy as sweat drips off both their bodies. Once she is done with him she allows him to ejaculate his sticky white cum on her ass. What a blessed life this dildo has.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "FX Tim",
      "person_id": 63006
    },
    {
      "name": "Lydia Black",
      "person_id": 60714
    }
  ],
  "release_date": "2020-07-03",
  "scene_id": 46392,
  "tags": [
    "black hair",
    "Blowjob",
    "Crop",
    "Dildo",
    "domestic",
    "Edging",
    "Facesitting",
    "Feet",
    "Femdom",
    "Foot Worship",
    "Handjob",
    "Latex",
    "Leather",
    "natural boobs",
    "Paddle",
    "Pussy Eating",
    "slim",
    "Smothering",
    "Spanking",
    "spit",
    "Straight",
    "white"
  ],
  "title": "Keep Your Mouth Shut and Fuck Me"
}