{
  "collections": [
    "Filthy Femdom"
  ],
  "description": "Goddess Jet Setting Jasmine is not satisfied with your performance as a service submissive. Tired of your constant failure, she invites her built, handsome, and hung lover King Noire over to show you just how pathetic your attempts to please her are in comparison to him. Though you will never measure up to such a man, maybe you’ll learn something! She starts off by showing you the proper way to kiss and worship her feet, legs, and pussy. Sit patiently while she describes how King slowly uses his seductive mouth and tongue to turn her on. Watch as he uses his expert cunnilingus skills to make your goddess come in ways you have never dreamed of doing. You might get the chance to worship her pussy but you will never get the chance to experience what she does next. Jasmine compares your pathetic little cock to King’s huge beautiful cock. She enjoys wrapping her lips and mouth around him, but would never think to give your puny cock that kind of attention. She works his cock like a master while she prepares to get pounded to her satisfaction by this masculine god. She would never ever dream of letting you inside of her divine pussy. You have no choice but to get a front row view of what you are missing out on, until she strokes and licks him to an orgasm as his huge sticky load drips onto her beautiful goddess body.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Jet Setting Jasmine",
      "person_id": 59795
    },
    {
      "name": "King Noire",
      "person_id": 59129
    }
  ],
  "release_date": "2020-07-31",
  "scene_id": 46393,
  "tags": [
    "big dick",
    "Black",
    "black hair",
    "Cuckolding",
    "Feet",
    "Femdom",
    "master",
    "mixed",
    "muscular",
    "natural boobs",
    "other hair color",
    "shaved",
    "Straight",
    "Stud",
    "Tattoo",
    "top"
  ],
  "title": "How to Worship a Goddess: Cuckolded and Taught a Lesson!"
}