{
  "collections": [
    "Bound And Gagged"
  ],
  "description": "Part 1. Plug’gagged Tag is intricately tied in a bucked position on a floating bondage board, a long leather-covered pole between his elbows and knees. Doug uses a variety of sharp-edged toys on him before bringing out clamps and clothespins. He blindfolds Tag and applies the pins to Tag’s chest and nipples. He removes the gag so Tag can suck his nipples before he starts removing the clothespins, handgagging Tag who cries out as the pins come off.\n\nPart 2. Tag’s wrist restraints are attached to the chains holding up the bondage board. Doug smacks his balls until Tag, howling, agrees that he likes it, then makes Tag suck his cock, his head back and hanging over the edge of the board. Doug pushes the board so that each time it swings back Tag’s mouth swallows his cock all the way. Doug continues swinging the board as he has Tag lick his balls, and starts swatting Tag’s rock hard dick each time it comes within his reach. Doug swings the board faster, but Tag is up to the job. Doug turns around and bends over so the swinging board will bring Tag’s face right into his ass, which Tag approaches tongue straight out. Great verbal between the two, with Tag admitting to being Doug’s slut.\n\nDoug fucks Tag on the board, pounding his ass. The swinging board makes a bullseye connection between Doug’s cock and Tag’s asshole. As hard as Doug fucks him, Tag cries out to be fucked harder, thanking Doug over and over. Tag opens his mouth wide for Doug to spit into it. The hard fuck goes on and on. Doug gets Tag on all fours, then rough fucks him doggy-style. Doug spanks Tag’s ass. He gets Tag on his back again, pulls off his condom, kisses Tag as he jerks himself off and shoots a huge load across Tag’s chest. Tag massages the cum into his chest. They kiss. Doug cums without stopping, twice more, shooting an amazing amount even the third time! Doug reattaches Tag’s restraints to the chains, blindfolds him, plug gags him, and leaves.\n\nPart 3\nAlone in the dungeon, strapped into a chair and plug gagged, Tag succeeds in freeing a hand and jerking off. Doug catches him at it as he shoots a huge load.",
  "directors": [],
  "models": [
    {
      "name": "Doug Jeffries",
      "person_id": 61819
    },
    {
      "name": "Tag Adams",
      "person_id": 62428
    }
  ],
  "release_date": "2020-06-25",
  "scene_id": 46390,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Blindfold",
    "Bondage",
    "CBT",
    "Chains",
    "Clothespins",
    "Deepthroat",
    "dungeon",
    "Facefucking",
    "Fetish",
    "Gag",
    "Gay",
    "Leather",
    "Leather Cuffs",
    "masturbation",
    "Rimming",
    "Rope Bondage",
    "Spanking",
    "spit",
    "Straight",
    "Partner Studio"
  ],
  "title": "TAG TIED: \"The Floating Bondage Board\""
}