{
  "collections": [
    "DDF Network"
  ],
  "description": "Tigerr Benson is awaiting her prisoner humiliation by the dominatrix Cathy Heaven. Today’s BDSM spectacle is packed with ass gapes, pussy gapes, and some serious pussy and ass cramming with a huge black strap-on dildo! Tigerr is tied to the ceiling with a rope around her wrists. Cathy enters the room and feeds her an anal plug which she then sticks into her massive big tits! Both chicks wear latex and high heels, when Cathy decides to rip her playmate’s fishnet nylon pantyhose apart! The strong and dominant long-haired mistress keeps spanking her submissive babe’s ass and starts fucking her tight pink pussy with that strap-on. She fixates her subby in today’s FemDom masterpiece and crams her deep throat with that dildo! Watch her big tits shake and see Tigerr suck that sex toy before she receives some spitting and spanking again! Finally, Cathy fucks her asshole and rides her like a cowgirl, stuffing that strap-on up her own ass until she reaches her anal orgasm! If you like to see more anal insertion, please click on our XXX BDSM porn pics below and hit like if you love what you see!",
  "directors": [],
  "models": [
    {
      "name": "Cathy Heaven",
      "person_id": 61179
    },
    {
      "name": "Tigerr Benson",
      "person_id": 62275
    }
  ],
  "release_date": "2020-06-29",
  "scene_id": 46402,
  "tags": [
    "Anal",
    "Asian",
    "Ass To Mouth",
    "BDSM",
    "Big Tits",
    "Brunette",
    "buttplug",
    "Dildo",
    "Domination",
    "Dominatrix",
    "dungeon",
    "Facefucking",
    "Femdom",
    "Fishnets",
    "Hair Pulling",
    "High Heels",
    "Humiliation",
    "Latex",
    "Leather",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pierced Pussy",
    "Rope Bondage",
    "shaved",
    "slim",
    "Spanking",
    "Stocks",
    "Straight",
    "Strap On",
    "Partner Studio",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Prisoner Humiliation - Milfs Cram Pussy & Ass With Strap-On"
}