{
  "collections": [
    "Filth Syndicate"
  ],
  "description": "Get ready to relax every part of your body from your head to your toes with this ASMR inspired JOI. Listen as Lauren Phillips crinkles and squeaks her red, latex gloves. Feel yourself beginning to tingle as she whispers and blows in your ears. What’s that? Feel a little pleasure chill up your spine? It’s only the beginning. In addition to enhancing your sensory experience with pleasurable auditory sounds Lauren’s beautiful, big tiddies are in full view for some visual stimulation. She whispers some more, instructing you to pull your cock out and make it hard. As she taps and squeaks she also chews bubblegum to produce a nice crinkle and snapping sound from her gorgeous mouth. She stands up and takes her slippery, squeaky gloves and starts to rub her pussy. She knows this is going to make your dick so hard. Just look at her gorgeous, swollen cunt being massaged by her bright gloves as she demands you to jerk for her. She turns around and gives her big, beautiful ass a slap or two while she spreads her cheeks for your face. Then she sits back down and blows in your ear some more. She instructs you stroke your cock while she sucks on two of her gloved fingers. She slurps and squeaks as her fingers slide in and out of her pretty mouth. She can feel how excited you’re getting as you milk that cock. She wants you to cover her tits with your cum. She whispers how much she wants you to just explode your fat load all over her big beautiful breasts as she squeezes them. As she grabs her tits she gently jingles her necklace over breathy moans, “maybe you learned a little more about yourself this time.”",
  "directors": [],
  "models": [
    {
      "name": "Lauren Phillips",
      "person_id": 59097
    }
  ],
  "release_date": "2020-07-03",
  "scene_id": 46425,
  "tags": [
    "Big Tits",
    "Bondage",
    "Cuckolding",
    "fake boobs",
    "Femdom",
    "Fetish",
    "gloves",
    "JOI",
    "Kinky",
    "Latex",
    "Redhead",
    "shaved",
    "Solo Female",
    "Straight",
    "switch",
    "Partner Studio",
    "toned",
    "white"
  ],
  "title": "KINKY JOI: ASMR"
}