{
  "collections": [
    "House of Taboo"
  ],
  "description": "In today’s episode of DDF Network’s House of Taboo, our domina nurse Angelica Heart examines Arteya’s fuckholes! The young blonde nurse is waiting for the doc in the doctor’s office and sits on the examination table. Angelica enters the room and soon starts spanking that young blonde’s curvy naked ass! Too many mistakes lately, this is no longer tolerable. The redhead spanks that Russian college girl’s butt and starts choking her before tying her wrists together. She then makes her ass gape and inserts her index finger into that tight young butthole, while her middle finger and ring finger slide into her shaved box! She works her fuckholes with some examination tools and inserts a metal tube into her anus and pussy. The fetish loving doc crams that nurse’s cunny with her hand. Fisting and anal stuffing is her favorite BDSM technique, and the Russian nurse seems to enjoy her treatment! Time for some face sitting. The busty doc spreads her ass and feeds her cunt to that young submissive nurse. Arteya licks her clit until she cums and hopes for more humiliation by her dominatrix!",
  "directors": [],
  "models": [
    {
      "name": "Angelica Heart",
      "person_id": 20417
    },
    {
      "name": "Arteya",
      "person_id": 63000
    }
  ],
  "release_date": "2020-07-03",
  "scene_id": 46429,
  "tags": [
    "Anal",
    "Anal Fingering",
    "BDSM",
    "Blonde",
    "Bondage",
    "Brunette",
    "Choking",
    "Curvy",
    "Dildo",
    "Doctor",
    "Domination",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fetish",
    "Fingering",
    "Fisting",
    "Hair Pulling",
    "High Heels",
    "Humiliation",
    "Kinky",
    "Lesbian",
    "LezDom",
    "Medical Fetish",
    "Nurse",
    "OTK",
    "Redhead",
    "shaved",
    "Spanking",
    "Speculum",
    "Straight",
    "Partner Studio",
    "white"
  ],
  "title": "The Visit - Domina Doc Examines Blonde's Fuckholes"
}