{
  "collections": [
    "CFNMEU"
  ],
  "description": "Sexy str8 guy Oliver Hruby has been gagged and shackled, wearing only his boxers, by his Mistress. He is lying face down on the mattress and feels the whip as the Mistress sets about her work. His skin reddens as the whip does its job. Then she pulls the underwear off Oliver’s sexy ass and whips that too. Straddling him, she spanks on his ass as well. Then, when she turns Oliver over, we see his boxers tenting with his massive erection. She removes the boxers and wanks on the big cock. As she works, the girl clamps and pegs his nipples and his balls too. Wanking the cock and slapping the thighs, the girl then removes the pegs and clamps from his balls. That big cock stands up, and the girl whips Oliver’s hot body again. He moans as he feels it landing. Then Oliver is moved, his hands shackled above him as he stands. His ass gets spanked, and the whip lands all over his back. He is turned again, and the girl wanks the cock again. He is laid down again, this time with his legs in the air, showing off his tight hole. His cock is wanked and the girl oils that sexy ass hole. Rubbing the oil over the hole the girl shoves a dildo deep inside. That tight hole gets fucked deep by her dildo and Oliver takes it well, moaning as he does so. Turning him over the girl then uses a thicker dildo to work that hot hole. It goes in all the way as he moans. Oliver is relieved when he is turned over and allowed to wank himself to a big,squirting, cumshot.",
  "directors": [],
  "models": [
    {
      "name": "Lucy Vojak",
      "person_id": 62062
    },
    {
      "name": "Oliver Hruby",
      "person_id": 63017
    }
  ],
  "release_date": "2020-07-02",
  "scene_id": 46422,
  "tags": [
    "Anal",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "CBT",
    "CFNM",
    "Clothespins",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Edging",
    "Femdom",
    "Flogging",
    "Hair Pulling",
    "Handjob",
    "Leather Cuffs",
    "Male Sub",
    "Slapping",
    "Straight",
    "Partner Studio"
  ],
  "title": "Oliver Hruby - CFNM"
}