{
  "collections": [
    "Torment Time"
  ],
  "description": "Violet Doll is sick and tired of all of the creeps who keep pestering her at AVN, especially a creeper by the name of Fluffy. Everywhere Violet goes on the AVN Expo floor, Fluffy is right there behind her, trying to get her to go out with him. Violet has finally had enough, so she decides to invite him up to her room, to teach him a little lesson. Fluffy arrives and is immediately instructed to strip off his clothing, in which Fluffy already begins to frustrate Violet when he begins bumbling with his clothes. Finally with a little encouragement from Violet, Fluffy is now completely naked and ready for his next task. Violet hands Fluffy a pair of Leather cuffs and instructs Fluffy to place them on his wrists, before securing them behind his back. Now that Fluffy is all safe and secure, Violet happily begins to torment Fluffy’s dick and balls, by squeezing, twisting, squishing, and slapping his dick and balls, even pulling Fluffy’s dick back to his ass at times, all while Fluffy gets harder and harder. Fluffy’s dick must have been very excited to have its first girl ever touch it, especially a girl as hot as Violet Doll, even though all she is doing abusing it. Violet Doll has had so much fun abusing Fluffy’s dick, that she decides to make a call to her friend to come join in on the fun…",
  "directors": [],
  "models": [
    {
      "name": "Slave Fluffy",
      "person_id": 58760
    },
    {
      "name": "Violet Doll",
      "person_id": 62968
    }
  ],
  "release_date": "2020-07-03",
  "scene_id": 46432,
  "tags": [
    "BDSM",
    "big dick",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "cock and ball torture",
    "Domination",
    "Dominatrix",
    "Femdom",
    "Fetish",
    "Kinky",
    "Latex",
    "Leather",
    "Leather Cuffs",
    "Male Sub",
    "shaved",
    "Slapping",
    "Straight",
    "Partner Studio",
    "white"
  ],
  "title": "AVN Creeper - Part 1"
}