{
  "collections": [
    "Kinky Bites"
  ],
  "description": "Every Thursday Delirious Hunter and her husband Joeydotrawr take turns surprising each other with their filthy fantasies, safe in the confines of their private abode. Today it is Joey’s turn to use her body as a canvas for his sadistic delights. Delirious can’t wait to beg to service his cock, to pound her hard and deep and to be his submissive pain slut. Joey comes home to find his lovely wife sitting on the couch, legs up, showing off her ballet boots and shaved pussy. Joey brings out a few leather floggers for some impact play against Delirious’ tender thighs. A riding crop stings her flesh. Delirious turns around to present her round ass for punishment. Joey brings out a heavier flogger to get down to some serious business. He beats her ass until it’s glowing pink. Between her cries of pain, Delirious manages to shout thank you repeatedly to her master. A vibrator on her pussy is the reward for taking so much punishment. Kindness is always followed up with more punishment as Delirious has her arms shackled behind her back and sits on the Tremor. Delirious is impatient for dick, she begs for it. Joeydotrawr gives her a little taste, an appetizer before getting down to business. The riding crop stings across Delirious’ bare breasts. She’s still begging for his dick. Joey turns up the Tremor and the vibrations shoot through Delirious’ body, yet she still tries to get his dick in her mouth. The Tremor finally becomes too much, even for this slut. She gives in to an intense orgasm. Gasping for air, Delirious still wants that dick. She’s begging to be fucked. Joey shuts her up with a nice pink ball gag. He fucks her on the couch then in the chair. Delirious sits on his cock, and pulls out the vibrator and gets pounded into another glorious orgasm. Delirious begs for more cock in her mouth. Even with the ball gag, she begs and pleads for Joey’s cock. He rewards her by shooting his load all over her naked chest. A lovely pearl necklace to show her neighbors.",
  "directors": [
    {
      "name": "Fivestar",
      "person_id": 58
    }
  ],
  "models": [
    {
      "name": "Delirious Hunter",
      "person_id": 56555
    },
    {
      "name": "Joeydotrawr",
      "person_id": 63025
    }
  ],
  "release_date": "2020-08-21",
  "scene_id": 46444,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "Crop",
    "Curvy",
    "Flogging",
    "Gag",
    "Leather",
    "master",
    "multiple orgasms",
    "natural boobs",
    "Pain",
    "Pain Slut",
    "shaved",
    "Straight",
    "Tattoo",
    "the chair",
    "Vibrator",
    "white"
  ],
  "title": "Afternoon Delight: Delirious Hunter and Joeydotrawr"
}