{
  "collections": [
    "Kinky Bites"
  ],
  "description": "Bussy Bradley spends his days cleaning southern goddess Kendall Penny’s house, building her sadistic BDSM furniture, and waiting eagerly for her to give him any attention at all. Today’s his lucky fucking day because Kendall’s in the mood to play with her submissive pain slut. She finds him with his head locked in a box, ass in the air, and wrists cuffed. Kendall flogs, whips, and crops his exposed vulnerable ass before she unlocks him and pulls him out onto his knees. He screams through his ball gag as she punches his balls, slaps his taint, and pokes at the cage locked around his little prick. She spits on him and laughs. Kendall demands that every inch of her beautiful body be worshiped and cleaned with Bussy’s mouth starting with the bottom of her boots, kissing up her long legs, licking her cock and balls and around her full breasts. With her cock down his throat, she has him proclaim his devotion before she turns around and buries his face in her ass. Kendall then locks his head back in the box and uses him like the piece of meat he is. She fucks his hungry ass allowing him to lift his head only to clean her cock off between poundings. He’s bent over the chair, fish hooked, and fucked on all fours before she allows him the honor of eating her sweet cum.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Bussy Bradley",
      "person_id": 63024
    },
    {
      "name": "Kendall Penny",
      "person_id": 61838
    }
  ],
  "release_date": "2020-07-20",
  "scene_id": 46441,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Blowjob",
    "Boot Worship",
    "bottom",
    "Cage",
    "CBT",
    "Chastity Play",
    "Corporal Punishment",
    "Crop",
    "Dominatrix",
    "Femdom",
    "Flogging",
    "Gag",
    "Pain",
    "Pain Slut",
    "southern",
    "spit",
    "Straight",
    "Swallow",
    "the chair",
    "TS",
    "Whipping"
  ],
  "title": "Kendall Penny: Bury Your Face Into My Goddess Hole"
}