{
  "collections": [
    "Kinky Bites"
  ],
  "description": "Kenzie Taylor and Seth Gamble break into an apartment late at night in hopes of finding some valuable loot. Cloaked in black and wearing a ski mask, Kenzie finds a drawer full of floggers, whips, nipple clamps, and rope. The implicit danger turns them both on. Kenzie suggests they fuck in the stranger’s bed and Seth doesn’t hesitate to indulge her. He strips Kenzie down exposing her round ass and perky tits. He puts all the toys to use, pinching her pink nipples with the clamps, using leather cuffs and rope to tie her down as he manhandles her, positioning her so he can crop her ass and thrust his hard cock down her throat at the same time. She clearly can’t get enough and immediately falls into the role of submissive cocksucking slut, begging to be choked and slapped as she cums over and over again on his big dick. He licks her pussy and presses the vibrator down on her throbbing clit knowing exactly what to do to get her off. Pushing her onto all fours, Seth drills her wet pussy from behind while he flogs her ass. She is then put on a chain leash and collar and alternates between riding Seth then licking her pussy juices off his cock. On her knees she gives him a sloppy blowjob and strokes him as she stares up at him with her beautiful blue eyes. She begs him for his cum and eagerly gets her face covered in his thick load.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Kenzie Taylor",
      "person_id": 59531
    },
    {
      "name": "Seth Gamble",
      "person_id": 57488
    }
  ],
  "release_date": "2020-08-07",
  "scene_id": 46443,
  "tags": [
    "BDSM",
    "big dick",
    "Big Tits",
    "Blonde",
    "Blowjob",
    "Bondage",
    "brunet",
    "Collar",
    "Crop",
    "fake boobs",
    "Flogging",
    "Hair Pulling",
    "Hitachi",
    "Leather",
    "Leather Cuffs",
    "Mask",
    "muscular",
    "Nipple Clamps",
    "Pussy Eating",
    "shaved",
    "Spanking",
    "Straight",
    "Stud",
    "switch",
    "toned",
    "Vibrator",
    "white"
  ],
  "title": "Breaking In: Seth Gamble Dominates Kenzie Taylor"
}