{
  "collections": [
    "Kinky Bites"
  ],
  "description": "We open on a tan, gorgeous Syren De Mer getting her huge tits slapped. Rick Stronghold bends her over and raises her tight leather skirt to spank her ass till its bright red, but that is just the warm up. He flogs her, canes her, and crops her ass and breasts. Syren proves herself by showing her gratitude and maintaining her composure despite the obvious sting and thud of his implements. He rewards his pet’s obedience with a single tail whipping. When she sees him walking towards her with the whip she smiles and shakes her ass with glee. Syren is such a hot pain slut. All this impact play has her wet and begging for his cock, but she must stop being a greedy slut. He decides when she can fuck and when she can come. His fucking machine thrusts a dildo deep in her pussy as he holds a bullet vibe on her clit and shoves his fingers in her cunt and then in her mouth. Her bound body trembles relentlessly as he pulls multiple orgasms out of her. Her pussy pushes the dildo out as her muscles contract. As he fucks her Rick grabs the rope binding her leg and uses it to thrust deeper into her horny cunt and she writhes in pleasure. Syren is instructed to climb up on Rick’s cock and ride him. Her bondage makes this difficult but he orders her to figure it out and fast. Her desire to please her Daddy is matched only by her need to be filled by his hard dick. Once she is bent over Rick spanks her ass and pounds her pussy as she thanks him over and over again. Syren is up on her knees eagerly deepthroating his prick until he squirts his cum in her mouth and tells her what a good girl she has been.",
  "directors": [
    {
      "name": "Sadie Lola",
      "person_id": 61
    }
  ],
  "models": [
    {
      "name": "Rick Stronghold",
      "person_id": 63038
    },
    {
      "name": "Syren de Mer",
      "person_id": 43807
    }
  ],
  "release_date": "2020-08-12",
  "scene_id": 46445,
  "tags": [
    "BDSM",
    "Bondage",
    "Caning",
    "Crop",
    "Dildo",
    "fake boobs",
    "Flogging",
    "Leather",
    "multiple orgasms",
    "Pain",
    "Pain Slut",
    "Redhead",
    "Rope Bondage",
    "shaved",
    "Single Tail",
    "Straight",
    "Tattoo",
    "toned",
    "Vibrator",
    "Whipping",
    "white"
  ],
  "title": "Thank You Daddy!: Syren De Mer and Rick Stronghold"
}