{
  "collections": [
    "DDF Network"
  ],
  "description": "Lara Onyx is chained to the ceiling of a dark room. The submissive blonde awaits her special double penetration treatment in the chamber of lust. Franco Roccaforte and Marco Banderas enter the room and start humiliating that hot Russian. The black German stud feeds her his black leather whip while Marco sucks her hard nipples. Time to give her some ass spanking! With a metal chain around her neck, the Russian bombshell starts sucking Franco big black cock while Marco inserts the whip into her tight shaved pussy. He can’t wait to fuck her twat before the two dudes feed her both cocks at the same time. After this multidick sucking moment of total humiliation, the two horny studs bang that blonde babe on the floor. She rides Franco while Marco stuffs her deep throat with his long john. Both bang her snatch and finally cram both her fuckholes at the same time! After some intense ass fingering and double penetration, the two guys blow their loads of cum in her mouth and leave her alone. Check out her full lips, ready to suck some dick again!",
  "directors": [],
  "models": [
    {
      "name": "Franco Roccaforte",
      "person_id": 63003
    },
    {
      "name": "Lara Onyx",
      "person_id": 63002
    },
    {
      "name": "Marco Banderas",
      "person_id": 27958
    }
  ],
  "release_date": "2020-07-10",
  "scene_id": 46459,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "bbc",
    "BDSM",
    "big dick",
    "black hair",
    "Blonde",
    "Blowjob",
    "Cage",
    "Chains",
    "Collar",
    "Deepthroat",
    "Double Anal",
    "Double Penetration",
    "Facefucking",
    "Facial",
    "Fingering",
    "Flogging",
    "foreskin",
    "German",
    "Humiliation",
    "Interracial",
    "Kinky",
    "Leather",
    "mixed",
    "muscular",
    "Pierced Pussy",
    "shaved",
    "Spanking",
    "Spit Roast",
    "Straight",
    "Stud",
    "Partner Studio",
    "Threesome",
    "Uncircumcised",
    "Vaginal Penetration"
  ],
  "title": "Chamber of Chains: Submissive Blonde Double Penetrated"
}