{
  "collections": [
    "Man Up Films"
  ],
  "description": "Ricky Larkin just got home from work on a Friday. He had to reprimand one of his younger employees, Tony Orlando, for slacking at the office and decided to dock his pay. Tony didn’t take it well, and Ricky is reluctantly talking to him on the phone about it.\n\nTony surprises the fuck out of his boss by sneaking into his house, going through his drawers and putting on his bath robe. Ricky, naturally, gets irate and demands that Tony get out of his robe and leave his house immediately. It’s completely inappropriate. Tony responds by pulling a magic necklace out of his pocket and showing his boss.\n\nHe quickly uses the necklace to gain complete control over Ricky’s mind and body. From there, he makes it clear that he lusts over his muscular and manly boss all day at work. Now that he has him under a spell, Tony perves on him hard. He makes him flex without his shirt on, worships his perfect hairy body, then sucks his cock.\n\nTony snaps Ricky in and out of the spell as he sucks his cock and makes Ricky eat his ass. Tony uses his magic to make Ricky cum in his mouth, but stay hard, because he’s going to need that dick for something else…\n\nTony still has magic power over his muscular and manly boss, Ricky Larkin. He incepts into Ricky mind that he thinks it’s a good idea to fuck all of his employees in the ass, starting with Tony.\n\nTony enjoys his boss’s huge hard cock, then snaps his fingers to made Ricky mentally aware of what is happening, but physically unable to stop fucking him. Ricky can’t stop fucking his employee, but he can rage out on him, grab him by the throat, slap him and pull his hair. Tony loves every second of it. He likes it rough and loves that his boss knows what is happening but can’t stop.\n\nHe snaps Ricky in and out of it a couple times, then takes all of Ricky’s cum in his ass. Then he snaps him back to completely aware and pretends that Ricky just invited him over, bent him over in the kitchen and fucked his ass. He leaves his boss with an HR nightmare and all the material he needs to never get fired.",
  "directors": [],
  "models": [
    {
      "name": "Ricky Larkin",
      "person_id": 35556
    },
    {
      "name": "Tony Orlando",
      "person_id": 48907
    }
  ],
  "release_date": "2020-07-08",
  "scene_id": 46450,
  "tags": [
    "Anal",
    "Bareback",
    "big dick",
    "black hair",
    "Blowjob",
    "brunet",
    "Choking",
    "Couple",
    "Deepthroat",
    "Gay",
    "Hairy",
    "mixed",
    "Muscle",
    "muscular",
    "Rimming",
    "Role Play",
    "shaped",
    "shaved",
    "switch",
    "Tattoo",
    "Partner Studio",
    "versatile",
    "white"
  ],
  "title": "Tony Mind Fucks His Hot Boss RAW"
}