{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Thick-muscled Lawson Kane, in jock and leather harness, ties scruffy punk boy Draven Torres’s hands behind his back. Holding tight to the Draven’s leather harness, he pounds his abs relentlessly, his huge arms flexing as he tests Draven’s endurance. Draven spits on Lawson’s big smooth chest which only earns him a longer fist beating, Lawson switching up the speed and target of his blows, until Draven falls to his knees in surrender. Lawson pulls out his hard, thick, uncut piece and shoves it in Dawson’s mouth, holding tight to Draven’s mohawk as he works the bound bottom’s throat muscles until the boy’s spit is dripping from Lawson’s full, dark sack. Lawson drenches Draven’s face and chest with piss, then pulls down Draven’s latex shorts and positions him on all fours, hands still tied behind his back. Lawson works his mammoth meat into Draven’s perfect ass, holding onto Draven’s bound wrists and pummeling him without mercy, claiming all of him. Lawson unties Draven’s hands just long enough to flip him over and plunge back into his steamy hole, working him deep as Draven pounds his own hard meat. Draven then lowers his own tight ass on Lawson’s thick meat, riding his cock like a young bronco before spraying his cum all over Lawson’s abs",
  "directors": [],
  "models": [
    {
      "name": "Draven Torres",
      "person_id": 62520
    },
    {
      "name": "Lawson Kane",
      "person_id": 63028
    }
  ],
  "release_date": "2020-07-10",
  "scene_id": 46462,
  "tags": [
    "Anal",
    "bbc",
    "BDSM",
    "Blowjob",
    "Bondage",
    "bottom",
    "Deepthroat",
    "Facefucking",
    "Fetish",
    "Gay",
    "Interracial",
    "jock",
    "Jockstrap",
    "Latex",
    "Leather",
    "Muscle",
    "Oral Sex",
    "Piss Play",
    "Punching",
    "harness",
    "Rimming",
    "Rough Sex",
    "smooth",
    "spit",
    "Tattoo",
    "Partner Studio"
  ],
  "title": "PUNCHED AND POUNDED: Lawson Kane and Draven Torres"
}