{
  "collections": [
    "Str8Hell"
  ],
  "description": "Sexy st8 guy Stano Janda, having had his cherry busted on williamhiggins.com is get more cock in his ass from str8 guy Karel Polak. But the situation is different, as Stano has been arrested but security. As he is left alone his tries to hide the wallets he has been stealing. Karel returns and explains that he has video of Stano stealing. Karel makes Stano start to strip. When he opens his jeans and pushes them down it is clear that there is more than just cock in his underwear. He has to hand over the wallers to Karel. Then he is told to get naked. He is told to sit and Karel takes Stanos hand and pushes it against his pants. Then Karel opens his pants and pulls out his big cock. He makes Stano wank the cock, and then tells him to suck it. Stano leans forward and starts to lick and suck the cock. Karel grabs Stano’s head and pushes it onto his thick, stiff, dick. Stano sucks on the cock for a while. That cock gets so hard as Karel pushes the head onto it. He slaps Stano’s face too and then moves him onto his knees. With that sexy ass available Karel’s thick dick soon slides deep inside as Stano moans loudly. Karel pounds that sexy ass, fucking deep as Stano moans. Karel spanks the ass as he fucks it hard. He moves Stano onto the floor and fucks him some more. That throbbing cock goes so deep in Stano’s hole and he keeps up his moaning as he feels it. Then Karel needs to cum, so he pulls out and stands over Stano to shoot his cum as Stano’s tongue comes out of his mouth trying to taste it. Karel obliges by moving so that Stano can suck on the sticky dick, still with his legs in the air wanting more cock.",
  "directors": [],
  "models": [
    {
      "name": "Karel Polak",
      "person_id": 63013
    },
    {
      "name": "Stano Janda",
      "person_id": 63012
    }
  ],
  "release_date": "2020-07-09",
  "scene_id": 46464,
  "tags": [
    "Anal",
    "Bareback",
    "big dick",
    "Blowjob",
    "Deepthroat",
    "Facefucking",
    "Gay",
    "Role Play",
    "Partner Studio",
    "Twink",
    "Uncircumcised",
    "uniform"
  ],
  "title": "Stano & Karel - YOUNG OFFENDERS RAW"
}