{
  "collections": [
    "House of Taboo"
  ],
  "description": "Brandy Smile is ready for a horny horseback ride on her human pony named Luna Rival. The dominant jockey humiliates our new face in today’s episode of House of Taboo by DDF Network! See the brunette Hungarian dressed as a jockey put a saddle on her submissive’s back. Luna is a young college student from France. The beautiful blue-eyed teen with brunette hair and an irresistible smile on her gorgeous face can’t balance the heavy saddle on her petite back. With a gagball in her mouth, she receives some spanking by Brandy’s black leather whip. The long-haired domina slaps her playmate’s curvy butt cheeks with her hands and crams her anus with a buttplug. Next up, she slides an enormous black double dong into her asshole and stuffs the other end into her gaping shaved pussy! Her submissive girlfriend’s wrists are tied together while she bangs her anus with a thick flesh-colored dildo! Watch her trimmed pussy gape before she is granted a second chance and licks her master’s twat before going for a ride. XXX Lesbian Fetish at its finest! Enjoy and hit like if you would like to see more of our hot little newbie!",
  "directors": [],
  "models": [
    {
      "name": "Brandy Smile",
      "person_id": 61806
    },
    {
      "name": "Luna Rival",
      "person_id": 60512
    }
  ],
  "release_date": "2020-07-10",
  "scene_id": 46460,
  "tags": [
    "Anal",
    "BDSM",
    "Big Toy",
    "bit gag",
    "Brunette",
    "buttplug",
    "Crop",
    "Curvy",
    "Dildo",
    "Domination",
    "Femdom",
    "Fetish",
    "Foot Torment",
    "Gaping",
    "Humiliation",
    "Kinky",
    "Leather",
    "Lesbian",
    "LezDom",
    "master",
    "natural boobs",
    "Pain",
    "Pet Play",
    "Petite",
    "Pony Play",
    "Pussy Eating",
    "Rimming",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Partner Studio",
    "Vaginal Penetration",
    "white"
  ],
  "title": "Horny Horseback Ride - Dominant Jockey Humiliates New Face"
}