{
  "collections": [
    "Kinky Bites Men"
  ],
  "description": "When Dallas Steele shows up to record for a podcast, he has no idea what he’s in store for. Owen Andrews can’t wait to get his hands on Dallas. He takes Dallas by surprise, yanking him into his house. Soon Dallas finds himself stripped to his jockstrap and boots and restrained in a leather sling. His masked captor, runs his hands along Dallas’ muscles and pulls his cock out of his jock, stroking him to hardness. Dallas moans as his captor’s clever hands have their way with his body. Owen slides a pump over Dallas’ cock and soon Dallas is twisting in ecstasy as the pump milks his cock. His hips thrust desperately as Owen edges him slowly. And Owen is just getting started. He slips a narrow dildo attached to a fucking machine into Dallas’ ass and turns up the speed. Owen watches as Dallas is overcome with pleasure from being at the mercy of these two automated machines. Next, Dallas is restrained over a spanking bench. Owen spanks Dallas’ ass before filling it again with a dildo. Dallas moans as Owen replaces the dildo with his own hard fat cock. Soon Dallas is getting fucked hard by someone who’s face he can’t even see. Dallas’ moans get louder and louder as this man uses his body. Finally, Owen blows his load all over Dallas’ face. Now the podcast recording can begin.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dallas Steele",
      "person_id": 61115
    },
    {
      "name": "Owen Andrews",
      "person_id": 63034
    }
  ],
  "release_date": "2020-07-28",
  "scene_id": 46467,
  "tags": [
    "Anal",
    "Ass To Mouth",
    "BDSM",
    "big dick",
    "body builder",
    "Dildo",
    "Facial",
    "Gay",
    "Handler",
    "jock",
    "Jockstrap",
    "Leather",
    "Machine Dildo",
    "Mask",
    "muscular",
    "other hair color",
    "Spanking",
    "white"
  ],
  "title": "Podcast Pervert: Dallas Steele Gets Got!"
}