{
  "collections": [
    "Kinky Bites Men"
  ],
  "description": "Dillon Diaz is rock hard and ready to blow his load! Too bad for him, Mason Lear has other plans. He strips Dillon of his jockstrap and makes him bury his face into his own sweaty musk. He hits Dillon’s chest with his gloved hands. He puts a bit gag on Dillon and restrains his hands with leather. Now all this muscle is at his mercy. Mason wraps his hands around Dillon’s cock, strokes him until Dillon is begging to cum. But Mason isn’t done yet. He slips Dillon’s cock into a stroker fucking machine and watches as it devours Dillon’s rock hard cock. Soon Dillon is thrusting his hips forward, chasing the pleasure brought by the tight slickness enveloping his cock. Next, Mason has Dillon on his back. He buries his tongue in Dillon’s ass before pushing a gloved finger into its tight embrace. Then he pushes a pulsating prostate plug into Dillon’s ass. Dillon moans as his ass is breached by the plug and he gets on his hands and knees to service Mason’s hard cock. Mason fucks his face and then blows his load all over Dillon’s face. Mason pushes Dillon down and edges him until he shoots a creamy load all over his leather gloves. Dillon eagerly cleans off Mason’s gloves and is rewarded with a hot searing kiss from Mason.",
  "directors": [
    {
      "name": "Sebastian Keys",
      "person_id": 59
    }
  ],
  "models": [
    {
      "name": "Dillon Diaz",
      "person_id": 61853
    },
    {
      "name": "Mason Lear",
      "person_id": 60275
    }
  ],
  "release_date": "2020-08-06",
  "scene_id": 46471,
  "tags": [
    "Anal Fingering",
    "Athletic",
    "BDSM",
    "big dick",
    "bit gag",
    "black hair",
    "brunet",
    "buttplug",
    "Edging",
    "Gag",
    "Gay",
    "gloves",
    "Jockstrap",
    "Leather",
    "Leather Gloves",
    "Muscle",
    "muscular",
    "Rimming",
    "Stud",
    "white"
  ],
  "title": "Edging Dillon: Mason Lear Teases Dillon Diaz Till He Blows!"
}