{
  "collections": [
    "DDF Network"
  ],
  "description": "Jasmine Jae is a horny wife and constantly thinking of cock sucking. Her mind is spinning around intense and hard pornography, even when Ryan Ryder pays her a visit. The neighbor feels so attracted to that black-haired busty beauty, he can’t wait to make out with her! She slides his dong down her deep throat and sucks his balls before taking off her panties for a reverse cowgirl ride. She enjoys that hard dick inside her trimmed pussy! Ryan crams her crotch with his face when suddenly her husband Mugur enters the livingroom. He can’t believe his eyes! The cuckold sits next to the couple and starts whining. Jasmine can’t stand that miserable noise and ties him up with a black strap. Mugur sits and watches the two fucking right in front of his eyes! The dominant wife needs her ass to be filed with a hard dick and Ryan can’t wait to penetrate her gaping butthole with his helmet! After some ass fucking, the domina starts sucking Mugur’s cock as well and lets him bang her box for a bit. A handjob later, Ryan cums on her ass while Mugur blows his jizz all over her gaping twat!",
  "directors": [],
  "models": [
    {
      "name": "Jasmine Jae",
      "person_id": 59210
    },
    {
      "name": "Mugur",
      "person_id": 33526
    },
    {
      "name": "Ryan Ryder",
      "person_id": 60502
    }
  ],
  "release_date": "2020-07-20",
  "scene_id": 46498,
  "tags": [
    "Anal",
    "Anal Creampie",
    "Athletic",
    "big dick",
    "Big Tits",
    "blond",
    "Blowjob",
    "Bondage",
    "bottom",
    "british",
    "brunet",
    "Brunette",
    "Couple",
    "Cuckolding",
    "Deepthroat",
    "Facefucking",
    "fake boobs",
    "foreskin",
    "Gag",
    "Gaping",
    "Handjob",
    "High Heels",
    "Kinky",
    "MILF",
    "Nylons Stockings",
    "Pierced Nipples",
    "Pierced Pussy",
    "Pussy Eating",
    "shaved",
    "Spit Roast",
    "Straight",
    "Stud",
    "Tattoo",
    "Partner Studio",
    "Threesome",
    "toned",
    "Vaginal Penetration",
    "white"
  ],
  "title": "The Bound Cuckold - A Horny Wife's Deep Throat Affaire"
}