{
  "collections": [
    "SW Nude"
  ],
  "description": "Bradley Cook and Tomas Decastro are two of the hottest guys around. They are in for a wrestling match and start with some warming up exercises and some stretching. Then it is on with the match. Straightaway they are rolling all over the mats, trying to gain a hold. It is Bradley who prevails and quickly gains a submission. He also wins the second round in very quick time. Tomas isn’t about to give up so easily and strains to hold off Bradley, and to gain an advantage. But round 3 also goes Bradley’s way despite Tomas’ huge efforts. They remove their underwear before starting the next round and with their cocks and asses on show Bradley quickly gains a neck hold that gives him another point. It seems he has the measure of Tomas, seemingly able to counter any attempt that Tomas may make. As the roll over the mats Tomas falls against Bradley’s balls which gains him his first points. Bradley grabs his aching balls before they start the next round. He quickly recovers though and continues on his winning ways. With the score at 7-1 to Bradley they take a break to oil each other all over. Then it is on with the match, and Bradley continues his inexorable progress to victory, winning by 10-2. They settle down on the mats for a wank off and in the process they wank each other for a while. Bradley’s cock is soon big and hard and he wins the wank off, shooiting his cum all over the place. Tomas continues to wank and he too dumps his creamy load which runs down his balls and thigh onto the mats. They clean each other off and then go the the shower to clean up.",
  "directors": [],
  "models": [
    {
      "name": "Bradley Cook",
      "person_id": 60772
    },
    {
      "name": "Tomas Decastro",
      "person_id": 61291
    }
  ],
  "release_date": "2020-07-16",
  "scene_id": 46493,
  "tags": [
    "blond",
    "body builder",
    "erotic wrestling",
    "Fetish",
    "foreskin",
    "Gay",
    "masturbation",
    "Muscle",
    "muscular",
    "Submission",
    "Partner Studio",
    "Uncircumcised",
    "white",
    "Wrestling"
  ],
  "title": "Bradley vs Tomas - WRESTLING"
}