{
  "collections": [
    "House of Taboo"
  ],
  "description": "A BDSM prescription sometimes helps against blue balls. Today’s episode of House of Taboo by DDF Network is a HD masterpiece, starring Candy Alexa and Kai Taylor. The British doc with brunette hair and brown eyes crams his hot nurse’s mouth with a black gagball. The blue-eyed beauty loves role plays with her boss and asks him to put handcuffs around her wrists. She wanks his boner and gives him a handjob before he licks her trimmed pussy. Then, he penetrates his submissive’s wet box with his big dong. Once that gagball has been removed, the Doc crams her deep throat with his rod and starts fucking her snatch from behind. Kai probes her tight anus with his fingers and inserts two fingers deep into her asshole. Some licking lubes up her derriere and prepares that butthole for his thick prick. Kai bangs the submissive nurse doggy style and ass-fucks her until her butthole gapes! The horny nurse rides his big dong in reverse cowgirl style and fingers her pussy at the same time. Finally, she receives a big load of cum in her face. This nurse wants more!",
  "directors": [],
  "models": [
    {
      "name": "Candy Alexa",
      "person_id": 59416
    },
    {
      "name": "Kai Taylor",
      "person_id": 61191
    }
  ],
  "release_date": "2020-07-17",
  "scene_id": 46490,
  "tags": [
    "Anal",
    "Anal Fingering",
    "Ass To Mouth",
    "Ball Gag",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "british",
    "Brunette",
    "Deepthroat",
    "Doctor",
    "Facefucking",
    "Facial",
    "fake boobs",
    "Fetish",
    "foreskin",
    "Handjob",
    "High Heels",
    "Kinky",
    "Medical Fetish",
    "muscular",
    "Nurse",
    "Nylons Stockings",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Partner Studio",
    "Uncircumcised",
    "uniform",
    "Vaginal Penetration",
    "white"
  ],
  "title": "BDSM Prescription - Handcuffed And Gagged in The Clinic"
}