{
  "collections": [
    "Submissived"
  ],
  "description": "Lexi wakes up furious. Her boyfriend Bruno forgot to pay the rent and they only have less than a week to come up with the cash. How could he do this? What an asshole! Bruno could sense the anger in Lexi, and assured her he would find some way to come up with the cash. Lexi goes into the living room to cool down and Bruno follows with a bright idea. He had met a hardcore porn producer at a club who pays top dollar for amateur content, more than enough to cover what they owe. Lexi was hesitant, but Bruno assured her it would not only solve their issue quickly but also be fun. Lexi was officially down. Bruno ties her up and gags her in the middle of the living room. He begins to hit her with a massive dildo and shove it in her pussy while she whimpers in dismay. She seemed ready for more. Bruno then ripped the gag off and dragged her to the coach where he spit in her mouth, slapped her around, and violated all the holes he could. They pretty much filmed everything they needed to get the rent money, but they might as well go the extra mile for more cash that they can spend leisurely. Bruno jizzes all over Lexis strained face, earning them just enough for a swell brunch so they can discuss their future porn endeavors! And maybe a more strict rent payment schedule too.",
  "directors": [],
  "models": [
    {
      "name": "Bruno Dickemz",
      "person_id": 54328
    },
    {
      "name": "Lexy Bandera",
      "person_id": 62960
    }
  ],
  "release_date": "2020-07-22",
  "scene_id": 46505,
  "tags": [
    "Anal Fingering",
    "Athletic",
    "Ball Gag",
    "big dick",
    "black hair",
    "Bondage",
    "brunch",
    "Choking",
    "Deepthroat",
    "Dildo",
    "Domination",
    "Facefucking",
    "Facial",
    "Gag",
    "Hair Pulling",
    "Latinx",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "spit",
    "Straight",
    "Tattoo",
    "Partner Studio",
    "top",
    "Vaginal Penetration"
  ],
  "title": "Paying Rent The Hard Way"
}