{
  "collections": [
    "CFNMEU"
  ],
  "description": "Hugo Antonin is studying when he is interrupted by his sexy girlfriend. He needs to study but she has other ideas. She soon has Hugo’s attention and begins to strip him as he sits in the chair. First, she bares his chest and leans over to rub it. Then he opens his pants and reaches inside to rubs his cock. That cock is very hard and pokes out of Hugo’s pants. The girl says she has some surprises for him and produces some cuffs. She cuffs his hands behind his back and then kneels in front of Ivan. She kisses him and starts wanking his throbbing cock. She then takes a whip and alternates between whipping and kissingn Hugo. His big cock stays rock hard as she plays with him. Things get more serious as she pins his nipples and gags his mouth, slapping his face and his stiff cock. Pulling his shorts off the girl ties rope around his cock and balls and pulls on them. Hugo takes it all and then enjoys the feel of her hot mouth on his rampant cock. The girl still has more ideas and moves Hugo to the sofa, with his legs in the air. She spanks his sexy ass as his hole is fully exposed. Then she takes a vibrator and shoves it into his ass hole. Hugo moans as he takes the toy up his ass. A larger toy is then used to stretch that hole wider. The girl fucks Hugo’s hole with the toy. She turns him onto his knees and fucks his hot hole some more. That dildo goes deep into Hugo’s ass, as he sucks on the other toy. Then a thicker toy is used to fuck him even more. Hugo is then allowed to turn over and wank his cock. He wanks it hard and keeps going until he unloads his hot cum onto his belly.",
  "directors": [],
  "models": [
    {
      "name": "Hugo Antonin",
      "person_id": 60752
    },
    {
      "name": "Iryna",
      "person_id": 63018
    }
  ],
  "release_date": "2020-07-23",
  "scene_id": 46513,
  "tags": [
    "Anal",
    "Athletic",
    "bit gag",
    "Blowjob",
    "Bondage",
    "brunet",
    "CFNM",
    "Dildo",
    "Domination",
    "foreskin",
    "Handjob",
    "Kinky",
    "Male Sub",
    "Slapping",
    "Straight",
    "the chair",
    "Partner Studio",
    "Vibrator",
    "Whipping",
    "white"
  ],
  "title": "Hugo Antonin - CFNM"
}