{
  "collections": [
    "PegHim"
  ],
  "description": "Siouxsie Q knows first hand just how much Sonia Harcourt enjoys fucking a slutty asshole with a big strapped on cock, as the two have had their share of fun in the past. The intoxicating chemistry between the fiery redhead and the innocent brunette lead seasoned butt slut Michael Vegas into a spicy threeway that starts with the two girls peeling off his blue jeans and using their tongues to pleasure his eager asshole. Sonia is a huge fan of boy butts, admitting she often rims and pegs her husband both on and off camera. Her authentic lust for licking men’s assholes is apparent as she squeals with delight with every lap her long tongue takes of Michael’s sphincter, alternating pleasuring his most sensitive areas with her luscious red lips and warming up his ass up by playfully inserting her bright candy apple red polished fingers in and out of his ass, eventually sliding in her entire hand inside him-something she can hardly believe! She starts to lube up the giant cock she’s strapped on as Siouxsie directs her from behind the camera on the best way to fully use and abuse her boyfriend’s hole. Then, the curvy brunette and her redhead friend truly go to town on Michael’s hole, shoving their giant cocks inside of him one at a time, and then eventually attempting to get both in at the same time to really stretch and test how much his pighole can take. The girls decide bareback is best, and opt to dig their manicured hands into a good old fashioned tub of vegetable shortening to prepare their fists to penetrate his hole as well. Sonia displays Michael’s adorable gape, and Siouxsie, from behind the camera goes dick first into her man’s hole, adding her hand and eventually Sonia’s, as the two girls explore the limits of Michael’s ass. He somehow ends up on his back with Sonia lustily stroking his cock and massaging his balls while Siouxsie punch fucks his pighole into loving submission until he squirts cum all over his hairy chest and Sonia’s sweaty, elated body.",
  "directors": [],
  "models": [
    {
      "name": "Michael Vegas",
      "person_id": 47624
    },
    {
      "name": "Siouxsie Q",
      "person_id": 34821
    },
    {
      "name": "Sonia Harcourt",
      "person_id": 62780
    }
  ],
  "release_date": "2020-07-29",
  "scene_id": 46531,
  "tags": [
    "Anal",
    "Anal Stretching",
    "Bareback",
    "Big Toy",
    "black hair",
    "blond",
    "bottom",
    "Brunette",
    "Curvy",
    "Dildo",
    "Femdom",
    "Fisting",
    "Hairy",
    "mixed",
    "natural boobs",
    "Pegging",
    "Redhead",
    "Rimming",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "Partner Studio",
    "Threesome",
    "top",
    "white"
  ],
  "title": "Sonia Harcourt and Michael Vegas"
}