{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "Massive muscle man Spencer Reed, handsome buzz-headed Junior Stellano, and a furry, inked Tibor Wolfe, wearing latex chaps, swap spit and cock strokes in a dim-lit dungeon. The leather harnessed Spencer face-fucks Tibor, then aims a strong geyser of piss all over Tibor’s hole, slapping his ass until drops fly through the air. He gets his big cock into Tibor, holding tight to his waistband for leverage as he pounds away. Junior take his turn on Tibor’s hairy hole, fucking him hard until his balls slap the bottom’s cheeks. Junior pulls out and works his wet fingers into the stretched hole. Spencer grunts, “It’s your turn, boy,” ordering Junior down on all fours so that Spencer can get his thick hard pipe all the way into Junior’s muscular ass with one shove. Spencer pulls out of Junior to spit on and slap his hole, then plows back in again. Then Spencer slams an enormous, ridged dildo into Tibor’s upturned ass. Tibor takes it like a trooper, grunting, his mouth firmly clamped around Junior’s cock. Spencer works the monster dildo all the way in, shaking it around to give Tibor’s prostate a good work-out. Spencer and Junior admire his stamina before shoving in a thicker dildo. Junior slides his entire fist into Tibor’s stretched hole as Spencer marks the bottom with another piss geyser. Then Spencer works his big hand slowly up into Tibor, opening the man’s ass enough to take his entire fist. Then Spencer urges Tibor to back up on both of Junior’s slick mitts. Junior punch-fucks Tibor with alternating fists, Tibor’s cock standing at attention as he opens up his deep red hole for Junior’s inspection. Lodging his fist firmly up the bottom’s ass, Junior urges Tibor to pound his meat until he erupts all over his hairy chest. In serious heat, Spencer and Junior dump their own thick loads of cum all over the blissed-out bottom.",
  "directors": [],
  "models": [
    {
      "name": "Junior Stellano",
      "person_id": 63077
    },
    {
      "name": "Spencer Reed",
      "person_id": 19086
    },
    {
      "name": "Tibor Wolfe",
      "person_id": 39831
    }
  ],
  "release_date": "2020-07-31",
  "scene_id": 46535,
  "tags": [
    "Anal",
    "Anal Fisting",
    "Anal Stretching",
    "big dick",
    "Big Toy",
    "Blowjob",
    "body builder",
    "bottom",
    "brunet",
    "Deepthroat",
    "Dildo",
    "dungeon",
    "Facefucking",
    "Fetish",
    "Fisting",
    "Gaping",
    "Gay",
    "Hairy",
    "Latex",
    "Leather",
    "Muscle",
    "muscular",
    "Piss Play",
    "Prolapse",
    "Rimming",
    "Rough Sex",
    "shaved",
    "Slapping",
    "spit",
    "Spit Roast",
    "Tattoo",
    "Partner Studio",
    "unshaved",
    "white"
  ],
  "title": "FIST DEEP: Junior Stellano, Spencer Reed, Tibor Wolfe"
}