{
  "collections": [
    "House of Taboo"
  ],
  "description": "Nikki shows up at her massage appointment at Kai Taylor’s massage parlor and feels attracted to the humble Brit. She takes off her clothes and awaits a relaxing massage which soon turns into absolute humiliation! The blonde babe with small natural tits and tattoos is a Russian BDSM lover and receives a very special treatment in today’s House of Taboo premium fetish porn by DDF Network! Kai stuffs her tiny asshole with his massive cock after feeding her that dong down her deep throat. He also pinches her hard nipples and wraps a rope around her wrists before putting clips all over her torso! The light-skinned milf gets her deep throat stuffed with his dong and receives some intense spanking with a rolling pin! The dominant massage therapist crams Nikki’s small asshole with that enormous dick and bangs her butt deeper and deeper! Nikki can’t stop moaning and feels his strong hands inside her fuckhole before he penetrates her face with his shaft until he blows his cum down her deep throat! Today’s BDSM premium porn is loaded with dirty kinkiness and you will for sure enjoy this gorgeous anal gape of hers! Hit like and leave a comment to see more bondage scenes with horny Nikki!",
  "directors": [],
  "models": [
    {
      "name": "Kai Taylor",
      "person_id": 61191
    },
    {
      "name": "Nikki",
      "person_id": 63061
    }
  ],
  "release_date": "2020-08-03",
  "scene_id": 46542,
  "tags": [
    "Anal",
    "Anal Fingering",
    "BDSM",
    "black hair",
    "Blonde",
    "Blowjob",
    "Bondage",
    "Clothespins",
    "Deepthroat",
    "Facefucking",
    "Facial",
    "Fetish",
    "Fingering",
    "foreskin",
    "Hand Gagging",
    "Humiliation",
    "MILF",
    "muscular",
    "Paddle",
    "Pain",
    "Pussy Eating",
    "Rope Bondage",
    "shaved",
    "Spanking",
    "Straight",
    "Partner Studio",
    "white"
  ],
  "title": "Absolute Humiliation: Bondage & Clips Instead Of Massage & Tips"
}