{
  "collections": [
    "DDF Network"
  ],
  "description": "Did you ever ask yourself what’s going on during a nurse’s lunch break? Well, there’s no time for food at all because they get horny as fuck! Today’s video lets you catch a glimpse of what’s going on during those breaks, so get ready and meet the hot and dangerous Russian brown-eyed nurse Kendra Star and her submissive beautiful colleague, the blonde German chick Lena Nitro in this Full HD extreme sex BDSM lesbian bondage episode. Kendra walks up to Lena while she is busy on her phone. She opens a pack of bandages and starts wrapping her up on that chair so she can barely move. While sliding her strong hands all over Lena’s thin body she spreads her legs, and rubs her face into her wet pussy. Then she starts fingering that cunt’s pink little slit while getting her box licked, right before she starts slapping that young teen’s curvy tight ass cheeks dark red. Then Kendra puts on blue latex gloves and stretches Lena’s mouth. She spits into her cavity, then opens Lena’s uniform and squeezes her tits with their pierced nipples. Finally Kendra probes Lena’s pussy and asshole with her gloved fingers, laying her on the desk and takes off her panties to wipe them across Lena’s face. That’s just the beginning! Stop by for round two, coming up next.",
  "directors": [],
  "models": [
    {
      "name": "Kendra Star",
      "person_id": 42132
    },
    {
      "name": "Lena Nitro",
      "person_id": 62799
    }
  ],
  "release_date": "2020-08-10",
  "scene_id": 46562,
  "tags": [
    "Anal Fingering",
    "BDSM",
    "Blonde",
    "Bondage",
    "Brunette",
    "Curvy",
    "Dominatrix",
    "Fetish",
    "Fingering",
    "German",
    "gloves",
    "Hand Gagging",
    "Kinky",
    "Latex",
    "Lesbian",
    "LezDom",
    "Lingerie",
    "Medical Fetish",
    "natural boobs",
    "Nurse",
    "Nylons Stockings",
    "Pierced Nipples",
    "Pussy Eating",
    "shaved",
    "Slapping",
    "slim",
    "Spanking",
    "Straight",
    "Partner Studio",
    "uniform",
    "Vibrator",
    "white"
  ],
  "title": "Nurse Break - Hot Babes Find Out About Their Fetish Destiny, Part 1"
}