{
  "collections": [
    "DDF Network"
  ],
  "description": "The Russian brown-eyed dominant nurse Kendra Star continues to control her submissive colleague, the blonde German chick Lena Nitro in this Full HD BDSM lesbian bondage sequel. Lena is tightly tied to the exam table with her shiny pink high heels still on, struggling and trying to escape. But that bondage around her wrists and ankles is too tight. Her tiny natural tits are bouncing up and down, and those pierced nipples get hard when her mistress enters the room to prepare her for some hardcore fetish action. Her medical scrubs wide open, Kendra walks in with a rabbit-style sex toy in her hands and gently strokes along that naked slut’s pelvis right before making her put that entire stick in her mouth. She rams that red anal plug between Lena’s red lips while rubbing her slit with the vibrator. Kendra shifts her around and doggy styles that anal plug right into her tight rosebud. Still tied up to that exam table, Lena’s pink twat gets dripping wet when Kendra inserts that cork into her asshole and starts fingering her clit before resuming that deep ass plowing with her rabbit style vibrator. Finally, she swings her curvy butt on the exam table and spread her legs to rub Lena’s face into her pussy, just before leaving that room - with Lena still plugged in and bound to the table.",
  "directors": [],
  "models": [
    {
      "name": "Kendra Star",
      "person_id": 42132
    },
    {
      "name": "Lena Nitro",
      "person_id": 62799
    }
  ],
  "release_date": "2020-08-13",
  "scene_id": 46581,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "Brunette",
    "buttplug",
    "Curvy",
    "Dildo",
    "Dominatrix",
    "Fetish",
    "Fingering",
    "German",
    "High Heels",
    "Lesbian",
    "LezDom",
    "Medical Fetish",
    "natural boobs",
    "Nurse",
    "Nylons Stockings",
    "Pierced Nipples",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Partner Studio",
    "Vaginal Penetration",
    "Vibrator",
    "white"
  ],
  "title": "Nurse Break - Hot Babes Find Out About Their Fetish Destiny, Part 2"
}