{
  "collections": [
    "TitanMen Rough"
  ],
  "description": "The stark contrast of their skin tones makes the visual even hotter: dark, tan, tattooed\nand hairy Alessio Romero is instantly engaged in a passionate kiss with smooth,\nlight-skinned blond Billy Berlin. As they lick pits and rub chests, Billy spits in his bud’s\nmouth before falling to his knees. After a wet suck, the two kiss as their cocks grind.\nAlessio deep throats Billy, who feeds his fingers to him before spitting into Alessio’s\nmouth and fucking his face. The two piss on each other before Billy bends over. The\nverbal Alessio eats and fucks the bottom, constantly spitting down on Billy (who turns\naround to grab the top’s pec). Billy turns over as Alessio’s hairy ass thrusts deep, the\ntop’s muscular back getting sweatier. A huge dildo and some fingers are up Billy\nnext. With his abs tight, the bottom smiles and stays stiff, his boner propped up by\nAlessio. The scene excites Tony Buff, who rubs his dick and lets out a huge stream\nof piss as he watches.\nAfter Billy’s hole swallows an even bigger dildo, his sticky ass welcomes Alessio’s\nfists - which take turns sliding in and out. The top twists in deep, his hairy forearms\nsoaked with ass juice. He spreads Billy’s cheeks, showing off the bright-red cherry\nbefore the bottom crouches on a ladder and sits down on Alessio’s arm. Billy jacks to\ncum before the equally excited Alessio dumps a massive load on the floor, shouting\nout “Motherfucker!” to end the intense and extreme encounter.",
  "directors": [],
  "models": [
    {
      "name": "Alessio Romero",
      "person_id": 20463
    },
    {
      "name": "Billy Berlin",
      "person_id": 18898
    }
  ],
  "release_date": "2020-08-14",
  "scene_id": 46582,
  "tags": [
    "Anal",
    "Anal Stretching",
    "Athletic",
    "Big Toy",
    "blond",
    "Boot",
    "bottom",
    "brunet",
    "Deepthroat",
    "Dildo",
    "Facefucking",
    "Fetish",
    "Fisting",
    "Gay",
    "Hairy",
    "Jockstrap",
    "Latinx",
    "muscular",
    "Piss Play",
    "Rimming",
    "smooth",
    "Tattoo",
    "Partner Studio",
    "top",
    "white"
  ],
  "title": "ANAL ASSAULT: Billy Berlin and Alessio Romero"
}