{
  "collections": [
    "The Training Of O"
  ],
  "description": "Applicant Profile\n\nAge:\n18\nSign:**Cancer\n**Disposition:\nBrat\n\nFears / Current Limits:\nOther than no anal sex, she claims to have none outside of shooting rules\n\nStrengths:\nApplicant appears familiar with BDSM and power exchange and claims to be ‘able to process pain really well’. She seems to possess an adventurous and enthusiastic personality.\n\nWeaknesses:\nApplicant has trouble with the cane and single tail whip. She cannot control her breathing in corsetts and tight bondage. Weak anal skills, fidgets, difficulty standing still for punishment. She is very ticklish. Applicant claims to be ‘a very bratty submissive’.\n\nExperience:\nSome experience in public BDSM scene, limited commercial BDSM and mainstream porn films\n\nCurrent Status:\nunowned\n\nInitial Observations:\nApplicant describes herself as ‘the little kid who tests boundries’ and says she ‘needs someone (to top her) who will not back down’. She sounds like a classic argumentative, bratty submissive. Through the interview she fidgets nervously, holds eye contact sporadicly, and rambles on quite insescently.\n\nShe does seem excited by the prospect of training, and this is accompanied by an apparent understanding of basic BDSM philosophy. She is intellengent and nerdy with an inherent cuteness that is aching to be developed.\n\nRecommendations:\nGag her right away to teach the value of succinct speech. Deliver an over the knee spanking to test her composure, control, and ability to process pain. Impose a few strict rules for her to break and correct her with the cane. Watch her squirm and attempt to teach her to take a punishment properly.\n\nFuck her mouth and pussy with a dick on a stick till she begs to orgasm, then stuff her mouth with a hard cock to suck off. Come on her face, rate her blowjob skills and send her to her quarters for the evening to do her homework.\n\nPerform a surprise inspection of her quarters late at night. Blindfold her and bring in William. Do not allow her to see him for the entire evening while she fucks and sucks him for our amusement.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Billy",
      "person_id": 13720
    },
    {
      "name": "Devi Lynne",
      "person_id": 13394
    }
  ],
  "release_date": "2007-08-10",
  "scene_id": 4661,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "blond",
    "Blowjob",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gag",
    "Gimp",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Public",
    "Role Play",
    "Rope Bondage",
    "Single Tail",
    "Slave",
    "Spanking",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "The Training of Devi Lynne, Day One"
}