{
  "collections": [
    "Device Bondage"
  ],
  "description": "**\n\nOxygen\n\n**\nSince her last shoot, Ariel X managed to find a new friend who beats up her during sex. She’s rather pleased and she smiles when she talks about it.\n\nWhen I buckle a leather control collar around her neck she begins to fidget and twist her head. She is getting nervous and I like it. By the time I finish strapping her down and sliding the gas mask into place, her breathing is heavy and panic is building.\n\nI lay down on my stomach as I approach with the cattle prod set on high. With the mask on, she can’t see where I’m going to strike. The shocks come out of nowhere and the unexpected searing pain makes her jump and gasp for air only to to find there is none to be had with my palm pressing sealing off the intake hose. Her lungs are burning, desperately working in vain, but all they can do is pull the mask tighter against her face. Her neck bulges like a sausage trapped in the leather collar. Fear is in her eyes now and sweat begins to bead on her skin.\n\nI keep shocking her and sealing off her air. I look down at her wide eyes through the holes in the mask and for a moment I imagine I’m not going to let go, I’m going to let her gasp and flop like a fish in the sand until she goes quiet. She stares back at me through the glass and for a split second I’m sure she can tell what I’m thinking.\n\nI take my hand off the hose and shock her again in the most sensitive spot within reach. She thrashes around on the floor, her chest heaving with the labor of sucking in air.\n\nAnother moment to enjoy her helplessness, and then I bury a vibrator in her cunt and strap it in. The screams of pain from the prod turn into moans now. Her sharp shallow breaths become deep and ragged as she builds up to climax. She thrashes around again and again but the terrified look is gone and now her expression is relaxed, her eyes glazed over and far away.",
  "directors": [],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    }
  ],
  "release_date": "2007-08-15",
  "scene_id": 4733,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Cattle Prod",
    "Collar",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Mask",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Vibrator",
    "white"
  ],
  "title": "Oxygen"
}