{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\nTraining Goals Progress:\nSex Slave: Teach her that there is more to being a sex slave than fucking and sucking.\nAnal Training: Tentative and slow. Continue with small toys to further stretch her slave asshole.\nBasic Protocol: She serves with a self assured smirk, and needs to be taken down a notch.\nPain Processing: She is not a masochist, but today, with re-inforcing orgasms, she will suffer for our pleasure.\nRecommendations: Start by ordering her to run the armory stairs till her self satisfied demeanor falters, then push her into a desperate and quivering state of reliance and submission through severe exercise and discipline.\nTest her temperament further. Cuff and collar her sweaty body, leash her and lead her through the Armory halls to her next station, where she is blindfolded and bound into a very difficult squat and made to suffer for our amusement until she properly begs to be allowed to escape into the relief of a screaming orgasm. This is a very difficult scene for our young trainee and is intended for the experienced BDSM viewer.\nOrder her to hold position and be whipped while the sadistic Mistress Claire Adams masturbates to her sweet suffering. Dildo gag her and order her to service Claire's wet pussy.\nOrder her onto all four on the exam table to continue her anal training. Stretch her slave asshole with a vibrating dildo, reinforcing this training with more massive orgasms.\nDismiss her for the evening to the slave quarters with her homework assignment, where she is left to consider her decision to train here.",
  "models": [
    {
      "name": "Claire Adams",
      "person_id": 378
    },
    {
      "name": "Devaun",
      "person_id": 14316
    }
  ],
  "release_date": "2007-12-21",
  "scene_id": 4821,
  "tags": [
    "anal",
    "bdsm",
    "blindfold",
    "bondage",
    "collar",
    "Corporal Punishment",
    "dildo",
    "discipline",
    "female slave",
    "gag",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "slave",
    "straight",
    "submission"
  ],
  "title": "The Training of Devaun, Day Three"
}