{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\n\nTraining Goals Progress:\n\n\nOral Skills - her first on cam blow job was very hot, but her pussy eating still needs work\n\nFirst Fuck on Camera: has been prepped and seems eager to fuck\n\nPosture Training: detail oriented and takes well to corrections in her stance\n\nSlut Training: she is easily embarrassed and still needs help coming on as a slut\n\n\nRecommendations:\nIncorporate another slave to improve her pussy eating skills, improve her composure, and assist with getting her cunt fucked for the first time on camera.\n\nSuspend both sluts in painful predicament bondage and attach them together with clips tied between nipples and labia. Apply the whip and observe their struggle to maintain composure while Berlin is quizzed on her homework about slave identity.\n\nPut our trainee to work on Madison’s pussy, beating her till she gets the slave off with her slut mouth.\n\nMount the trainee on a bench and use Madison to get her pussy wet and ready to fuck. Pound her cunt with hard cock in several positions till she has had enough use, then put her on her knees to receive a load of hot come all over her huge, beautiful tits.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Madison Young",
      "person_id": 2674
    },
    {
      "name": "Mz Berlin",
      "person_id": 14228
    }
  ],
  "release_date": "2008-01-18",
  "scene_id": 4931,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Bondage",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Predicament Bondage",
    "Pussy Eating",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "shaved",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "The Training of Berlin, Day Three"
}