{
  "collections": [
    "The Training Of O"
  ],
  "description": "Applicant Profile\n\nAge:**25\n**Sign:**Leo\n**Disposition:\nFilthy Whore\n\nFears / Current Limits:\nFears the single tail, cane.\n\nStrengths:\nLoves dirty sex, erotocizes humiliation. Wants to learn more.\n\nWeaknesses:\nLacks discipline. Fucks like a greedy porn star. Very little skill in processing pain, knows nothing about BDSM history or mechanics.\n\nExperience:\nPopular porn star with a deep desire to learn more about BDSM.\n\nCurrent Status:\nunowned\n\nRecommendations:\nOrder her to strip naked and masturbate throughout the opening interview.\n\nDetermine what her filthy mouth is good for aside from spewing senseless, pedantic profanities by shoving her tongue in an asshole, then filling it with a hard cock.\n\nTeach her the meaning of the command ‘open’ through tight, painful bondage and clips on her wet cunt while she is fucked like a whore.\n\nTeach her the concept of ‘gratitude’ by beating it into her every time she neglects to say ‘Thank you, Sir’.\n\nSpank and beat her round, full ass then stuff it with a but plug to further violate her while she fucks a hard cock with her tits, sucks balls, and ultimately milks the come out all over her slut face.\n\nAssign her reading on the history of leather, send her to her quarters for the evening feeling totally used, beaten and fucked out.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Delilah Strong",
      "person_id": 11801
    }
  ],
  "release_date": "2007-12-07",
  "scene_id": 4934,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "Leather",
    "master",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Single Tail",
    "Straight",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "The Training of Delilah Strong, Day One"
}