{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\nTraining Goals:\nExplore physical and emotional limits\nInstill a sense of gratitude\nDiscipline\nSingle tail and cane training\nLeather history lessons\nRecommendations: Although we cannot possibly get filthy enough to satisfy this whore's insatiable appetite for sex and degradation, our curriculum does push her physical and emotional limits in ways that this young cunt never imagined existed. To shatter her expectations of what BDSM is she must be methodically broken down and rebuilt.\nStart with sleep deprivation, getting her out of bed at 7AM and made her to run through the neighborhood in ridiculous workout wear, her huge tits and ass bouncing through the streets like some exhausted, crazed whore on a sudden health kick. This is just the start.\nTake her to our 'gym' and make her sweat under the whip like she never has. End this intense workout with a screaming fuck on a fucking machine, all the time drilling her with lessons in discipline, endurance and most of all, gratitude.\nExhausted and fucked out, the real training begins. Take her to the basement and methodically take her mind and body apart under the whip, creating a cathartic experience in discipline and re-birth like she has never known existed.\nQuiz her on her history lessons while fucking her cunt and whore mouth, extracting required answers between deep thrusts down her cunt throat. Finish on her tits and send her filthy, used ass back to her quarters with still more assignments to read and journaling to do. Leave her with the distinct impression that she is in way over her head and may very well never make it through this program. Welcome to your training, Miss Strong.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Delilah Strong",
      "person_id": 11801
    },
    {
      "name": "Tomcat",
      "person_id": 7009
    }
  ],
  "release_date": "2008-01-04",
  "scene_id": 4935,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Corporal Punishment",
    "Deprivation",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "Leather",
    "master",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "Single Tail",
    "Straight",
    "top"
  ],
  "title": "The Training of Delilah Strong, Day Two"
}