{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report, Final Day\n\nGoals Review\n\n\nSincerity:\nShe has learned the importance of sincere delivery, but must be reminded\n\nDiscipline:\nMuch improved\n\nObedience:\nSurprisingly, this slut has been a very obedient girl this week.\n\nGratitude:\nToo slow, but improved.\n\n\nRecommendations:\nPlug her ass and turn her over to Torque to work up a sweat with exercise, kegels and stress positions.\n\nVibrate her hungry cunt while putting her through a hard flogging, teaching her ways to eroticize pain.\n\nHand her and her file over to her boyfriend, Daniel, for a test drive.\n\nShe has been programmed to respond to her slave name, Number Nine, by assuming a submissive stance and waiting for orders. He immediately tests her obedience by ordering her to shave her cunt for him.\n\nOnce satisfied, he inspects her and orders her through various positions including presenting her slut mouth to suck cock, and her ass to fuck.\n\nMake her get on top and ride hard cock in her ass, doing all the work and finally taking his come in her mouth.\n\nMiss DeArmond graduates today, and we turn her over to Daniel with a new set of skills that will hopefully add to their kinky sex life and press her to continue to ask, how can I please him?",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Dana DeArmond",
      "person_id": 4498
    },
    {
      "name": "Danny Wylde",
      "person_id": 7790
    },
    {
      "name": "Torque",
      "person_id": 1327
    }
  ],
  "release_date": "2008-04-18",
  "scene_id": 5009,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Flogging",
    "Gimp",
    "Humiliation",
    "Kinky",
    "master",
    "natural boobs",
    "Oral Sex",
    "other hair color",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Slave",
    "Straight",
    "toned",
    "top",
    "white"
  ],
  "title": "The Training of Dana DeArmond, Day Four"
}