{
  "collections": [
    "Device Bondage"
  ],
  "description": "At the beginning of the shoot, cyd sizes up Alexa and Claire. He decides to torment Alexa by getting her to endure a series of uncomfortable and humiliating positions. On her knees, with her arms bound behind her, Alexa moans into her gag, trying to find some way to ease the tension on the tight nose clamp that keeps her head firmly under control and her body under ever increasing waves of stress that slowly and inexorably break her down and bring her to the point of agony. Done with Alexa for the moment, cyd binds Claire kneeling with her knees spread and her arms stretched out and strapped to a horizontal pole behind her shoulders - a perfect position for the breast bondage and whipping that is to come. cyd straps Claire's head into a tight head harness panel gag which completes the bondage and the visual spectacle at the same time. Once cyd begins wipping Claire, an unexpected and delightfully sadistic bonus presents itself: The metal bar that Alexa's already sore and tender nose is clamped to also happens to be part of the metal structure that Claire is bound to. As such, the bar vibrates back and forth as Claire throws her body against it as cyd whips her, bringing the already desperate Alexa to the verge of tears.\nNOTE: Currently it is my intention to post edited versions of live shows on weekends and post recorded shoots during weekdays. Since the recorded update for the week is not ready to be posted yet, I am switching the posting process for this week and giving you the live show today and the recorded update this weekend, as I do not want members to have to wait any longer. Next week, things should be back to normal. -cyd",
  "models": [
    {
      "name": "Claire Dames",
      "person_id": 14027
    },
    {
      "name": "Alexa Jordan",
      "person_id": 15739
    }
  ],
  "release_date": "2008-03-27",
  "scene_id": 5074,
  "tags": [
    "whipping",
    "gag",
    "bondage"
  ],
  "title": "Claire Dames and Alexa Jordan Live, Part 1"
}