{
  "collections": [
    "The Training Of O"
  ],
  "description": "Applicant Profile\nName: Amber Rayne\nSign: Virgo\nAge: 23\nWeight: 114\nHeight: 5' 3''\nDisposition: Cocky, masochistic, nymphomaniac\nStrengths: Loves being fucked in the ass, feels a need for pain, wishes to experience a deeper sense of submission. She is very intelligent and focused, and appears to take her role in this training seriously.\nWeaknesses: I don't know, but we will find out in this update.\nExperience: Started BDSM working for commercial sites, then craved it more and more, eventually seeking it out in her personal life.\nCurrent Status: Unowned\nRecommendations: Test her responses to pain right away by ordering her to cover herself in clothespins, then whip them off her while drilling her about her associations with pain and pleasure.\nIntroducer her to the filthy floor, and keep her on it to teach her that this is where she belongs.\nTie her into restrictive bondage and order her to work to get a hard cock in her mouth.\nStripe her ass and thighs with a cane while fucking her cunt with a hard cock to work on her pain processing.\nDrill her on defining her curriculum, why she is here, what she needs to learn, and develop the week's goals with her help.\nFuck her mouth and spill hot come all over her slut face, then assign her homework assignments and send her to her quarters for the evening.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Amber Rayne",
      "person_id": 12631
    }
  ],
  "release_date": "2008-02-29",
  "scene_id": 5115,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Brunette",
    "Clothespins",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "The Training of Amber Rayne, Day One"
}