{
  "collections": [
    "The Training Of O"
  ],
  "description": "Applicant Profile\nName: Harmony Rose\nSign: Libra\nAge: 24\nHeight: 5' 5''\nDisposition: Cock Slut\nStrengths: Takes a good hard fucking well, likes to push herself, adrenaline junkie\nWeaknesses: Lacks patience, cannot do hard bondage, claustrophobic\nExperience: Many years in the industry, some experience bottoming\nCurrent Status: Unowned\nRecommendations: Control that pussy right from the start. Blindfold her and lead her through the armory to the medical set, where she is to be tied up and interrogated about her reasons for being here.\nFinger her dripping cunt till she is at the edge of orgasm, then whip her to test her composure.\nTeach her to stay off the furniture, how to address her dominants, and instill some protocol for her to follow this week. Drag her around by the cunt and fuck her mouth till she is begging to come and deny her further.\nStrap her firmly to the gyno table and tease her pussy and tits with a vibe and a hard cock, always taking her close to orgasm then beating her down again. Deny her orgasm all day, then take her to the slave quarters to fuck her face and deposit a huge load of hot come all over her beautiful tits.\nStuff her in the closet to teach her the value of patience, then assign her homework and restrict her from touching her aching cunt till the next day's training.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Harmony",
      "person_id": 6341
    }
  ],
  "release_date": "2008-03-28",
  "scene_id": 5159,
  "tags": [
    "Anal",
    "BDSM",
    "Blindfold",
    "Blonde",
    "Bondage",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "master",
    "natural boobs",
    "Oral Sex",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "Slave",
    "Straight",
    "top",
    "white"
  ],
  "title": "The Training of Harmony Rose, Day One"
}