{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\nGoals Revisited:\nPatience\nClaustrophobia\nOrgasm Control\nComposure\nRecommendations: Enforce our control over our trainee's hunger for humiliation and filthy sex by handing her over to a building janitor for a quickie while on he way to the set. Right in that filthy bathroom, order her to drop to her knees and suck him off like he was a leather Master, and thank him for the chance to take his come down her slut throat.\nWhen she thinks the worst is over, detour again into the Pit Room where she is to punished for staying out past curfew, fucking in the park and acting like a drunken teenager.\nMake her plead to be punished before stuffing her head into the locking underground pit to face her nightmares of claustrophobia while her ass is stripped by the cane in a brutal punishment scene. When she comes up she knows what is it like to be absolved through fear and pain.\nOrder her cleaned up, collared and dressed for her presentation to Mr. Holmes. Put her on best behavior and turn her over for BDSM use, hard ass, pussy and mouth fucking followed by some corner time to meditate on her slutty behavior.\nDrag her to quarter and confront her with the shortcomings of her performance that day, and beat her ass while she recites each of them. Accept her thanks for the punishments, corrections and use, then assign her homewrok and send her away to prepare for her final day of training.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Harmony",
      "person_id": 6341
    },
    {
      "name": "Steve Holmes",
      "person_id": 15810
    },
    {
      "name": "Casper Coxx",
      "person_id": 15655
    }
  ],
  "release_date": "2008-06-06",
  "scene_id": 5161,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "Brutal Punishment",
    "collar",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Gimp",
    "humiliation",
    "leather",
    "master",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "slave",
    "straight",
    "the pit"
  ],
  "title": "The Training of Harmony Rose, Day Three"
}