{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "TAG TEAM LEAGUE\nNOW IN FRONT OF A LIVE AUDIENCE\n\nTEAM BLACK\nAdrianna & Dia\nCombined HT:132”\nCombined WT: 290lbs\nRecord:(1-0)\n\nTEAM ORANGE\nWenona & Madison\nCombined HT:130”\nCombined WT: 229lbs\nRecord:(0-0)\n\nWelcome to Ultimate Surrender’s forth league match. Team Black vs, Team Orange. Four girls, non-scripted, real tag team action.\n\nThe rules are set: (1) Three tags per team, per round. (2) Three 12-minute non-scripted wrestling rounds. (3) Last round consists of the winners tying up, dominating, humiliating, and brutally fucking the losers.**\nIN FRONT OF A LIVE AUDIENCE!\n\n**Team Black: Won their first match vs Purple, and are currently the only undefeated Tag Team. Their victory was by the smallest of margins. However Black has a new wrestler on the team, and she is a powerhouse! Welcome Dia Zeva to the Black Team.\n\nOrange: This is Team Orange’s first match. They have strenght and speed. Both are extremely competitive, and go 100% until the final whistle. Orange is looking and considered a favorite to win it all.\n\nThis is our first match in front of a live audience. All Tag Team matches will now be shot in front a live crowd. It is one thing to lose and get beaten in a closed room with just crew, it is a different thing to lose and be humiliated in front of a live audience. The stakes are higher then they have ever been, who will rise to the top?",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Adrianna Nicole",
      "person_id": 301
    },
    {
      "name": "Dia Zerva",
      "person_id": 16038
    },
    {
      "name": "Madison Young",
      "person_id": 2674
    },
    {
      "name": "Wenona",
      "person_id": 4485
    }
  ],
  "release_date": "2008-06-27",
  "scene_id": 5192,
  "tags": [
    "Anal",
    "Blonde",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "Redhead",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "Tattoo",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "LIVE TAG TEAM LEAGUE Team Black vs Team Orange"
}