{
  "collections": [
    "Device Bondage"
  ],
  "description": "Claustrophobic Samantha Sin hangs on in terror suspended eight feet in the air while painfully cramped in a tiny cage. cyd sits below eating his lunch on Sarah Jane the table. He lackadaisically interviews the girls as they suffer, alternating his questions between Sarah, whose ass makes an attractive yet functional place to rest his seaweed salad and Samantha, whose body, suspended above him, provides shade from the hot video lights above.\nWith lunch and an amusing interview finished, the girls are literally aching to engage in some more active forms of BDSM. It's Sarah's turn first, and cyd straps her onto a device on her stomach with her long toned, sexy legs spread almost unbelievably wide apart with her tight pussy and asshole tilted in mid-air just so and her arms pulled up in strappado behind her. What's most amazing is that Sarah came up with the idea for the position itself earlier in the week, showing sketches to cyd and helping him build it. The result is a crazy contortion that only Sarah could know her body was actually capable of. Samantha watches from above, wondering if it is worse to be below with cyd, feeling the savage sting of the single tail and cane or if it is better to be confined in her cage with the hard rusty metal bars digging harshly into her skin and pressing against her bones, slowly bruising her and pushing her towards her breaking point. In the end, it makes no different to the sadistic viewer. She is going to suffer either way and that makes it worthwhile regardless.",
  "directors": [],
  "models": [
    {
      "name": "Samantha Sin",
      "person_id": 14640
    },
    {
      "name": "Sarah Jane Ceylon",
      "person_id": 12772
    }
  ],
  "release_date": "2008-05-03",
  "scene_id": 5204,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Cage",
    "Corporal Punishment",
    "Domination",
    "Feet",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "Pain",
    "shaved",
    "Single Tail",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "toned",
    "white"
  ],
  "title": "Sarah Jane Ceylon Live, Part 1"
}