{
  "collections": [
    "The Training Of O"
  ],
  "description": "Training Report\nGeneral Observations\nTrainee dislikes inferior performance, needs to 'do a good job'\nPoor at controling teeth on blowjobs\nLikes earning marks, makes her 'feel tough'\nEngaged, present, shows natural reactions\n Seems to have difficulty keeping track of her 'burden'\nLessons\nDiscipline is humility\nGrace and fluidity\nHer holes are ours\nRecommendations:\nReview homework: An essay on Patrick Califia\nReward her thorough research by ordering her to masturbate for us while under the whip\nMake her restrain her orgasm while drilling her on training goals\nAssign a new name for the day to keep her identity at bay\nIntroduce Sarge to instill discipline and humility through rigorous physical and mental exercises\nDrill her on graceful movements\nUse vibration and orgasm to motivate\nDistract her with the gimp's mouth on her cunt and test her composure\nClamp her nipples and order her to make herself suffer for our amusement\nUse whips, clamps, weights and orgasms liberally\nTake her to the scrubing room to underscore her lessons in humility\nGive her plenty of practice at giving up her mouth and pussy for cock, or else she gets the hose again.\nDrill her on ball sucking till her face is covered in cum\nBe sure she understands that the blowjob is not over once the cum comes out\nAssign her homework: an essay on Joseph Bean\nDemonstrate the consequences of loosing track of her burden, the 40 pound stone she must keep with her at all times.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Princess Donna Dolore",
      "person_id": 5235
    },
    {
      "name": "Sgt. Major",
      "person_id": 4556
    },
    {
      "name": "Daac Ramsey",
      "person_id": 15390
    }
  ],
  "release_date": "2008-06-27",
  "scene_id": 5243,
  "tags": [
    "anal",
    "bdsm",
    "blowjob",
    "bondage",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "gag",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "role play",
    "rope bondage",
    "straight",
    "weights"
  ],
  "title": "The Training of Princess Donna, Day Two"
}