{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "TAG TEAM LEAGUE\n\nTEAM RED\nAriel X & Samantha Sin\nCombined HT: 127”\nCombined WT: 235lbs\nRecord: (0-1)\n\nTEAM BLUE\nIsis Love & Jade Marxxx\nCombined HT:133”\nCombined WT: 265lbs\nRecord:(0-0)\n\nWelcome to Ultimate Surrender’s second league match. This is how Red vs Blue should be. Four girls, non-scripted, real tag team action..\n\nThe rules are set: (1) Three tags per team, per round. (2) Three 12-minute non-scripted wrestling rounds. (3) Last round consists of the winners tying up, dominating, humiliating, and brutally fucking the losers.\n\nTeam Red: Lost their first match and cannot afford to lose another. Anchored by veteran Ariel “The Assassin” X. This team lost its first match by only 17pts in the very last minute of the match. Since Samantha “The Python” Sin is getting stronger with each match, the Team hopes to dominate and fuck the more experienced Blue team.\n\nTeam Blue: The only team to feature wrestlers from the very first season of Ultimate Surrender, their experience is unmatched by any other team in the league. Anchored by beautiful Isis “The Goddess” Love, this team is favored to take home the Championships. With Jade “The Trouper” Marxxx at The Goddess’s side, this team is fast, big, and strong.\n\nOnce again the match went down to the last minute, and we have a loser after 36 minutes of brutal wrestling. Heart breaking for the losers, but sweet, sweet victory for the winners! Which team got fucked and humiliated for losing? Which team got tied up and dominated by the victors?",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Jade Marxxx",
      "person_id": 571
    },
    {
      "name": "Samantha Sin",
      "person_id": 14640
    }
  ],
  "release_date": "2008-04-25",
  "scene_id": 5257,
  "tags": [
    "Anal",
    "Blonde",
    "Brunette",
    "Curvy",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "mixed",
    "natural boobs",
    "Pussy Eating",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "Tattoo",
    "toned",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "TAG TEAM LEAGUE Team Red vs Team Blue"
}