{
  "collections": [
    "The Training Of O"
  ],
  "description": "Applicant Profile\n\nGeneral Observations\n\n\nExperience: 1 year\n\nStrong fantasies of punishment, being put in her place\n\nThreat of orgasm denial makes her more turned on and likely to come\n\nWhen asked how to train her she replies ‘she needs improvement in sexual servitude’\n\nNeeds blow job training, has a ‘horrible gag reflex’\n\nNeeds her ass stretched\n\nLoves chains, belts\n\n\nStrengths\n\n\nresponds well to control, rules\n\nLoves to endure difficult tasks, pain\n\n\nWeaknesses\n\n\nHas mistaken assumption that life is fair.\n\nPrideful, has a hard time being wrong.\n\nForgetful\n\n\nRecommendations:\n\n\nSubject is clearly nervous.\n\n\nCut her clothes off and put her in a steel yoke for the interview\n\n\nOrder her to scurb the filthy floor while ‘getting to know her’\n\n\nSolicit a training name and beat her her till she comes up with a good one\n\n\nChallenge her to keep her dirty little fingers out of her cunt at night to demonstrate her obedience\n\n\nDiscipline her with a cane, reward her with orgasms\n\n\nPlay a game of pain and stress with her to teach her that the word ‘fair’ does not exist in this dungeon in 100 strokes or less.\n\n\nTeach her to be better judge of her abilities with simple stress position and the erosolator\n\n\nInsert training plug to begin stretching her tight slut asshol\n\n\nDrill her on a presentation routine while stuffed and whipped\n\n\nFuck her mouth with a rubber cock to test her gag reflex\n\n\nInstill strict discipline in her tasks, posture and speech\n\n\nOrder her to get come from the gimp\n\n\nBegin work on a ‘Training Trigger’\n\n\nOrder her to get herself off in the cage while we watch\n\n\nLead her by the hair to the slave quarters to assign morning stretches video journal and written homework: Summary of the StoneWall Riots\n\n\nRepay her for coming to our shoot at the last minute with a hard belt spanking",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Charlotte Vale",
      "person_id": 16865
    },
    {
      "name": "Lobo",
      "person_id": 16229
    }
  ],
  "release_date": "2008-06-20",
  "scene_id": 5340,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "brunet",
    "Brunette",
    "Cage",
    "Chains",
    "Corporal Punishment",
    "Curvy",
    "Discipline",
    "dungeon",
    "Female Slave",
    "Gag",
    "Gimp",
    "Humiliation",
    "Latinx",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Orgasm Denial",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "The Training of Charlotte Vale, Day One"
}