{
  "collections": [
    "The Training Of O"
  ],
  "description": "OVERVIEW\n\n\nThis is the first time TTOO has attempted training two girls at the same time.\n\nRecommending separate interviews for the girls.\n\nFamiliarize the young ladies with the rigors of the horse trails cutting through this 60 acres of isolated, scorching hillside.\n\nLeash and yoke them both for marches between scenes\n\nDetermine and test their individual strengths, weaknesses and personalities to develop the week’s curriculum\n\n\nSARA FAYE\nNumber one\n\nOBSERVATIONS\n\n\nExperience: enthusiast, recently started to follow the lifestyle\n\nNervous, attentive\n\nVery curious about the D/s relationship\n\nDoes not always follow orders on purpose, ‘because it’s fun’\n\nProcesses pain well, finds pleasure in it\n\nEnjoys leash and collars\n\nEnjoys resisting, being told to do things\n\nHates singles tails ‘because they hurt too much’\n\nJust wants to learn to be a good girl\n\n\nGOALS\n\n\nObedience, Discipline and Grace\n\n\nRECOMMENDATIONS\n\n\nOffer her a leather training collar to earn\n\nTeach her discipline through concentration, balance and pain\n\nStart with a painful cover clamp leash on pussy and nipples\n\nMarch her around the pen\n\nMake her come up with a name for her slut sister\n\nOrder her to clamp up her sister\n\nTeach her why a collar earned is better than a collar bought\n\nFlog her, tempt her to fail\n\nOrder her to hose off her filthy slut sister and march her into the barn to get fucked\n\nShow her that good girls get sucked off and fucked to orgasm\n\n\nLESSONS\n\n\nLearned she is capable of more than she thought\n\nListen to what she is being told\n\nLeash Training\n\nDoes she deserve a collar?\n\n\nCLAIRE DAMES\nNumber two\n\nOBSERVATIONS\n\n\nExperience: 1.5 years\n\nDid not respond to two pre-shoot requests for background information and input on her training.\n\nLack of a proper response sets a bad precedent\n\nNervous but really excited\n\nSurprisingly demure when asked to strip\n\nLikes the suspense of not knowing what is going to happen\n\nShe tells us, ‘I’ve never been a slave before’.\n\n\nGOALS\n\n\nMake it through the day\n\n\nRECOMMENDATIONS\n\n\nWe do not know what to do with her, so do nothing important.\n\nMake her wish she had sent that email\n\nTeach her to formulate a proper response\n\nGag her and tie her to a post\n\nTell her to stand there and look pretty while her slut sister is trained\n\nPut her to work digging a mud pit for another site\n\nDemonstrate the single tail whip on Claire’s huge tits for Sara\n\nTake away the shovel and make her dig with her hands\n\nHose her down like a barnyard animal\n\nUse her mouth liberally as a fuck hole\n\nRegarding her cunt, fuck it or beat it?\n\nAssign homework: respond to the initial application letter\n\nShow her that bad girls get sent to bed with hungry, frustrated cunts\n\n\nLESSONS\n\n\nLearned the importance of a proper response\n\nLearned that for today, her mouth is only good for sucking cock and eating pussy.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Claire Dames",
      "person_id": 14027
    },
    {
      "name": "Lobo",
      "person_id": 16229
    },
    {
      "name": "Sara Faye",
      "person_id": 12832
    }
  ],
  "release_date": "2008-07-18",
  "scene_id": 5343,
  "tags": [
    "Anal",
    "BDSM",
    "Big Tits",
    "Blonde",
    "Bondage",
    "brunet",
    "Brunette",
    "Collar",
    "Corporal Punishment",
    "Discipline",
    "fake boobs",
    "Female Slave",
    "Gag",
    "Gimp",
    "Humiliation",
    "Latinx",
    "Leather",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "shaved",
    "Single Tail",
    "Slave",
    "Straight",
    "Tattoo",
    "toned",
    "top",
    "white"
  ],
  "title": "The Training of Sara Faye and Claire Dames, Day One"
}