{
  "collections": [
    "The Training Of O"
  ],
  "description": "Graduation Day\nPut these two pony sluts to task on their last day of slave training. Post them up on the rocks and drill them through a series of painful stress positions under the blazing sun. Make them sweat and whine till their limbs are trembling in pain, then begin the punishments. As each falters, it is their slut sister that takes the correcting blows.\nSlut number 2 is begging for a punishment. She has fucked up again, this time by misplacing her collar. Her pathetic pleas are met with kind re-assurance. We have the collar, all is well. Now assume the position and accept a ruthless thrashing as your trainer beats your ass with the very piece of leather that you seek. After pressing her to near failure, she is pulled up and the leather is wrapped around her neck. Now slut, trot the half mile back to the house alone and use the time to reconsider your responsibilities to the leather.\nAfter feeding, the sluts are dressed in light gear and paraded, synchronization enforced with a stinging crop. March the pony sluts to a shaded tree and tether them before the trainer, where they are to complete their final training tasks. Judgement is rendered at the end of a whip, and the marks they earn here are the badges of graduation from this sweltering camp of pain and discipline.\nBoth sluts are whipped in tandem as their shuddering cunts are vibrated. The final blows cut the badges into their tits and asses as they ride their orgasms through the pain and burning humiliation.\nThen comes the use. It is hard, the sluts getting fucked in the ass, mouth and cunts. All holes are ours and the ponies are covered in come, sweat and welts by the end of the day. Congratulations sluts, you have both managed to make it through four days of scorching training. Now, to earn your rides back to civilization...",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Billy",
      "person_id": 13720
    },
    {
      "name": "Claire Dames",
      "person_id": 14027
    },
    {
      "name": "Lobo",
      "person_id": 16229
    },
    {
      "name": "Sara Faye",
      "person_id": 12832
    }
  ],
  "release_date": "2008-10-31",
  "scene_id": 5345,
  "tags": [
    "Anal",
    "BDSM",
    "Bondage",
    "Collar",
    "Corporal Punishment",
    "Crop",
    "Discipline",
    "Female Slave",
    "Gimp",
    "Humiliation",
    "Leather",
    "master",
    "Oral Sex",
    "Pain",
    "Role Play",
    "Rope Bondage",
    "Slave",
    "Straight",
    "top"
  ],
  "title": "The Training of Sara Faye and Claire Dames, Day Four"
}