{
  "collections": [
    "The Training Of O"
  ],
  "description": "TRAINERS NOTES\nGENERAL REVIEW\nFailed at running the stairs\nLoss of Balance trigers FEAR\nHoods trigger FEAR\nFear is power\nSlave Dance - 4 positions into one movement\nBouncing, rhythm, tease\nEarned bed (but did not GET it)\n5 - 15 orgasms by her own hand\n'Earnest' strikes a cord with her\nBREAKTHROUGH in self identity / sexuality\nMOTIFS: Buckets, Stairs, Duty\nTRAINING TRIGGERS\noutside right thigh - press for dirty talk, from day one\nchoking -associate wet pussy, masturbation, orgasm\nPOSITIONS / PROTOCOL COVERED\nAttention, eyes ahead, arms in box\nKneeling, hands clasped behind head\nPresent ass standing and kneeling\nNEW - back bend present cunt\nDESPERATELY SEARCHING for that RITE OF PASSAGE\nBegin to instill sense of DUTY, a power from the heart that drives her\nSABRINA QUOTES\n'I really want to work on bringing out my inner submissive.'\n'I often fantasize about harsh, rigorous, and demanding training.'\n'…but, I feel if afterwards, if there isn't some type of softness or reward, it breaks my heart.'\nHer fantasies, triggers and orgasms revolve around consent and permission\nShe is likely a masochist / sensation slut - is she an attention slut as well?\nSIMPLE COMMANDS\n'I have the hardest time following the simplest command...if I'm told to strip, it's almost as if I physically can't do it.'\nCHORES\n'I want to learn to find pleasure in service and chores'\nMASTURBATION\n'I can't masturbate in front of others'\n'I can remember... begging for forgiveness...'\nTRAINERS NOTES, DAY THREE\nHOMEWORK REVIEW: list the BDSM organizations and events over the next 3 mos in her area\nDEMONSTRATE THE PROPERTY to Aiden Starr and ask her help in refining the charge.\nOrder her to masturbate herself for our amusement\nFuck her cunt with a giant rubber cock while Aiden uses her face to get off\nOffer the reward of Aiden's FIST in her cunt\nDRILL DUTY - embed the concept - core principle\n'def: Something that one is required to do by moral or legal obligation, an act or expression of respect'\n'True to self'\n'Duty to Seek Learn and Explore'\nDRILL THE RULES - Demand sort, concise answers, military style\nWHAT IS YOUR NAME? 116\nWHAT ARE YOUR TRAINING GOALS? Eroticize service through chores, Initiate sex, Obey Simple Commands, Humility\nWHAT IS RULE NUMBER 1? Control eye-line\nRULE 2? Do not anticipate actions\nRULE 3? Address Trainer as Trainer\nRULE 4? No furniture\nRULE 5? No masturbation\nWHAT IS YOUR DUTY? 'Embrace submissive nature and suffer beautifully in the release of control.\nWHAT IS YOUR RESPONSIBILITY? 'To pass on what I learn in order to cultivate the leather culture.'",
  "models": [
    {
      "name": "Sabrina Fox",
      "person_id": 14055
    },
    {
      "name": "Aiden Starr",
      "person_id": 11489
    }
  ],
  "release_date": "2008-10-24",
  "scene_id": 5350,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "choking",
    "Corporal Punishment",
    "discipline",
    "female slave",
    "Gimp",
    "humiliation",
    "leather",
    "master",
    "masturbation",
    "oral sex",
    "role play",
    "rope bondage",
    "slave",
    "straight"
  ],
  "title": "The Training of Sabrina Fox, Day Three"
}