{
  "collections": [
    "The Training Of O"
  ],
  "description": "TRAINERS NOTES\nGoals of this document:\nFormulate presumptions and recommendations based on analysis of available resources\nDistill presumptions to formulate anticipated goals and recommendations\nINITIAL OBSERVATIONS\nnice girl, sweet disposition\n'I'm very submissive...I just like being tied up and knowing I can't do anything about it.'\ninner reflections are difficult to articulate, lacks enthusiasm\nwhen asked what she wants her response is 'just to have fun'.\nwhines and whimpers with flogging / slapping - sometimes w/ fucking as well\nrough fucking OK: 'I like it being slapped in the face, choked, hair pulled'\nBJ action, have not seen anything impressive, appears rote.\nPussy eating, mediocre at best\norgasms really hard w/ hitachi, body lock up / shakes\nvery sensitive pussy after orgasm\nbondage and suspensions intensifies orgasm, 'very much so'\ncome in mouth and face OK\nFEARS\nblindfolds (hoods?)\n'She is afraid of being blindfolded, likes to see everything' - Sandra R. WA 4961\n'not having control in a situation is very scary to me'\nDoes fear make her pussy wet?\nPAIN MANAGEMENT\nappears to possess elementary to good skills\nhas done allot of Device Bondage\ntook the cattle prod for Donna BUT...does not like the cattle prod on other occasions\nLIKES\n'I love to be suspended', but not very painful ones\n'I like being roughed around'\nlikes being tied up and fucked\nDISLIKES\nmummification - 'every time I moved it got tighter....'\ndoggie style fucking\n'I don't like my feet being touched...'\nblindfolds / hoods\nPRESUMPTIONS\nan attitude or belief dictated by probability\nshe appears to be a pretty good little play toy\nwilling to take a fair amount of pain, an excellent bondage model\nlikes to be pushed, seeing how much she can take\ninner sense of accomplishment is a big motivator for this one.\nshe is shy, difficulty expressing her submission beyond the base elements\ndoes she have the stomach to be a slave? - can she face down adversity?\nRECOMMENDATIONS\nExamine suppositional impressions and prepare a critical, overall appraisal of the applicant\nconduct an interview, physical inspection, psychological evaluation\nsee file: Questions for Alexa\nobserve and note traits and characteristics:\nmanners, attitude, responses to physical and mental stimuli\nintelligence, comprehension of D/s concepts\nlook for signs of slave heart\nnote responses to sexual stimuli, vibration, orgasm denial, oral and vaginal penetration\npain response - teach her to channel pain and sensation in other ways\nassume control over her, hobble her in restraints\nintensify the focus on her inner dialogue with homework:\n20 ways to express submission",
  "models": [
    {
      "name": "Alexa Von Tess",
      "person_id": 12340
    },
    {
      "name": "Lobo",
      "person_id": 16229
    }
  ],
  "release_date": "2008-09-12",
  "scene_id": 5351,
  "tags": [
    "anal",
    "bdsm",
    "blindfold",
    "bondage",
    "cattle prod",
    "Corporal Punishment",
    "discipline",
    "Feet",
    "female slave",
    "flogging",
    "Gimp",
    "Hitachi",
    "humiliation",
    "master",
    "oral sex",
    "orgasm denial",
    "pain",
    "Pussy Eating",
    "role play",
    "rope bondage",
    "slapping",
    "slave",
    "straight",
    "submission",
    "suspension",
    "Vaginal Penetration"
  ],
  "title": "The Training of Alexa Von Tess, Day One"
}