{
  "collections": [
    "The Training Of O"
  ],
  "description": "TRAINING PROFILE\nSUBJECT: #107\nREF. SESSION: #5358\nSTIPULATIONS\nThis doc is indirect. Require direct assessment prior to intervention.\nQuotes are from the subject unless otherwise noted.\nSTATS\nAge: 22\nSign: Pisces\nMeasurements: 32C - 26 - 34\nBreasts: real\nAnal: Virgin to be trained\nStatus: Owned\nHISTORY\n2 years lifestyle, 24/7 for nearly 2 years\nFormerly in service to couple\nCurrently in sole service to her Master\n'I was dabbling in BDSM way before I should have, and I'm no stranger to the power play dynamic'\nPROCLIVITIES\nAll sorts of bondage and sensory play\n'Loves to be slapped and spanked, either will get her wet instantly' - owner\nSymbols of Master/slave dynamic: collars, cuffs, corsets to some extent\nPAIN MANAGEMENT SKILLS\nTrouble eroticizing pain, but has high tolerance\n'I take a good deal, but it may not turn me on'\nASSETS\nGood work ethic, enthusiastic, intelligent\nDEFICIENCIES\nNo Anal experience, complete virgin\n'Hates to verbalize' - owner\nEXCEPTIONS\nash play (no cigarettes on my body)\nwater-sports, spitting in face or mouth\nISSUES\nNeeds anal training - requested by owner\nNot good with mental bondage:\n'If I'm not tied down and we're engaging in any sort of corporal discipline, I tend to move away or block whatever is striking me.\nQUOTES\n'I would never consider myself a pain slut.'\n'She is a lovely slave girl, and I don't think you will have trouble bringing out her best.' -owner\nASSESSMENT STRATEGIES\nASSESSMENT GOALS\nDetermine current learning schemas\nPrimary motivations / fulfillment ULs\nTest initial, indirect suppositions\nExtract data to formulate analysis\nExtract leads to formulate training goals\nDetermine subject's understanding of service, satisfaction, ego and egoless\nSTRATEGIES\nUse the whip to motivate responses to standard interview questions\nSolicit the protocol - she makes her own rules\nEnforce them vigorously to illustrate the challenges of strict discipline\nApply cuffs, clips, clamps, weights and use stress positions to facilitate observation of her skills managing pain\nCage her, bind her and put her through a brutal zipper session\nStretch her virgin ass with stainless plug\nEvaluate her cock sucking and fucking skills\nHomework: A written list of data points on anal health and practices by morning.\nQUERIES\nGiven the opportunity to formulate her own rules, what would they be?\nWould the level of strictness that she sets be an indicator of her commitment?\nCONDUCT CODE\nImplement a merit and demerit system:\nOne demerit per infraction\nMerits for good behavior / accomplishments\nInscribe the tally on her thighs\nExcess demerits worked off in pain.\nRecorded daily conduct ratings in her permanent case file.\nCORE TRAINING REQUIREMENTS\nBasics of managing pain with breathing, visualization and manipulation techniques\nSelf assessment and reporting techniques\nManners 101",
  "models": [
    {
      "name": "Raina Verene",
      "person_id": 17161
    },
    {
      "name": "Wolf Hudson",
      "person_id": 14471
    }
  ],
  "release_date": "2008-10-10",
  "scene_id": 5358,
  "tags": [
    "anal",
    "bdsm",
    "bondage",
    "cage",
    "cock sucking",
    "collar",
    "Corporal Punishment",
    "couple",
    "discipline",
    "female slave",
    "gag",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "pain",
    "pain slut",
    "role play",
    "rope bondage",
    "slave",
    "straight",
    "weights",
    "zipper"
  ],
  "title": "The Training of Raina Verene, Day One"
}