{
  "collections": [
    "The Training Of O"
  ],
  "description": "Trainer's Report\nMid-Term Slave Review\nSubject Id: #208\nSession Id: #5360\nPain Management 101\nSubject shows a talent. Recommend focus in this area to explore deeper masochism. Strategies to date incorporate the assumption that pain is energy and can be identified and manipulated through conscious controls:\nIdentify rhythm in the strikes\nsynchronize breathing patterns tot his rhythm\nuse breathing to capture the pain\napply visualization and concentration to 'own the pain'\ncontrol and steer the flow of energy\nSelf Expression\nNarrative Visualization techniques are applied in an attempt to break the cycle of repressed verbal behaviors, esp. sexual.\nThe addition of a blindfold increases positive response.\nStimulus, electricity and verbal guidance further contribute to develoment.\nVoice Controls\nDiction and grammar are good, making the subject a good candidate for speech and voice training.\nThink Before You Speak\nPause for a Beat:\nMid Term Assessments\nSelf social Identity (how she sees herself in this world):\nService slut girl - what percentage of the time is she like this?\nFeels she needs more patience\nAttracted to - knowledge, confidence, strictness, kindness\nDepth - claims to not have been past anger in BDSM\nDifficult letting go to express herself results in sometimes rigid uninspired attempts at erotic vocalizations.\nConduct is excellent, shows enthusiasm and determination to learn. Excellent candidate for deep, full use.\nD3 Training Strategies\nFormative Assessments\nThe most important single factor influencing learning is what the learner already knows. Ascertain this and teach accordingly.\nPain 202, Clinical To Ritual\nReview previous lessons and confirm most useful techniques:\nThe Cup of Pain\nSteering pain energy to body parts\nInstructional Component\nCorporal implements with guided instruction in technique\nFocus on breathing - the gatherer of pain\nvisualization as heat, light and color\napplied: generalization, superficializing, radiation\nApplication:\nPrincess Donna applies unrelenting sadistic stimulus\nheavy single tail whip\ncat o nine tails\nrepeated cattle prod\nhard pussy slapping\nEvaluation:\nSubject maintains composure and displays a talent for learning and a presence of mind that appears to keep her 'in the scene' mentally. Occasional lapses in response time and breaks in form exist. Recommend allowing it due to cognitive load.\nRating: 4/5\nNote: She is sustaining heavy marking and showing signs of fatigue.\nReinforcement\napply positive reinforcers; clit vibration\nput her slut mouth to work on servicing Donna's pussy to orgasm\nHomework\nFreud's theory of Ego, Id and Super-ego",
  "models": [
    {
      "name": "Raina Verene",
      "person_id": 17161
    },
    {
      "name": "Lobo",
      "person_id": 16229
    },
    {
      "name": "Princess Donna Dolore",
      "person_id": 5235
    }
  ],
  "release_date": "2008-12-19",
  "scene_id": 5360,
  "tags": [
    "anal",
    "bdsm",
    "blindfold",
    "bondage",
    "cattle prod",
    "Corporal Punishment",
    "discipline",
    "electricity",
    "female slave",
    "Gimp",
    "humiliation",
    "master",
    "oral sex",
    "pain",
    "role play",
    "rope bondage",
    "single tail",
    "slapping",
    "slave",
    "straight"
  ],
  "title": "The Training of Raina Verene, Day Three"
}