{
  "collections": [
    "The Training Of O"
  ],
  "description": "Trainer’s Report\n\nSubject Id: #178\nSession Id: #5364\n\nCase Review\n\n\nRe-state the Hypothesis: Subject starts in BDSM at a young age, operates in a singular ego state of uncertainty and acquiescence. Not to be confused with submission, this meek attitude serves as the vehicle for explorations in BDSM and slavehood.\n\nEvolving conditions positively influence growth into an Adult state of appropriate assertiveness and control over her decisions.\n\nSubmission, however, becomes distant due to it’s persistent association with the former Child ego-state. Meek means weak, and submission is tied to this former helpless state. Efforts to dominate her met with psychological reactance resulting in confusion, resistance, and inner struggle.\n\n\nSupporting Evidence\n\n\nEasier to engage in power games with strangers than with those more familiar.\n\nDiscussions uncover a resonance with the principles of reactance\n\nBehavior suggest Erikson’s ‘identity crisis’:\n“people experience an identity crisis when they lose a sense of personal sameness and historical continuity”.\n\nSocialization is lacking from subject’s BDSM development. Seemingly, subject closes herself off to stimulus relating to kink by using blocking statements\n\nWhen asked about community involvement, response cites ‘no parties are doing what I’m into.\n\n‘When asked about favorite genre fiction, response indicates low interest due to poor writing skills among genre authors.\n\n\nTraining Goals\n\n\nIdentity: explore the PAC model of ego states.\n\nEroticize Pain: practical techniques\n\nPosture through Pain: balance\n\n\nRule Set\n\n\n\nSir, thank you Sir.\n\n\n\n\ncontrol nervous laughter\n\n\n\n\nOrgasm ONLY when in pain\n\n\n\n\nHead and eye alignment\n\n\n\n\nRe-State Rule #4\n\n\nWager her accumulated demerits against her mouth stuffed in an asshole + 50 cane strokes: can she maintain balance for more than a few seconds?\n\n\nLesson Review\n\n\nA hard whipping by the master sets up the lesson.\n\nCane her tits to solicit reflections on the principles of the hypothesis, identity, reactance, and past associations of submission.\n\n\nReview By Committee\n\n\nSocial anthropologist Gayle Rubins co-founded the historic Samois group and fought the Feminist Sex Wars of the 80’s to defend the right to engage in the very activity our subject is now thoroughly enjoying. Role model?\n\n\nJob Interview, Pt 1\n\n\nToilet Attendant, ass eating and fluids play\n\nCollect on the debt and reward Madison’s participation with 5 minutes of 178’s tongue up her ass.\n\nAssess this applicant’s potential for satisfying the most copious bladder relievers in the building and a possible future with the House.\n\n\nSelf Assessment Under Duress\n\n\nHow far can one push themself?\n\n\nAre you giving yourself as a commodity to use?\n\n\nAn entity of slavehood: number 178.\n\n\nIdentify this commodity: what are you, who are you? How can you give it up if you don’t know what it is?\n\n\nWithout identity we have confusion, turmoil and pain: where you are now.\n\n\nEvery seven years we grow, do we give it up or adapt?\n\n\n\nAssignment\n\n\nWrite a user’s manual:\n\nwhat works, what does not work, what you are good at, where your weaknesses lie. A blueprint of what 178 is.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Madison Young",
      "person_id": 2674
    },
    {
      "name": "Maestro",
      "person_id": 11928
    },
    {
      "name": "Tom Moore",
      "person_id": 13997
    }
  ],
  "release_date": "2009-01-16",
  "scene_id": 5364,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "blond",
    "Bondage",
    "bottom",
    "Cop",
    "Corporal Punishment",
    "Discipline",
    "Female Slave",
    "Gag",
    "Gimp",
    "Humiliation",
    "Latex",
    "Latinx",
    "master",
    "muscular",
    "natural boobs",
    "Oral Sex",
    "other hair color",
    "Pain",
    "Piss Play",
    "Piss Play",
    "Redhead",
    "Role Play",
    "Rope Bondage",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Submission",
    "Tattoo",
    "top",
    "unshaved",
    "Whipping",
    "white"
  ],
  "title": "The Training of Cherry Torn Day Three"
}