{
  "collections": [
    "Device Bondage"
  ],
  "description": "Before play began and during the interview, Scarlet made special effort to talk about what a turn on it was to be helpless, and what a turn on it was to be spanked hard and what a turn on it was to have her face slapped. So I made a special effort to punish her ass most exquisitely and find out for myself if her ass could cash the checks her mouth was writing.\nWell, it turns out it could. Strapped tight in leather belts that cup her round ass cheeks and bind her wrists to her thighs, she is hoisted up off the grounds, legs chained wide open. Her body weight pulling down on the strap harness spreads her fleshy ass cheeks apart and plumps them up firmly, presenting them in the ideal position for a hard punishment spanking, paddling and whipping. Her skin is pulled tight from the pressure, ensuring she will feel each spank, each stroke, each smack most intensely as the various implements make impact in the most tender of places.\nThis update is for fans of bondage, but especially for fans of good old fashioned hard punishment spanking. An obvious brat, Scarlett deserves every stroke she gets and has been long overdue for quite some time. Despite the hard punishment she got, after the shoot Scarlett is beaming with ass-tastic joy, her reddened, sore bottom throbbing beneath her, making it hard to find any comfortable way to sit and hard to stop feeling horny. Hope she enjoyed the extended sitting during her flight and cab home.",
  "directors": [
    {
      "name": "Cyd Black",
      "person_id": 12661
    }
  ],
  "models": [
    {
      "name": "Scarlett Pain",
      "person_id": 14244
    }
  ],
  "release_date": "2008-09-03",
  "scene_id": 5654,
  "tags": [
    "BDSM",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "Fingering",
    "Handler",
    "Humiliation",
    "Leather",
    "Leather Belt",
    "Metal Bondage",
    "Paddle",
    "harness",
    "Spanking",
    "Straight",
    "Submission",
    "Whipping"
  ],
  "title": "Hard Ass Punishment"
}