{
  "collections": [
    "Device Bondage"
  ],
  "description": "Bobbi Starr is the girl next door all right. Such a nice girl, with a hi and a friendly word for everyone. If she was your daughter, you’d never know what she was getting up to in her spare time. She’d come home from college during semester breaks and you’d be so proud when you saw her high marks. You’d tell everyone what a good girl you raised. Totally, blissfully clueless that she’s cramming as many cocks as she possibly can in every hole she has and otherwise generally engaging in the most depraved and perverted sexual escapades known to mankind, because the straight up sex alone isn’t even enough. Our good little girl’s got to get into the hardcore S&M too, you know, for variety and such?\n\nWell on this day, Bobbi wandered her way down into the basement of our armory, all smiles as usual. Her hair and nails all trim, neat and shiny, having been freshly plucked, powdered and preened in the clean and pleasant confines of the second floor makeup suite.\n\nThe hair and makeup lasted about five minutes, give or take.\n\nI bolted her to the floor naked on her back, with her legs strapped open and up, cunt and asshole spread wide and went to work. I clamped her tits, I locked her mouth open with a ring gag and stuffed a dildo on a pole in her cunt and her mouth, back and forth for lube and so she could taste her own juices. I stepped on her for some more leverage on the pole.\n\nHow do you like your good girl now?",
  "directors": [],
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    }
  ],
  "release_date": "2008-10-15",
  "scene_id": 5755,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Dildo",
    "Domination",
    "Fingering",
    "Gag",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "slim",
    "Straight",
    "Submission",
    "unshaved",
    "white"
  ],
  "title": "Quandary"
}