{
  "collections": [
    "Men in Pain"
  ],
  "description": "'I want to hear you say you want pain. And wipe that pretty little smile off that fucking face.'\nShe'd rather slap it off. Maitresse Madeline is a buzz saw hidden under a latex dress, and slapping the shit out of this little smart ass is just the first two minutes of this movie. Then, he makes the mistake of opening his mouth.\nCalling her Ma'am is like poking a hungry, caged tiger through the bars and then realizing that the door is unlocked. Just to teach him what her name is, she lays a set of cane stripes on him that he will likely never forget. And once he finally gets it right, she only beats him harder to make sure that he will never, EVER forget it.\n'You thought you were going to come here and show off, that I would be easy on you, didn't you?'\nSadistic chuckles betray her sheer amusement through the ball slapping, squeezing, pulling, cock twisting and general mayhem she unleashes below his waist. Then she takes out the pliers and the spiked nerve wheel.\n'Why are you so fucking greedy?'\nShe assures him of one thing as she reclines, her gorgeous ass luxuriously enveloping his face. 'You need to be licking my ass, because that is the closest you will ever get to fucking my hot little holes.'\nAs her strap on rips his hungry ashole apart, her manicured nails tease and dig at the flesh just below the tip of his hardened, beaten cock. When she brings him to the edge of orgasm with a hitachi vibe on his aching prick only to turn and walk away, one has to wonder if she had been contemplating her decision about Rico's orgasm before she ever stepped foot in the building.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    },
    {
      "name": "Rico",
      "person_id": 16001
    }
  ],
  "release_date": "2010-10-25",
  "scene_id": 5870,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "black hair",
    "Blonde",
    "Bondage",
    "Cage",
    "Caning",
    "CBT",
    "Chains",
    "cock and ball torture",
    "Collar",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Foot Torment",
    "Hitachi",
    "Humiliation",
    "Interracial",
    "Jockstrap",
    "Latex",
    "Latin",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Pierced Nipples",
    "Pussy Eating",
    "Rimming",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Tattoo",
    "top",
    "Weights",
    "white"
  ],
  "title": "The Name is Maitresse, Don't Fuck it Up"
}