{
  "collections": [
    "Hogtied"
  ],
  "description": "Holy Babbling Fuck\n\nOK, you the members, asked for this.\nHappy New Year!\nI thought I would start the year off with screaming orgasms…\n\nThere is something very sexy when a beautiful woman’s face is contorted in a powerful orgasm – but Darling just takes the cake & will FUCKING BLOW YOU AWAY. She also has this funny thing her brain does as she is coming again & again; it sort of goes into schizoid mode, & nothing intelligible or coherent is able to get past her sexy lips. This beautiful, sexy woman is someone who has an on/off switch which sometimes gets stuck…. She tells me it is either on or off, but with this week’s update I tried to blow the fuse & see if I could burn out the switch. Well she got the best of me, sort of…. ;-) She never gave in, but the day has just so many hours, & we really didn’t want to go into overtime shooting her screaming, babbling orgasms all through the night.\n\nThis shoot is also for the tickle torment fans out there. The only thing that was more of a turn-on for me was distracting Darling in mid-orgasm with a bit (really a lot) of tickle torment. Now some people say laughing has no place in bdsm; please do tell me what you think after you watch this update… If you still have a problem with the idea that tickling has no place in torment, try asking Darling as she tries to catch her breath.\n\nFor the moment there is a problem with the zip download for wmv versions of the videos. You CAN still right click/save on them as well as download the mp4 zip versions. We are working on getting them up ASAP.",
  "directors": [],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2008-12-30",
  "scene_id": 5914,
  "tags": [
    "Ball Gag",
    "BDSM",
    "Big Natural Tits",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Choking",
    "Clothespins",
    "Clover Clamps",
    "Corporal Punishment",
    "Destruction",
    "Domination",
    "Female Slave",
    "Fingering",
    "Flogging",
    "Foot Torment",
    "Handler",
    "Hitachi",
    "Humiliation",
    "multiple orgasms",
    "natural boobs",
    "Nipple Torment",
    "Rope Bondage",
    "shaved",
    "Slapping",
    "Slave",
    "slim",
    "Straight",
    "Submission",
    "Suspension",
    "switch",
    "Tickling",
    "Vaginal Penetration",
    "Weights",
    "white"
  ],
  "title": "Darling gives us BLOODY SCREAMING FUCKING ORGASMS over & over & over again!"
}