{
  "collections": [
    "Device Bondage"
  ],
  "description": "This woman, this India Summer, is in heat in such an achingly constant agonizing intense way that she actually manages to radiate waves of it out like some primal pheromone that makes the air kind of humid and you start to feel hazy and dull. She's rubbing her thighs together endlessly, endlessly trying to make the waiting go faster but it doesn't help it just makes it worse and you realize you've stopped whatever you were doing and now you're even a little bit freaked out too.\nNothing can satiate her. Her cunt clamps down so hard on a dildo that I can't pull it out with two hands, and using a three foot pole for leverage. She will actually slide across the floor first before it comes out. If you tried to fuck her, she could hold you hostage. I don't even know if it would be a good idea to try to fuck her because she might push the blood backwards into your heart the wrong way and kill you or something. When she comes, the contractions crush the thick stiff rubber cock, bending it almost in half. I'm glad I decided to use the straitjacket and padded cell for the shoot out of pure luck because it was all honestly _useful_ as opposed to being a fantasy setting so she doesn't strip screws or rip bolts through the wood of my normal set in some riot of orgasmic violence.",
  "directors": [],
  "models": [
    {
      "name": "India Summer",
      "person_id": 16909
    }
  ],
  "release_date": "2013-12-04",
  "scene_id": 5925,
  "tags": [
    "Athletic",
    "Ball Gag",
    "BDSM",
    "Big Ass",
    "Bondage",
    "Brunette",
    "Clover Clamps",
    "Corporal Punishment",
    "Crop",
    "Deprivation",
    "Dildo",
    "Discipline",
    "Domination",
    "Electric Dildo",
    "Electrical Play",
    "Fingering",
    "Flogging",
    "Foot Torment",
    "Hair Pulling",
    "Handler",
    "Hitachi",
    "Hood",
    "Humiliation",
    "Leather",
    "Leather Belt",
    "Metal Bondage",
    "Nipple Torment",
    "Slapping",
    "Small Tits",
    "Straight",
    "Straight Jacket",
    "Submission",
    "Vibrator",
    "Whipping"
  ],
  "title": "KINK Classic 3 of 20. Countdown to relaunch!"
}