{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Never released on the Ultimate Surrender site, this match was only available as a Kink on Demand download up until now. Today, for the first time ever, members get this epic shoot as an update!\nBecause this shoot's popularity and acclaim as a KOD were so massive, we had to take this shoot out of the archive and share it once again, this time on the U/S site for all the members! Now members get this legendary battle at no extra cost! Now members get to see a part of Ultimate Surrender history.\nWelcome to ROYAL MADNESS. The most ambitious, wrestling porn event ever filmed. Where 6 winners will fuck 6 losers in an epic orgy of rough, brutal sex!\nTwo team Captains will take turns picking their wrestlers from a 10 girl pool. Playground rules until the last girl is picked. The teams are assigned colors and meet to work out a strategy.\nThe Match starts with Team Blue putting the first girl on the mat. Team Red has 30 seconds to decide who will wrestle her. After the fight, Team Red puts a girl out and Team blue must decide who will wrestle. This repeats until all girls have wrestled.\nEach score is added to the overall team score, as the Captains use strategy to try and get the best match up on the mat for their team. In the end, the team with the overall highest score wins, and gets to brutally fuck the losing team in a massive 12 girl orgy gangbang.\nBut that's not all. On top of over an hour of intense non-scripted wrestling and a 12 girl rough sex orgy, we have included tons of bonus material! An extra 45 minutes of the orgy scene from 3 different camera angles!! Before and after wrestling, we have behind the scenes footage with the wrestlers and out takes.",
  "directors": [
    {
      "name": "Ariel X",
      "person_id": 52
    }
  ],
  "models": [
    {
      "name": "Alexa Von Tess",
      "person_id": 12340
    },
    {
      "name": "Amber Rayne",
      "person_id": 12631
    },
    {
      "name": "Ami Emerson",
      "person_id": 18094
    },
    {
      "name": "Annie Cruz",
      "person_id": 7776
    },
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Claire Dames",
      "person_id": 14027
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Hollie Stevens",
      "person_id": 1572
    },
    {
      "name": "Julie Night",
      "person_id": 11190
    },
    {
      "name": "Madison Young",
      "person_id": 2674
    },
    {
      "name": "Tia Ling",
      "person_id": 17361
    },
    {
      "name": "Trina Michaels",
      "person_id": 16367
    }
  ],
  "release_date": "2012-12-25",
  "scene_id": 6052,
  "tags": [
    "Anal",
    "Athletic",
    "Big Natural Tits",
    "Big Tits",
    "Champion",
    "Domination",
    "Double Penetration",
    "Facesitting",
    "Facefucking",
    "Fingering",
    "Gangbang",
    "Hair Pulling",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Orgy",
    "Pussy Eating",
    "Rough Sex",
    "Small Tits",
    "Smothering",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "ROYAL MADNESS 12 girls, 2 teams, 1 score, one massive orgy."
}