{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "2009 TAG TEAM LEAGUENOW IN FRONT OF A LIVE AUDIENCE\nTEAM ICE\nVon Tess & Bella\nCombined HT:130\"\nCombined WT: 295lbs\nRecord:(0-0)\nTEAM NINJA\nVendetta & Kirra\nCombined HT:129\"\nCombined WT: 255lbs\nRecord:(0-0)\nWelcome to Ultimate Surrender's 2009 Tag Team League.\nTeam Ice vs Team Ninja. Four girls,\nnon-scripted, real tag team action.\nThis is the start of the new 2009 Tag Team Season. New teams; new wrestlers. The Beginning of what will be the the most brutal Tag Team Season yet!\nTeam Ice: Alexa Von Tess has teamed up with rookie sensation Bella Rossi. This team is bigger than all the other teams and has the experience and strength to win it all. When one of these girls drops a booty on your face, you're going nowhere.\nTeam Ninja: Vendetta is the Team Captain, and hand picked Kirra Lynne for her partner. Kirra is a true Pit Bull; fast determined and dangerously brutal. However, she lacks mat time, and is the least experienced girl in the league. But with Vendetta on your team, that might not mean much.\nThis is the first match of the new 2009 Tag Team season: 5 teams battle to see who will be crowned the Champion. If you have not joined yet, now is the time. This is the ground floor of the most brutal sexy wrestling league on the net. Watch it from the start!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Alexa Von Tess",
      "person_id": 12340
    },
    {
      "name": "Bella Rossi",
      "person_id": 18418
    },
    {
      "name": "Kirra Lynne",
      "person_id": 18123
    },
    {
      "name": "Vendetta",
      "person_id": 8300
    }
  ],
  "release_date": "2009-03-27",
  "scene_id": 6282,
  "tags": [
    "Anal",
    "Big Tits",
    "Blonde",
    "Brunette",
    "Champion",
    "Curvy",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "natural boobs",
    "other hair color",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "Tattoo",
    "top",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "LIVE TAG TEAM LEAGUE Team Ice (0-0) vs Team Ninja (0-0)"
}