{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "2009 TAG TEAM LEAGUENOW IN FRONT OF A LIVE AUDIENCE\nTEAM DRAGON\nAriel X & Wenona\nCombined HT:131\"\nCombined WT: 235lbs\nRecord:(0-0)\nTEAM PIRATE\nDia Zerva & Yana Jordan\nCombined HT:131\"\nCombined WT: 270lbs\nRecord:(0-0)\nWelcome to Ultimate Surrender's 2009 Tag Team League.\nTeam Dragon vs Team Pirate. Four girls,\nnon-scripted, real tag team action.\nThis is the start of the new 2009 Tag Team Season. New teams; new wrestlers. The Beginning of what will be the the most brutal Tag Team Season yet!\nTeam Dragon: Last year this team did not win a single match. It was the only team that was defeated every fight. This year Team Dragon gets a new team Captain, Ariel X. Ariel X took her team to the championship last year and hopes to bring Team Dragon out of the cellar.\nTeam Pirate: This team won last season's Championship. Dia is the team captain and this year has a new partner, rookie Yanna Jordan. Yanna comes to US with vast wrestling experience but is new to the US style of wrestling. Can this team repeat and win two championships in a row?\nThis is the second match of the new 2009 Tag Team season: 5 teams battle to see who will be crowned the Champion. If you have not joined yet, now is the time. This is the ground floor of the most brutal sexy wrestling league on the net. Watch it from the start!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Dia Zerva",
      "person_id": 16038
    },
    {
      "name": "Yana Jordan",
      "person_id": 18837
    },
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Wenona",
      "person_id": 4485
    }
  ],
  "release_date": "2009-04-24",
  "scene_id": 6299,
  "tags": [
    "Ariel X",
    "champion",
    "domination",
    "Facesitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tag team",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "LIVE TAG TEAM LEAGUE "
}