{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "2009 TAG TEAM LEAGUE IN FRONT OF A LIVE AUDIENCE\nTEAM NINJA\nIsis Love & Vendetta\nCombined HT:132\"\nCombined WT: 255lbs\nRecord:(1-0)\nTEAM GODDESS\nClaire Dames & Calico\nCombined HT:129\"\nCombined WT: 242lbs\nRecord:(0-0)\nWelcome to Ultimate Surrender's 2009 Tag Team League.\nTeam Ninja vs Team Goddess. Four girls,\nnon-scripted, real tag team action.\nThis is the start of the new 2009 Tag Team Season. New teams; new wrestlers. The Beginning of what will be the the most brutal Tag Team Season yet!\nThe Ninja's have scored a new permanent wrestler in the form of Isis Love. Isis has come out of retirement to wrestle for the elite Tag Team League. This team is now the team to beat.\nTeam Goddess is in real trouble today. Both their regular wrestlers are out due to injuries. Stepping in at the last minute are Claire Dames with her huge tits, and Calico with her sexy lithe frame. They don't stand a chance in Hell but it will be fun watching them get their beautiful asses kicked!\nThis is the third match of the new 2009 Tag Team season: 5 teams battle to see who will be crowned the Champion. If you have not joined yet, now is the time! This is the ground floor of the most brutal and sexiest wrestling league on the net.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Vendetta",
      "person_id": 8300
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Claire Dames",
      "person_id": 14027
    },
    {
      "name": "Calico",
      "person_id": 11592
    }
  ],
  "release_date": "2009-05-29",
  "scene_id": 6324,
  "tags": [
    "champion",
    "domination",
    "Face Sitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tag team",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "LIVE TAG TEAM LEAGUE "
}