{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "2009 TAG TEAM LEAGUE IN FRONT OF A LIVE AUDIENCE\nTHE DRAGONS\nAriel X & Wenona\nCombined HT:131\"\nCombined WT: 235lbs\nSeason Record:(1-0)\nFranchise Record (1-4)\nTHE GODDESSES\nTia Ling & Ami Emerson\nCombined HT:128\"\nCombined WT: 232lbs\nSeason Record:(0-1)\nFranchise record (1-4)\nWelcome to Ultimate Surrender's 2009 Tag Team League.\nThe Dragons vs The Goddesses. Four girls,\nnon-scripted, real tag team action.\nThis is the new 2009 Tag Team Season. New teams; new wrestlers. The beginning of what will be the the most brutal Tag Team Season yet!\nThis match was held in front of our affiliates. A private party for the people who promote our sites. Most of you found out about US probably though an affiliate site. This was the rowdiest crowd yet and that energy carried over on to the mat.\nThe Dragons won their first match by 31 pts, and are looking to go 2-0 which would almost guarantee a playoff spot. Both wrestlers are in the best shape of their lives and seasoned with experience on the mat.\nThe Goddesses have not fielded a complete team due to an injury to Adrianna Nicole. Tia Ling steps in to hopefully give the blue team its first victory.\nWith an out of control crowd, and fired up and determined wrestlers, this match went down to the last 2 minutes. Pandemonium in the squared circle!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Wenona",
      "person_id": 4485
    },
    {
      "name": "Ami Emerson",
      "person_id": 18094
    },
    {
      "name": "Tia Ling",
      "person_id": 17361
    }
  ],
  "release_date": "2009-07-31",
  "scene_id": 6326,
  "tags": [
    "Ariel X",
    "Asian",
    "domination",
    "Face Sitting",
    "Fingering",
    "lesbian",
    "lesbian anal",
    "LezDom",
    "Pussy Eating",
    "straight",
    "strap on",
    "submission",
    "tag team",
    "Vaginal Penetration",
    "wrestling"
  ],
  "title": "LIVE TAG TEAM LEAGUE "
}