{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "2009 TAG TEAM LEAGUE IN FRONT OF A LIVE AUDIENCE\n\nTHE PIRATES\n\nDia Zerva & Yana Jordan\nCombined HT:131\"\nCombined WT: 270lbs\nSeason Record:(1-1)\nFranchise Record (4-2)\n\nTHE NINJAS\nVendetta & Isis Love\nCombined HT:132\"\nCombined WT: 255lbs\nSeason Record:(2-0)\nFranchise record (5-1)\n\nWelcome to Ultimate Surrender's 2009 Tag Team League.\nThe Pirates vs The Ninjas. Four girls,\nnon-scripted, real tag team action.\n\nThis is the new 2009 Tag Team Season. New teams; new wrestlers. The Beginning of what will be the the most brutal Tag Team Season yet!\n\nThis is the match-up everyone has waited for. Isis Love is back and is looking hotter then ever. Vendetta and Dia Zerva will face off for the first time. Hang on - this could get rough.\n\nThe Pirates have been looking forward to this match for weeks. Both of these girls train hard off of the mat, and each looks forward to battling their counterpart. Dia wants fingers in Vendetta, and Yana wants Isis to be her little sissy bitch. This team is polished, coordinated and ready.\n\nThe Ninjas are cocky. After all, it's Vendetta and Isis - and they know it. Vendetta is a past US champion, and Isis is a back from retirement and an elite member of the US hall of fame. This team is not worried about much.\n\nThe first round is a wake up call for the Ninjas as the Pirates' coordination, speed, and skill surprises the veteran Ninjas. Isis gets trapped and mauled at the end of the round and the Pirates are looking good.\n\nRound two is a different story, as the Ninjas dominate from the start, not only do they get the lead back but they look great doing it. Then tragedy strikes, and Yana goes down hard with an injury. We are 3 seconds past the halfway point of the match and according to the rules, the match is over.\n\nBut Round 4 will be held, and it is decided that Dia will take the double team while an injured Yana watches. However, the Ninjas spy Darling in the crowd, and drag her ass onto the mat and begin to fuck her and the loser.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Vendetta",
      "person_id": 8300
    },
    {
      "name": "Dia Zerva",
      "person_id": 16038
    },
    {
      "name": "Yana Jordan",
      "person_id": 18837
    },
    {
      "name": "Isis Love",
      "person_id": 6584
    }
  ],
  "release_date": "2009-08-28",
  "scene_id": 6327,
  "tags": [
    "Anal",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "Tag Team",
    "top",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "LIVE TAG TEAM LEAGUE"
}