{
  "collections": [
    "Bound Gods"
  ],
  "description": "Patrick Rouge is the second slave chosen for training. He is a power bottom and former military. He should do well. His handler is our very own Tyler Saint. I sometimes call him affectionately Mr. Tyler. No matter what, Tyler Saint has cock and muscles that won't stop.\nIf you have seen Part One, the Cock's Creed and the Slave Positions are repetitive. They are annoying. They are used for the first slave training. I hope this is the last you will see of the Cock's Creed.\nFrom Part One: Life always moves forward, and changes are afoot in the Armory. Clans at Kink.com and Kinkmen.com have united in order to gain access to the exclusive realm of TheUpperFloor.com. The House of Detention is now called simply \"The House.\" BoundGods has been invited to host a formal dinner party on TheUpperFloor, which will be broadcast live online. Every few months, two applicants will compete for UpperFloor slave status, and BoundGods viewers will vote for the winner. At the end of the year, these winners will compete for the final time for the 2010 KinkMan of the Year Title.\nI'm training the slaves for the event with the help of my \"handlers,\" a daunting task given such a short period of time. It's a crash course and it's a bit repetitive. Many things can and will go wrong. Oh, the beauty of real life!\nSincerely, Van Darkholme",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Patrick Rouge",
      "person_id": 18939
    },
    {
      "name": "Tyler Saint",
      "person_id": 17416
    },
    {
      "name": "Van Darkholme",
      "person_id": 15862
    }
  ],
  "release_date": "2009-05-14",
  "scene_id": 6447,
  "tags": [
    "Anal",
    "BDSM",
    "Blowjob",
    "Bondage",
    "bottom",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "Handler",
    "Humiliation",
    "Male Sub",
    "master",
    "Muscle",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "Slave",
    "Submission"
  ],
  "title": "Training for TheUpperFloor.com: Part Two"
}