{
  "collections": [
    "Bound Gods"
  ],
  "description": "Life moves always forward, and changes are afoot in the Armory. Clans at Kink.com and Kinkmen.com have united in order to gain access to the exclusive realm of TheUpperFloor.com. The House of Detention is now called simply “The House.” BoundGods has been invited to host a formal dinner party on TheUpperFloor, which will be broadcast live online. Every few months, two applicants will compete for UpperFloor slave status, and BoundGods viewers will vote for the winner. At the end of the year, these winners will compete for the final time for the 2010 KinkMan of the Year Title.\n\nI’m training the slaves for the event with the help of my “handlers,” a daunting task given such a short period of time. It’s a crash course, and it’s a bit repetitive. Many things can and will go wrong. Oh, the beauty of real life!\n\nI’ve chosen Dean Tucker as the very first slave, both for his submissive nature and his beautiful white ass. His handler is the stunning fashion model Rusty Stevens. Don’t let his pretty boy face and bod fool you – Mr. Stevens has impressive qualities as a dom.\n\nSincerely, Van Darkholme",
  "directors": [
    {
      "name": "Van Darkholme",
      "person_id": 54
    }
  ],
  "models": [
    {
      "name": "Dean Tucker",
      "person_id": 18800
    },
    {
      "name": "Rusty Stevens",
      "person_id": 19600
    },
    {
      "name": "Van Darkholme",
      "person_id": 15862
    }
  ],
  "release_date": "2009-04-16",
  "scene_id": 6484,
  "tags": [
    "Anal",
    "Asian",
    "BDSM",
    "big dick",
    "black hair",
    "Blowjob",
    "Bondage",
    "brunet",
    "Corporal Punishment",
    "Domination",
    "Gay",
    "Handler",
    "Humiliation",
    "Male Sub",
    "master",
    "muscular",
    "other hair color",
    "Rimming",
    "Rope Bondage",
    "Rough Sex",
    "shaved",
    "Slave",
    "Submission",
    "Tattoo",
    "white"
  ],
  "title": "Training Begins for TheUpperFloor.com"
}