{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE MATCH UP: ROUND 1\nMADISON\nThe Butcher\nHT: 5'2\nWT: 109lbs\nSeason record (1-1)\nLifetime record (3-2)\nRanked 11th\nAMBER RAYNE\nRogue\nHT: 5'3\nWT: 105lbs\nSeason record (1-1)\nLifetime record (4-4)\nRanked 12th\nWelcome to the start of the 2009 Championship tournament. The top 16 wrestlers of the season face off in a single elimination tournament. Check out the Summer Vengeance Bracket here.\nMadison finished this year ranked 11th, She is a multi-season veteran, and has been in the Summer Tournament before. She has amazing endurance and is surprisingly strong.\nAmber Rayne is a past Feather Weight Champion and a multi-season veteran. She is fast and talented, her only downside being her size, at 105lbs. she is one of the smallest wrestlers on the roster. What she lacks in size she more then makes up in determination.\nThis was a well fought match, both opponents had the other in submission holds and other brutal locks. From leg scissors to reverse head locks, this match had everything in it. Madison was helpless to stop the finger fucking on many occasions. In the end the winner fucked the loser's ASS with power and authority. The winner also advances to the next round of the tournament!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Amber Rayne",
      "person_id": 12631
    },
    {
      "name": "Madison Young",
      "person_id": 2674
    }
  ],
  "release_date": "2009-06-16",
  "scene_id": 6632,
  "tags": [
    "Anal",
    "Brunette",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Pussy Eating",
    "Redhead",
    "shaped",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "top",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "SUMMER VENGEANCE TOURNAMENT MATCH UP! MADISON VS AMBER RAYNE"
}