{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "SUMMER VENGEANCE MATCH UP: QUARTER FINALS!\nDIA ZERVA\nThe Iron Maiden\nHT: 5'5\nWT: 135lbs\nSeason record (4-0)\nLifetime record (5-1)\nRanked 1st\nARIEL X\nThe Assassin\nHT: 5'8\nWT: 115lbs\nSeason record (5-0)\nLifetime record (12-3)\nRanked 4th\nWelcome to the 2009 Championship tournament. The top 16 wrestlers of the season face off in a single elimination tournament. Check out the Summer Vengeance Bracket here.\nDia Zerva was last year's runner up to the Championship. This year she is ranked 1st and is undefeated. She is expected to win the Championship this year. Dia is a former Marine, who trains hard and often between matches. Fast, brutal, with a never-give-in-or-give-up attitude makes this Welterweight one of the elite wrestlers of Ultimate Surrender.\nAriel X is the 115lb spitfire from hell! Ariel, in our opinion, has the best endurance of any wrestler on our books. She has never trained harder for a season than she has for this one. Ariel remembers last year's match-up in the finals with Dia; she remembers Dia calling time out when she was gasping for air, struggling to hang on. A strategy that worked for Dia but pissed off the Assassin. Revenge is all that is on Ariel's mind right now, brutal revenge!\nIt was a vicious battle, a technical masterpiece. Two strong, experienced, girls that both take losing very badly, pushed to the limit. In the end one of these girls wanted to fuck the other's ass more. Who was it? Who got their ass handed to them, then got it fucked?\nAnd for an intimate behind-the-scenes look at Dia and Ariel's very friendly rivalry, be sure to check out this exclusive\nBehind Kink story.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Dia Zerva",
      "person_id": 16038
    }
  ],
  "release_date": "2009-08-25",
  "scene_id": 7142,
  "tags": [
    "Anal",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "SUMMER VENGEANCE TOURNAMENT MATCH UP! "
}