{
  "collections": [
    "Divine Bitches"
  ],
  "description": "#mm h3, #mm h4, #mm p, #mm ol, #mm ol li, #mm ul, #mm ul li {\nfont-family:Verdana, Geneva, sans-serif;\ntext-align:left;\n}\n#mm h3, #mm h4 { font-weight:bold; margin-top: 15px; margin-bottom: 5px;}\n#mm p { margin-bottom: 15px; }\n#mm ol, #mm ul { margin-top: 2px; list-style-position: outside; padding-left: 40px; }\n#mm ol li { list-style:decimal; }\nDivine Bitch: Miss Dia Zerva\nWorm: Kade\nKade has already gone through two days of training with Maitresse Madeline yet with new protocol in place Kade is made to start from the beginning and go through to determine whether or not he can serve on The Upper Floor. Maitresse decides that since he has served her in the past she will come down to the dungeon to assist Miss Dia in Kade's first day. His mouth is washed out with soap before he is even allowed to pleasure Madeline's pussy. He is caned for encouragement. Exercise torture is incorporated with ass worship. He's bound and has his cock used while getting fucked with a dick on a stick then left drained covered in his own filth!\nDon't miss the rest of Kade's episodes here at Divine Bitches! Come back and see if this slut has what it takes to serve on the prestigious Upper Floor!\nMaitresse's Evaluation\nGoals\nphysical health and conditioning\nquit smoking\nexcercise torture\ngain endurance\nmulti-tasking\nlearn to efficiently multi task\nClosing assessment\ndid not have a cigarette for 12 hours after training session\nendurance was promising\nup difficulty factor\neager to service a woman's ass but still much too messy and impatient\nwas able to keep cock hard, get fucked anally, and cum when told to do so",
  "models": [
    {
      "name": "Dia Zerva",
      "person_id": 16038
    },
    {
      "name": "Kade",
      "person_id": 12580
    },
    {
      "name": "Maitresse Madeline Marlowe ",
      "person_id": 17872
    }
  ],
  "release_date": "2009-10-27",
  "scene_id": 7190,
  "tags": [
    "dungeon",
    "anal"
  ],
  "title": "The Training of a Houseboy: Episode 1"
}