{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Mistress DragonLily\nWorm: Wolf Hudson\nWolf Hudson and Maitresse Madeline have history. Last year Madeline hit a cord during a training session with Wolf which left him raw and exposed. Maitresse decides to allow him to be one of the first male submissives to go through training with the Divine Bitches in order to be eligible to serve on the prestigious Upper Floor. Maitresse calls upon DragonLily the \"exotic temptress\" to assist in Wolf's adjustment. DragonLily is drop dead gorgeous and knows how to use her sensuality to her advantage. She teases Wolf with her beauty and pussy only to deny him access. She expertly trains Wolf through three goals first by plugging his ass, then flogging and caning him, making him worship her delicious asshole while she gets her pleasure and finally fucking this stubborn slut in the ass. Strap-on ass fucking is something this submissive has somehow avoided during his other training sessions and Maitresse decides it's about time he get fucked! Watch as Wolf takes a big cock in his ass just to make Maitresse and DragonLily happy. This episode will have all foot fans in a frenzy, it includes foot worship, shoe worship, strap-on ass fucking, ass licking and ass worship!\nDon't miss all of Wolf's episodes with the Divine Bitches! Come back and see the next Divine Bitch continue his training and find out if he has what it takes to serve Maitresse again and make it to The Upper Floor.\nMaitresse's evaluation\nGoals\nAttitude Adjustment\n-adjust cocky pornstar attitude\nAnal Training\n-learn to take the cock of a woman anally\nFoot and ass worship\n-learn proper body worship\nAttitude was slightly adjusted with flogging, caning and humiliating ass fucking. Left with a much more humble attitude. Needs further drilling in order to improve proficiency with anal fucking. Greedy with foot and ass worship but room for improvement and shows enthusiasm.",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Wolf Hudson",
      "person_id": 14471
    }
  ],
  "release_date": "2009-09-28",
  "scene_id": 7191,
  "tags": [
    "Anal",
    "Asian",
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Bondage",
    "Brunette",
    "Caning",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "Foot Worship",
    "foreskin",
    "Humiliation",
    "Latin",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rimming",
    "Rough Sex",
    "shaved",
    "shoe worship",
    "Slave",
    "Straight",
    "unshaved"
  ],
  "title": "The Adjustment of Wolf Hudson: Episode 1"
}