{
  "collections": [
    "Divine Bitches"
  ],
  "description": "#mm h3, #mm h4, #mm p, #mm ol, #mm ol li, #mm ul, #mm ul li {\nfont-family:Verdana, Geneva, sans-serif;\ntext-align:left;\n}\n#mm h3, #mm h4 { font-weight:bold; margin-top: 15px; margin-bottom: 5px;}\n#mm p { margin-bottom: 15px; }\n#mm ol, #mm ul { margin-top: 2px; list-style-position: outside; padding-left: 40px; }\n#mm ol li { list-style:decimal; }\nDivine Bitch: Mistress Ashley Fires\nWorm: Derrick P.\nMr Acworth and Mr Mogul introduced Maitresse Madeline during an Upper Floor party as the female house dominant in charge of training submissive men. She was ushered in on a throne by two hellhound slave boys who fiercely protect her. Maitresse is looking for another hellhound and Mistress Ashley Fires begins training the first possible candidate pup Derrick P the lifestyle dogboy who thinks he has what it takes. The pound hound is scrubbed down, paddled and made to worship ass. He is made to get his mistress off over and over again. Mistress Ashley takes on the last training goal by ramming dogboy in the ass deep with a strap-on cock. Mistress Ashley gets hers but does she give dogboy permission to release or is he left fucked and denied?\nBe sure to watch all of Derrick's episodes here at Divine Bitches and see if he does indeed have what it takes!\nMaitresse's Evaluation\nObjectives\nprotection with appropriate aggressive behavior\nturn dogboy from a Chihuahua to a Doberman\nservice\nlearn to properly serve a woman's ass\nstrength and endurance\nplease a women for extended periods while taking pain and other distractions\nanal training\ntake a women's cock for her amusement\nClosing assessment\nlong way to go before he will serve as a hellhound on The Upper Floor\nfailed to protect, not appropriate aggressive behavior like a Chihuahua\neager to service a woman's ass but still much to messy and impatient\neager to prove his strength and endurance when pleasing a woman to orgasm\nlacks grace\nanal training was promising",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Derrick P.",
      "person_id": 19453
    },
    {
      "name": "Ashley Fires",
      "person_id": 20856
    }
  ],
  "release_date": "2009-10-20",
  "scene_id": 7246,
  "tags": [
    "anal",
    "bdsm",
    "blonde",
    "bondage",
    "CBT",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "femdom",
    "Fingering",
    "humiliation",
    "Male Sub",
    "orgasm denial",
    "pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "Smoking",
    "straight"
  ],
  "title": "The Training of a Hellhound: Episode 1"
}