{
  "collections": [
    "Device Bondage"
  ],
  "description": "Live Show Mondays brings you the part one of the September live show that featured Jessie Cox, Ami Emerson and special guest co-top Isis Love.\nFirst off I want to thank Ami Emerson for stepping in at the last second (and I mean the last second) to fill in for a girl who canceled because she didn't feel like doing any bondage scenes that day, she only wanted sit in a cage. Ami was in a brutal Ultimate Surrender match the night before, but still wanted to help us with the show. A true professional.\nSo we start the show off with the girls chatting with members. At one point a member wants to see an escape challenge, with belts. We belt up both girls and see who can get out first. So we bind both, gag them and watch them struggle to escape. Jessie, being a 9-year gymnast, made short work using her flexibility to good effect. However poor Ami was hopelessly trapped and we had to let her out.\nNext we brought out the \"WALKER\" We did this once before, but a member had a great suggestion to put down an office floor mat with the very pointy points face up. We laid down two of those and had the girls fight to push their \"walkers\" barefoot over the painful spikes. Add in ass hooks, to pull them higher up on their toes, nipples weight swinging and pulling every step, and vibrator \"stations\" placed over the spikes, and you have a good start to Septembers live show.",
  "directors": [],
  "models": [
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Jessie Cox",
      "person_id": 18739
    },
    {
      "name": "Ami Emerson",
      "person_id": 18094
    }
  ],
  "release_date": "2009-10-12",
  "scene_id": 7295,
  "tags": [
    "ass hook",
    "bdsm",
    "bondage",
    "cage",
    "Corporal Punishment",
    "domination",
    "Fingering",
    "gag",
    "Handler",
    "humiliation",
    "metal bondage",
    "pain",
    "straight",
    "submission",
    "vibrator"
  ],
  "title": "Jessie Cox, Ami Emerson, and Isis Love "
}