{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Mistress Lorelei Lee\nWorm: Kade\n\nKade is back for training day 2 and this time he has to please the wicked flirt, Mistress Lorelei Lee. Kade was such a little pussy during his second day compared to his first. One can only hope he shapes up in the future! Kade is taken through his training goals while being made to worship leather boots, have his back side flogged, punished with the cattle prod, have his balls weighed down and his mouth filled with feet and sweet sweaty stockings. Lorelei has enough and just so this pussy doesn’t waste her entire day he is made to worship her pantyhose clad ass, rammed in the ass for amusement, completely encased in bondage tape then used for his cock till Mistress Lorelei cums. Kade is allowed release but only on the soft arches of her beautiful feet!\n\nWill Kade shape up and make it one step closer to The Upper Floor? Find out how his story unfolds in episode 3 at Divine Bitches!\n\nThis update includes boot worship, foot worship, pantyhose ass worship, encasement, strap-on ass fucking and much more!\n\nMaitresse’s Evaluation\nGoals\n\n\nproper eye contact\nnever look a dominant in the eye\n\n\nproper body language\nalways available sexually\n\n\npleasure slave training\nkeep dick hard!\n\n\n\nClosing assessment\n\n\ncould not keep eyes looking straight ahead\n\ncontinually looked dominant in the eye\n\nkept mouth and ass sexually available\n\ncould not keep dick hard\n\napply devices such as cock rings and penis pumps for cock readiness",
  "directors": [
    {
      "name": "James Mogul",
      "person_id": 53
    }
  ],
  "models": [
    {
      "name": "Kade",
      "person_id": 12580
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    }
  ],
  "release_date": "2009-12-09",
  "scene_id": 7376,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "Boot",
    "Boot Worship",
    "brunet",
    "Cattle Prod",
    "CBT",
    "Corporal Punishment",
    "Dominatrix",
    "Facesitting",
    "Feet",
    "Femdom",
    "Fingering",
    "Foot Worship",
    "Humiliation",
    "Leather",
    "Male Sub",
    "natural boobs",
    "Nylons Stockings",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "Straight",
    "white"
  ],
  "title": "The Training of a Houseboy: Episode 2"
}