{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Miss Dia Zerva\nSub: Jack Hammer\nMiss Dia is drenched in sweat and so hot in this update that she had me on the edge of my seat the entire time! Jack Hammer and Miss Dia are both marines. I found it very appropriate not only to put Jack through his first day of training with Miss Dia but to scheduled it on the marine core birthday! Dia puts Jack through her own form of bootcamp! Jack is placed in a leather posture collar (very appropriate for a leather neck) caned with the brutal bloodline cane while in intense cock and ball bondage. He's bound with rope, taught oral servitude till Miss Dia cums all over his face, subjected to impact play with MMA gloves, tickled, milked, fucked with an electrified dildo and completely teased and denied. As if that's not enough Miss Dia gags his mouth with a dildo gag and gets herself off leaving Jack there wanting with no release again!.\nDon't miss the rest of Jack Hammer's episodes here at Divine Bitches! Will he ever serve Maitresse Madeline and the House on The Upper Floor? Only time will tell!\nMaitresse's Evaluation\nCore Values\nHonor\nit's a privilege to train with DiB\nCourage\nthe quality of mind or spirit that enables a person to face difficulty\nCommitment\na pledge or promise to serve The Bitches for the possibility of serving on The Upper Floor\nClosing assessment\nhas the courage to face difficulty and pain without fear\ncontinue more training in pain processing\nseems committed to serving and puts in effort on his own time\nnot disciplined nearly enough, can't be trusted upstairs as of yet\ncontinues to anticipate actions",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Dia Zerva",
      "person_id": 16038
    },
    {
      "name": "Jack Hammer",
      "person_id": 18499
    }
  ],
  "release_date": "2009-12-16",
  "scene_id": 7467,
  "tags": [
    "BDSM",
    "big dick",
    "Black",
    "black hair",
    "Blonde",
    "Bondage",
    "CBT",
    "Collar",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "gloves",
    "Humiliation",
    "Leather",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "Smoking",
    "Straight",
    "Sub",
    "switch",
    "Tattoo",
    "versatile",
    "white"
  ],
  "title": "FemDom BootCamp: Episode 1"
}