{
  "collections": [
    "Divine Bitches"
  ],
  "description": "#mm h3, #mm h4, #mm p, #mm ol, #mm ol li, #mm ul, #mm ul li {\nfont-family:Verdana, Geneva, sans-serif;\ntext-align:left;\n}\n#mm h3, #mm h4 { font-weight:bold; margin-top: 15px; margin-bottom: 5px;}\n#mm p { margin-bottom: 15px; }\n#mm ol, #mm ul { margin-top: 2px; list-style-position: outside; padding-left: 40px; }\n#mm ol li { list-style:decimal; }\nDivine Bitch: Mistress Ashley Fires\nBitchboy: Jason Miller\nMistress Ashley Fires unleashes like we've never seen her do before! Bitchboy Jason Miller has his ass perched up high and exposed while in chastity. Ashley warms up by giving him a heavy flogging then sliding her ass lollipop deep playing around inside like it's a little toy. Since bitchboy's cock has continually proven to be completely worthless Mistress Ashley uses his mouth instead, first to worship her asshole through her transparent latex then to clean it while she has knee buckling orgasms. Mistress Ashley is fiercely cruel never letting Jason out of chastity and instead uses a fuck machine to get herself off while he is made to hold her vibrator and worship her feet. This devastatingly delicious bitch then rubs her cum all over his chastity belt and hits it home by reminding him how he'll NEVER fuck her hot pussy!\nDon't miss the rest of Jason's training here at Divine Bitches! Come back and see if this bitchboy has what it takes to serve on the prestigious Upper Floor!\nMaitresse's Evaluation\nObjectives\ngrace\nflow gracefully in any situation\ndevotion\nis he truly devoted to serving a women and The House\npatience\npatiently awaiting each command or task without his cock getting in the way\nClosing assessment\ncomplete mess no grace whats so ever\ncontinue training in proper posture and body stance\nneeds to be broken down even smaller\ncock continually gets in the way despite it being useless\nsuggest to remain in chastity",
  "models": [
    {
      "name": "Ashley Fires",
      "person_id": 20856
    },
    {
      "name": "Jason Miller",
      "person_id": 17619
    }
  ],
  "release_date": "2010-01-06",
  "scene_id": 7486,
  "tags": [
    "bdsm",
    "bondage",
    "CBT",
    "Chastity",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "Feet",
    "femdom",
    "Fingering",
    "flogging",
    "humiliation",
    "latex",
    "Male Sub",
    "orgasm denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight",
    "vibrator"
  ],
  "title": "Educating a Bitchboy Episode: 2"
}