{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Mistress Dragonlily\nWorm: Kade\nDay three of training for Kade has only become harder! Kade is made into a\ncomplete foot service slut by foot dom, Mistress Dragonlily. If you're into\nfoot worship, you will love the ball gag nail polish holder, foot bathing, toe\nsucking, sole licking and barefoot trampling! Kade can't seem to satisfy the\nhigh standards of Dragonlily and gets a painful OTK spanking and caning. She\nuses her unique techniques of punishment by making him crawl on rice and hold\nheavy buckets filled with rice during ass worship. Dragonlily's orgasms are\ncompletely intense. The look on her face says she gets nothing but true\npleasure from being such a sadistic woman. She even gives Kade a chance to fuck\nher. When he fails miserably he's made to put on a humiliating thick, rubber\ncock sheath over his dick that's 4 times the size of his cock. She fucks her\nwet pussy with it to orgasm while he can't do anything but lay there defeated\nand helpless like the little cock puppet he is!\nDon't miss the rest of Kade's episodes here at Divine Bitches! Come back and\nsee if this slut has what it takes to serve on the prestigious Upper Floor!\nMaitresse's Evaluation\nObjectives\nservice\nmade to be a foot service slut\ngratitude\nhave gratitude for opportunity\nClosing assessment\nproper eye contact improving\nproper body language still needs work\nmore anal muscle training\nuseful for certain service (ass worship) needs further training in others (foot service)\npotential for Upper Floor slave service",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "DragonLily",
      "person_id": 3433
    },
    {
      "name": "Kade",
      "person_id": 12580
    }
  ],
  "release_date": "2010-01-13",
  "scene_id": 7547,
  "tags": [
    "Anal",
    "Asian",
    "Ball Gag",
    "BDSM",
    "Bondage",
    "brunet",
    "Brunette",
    "Caning",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Foot Worship",
    "Gag",
    "Humiliation",
    "Male Sub",
    "Muscle",
    "natural boobs",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "Spanking",
    "Straight",
    "white"
  ],
  "title": "Training of a Houseboy: Episode 3 \"The Cock Puppet\""
}