{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Goddess Isis Love\nSub: Wolf Hudson\nWolf is on day two of his Divine training and Goddess Isis Love is relentless! While bound and stapled under a cage to the floor Isis administers CBT and nipple torture along with a nice flogging. He's made to worship her ass and pussy to her satisfaction. But, she derives the most amusement when she straps Wolf to a post and teases and denies his cock over and over again with the Fucksall fuck machine fixed with a fleshlight pussy attachment! I've never seen a slaveboy scream with such satisfaction and denial at the same time in my entire life! Goddess Isis continues teasing him with her feet and he is further teased by being allowed to fuck her pussy. The big question is will Isis allow him release? Only The Goddess can determine that........\nThis update includes ass worship, pussy worship, CBT, nipple torture, tease and denial, humiliation, foot job, encasement, orgasm control and more!\nDon't miss the rest of Wolf's adjustment here at Divine Bitches! Come back and see if this sub has what it takes to serve on the prestigious Upper Floor!\nMaitresse's Evaluation\nObjectives\nfears\nencasement and immobilization\nattitude\ncurb petulancy\norgasm control\nremain hard with no release\nClosing assessment\nfaced his ultimate fear did not conquer it\ncock remained hard\nattitude improved slightly from first training\nfailed denial but only after extreme over stimulization",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Wolf Hudson",
      "person_id": 14471
    }
  ],
  "release_date": "2010-02-17",
  "scene_id": 7589,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Bondage",
    "Brunette",
    "Cage",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Feet",
    "Femdom",
    "Fingering",
    "Flogging",
    "foreskin",
    "Humiliation",
    "Latin",
    "Male Sub",
    "mixed",
    "Nipple Torment",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "Slave",
    "Straight",
    "Sub",
    "unshaved"
  ],
  "title": "The Adjustment of Wolf Hudson: Episode 2 \"EXTREME tease and denial\""
}