{
  "collections": [
    "Fucking Machines"
  ],
  "description": "Here it is the 2009 FuckingMachines Porn Star vs. Amateur competition.\nThe winning November Amateur Girl Friday, Ela Darling - who you the members voted for her return - saddles up against FuckingMachines Hall of Fame Babe, Bobbi Star in this pussy show down.\nBobbi seeminly has the clear advantage, having fucked the machines many times and having much more experience fucking on camera than rookie, Ela who until today has NEVER even licked a pussy. But don’t let inexperience fool you - Ela is a fighter and Bobbi knows it.\nFirst is a warm up orgasm and a right of passage for Ela as Bobbi makes her lick her ass and pussy before showing her how to have a screaming, dripping orgasm on with Bunny Fucker. Ela is nervous but unfazed and cums like a veteran as Bobbi rubs her tiny clit.\nRound two is the speed round - how fast can you take the Intruder MK II - a machine that tops out at 700RMP. Here is where the real competive sides come out between these two babes.\nRound three - Who is the better lay? Each girl must fuck the other while getting fucked themselves. This proves difficult for Ela who starts to enjoy it too much and forgets she needs to get Bobbi off.\nRound four - Sybian Torment. No competition would be complete with out a Sybian challenge - and to up the ante before sitting on the Sybian for as long as they can possibly take it, the girls use suction on their clits to get them super sensitive even to the touch.\nWho wins? Watch and find out.",
  "directors": [],
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    },
    {
      "name": "Cherry Torn",
      "person_id": 11105
    },
    {
      "name": "Ela Darling",
      "person_id": 21149
    }
  ],
  "release_date": "2009-12-16",
  "scene_id": 7697,
  "tags": [
    "Anal",
    "Blonde",
    "Brunette",
    "Machine Dildo",
    "natural boobs",
    "other hair color",
    "shaved",
    "slim",
    "Straight",
    "switch",
    "Sybian",
    "Tattoo",
    "unshaved",
    "Vaginal Penetration",
    "white"
  ],
  "title": "PORN STAR VS. AMATEUR Bobbi Star vs. Ela Darling"
}