{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Maitresse Madeline\nHouseboy: Kade\n\nIt’s graduation day and Kade’s the first slave to survive the intense training of the Divine Bitches to serve the Queen Bee herself Maitresse Madeline. The chemistry between the two is intoxicating. Madeline paddles his ass and makes him fuck his own ass while balancing. She bends him over her knee for some OTK spanking while he’s plugged deep in his hungry asshole. He’s made to fuck Madeline’s pussy with a dildo gag till she orgasms. Kade is put in intense bondage which is visibly strenuous on him but the fact that Madeline is grinding her beautiful ass on his begging cock makes him shoot a well deserved huge load after a day of total denial. Madeline seals his graduation day with a little game of her own sure to keep Kade on his best behavior for the future.\n\nWatch Kade in action serving Maitresse Madeline and The House on Boxing Day at TheUpperFloor.com (Jan 11th update)\n\nMaitresse’s Evaluation\nGoals\n\n\nBDSM literature\nstudy classic and new literature based on BDSM and etiquette\n\n\nserving etiquette\nserve a proper cup of tea\n\n\nsexual service\ncock readiness\n\n\n\nClosing assessment\n\n\nready to serve The House at upcoming party\n\ncock was at it’s hardest and for duration during hard bondage\n\nserving protocol and body alignment much improved\n\ncontinue to research BDSM literature per Mr. Mogul’s request",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Kade",
      "person_id": 12580
    },
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 17872
    }
  ],
  "release_date": "2010-03-10",
  "scene_id": 7763,
  "tags": [
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Corporal Punishment",
    "Dildo",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "OTK",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaved",
    "Slave",
    "slim",
    "Spanking",
    "Straight",
    "Tattoo",
    "top",
    "white"
  ],
  "title": "Training of a Houseboy: Episode 5 \"Kade's Graduation\""
}