{
  "collections": [
    "Device Bondage"
  ],
  "description": "Live Show Mondays brings you the conclusion of the November live show that featured Ashley Jane, Ally Ann, and special guest co-top Princess Donna.\nThe last installment of this November feed starts with a brutal 69 in the cage. Why brutal? The pointy spikes they are made to lay on are not trivial, and cause much discomfort. The both girls are dragged out and while the boys set up the next scene Donna takes Ally, and makes Ashley finger fuck and FIST her friend. Ally is made to have the strongest orgasms of her life as Ally's fist drives deep up her shave cunt and Donna vibrates her clit.\nNow both girls are impaled on a sybian, spread and helpless. We soon discover that Ashely is just done. The 3 hours of non stop live BDSM has paid it's toll and she can not continue. But Ally is ready and willing to go. After the sybian make Ally over and over, we apply a zipper ot her. We instruct Ashely that she is going to pull it and make her freind scream in serious pain. Ashely doesn't want to but a stern look from Donna and Ashely is ready but not willing. The zipper is the brutal end to a very successful live show.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Ally Ann",
      "person_id": 19863
    },
    {
      "name": "Princess Donna Dolore",
      "person_id": 5235
    },
    {
      "name": "Ashley Jane",
      "person_id": 19727
    }
  ],
  "release_date": "2013-12-17",
  "scene_id": 7769,
  "tags": [
    "69 Position",
    "anal fingering",
    "bdsm",
    "big natural tits",
    "blonde",
    "bondage",
    "brunette",
    "cage",
    "choking",
    "clothespins",
    "Corporal Punishment",
    "destruction",
    "domination",
    "dominatrix",
    "extreme torture",
    "femdom",
    "Fingering",
    "Handler",
    "Hitachi",
    "humiliation",
    "leather",
    "lesbian",
    "LezDom",
    "metal bondage",
    "oral sex",
    "pain",
    "pain slut",
    "Pierced Pussy",
    "Rimming",
    "small tits",
    "straight",
    "submission",
    "suspension",
    "sybian",
    "tattoo",
    "Vaginal Fisting",
    "zipper"
  ],
  "title": "Ashley Jane, Ally Ann,Princess Donna "
}