{
  "collections": [
    "Divine Bitches"
  ],
  "description": "\"You shouldn't even be qualified to have a dick\"\nFelony is a gorgeous wife, married to a wormy little bitch of a husband. Felony has a very special Christmas present wrapped under the tree just for him, a CB6000! She wastes no time locking his freedom away in a chastity belt and punishing him for having such an insignificant little cock.\n\"Your dick will never see the light of my pussy. It will never feel the the sweet cream my pussy can make. It will never have the pleasure of even touching my pussy\"\nFelony plugs her pathetic husband in the ass, flogs him and uses her perfect body to tease and rub it all over his chastity belt to make it extremely painful.\n\"I love to hear the sounds of your screams when I sit on your face. It only makes my pussy vibrate more\"\nFelony amuses herself by using a fuck machine on her husbands ass to milk his prostate. He's made to lick her asshole clean before her boyfriend comes over to fuck it. She uses a painful clothes pin zipper across his body just to remind him he will never receive any pleasure.\n\"Your incompetent dick will never please me\"\nFelony locks her husband up in a cage under the stairs while she gets ravenously fucked in her pussy and ass by her boyfriend. Her boyfriend leaves a nice wet load of cum all over her ass.\n\"Merry Christmas Cuckold\"\nDavid is let out of the cage only to be humiliatingly made to sniff the sex and cock out of his wife's pussy.\nThis smoking hot update includes chastity, cuckolding, flogging, prostate milking, ass licking, SPH (small penis humiliation) and so much more!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Felony",
      "person_id": 17502
    },
    {
      "name": "Maestro",
      "person_id": 11928
    },
    {
      "name": "David Chase",
      "person_id": 20106
    }
  ],
  "release_date": "2009-12-23",
  "scene_id": 7777,
  "tags": [
    "BDSM",
    "Bondage",
    "Cage",
    "CBT",
    "Chastity Play",
    "christmas",
    "Corporal Punishment",
    "Cuckolding",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Flogging",
    "holidays",
    "Humiliation",
    "Male Sub",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rimming",
    "Rough Sex",
    "Slave",
    "Smoking",
    "Straight",
    "Zipper"
  ],
  "title": "Cuckold Christmas"
}