{
  "collections": [
    "Divine Bitches"
  ],
  "description": "#mm h3, #mm h4, #mm p, #mm ol, #mm ol li, #mm ul, #mm ul li {\nfont-family:Verdana, Geneva, sans-serif;\ntext-align:left;\n}\n#mm h3, #mm h4 { font-weight:bold; margin-top: 15px; margin-bottom: 5px;}\n#mm p { margin-bottom: 15px; }\n#mm ol, #mm ul { margin-top: 2px; list-style-position: outside; padding-left: 40px; }\n#mm ol li { list-style:decimal; }\nDivine Bitch: Goddess Isis Love\nSlaveboy: Wolf Hudson\nWolf Hudson's genuinely terrified of water. Goddess Isis and him have such a connection (see Febuary 17th update) I put them together again for my own sick amusement on this 3rd day of training. The connection oozes from every scene. The sheer pleasure Isis's gets from Wolf's fear is intoxicating and shows in how horny and wet her pussy gets and she can't help but touch herself! She punishes him throughout the day with heavy weights and clamps over every single sensitive part of his body. She flogs them off one by one yet he still chooses pain over touching the water. Isis doesn't care though he needs to bath his goddess so she sits right on his face in the dunker then squirts all over. Then he's made to fuck her in the tank while chained up. Any breath he takes is because Isis allows him above the water. The under water sex is fucking HOT! Isis's gets hers then makes him blow his filthy slave load underwater. It's the hottest underwater cum shot you'll ever see!\nWolf Hudson is through just over half of his training. Tune in right here to see what Divine Bitch will take him next!\nMaitresse's Evaluation\nGoals\nfears\nface fear of water\nservice\nsexual service in, around and near water with success\nClosing assessment\nrelatively tough submissive considering intensity of fear\nstrong drive to please women\nfaced fear head on but did not fully conquer fear\nwas still able to perform sexual services despite deep fear",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Isis Love",
      "person_id": 6584
    },
    {
      "name": "Wolf Hudson",
      "person_id": 14471
    }
  ],
  "release_date": "2010-04-21",
  "scene_id": 7926,
  "tags": [
    "Athletic",
    "BDSM",
    "big dick",
    "black hair",
    "Bondage",
    "bottom",
    "Brunette",
    "CBT",
    "Corporal Punishment",
    "Curvy",
    "Dominatrix",
    "Facesitting",
    "fake boobs",
    "Femdom",
    "Fingering",
    "foreskin",
    "Humiliation",
    "Latin",
    "Male Sub",
    "mixed",
    "Orgasm Denial",
    "Pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "Slave",
    "Straight",
    "top",
    "unshaved",
    "Weights"
  ],
  "title": "The Adjustment of Wolf Hudson: Episode 3 \"Aquaphobia\""
}