{
  "collections": [
    "Device Bondage"
  ],
  "description": "It been a while since Charlotte Vale dropped in and hung out for a while, so we thought we would make her return special. We pin her against the wall, and with custom metal bondage devices, we hang her out to dry. No feet touching the ground, suspended and utterly helpless.\n\nThen we bring it, starting with some light tickling, but we soon find that simple act brings Charlotte to tears, just the though of being helpless and tickled is to much for Charlotte to process. This girl would do anything not to be tickled and I mean anything.\n\nCharlotte collects herself, so we move on to nipple torment, brutal flogging of the tits and pussy. We assault her helpless body until it is red and beginning to bruise. Then we lock a vibrator on her sensitive clit, jam a huge dildo up her shaved wet cunt, and turn on the power on high. Charlotte is impaled, deep and hard.\n\nCharlotte’s body is amazing, it lets her cum over and over, with no hope of stopping the orgasms. Each gets more powerful, they cum in waves, and soon Charlotte is in subspace. The special place where a person forgets who they are, why they are, all they know are orgasms, and they can do nothing to stop them. At one point it looks like Charlotte passes out, so a hard face slap brings her back, her eyes are empty, and no one is home.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Charlotte Vale",
      "person_id": 16865
    }
  ],
  "release_date": "2009-12-26",
  "scene_id": 8033,
  "tags": [
    "BDSM",
    "Bondage",
    "Brunette",
    "Corporal Punishment",
    "Curvy",
    "Dildo",
    "Domination",
    "Feet",
    "Fingering",
    "Flogging",
    "Handler",
    "Humiliation",
    "Metal Bondage",
    "natural boobs",
    "Nipple Torment",
    "shaved",
    "Straight",
    "Submission",
    "the wall",
    "Tickling",
    "Vibrator",
    "white"
  ],
  "title": "Charlotte Vale Just hanging around, orgasmed into subspace hard!"
}