{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Christian Wilde is Bobbi Starr’s sexy fuck toy. He’s perfect. Beautiful body, amazing hard cock and knows just how to fuck and make her cum. Dylan Deap is Bobbi Starr’s pathetic chastity cuckold slave. He does everything and anything she wishes just to be in her presence (because he knows he will never be good enough to fuck her) even if that means entertaining her random sexual conquests. Dylan is made to orally prepare her pussy to get fucked by Christian. He’s made to watch her ride Christian’s dick to orgasm while being verbally humiliated and locked in chastity. When it’s time for Dylan’s daily punishment, Bobbi invites Christian to come to her basement and watch. How embarrassing for Dylan! Being punished for having a pathetic dick in front of a guy that just fucked his mistress! Bobbi even locks Dylan up in a strategically situated body cage where he’s made to watch Christian fuck Bobbi in the ass. Dylan is locked so close to the action he can smell the sex! Christian cums all over Bobbi’s ass and Dylan is used as the cum cleaner!\n\nThis filthy hot update includes cuckolding at its finest, chastity, spitting, boot worship, oral servitude, cum eating instruction, CBT, paddling, anal sex, humiliation, CFNM and more!!",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    },
    {
      "name": "Christian Wilde",
      "person_id": 21037
    },
    {
      "name": "Dylan Deap",
      "person_id": 21477
    }
  ],
  "release_date": "2010-05-26",
  "scene_id": 8506,
  "tags": [
    "Anal",
    "Athletic",
    "BDSM",
    "big dick",
    "blond",
    "Bondage",
    "Boot",
    "Boot Worship",
    "bottom",
    "brunet",
    "Brunette",
    "Cage",
    "CBT",
    "CFNM",
    "Chastity Play",
    "Corporal Punishment",
    "Cuckolding",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Humiliation",
    "Male Sub",
    "natural boobs",
    "Orgasm Denial",
    "Paddle",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "shaped",
    "Slave",
    "slim",
    "Straight",
    "switch",
    "Tattoo",
    "unshaved",
    "versatile",
    "white"
  ],
  "title": "Chastity Cuckold Slave: \"Smell his cock on my pussy\""
}