{
  "collections": [
    "Everything Butt"
  ],
  "description": "Bobbi and Ariel are our favorite kind of friends: gorgeous, latex-clad, anal-whore friends. The chemistry is mind-blowing as these hot sluts take turns worshiping one another's perfect ass with fingers, shaving, spanking, licking, face-sitting, huge toys, and enema fucking. Ariel's firm, round ass is first, as Bobbi eats her ass, peels off her latex, stuffs her full with a glass toy, spanks her, and smothers her face. Then it's Bobbi's turn to get served, as Ariel tastes her asshole, shaves it, fucks it with a glass dildo, and then plugs it with a huge toy that she taps until Bobbi comes. Like a good friend, Ariel licks up Bobbi's beautiful gaping asshole after orgasm. After all that filthy fun, these ass-whores need to get cleaned up. Bobby uses the shower enema to fill her hot, dripping pussy & ass with water she sprays on Ariel's pretty face. But the cleanest ass award goes to Ariel who takes enema after enema while Bobbi fucks her sexy ass with a strap-on. We've never seen enema-fucking like this before. Not to be missed. Filthy, wet, ass-gaping fun.",
  "directors": [],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Bobbi Starr",
      "person_id": 11290
    }
  ],
  "release_date": "2010-03-16",
  "scene_id": 8526,
  "tags": [
    "Acrylic Plug",
    "Anal",
    "Anal Fingering",
    "Anal Fisting",
    "Anal Stretching",
    "BDSM",
    "Big Ass",
    "Big Tits",
    "Blonde",
    "Bondage",
    "Brunette",
    "buttplug",
    "Dildo",
    "Domination",
    "Dominatrix",
    "Enema",
    "Gaping",
    "Hair Pulling",
    "Hitachi",
    "Latex",
    "Lesbian",
    "LezDom",
    "natural boobs",
    "Prolapse",
    "Rimming",
    "Rope Bondage",
    "shaved",
    "slim",
    "Spanking",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "unshaved",
    "Vaginal Fisting",
    "white"
  ],
  "title": "ASS FUCKING ENEMAS GALORE: Bobbi Starr & Ariel X"
}