{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the the first round of the 2010 Summer Vengeance Tournament! The top 16 wrestlers battle it out in single elimination!\n\nHOLLY HEART\nThe Hit Man\nHT: 5’6\nWT: 145lbs\nSeason record (0-5)\nRanked 10th\n\nKRISSY LYNN\nThe Crippler\nHT: 5’3\nWT: 130lbs\nSeason record (1-2)\nRanked 9th\n\nHolly Heart has one of the most athletic muscular bodies on the roster. She had one of the toughest rookie schedules in the history of Ultimate Surrender. This girl works out daily, but doesn’t train for the mat. So far she has been slow to learn, we are waiting for that one moment when it comes all together and she “gets it”.\n\nKrissy Lynn came to us late in the season and she might be the strongest wrestler we have in the tournament. She showed great promise early, giving up few points to the elite. She showed an early grasp on the techniques need to win.\n\nThis was a great match up against similiar opponents. One had more experience and wanted the win more. One never gave up or in and pushed to the final whistle to get her first Ultimate Surrender win!\n\nThis is single elimination wrestling at its best. The loser gets fucked and goes home. If you lose, your season is over! This was a hard fought match, back and forth. One girl had the size and weight advantage and used it to good effect. This is what Ultimate Surrender is all about! Non-scripted, brutal, real wrestling!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Holly Heart",
      "person_id": 20472
    },
    {
      "name": "Krissy Lynn",
      "person_id": 19730
    }
  ],
  "release_date": "2010-06-25",
  "scene_id": 9170,
  "tags": [
    "Anal",
    "Athletic",
    "Blonde",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "muscular",
    "Pussy Eating",
    "shaved",
    "slim",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "SUMMER VENGEANCE ROUND 1 ACTION Ranked 9TH VS 10TH"
}