{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Goddess Aiden Starr\nBitchboy: Jason Miller\nSlave Jason Miller is one step closer to serving Maitresse Madeline but not one step closer to freedom. His useless piece of meat is still locked away in chastity. He's flogged, spanked and weights hang from his gigantic, boiling over balls. His ass is fucked deep by an enormous strap on cock then his breath taken away by Goddess Aiden Starr's perfect ass mounted right on his face. Maybe she feel sorry for him, who knows, but she actually takes this bitchboy out of chastity to fuck him with the high powered fucksall rubber pussy. Precum oozes from the tip of his dick. But, Goddess Aiden never lets him cum. Instead she soaks his dick and balls in a bucket of ice water. Jason pleads for his freedom while Goddess Aiden laughs hysterically and stuffs his aching prick back in the cage then throws away the key forever!\nSlave Jason is on his way. Will he have what it takes to satisfy Maitresse?\nMaitresse's Evaluation\nGoals\nimprove posture\nmuch improved posture\nquit incessant whining\nwhining went to a dull moan\nendure bondage\nstill lacks flexibility for bondage\nClosing assessment\nremain in chastity\nsuggest stretching techniques for bondage\npain tolerance and processing improving from day one\ndevotion is evident\nsuggest endurance and strength testing next",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "Aiden Starr",
      "person_id": 11489
    },
    {
      "name": "Jason Miller",
      "person_id": 17619
    }
  ],
  "release_date": "2010-07-07",
  "scene_id": 9446,
  "tags": [
    "bdsm",
    "bondage",
    "cage",
    "CBT",
    "Chastity",
    "Corporal Punishment",
    "dominatrix",
    "Face Sitting",
    "femdom",
    "Fingering",
    "humiliation",
    "Male Sub",
    "orgasm denial",
    "pain",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "slave",
    "straight",
    "strap on",
    "weights"
  ],
  "title": "Chastity Tease and Denial: \"Hump the Air Bitchboy\" Episode 3"
}