{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the the second round of the 2010 Summer Vengeance Tournament! The top 16 wrestlers battle it out in single elimination! DARLING\nThe Grappler\nHT: 5'4\nWT: 112lbs\nSeason record (3-0)\nRanked 5thHOLLY HEART\nThe Hit Man\nHT: 5'6\nWT: 140lbs\nSeason record (0-5)\nRanked 10th\nDarling is stronger, faster and more experienced than ever. No surprise she went undefeated this season. Darling is one of the few girls who trains and trains hard off the mat. She made it to the semifinals last year where she suffered an injury and the match was called. This year her health has never been better and she is in the best shape of her life.\nHolly might be the strongest wrestling on the roster. This fitness buff works out 2 hours a day in the gym and is all muscle. Holly has been slow to catch on to the wrestling but shows improvement every match. She won her first match to advance and now faces a seasoned veteran.\nEven though Darling gave up 2 inches and almost 30lbs, her experience and speed won the day. All of Holly's size and strength meant nothing against a brutal veteran who is determined to win the championship!\nHolly was the next girl to face the wrath of a veteran in Rd4. Darling brought the pain and pleasure as she fucked the living hell out of her loser opponent. Holly's ass took a hard fucking from Darling, a fucking she and her ass will not soon forget!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Dee Williams",
      "person_id": 4197
    },
    {
      "name": "Holly Heart",
      "person_id": 20472
    }
  ],
  "release_date": "2010-07-16",
  "scene_id": 9539,
  "tags": [
    "Anal",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "In The Gym",
    "Lesbian",
    "LezDom",
    "Muscle",
    "Pain",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Wrestling"
  ],
  "title": "SUMMER VENGEANCE ROUND 2 ACTION Ranked 5TH VS 10TH"
}