{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the the second round of the 2010 Summer Vengeance Tournament! The top 16 wrestlers battle it out in single elimination!\n\nWENONA\nThe Gymnast\nHT: 5’8\nWT: 120lbs\nSeason record (3-0)\nRanked 6th\n\nMELLANIE\nThe Cow Girl\nHT: 5’9\nWT: 155lbs\nSeason record (2-3)\nRanked 11th\n\nWenona once again gets a first round bye in the tournament. She was undefeated in the regular season with a massive 804 power rating. That means her average win in all matches was by 804pts, that’s huge. Wenona works out close to 3 hours per day, and as of this moment right now, as you read this, she is nearing the peak of Mount Kilimanjaro. This girl is hardcore about fitness.\n\nMellanie is in her rookie season and is doing amazingly well. So few rookies ever make it to the second round of the hardest tournament of it’s kind in the world. Mellanie won her first match up over a young and spunky Tara Lynn Fox.\n\nWenona shows us why she was undefeated this season. Mellanie has no answer for Wenona’s quickness, strength, power and conditioning. Wenona now goes on to face Dia Zerva.\n\nThis is single elimination wrestling at its best. The loser gets fucked and goes home. If you lose, your season is over! This is what Ultimate Surrender is all about! Non-scripted, brutal, real wrestling!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Mellanie Monroe",
      "person_id": 20280
    },
    {
      "name": "Wenona",
      "person_id": 4485
    }
  ],
  "release_date": "2010-07-02",
  "scene_id": 9540,
  "tags": [
    "Anal",
    "Blonde",
    "Brunette",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "MILF",
    "muscular",
    "natural boobs",
    "Pussy Eating",
    "shaved",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "SUMMER VENGEANCE ROUND 2 ACTION Ranked 6TH VS 11TH"
}