{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the the Second round of the 2010 Summer Vengeance Tournament! The top 16 wrestlers battle it out in single elimination! TIA LING\nJade\nHT: 5'1\nWT: 99lbs\nSeason record (3-1)\nRanked 8thTRINA\nPassion\nHT: 5'6\nWT: 149lbs\nSeason record (0-1)\nRanked 16th\nTia Ling is one of the smallest wrestlers on the roster. Tia Ling is also one of the strongest wrestlers on the roster. Tia Ling is one of the best conditioned, tough, scrappy wrestlers we have on the roster. Only 5'1 and 99lbs, this little smoking hot spitfire is no pushover. When you wrestle with her, you're in for a battle.\nTrina Michaels is one of the biggest wrestlers we have; her boobs alone weigh more then Tia. A few weeks back Trina won her first Tournament match and is very confident about squishing the tiny little Tia Ling with her awesome phat booty and huge tits.\nThere's nothing sexier than a small girl totally destroying and dominating a bigger girl on the mat. In this Classic David vs Goliath match, Tia controls it from start to finish, and Trina does not take it well. Great leg scissors, submission holds, and finger fucking on the mat. Trina is just a play thing for the smaller girl to humiliate. Tia doesn't even bother to fuck the pussy in RD4, she goes straight to the ass like the fist of an angry GOD.",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Tia Ling",
      "person_id": 17361
    },
    {
      "name": "Trina Michaels",
      "person_id": 16367
    }
  ],
  "release_date": "2010-07-23",
  "scene_id": 9541,
  "tags": [
    "Anal",
    "Asian",
    "Big Tits",
    "black hair",
    "blond",
    "Blonde",
    "Domination",
    "Facesitting",
    "fake boobs",
    "Fingering",
    "Humiliation",
    "leg scissors",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "shaved",
    "Smoking",
    "Straight",
    "Strap On",
    "Submission",
    "Tattoo",
    "toned",
    "top",
    "tournament",
    "Vaginal Penetration",
    "white",
    "Wrestling"
  ],
  "title": "SUMMER VENGEANCE ROUND 2 ACTION Ranked 8TH VS 16TH"
}