{
  "collections": [
    "Divine Bitches"
  ],
  "description": "Divine Bitch: Mistress Lorelei Lee\nMeat: David Chase\n\nDavid Chase has been locked in a CB6000 for a week. Mistress Lorelei Lee has ZERO sympathy for this horny little fucker. It’s day 2 and if this slave is going to be up to Divine Bitch standards extreme measures must be taken immediately. Slave David thinks Mistress Lorelei is sweet letting him out of chastity but she hits him with the reality of the situation one after another. He’s placed in bondage, flogged, caned, clamped, humiliated, teased and has his balls shocked. His ass is deeply invaded with a gigantic strap-on dick while a cock and ball smashing CBT device is placed on his aching boiling balls. Mistress Lorelei uses her flirty personality to trick David into thinking he’s going to get release. This wicked bitch even goes as far as fucking this slaves cock for her pleasure. Little does he know his new industrial metal chastity belt is chillin behind him on ice. Mistress Lorelei totally denies him and stuffs his aching prick in the ice cold belt then sends him on his way for another week in chastity. This should teach this horny bastard to control his filthy fucking piece of man meat!\n\nTune in next time to day 3 of David’s training and find out how his second week in chastity unfolds!\n\nMaitresse’s Evaluation\nObjectives\n\n\nrestraint\naccept the relinquishment of his manhood\n\n\ndisposition\nproper stance and attitude during punishment\n\n\nhard gags\nwill benefit from extended periods gagged\n\n\nass drills\nexpand ability for anal penetration\n\n\n\nClosing assessment\n\n\nstill having issues giving up control of manhood\n\na bit bratty\n\nmust work on posture, grace and attitude\n\npotential slave is an eager mess\n\nwill remain in chastity",
  "directors": [
    {
      "name": "Maitresse Madeline Marlowe",
      "person_id": 57
    }
  ],
  "models": [
    {
      "name": "David Chase",
      "person_id": 20106
    },
    {
      "name": "Lorelei Lee",
      "person_id": 758
    }
  ],
  "release_date": "2010-08-04",
  "scene_id": 9808,
  "tags": [
    "Anal",
    "BDSM",
    "Blonde",
    "Bondage",
    "bottom",
    "brunet",
    "CBT",
    "Chastity Play",
    "Corporal Punishment",
    "Death Defying CBT",
    "Dominatrix",
    "Facesitting",
    "Femdom",
    "Fingering",
    "Gag",
    "Humiliation",
    "Male Sub",
    "muscular",
    "natural boobs",
    "Orgasm Denial",
    "Pegging",
    "Prostate Stimulation",
    "Pussy Eating",
    "Rough Sex",
    "Slave",
    "Straight",
    "top",
    "white"
  ],
  "title": "Chastity on the Rocks: David Chase Episode 2"
}