{
  "collections": [
    "Ultimate Surrender"
  ],
  "description": "Welcome to the quarter finals of the 2010 Summer Vengeance Tournament! The top 16 wrestlers battle it out in single elimination! DARLING\nThe Grappler\nHT: 5'4\nWT: 112lbs\nSeason record (3-0)\nRanked 5thARIEL X\nThe Assassin\nHT: 5'3\nWT: 115lbs\nSeason record (3-0)\nDarling is stronger, faster and more experienced than ever. No surprise she went undefeated this season. Darling is one of the few girls who trains and trains hard off the mat. She won her first tournament match up and advanced. Darling feels this is her year to go all the way!\nAriel X is last year's Tournament Champion. She has only lost one match since 2006, and last year took revenge on the girl that gave her that loss, beating her easily. Ariel X is the smallest of the top 8 wrestlers and proves that training, skill and endurance can compete with the welterweights.\nThe first four minutes was all Darling, then Ariel's legendary endurance kicked in. As Darling breathing got faster, Ariel's got calmer, more relaxed. Ariel X showed once again why she is the defending Champion. She dominated Darling and had an answer for everything Darling could throw at her. For those who though Dragon was unstoppable, your defending Champ just reminded you she is still in the house, and it's her fucking house!",
  "directors": [
    {
      "name": "Matt Williams",
      "person_id": 51
    }
  ],
  "models": [
    {
      "name": "Ariel X",
      "person_id": 10464
    },
    {
      "name": "Dee Williams",
      "person_id": 4197
    }
  ],
  "release_date": "2010-08-13",
  "scene_id": 9877,
  "tags": [
    "Anal",
    "blond",
    "Champion",
    "Domination",
    "Facesitting",
    "Fingering",
    "Humiliation",
    "Lesbian",
    "LezDom",
    "Pussy Eating",
    "Straight",
    "Strap On",
    "Submission",
    "top",
    "tournament",
    "Vaginal Penetration",
    "Weights",
    "Wrestling"
  ],
  "title": "Last years Champion takes on hot blond with huge tits Dominates her, fingers her and fucks her!"
}