{
  "collections": [
    "ChaosMen"
  ],
  "description": "I knew when I saw Carter that I wanted Elliott to work with him. Unfortunately I could tell Carter might only be down for a blow job, so even though Elliott had been up to bat a lot lately, I didn't want to miss this double red head pairing.\nAnd this is the epitome of straight guy oral Servicing!\nStoic straight boy watching his pussy porn then surrendering to the oral sensations of a pro-cocksucker. Elliott is amazing as he keeps him hard, and I swear, a couple times Carter looks very serious, as if he is about to nut.\nEvery now and then I find guys who can only seem to nut sitting down or laying on their back. Some of them really want to do porn, but in porn, the guy is usually upright when he nuts ON TO something.\nSo I always struggle when a new guy comes along who has to lay down, but wont let someone else cum on them. It makes for a non-interactive cumshot. I'm not fond of the two guys laying side by side and nutting on themselves. Best Friends Vids...sure, but otherwise, there has gotta be at least a trade of DNA on to someone else!\nNow Carter, he is just the opposite. Just like his solo, he wanted to be standing for the cum shot. Which is harder for most guys. So he is ahead in this game.\nBefore the shoot I showed Carter's jack-off technique to Elliott. That way, he would know how to handle Carter's cock. An advantage I always get from filming their solo.\nSo I showed him his milking technique, which Elliott uses at the end.\nIt's kind of hot to watch Carter look at the TV then back at Elliott, then keep warning him he is gonna cum.\nHe just kept tugging-n-tugging-n-tugging on him...till it all spills out!",
  "models": [
    {
      "name": "Carter Olson",
      "person_id": 3327
    },
    {
      "name": "Elliott",
      "person_id": 3256
    }
  ],
  "release_date": "2009-07-29",
  "scene_id": 1000,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Red",
    "Theme - Serviced"
  ],
  "title": "Carter Olson & Elliott - Serviced"
}