{
  "collections": [
    "ChaosMen"
  ],
  "description": "Well \"Kay\" sure made the rounds on the net a couple weeks ago. I had been sitting on his videos for a while, thinking he was working just for me. Well, guess not.\nIf you just stick to my site, then you will enjoy this part Asian kid. If you follow all comings and goings of models in the Blogosphere, you will likely be saying, \"There he is again!\"\nI worked with Kay a while back and he had just recovered from an injury and was getting his body back in shape.\nKay really wants to do porn, and is working on making his body to be the best it can be for you. So it will be kind of cool to see how his body changes over the coming months.\nHe has no illusion of being hung, and has already said he thought he would be a better bottom if he was to do gay porn. He has told me he has got some straight porn acting gigs lined up, but I wonder how much in demand he will be.\nI, on the other hand, am not looking for super hung guys. Kay might be in demand here with the nervous straight guys that might want to try bottoming for their first time with him.\nKay has the, \"Yo Adrian!\" delivery, and he is charming in that Balboa way. So spend a second or two listening to him talk.\nI think I will do a Serviced video and maybe see if he does respond to some oral-on-anal action. Who knows, maybe we have an eager bottom on our hands?(Or maybe we already know that)\nFor today though, I gave him the motivation of filming this video for his girlfriend. He is in a long distance relationship, so the phone talk and video clip exchanges have been quite heated.\nHe's a bit of a talker so his solo scores a verbal bonus as well.",
  "models": [
    {
      "name": "Kay",
      "person_id": 3322
    }
  ],
  "release_date": "2009-08-03",
  "scene_id": 1001,
  "tags": [
    "Theme - Solo",
    "Ethnicity - Asian Guys",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def"
  ],
  "title": "Kay - Solo"
}