{
  "collections": [
    "ChaosMen"
  ],
  "description": "Piotr is a Bi-married guy. His wife is Bi too, so they have fun with other couples. He admits to leaning a bit more towards guys, but seems like an equal opportunity sex jockey. He watched straight video the first day he was here, and then some ChaosMen videos on his second day.\nHe really likes to bottom more than top. When he tops, he likes to be the 'in control' guy and prefers twinks that have a nice bubble-butt. Mostly he bottoms, and he likes all kinds of guys, and for sure loves to give control to the Top. He says he is passive and likes bossy daddy types.\nPiotr also tells me he can take a pretty big dick as he has some large toys at home.\nHis solo is fantastic too! At nearly 30-years-old he has a hot body. He said his dick was 7-inhces, but it sure looked more like 7.5 when he got fully hard. I will have to measure it next time he is in.\nFor the ending, I gave him the little vibrating butt-plug that is so popular with new models. They don't make these anymore if you are looking for them. The bullet vibrating units are pieces of crap though. He tries putting the toy in, but the batteries fly out.\nI snuck them back in, and WOW did the vibration work! He had never tried a vibrating plug before.\nAs usual, these plugs do a great job of making the guys cum quickly. Once he got on his back, he easily shot his load!\nI have another video with him next week with another model, both of them using dildos and double-ended dildos on each other.\nStay-tuned for an awesome cum shot in that video as well!",
  "models": [
    {
      "name": "Piotr Watts",
      "person_id": 10006
    }
  ],
  "release_date": "2020-04-27",
  "scene_id": 10013,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Toys",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Piotr Watts - Solo"
}