{
  "collections": [
    "ChaosMen"
  ],
  "description": "For those of you who love lean guys with big dicks, this video is for you.\nKayden is a skinny boy with a fat cock, and Bailey was just the Twink to take it! Bailey could barely get it down his throat, gagging often, so I was worried when it came time to fuck, he would have a problem. Nope!\nKayden also shows-off his Bossy side in this video. I think since Bailey is so passive, that it just brings out everyone's inner Dom.\nI love watching Kayden try to wedge his cock down Bailey's throat when Bailey has his head over the side of the bed. Poor lucky guy!\nAnd then when it came time to take his dick, all it took was a little rimming from Kayden to make Bailey eager for cock.\nKayden runs his cock up and down the crease of Bailey's ass, and boy, it sure looks like it will fill-him-up!\nBut Bailey only had to grimace and put his head down for a few seconds before he was encouraging Kayden to fuck him harder.\nKayden pulls-out and laid down so Bailey could clean and lube-up his cock. Bailey rides his cock, and it feels like this was Bailey's favorite position.\nNext, Kayden got him on his back, truly a sure-fire way of making Bailey blow his load. Which of course, he did.\nNext Kayden bred his Bottom's boy hole, wedging the last of his load inside of him.\nHe pulls-out and straddles Bailey's face, making him lick the last bit of his own load from his fat dick!",
  "models": [
    {
      "name": "Bailey",
      "person_id": 9929
    },
    {
      "name": "Kayden Frost",
      "person_id": 9978
    }
  ],
  "release_date": "2020-05-11",
  "scene_id": 10024,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bailey & Kayden Frost - RAW"
}