{
  "collections": [
    "ChaosMen"
  ],
  "description": "Asher King said he had been sucked by and fucked a guy before. He also said he was into Latinas, so I wasn't sure if Latin dude would also be a fav, and it turns out it was!\nThe two took it slow, watching a porn video together. Of course, Bentley is hard and ready to go, but Asher was looking very nervous and soft. If you like newbies that grow into full-performers, you need to follow this guy's progress! (Hopefully he will be back!)\nBentley offers to suck his dick and help him get hard. It wasn't soon before Asher was bone-hard and not relying on the pussy porn playing for him. Maybe I should have put gay porn on?\nAfter breaking the ice with a good blow-job, Asher really gets into it, and forgets about the porn playing in the background.\nHe certainly looks like it is his first time sucking a dick, but he looks eager to doing it. I did give a few tips about gagging. To turn his head to the side, breath in through his nose while jerking his buddy's cock. He does this several times at the beginning.\nBut, by the time they are 69-sucking, Asher's gag reflex relaxed and he could enjoy sucking and pleasing his buddy.\nAsher stood-up so Bentley could suck his cock again. Asher ended up jamming Bentley's head against the bed, giving Bentley little room to escape from the face-fucking. Hats-off to Bentley for handling the face-fucking!\nAnother first for Asher was getting his ass eaten. He is kind of young, but my guess is, he will be eager to be rimmed and possibly return the rimming in the future. Fingers-crossed!\nAsher was not ready for a facial. I know that Bentley can time is own cum shot with others. Asher got on his back, and he took a few sneak peeks at the porn playing, then easily busted a tremendous nut. Like a pro, Bentley ramps-up and a few a moment's later, he spews his jizz all over Asher, adding his own load to Asher's already copious ejaculate.\nBentley plays with their cummy cocks, while Asher laid there in a fog, wondering how he ended up getting jizzed on!",
  "models": [
    {
      "name": "Asher King",
      "person_id": 10016
    },
    {
      "name": "Bentley Layne",
      "person_id": 9039
    }
  ],
  "release_date": "2020-05-13",
  "scene_id": 10020,
  "tags": [
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Asher King & Bentley Layne - Serviced"
}