{
  "collections": [
    "ChaosMen"
  ],
  "description": "It still surprises me when the models suggest to me doing these Edge videos.\nTo be honest, after getting my Trilogy done of 3 DVDs, I thought it was time to put the series to rest. Retiring the theme is harder than I thought when adorable 20-year-olds are actually asking to do them.\nI started doing the Edge vids as an easy way for \"newbies\" to get their dick sucked and explore gay sex, if only for a few brief moments!\nCeasar's best friend Clay had done a Serviced video with me, and apparently went on about how good the blow job. So every time Ceasar came down, he jokingly teased me that I hadn't sucked his dick and that would be fine by him. He has also done some fetish work, and thought that the Edge videos were right up his alley.\nI figured we could do one \"sometime\" when I didn't really have someone appropriate to work with him- he was certain he would never bottom. So we kept putting it off, and then I ran out of guys willing to sit on his dick.\nSo we talked about finally doing an Edge video. I thought maybe we could do some cocksucking lessons and maybe he could learn taking a cock wasn't THAT bad. Since I have a \"starter\" cock, I knew he could take it AND have a good experience where he could control the depth.\nSince I am gay, and most of the guys are indeed straight, their dicks tend to get wobbley quick, so slow inserts are challenging. Mine however, can stay hard as he takes his time to work it in.\nThis Edge video basically de-vigininizes 'lil Ceasar. I am not sure he will be bottoming a bunch, but I do know it is no longer in his mind that is an absolute \"No\" to doing it.\nSo I guess in all, the Edge videos are still doing what they need to do. Getting the guys comfortable doing guy-on-guy work!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Ceasar",
      "person_id": 3623
    }
  ],
  "release_date": "2009-07-22",
  "scene_id": 1004,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Edge",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating",
    "Ethnicity - Middle Eastern",
    "Ethnicity - White Guys"
  ],
  "title": "Bryan & Ceasar - Edge"
}