{
  "collections": [
    "ChaosMen"
  ],
  "description": "This was going to be a flip-flop video, but Julian saw how big Daniel's cock was, so he had been practicing at home getting fucked with a toy. He kind of over did it, and even his flight to the studio was uncomfortable.\nDaniel rolled with it and bottomed the whole video, but we both are eager to see him be a Top for a video. He loves to do both positions, but he really wants to show us is Topping skills.\nRegardless, Daniel is a great Bottom, while Julian brought his 'A Game' to fucking.\nThey start with some body worship with some oil, Daniel rubbing his body, and jerking Julian's cock.\nWhen it came time to fuck, Daniel sat on Julian's cock so he could control the depth and speed. But after popping his cherry, Julian really fucked him with high-speed thrusts.\nWe ended with Julian fucking Daniel on his back. Julian creams Daniel's ass first, shoving his load into Daniel. We always try to rush fucking the Bottom if the Top has cum, Just in case the Tops cock goes soft after a big nut.\nSure enough, Julian's cock was just not hard enough to fuck the cum out of Daniel, who honestly could have used a break from the fucking and breeding.\nJulian played with his cummy hole, while Daniel easy blew his load. Julian straddled Daniel's chest and made Daniel lick his cock clean!",
  "models": [
    {
      "name": "Daniel Greene",
      "person_id": 9944
    },
    {
      "name": "Julian Brady",
      "person_id": 9960
    }
  ],
  "release_date": "2020-06-12",
  "scene_id": 10040,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Sex Act - ATM Ass To Mouth"
  ],
  "title": "Daniel Greene & Julian Brady - RAW"
}