{
  "collections": [
    "ChaosMen"
  ],
  "description": "Introducing a new series called \"Juiced\"\nI did a DVD with that title a long time ago, and it was really hard to put together, I never attempted it again. But these videos have a value to me.\nFor some of the gay guys, if they need a little inspiration to cum, I sometimes play cumpilations for them to get them to spill their own loads.\nBasically, Juiced is ChaosMen's version of a CUMpilation. All cum shots!\nIn this first volume of the Juiced videos, I gathered up some of the best Serviced video cum shots.\nI think in all but one of these clips, the guy being serviced is made to cum with no help at all. It is one of my favorite things to do to a guy, and one reason I did so many Serviced themed videos.\nThough, it is a hard trick to do consistently, but many models doing the Servicing, really got quite good. I think I have the best ratio of making the guys cum, followed by other persistent models like Ransom, Lorenzo, Griffin Barrows, and Shiloh. We are all bound and determined to make our guys nut!\nOften the Serviced videos are only a model's second time, and they can feel a lot of pressure to perform, so making them nut by your own hand is a challenge and a thrill.\nThe one clip that did sneak in that isn't technically in this theme is \"Apollo & Glenn.\" I just love this cum shot because Apollo coats Glenn's face, and moments later Glenn lays back and unloads too.\nOf course, many Serviced videos end with a facial, so I am sure I will have a cumpilations of the best ChaosMen facials, along with breeding or RAW videos, G:Hole, Pure, TagTeam, etc.\nSo, watch this one, and see who you can time your own load with!",
  "models": [],
  "release_date": "2020-06-10",
  "scene_id": 10056,
  "tags": [
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - African American",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos",
    "Theme - Juiced"
  ],
  "title": "Serviced CUMpilaton Vol. 001 - Juiced"
}