{
  "collections": [
    "ChaosMen"
  ],
  "description": "Along with his Kevin's girlfriend, Kevin Texas and Lorenzo all became friends. They have gone out a couple times after Kevin visited Austin. Kevin's girlfriend usually comes with him for shoots, and this time she hung out outside the studio watching the action.\nThey both have been indicating they would like to try doing a full sex-scene together. I rarely pair guys again, but they obviously have some chemistry outside of the studio.\nAnd on Top of that, literally, Kevin was down with Lorenzo topping him. Kevin has somewhat bottomed with Wright, and he has bottomed in the past, but he is such a strong Top and I am always a little bottom heavy, that I haven't been pushing for versatility.\nNot sure if we caught it on film, but while Lorenzo was fucking Kevin, he turned to look at his girlfriend and jokingly sticks out his tongue.\nDespite the audience, with the security of the porn studio, both guys really got into each other.\nAnd when it came time for Kevin to bottom, he took it like a champ! Lorenzo started-off slow, but once he realized Kevin was starting to enjoy it, he ramped up his speed.\nI was tempted to see if Kevin could cum that way, but Lorenzo indicated he would cum almost instantly with Kevin fucking him.\nAnd sure enough, he spilled a massive load while Kevin rammed his hole.\nFinally, after years, Kevin bred Lorenzo's hole!",
  "models": [
    {
      "name": "Kevin Texas",
      "person_id": 9599
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2020-07-31",
  "scene_id": 10101,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Kevin Texas & Lorenzo - RAW"
}