{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video goes to the top of the list of best videos.\nNew members of Team Chaos, Devin & Gavin. go at it fast and furious, complete with dirty talking!\nGavin prefers to top in his daily sex, so he was a bit nervous taking on Devin's slinky sized cock.\nGavin must give great head, cuz he worked Devin's cock from soft to hard, and had him telling him to, \"Suck that dick!\" under his breath. Asking Gavin if he wants him to fuck him with his fat cock. Hot!\nDevin starts off slowly inserting over and over, trying to ease Gavin into his long rope of a dick, but after that, the words, \"No Mercy\" come to mind.\nSince Devin has such a downward angle on his dick, I figured we could do an upside down fuck scene. It's very hot as you see Devin dip his bare cock into Gavin's hole.\nThe cumshot is a little crazy. Devin had a lot of lube and pre-cum dripping and Gavin thought Davin was busting, so he bust a little before him, but thankfully this allowed me to get both cumshots.\nAnd when I say Devin has a rope of a dick, he also spews ropes of cum, all over Gavin's face and body. He scoops up the cum and drips it into Gavin's mouth, then tells him to suck the rest of the cum out of his long dangling cock.\nI know this is a great video, because I bonered up when I was editing it!",
  "models": [
    {
      "name": "Devin",
      "person_id": 3314
    },
    {
      "name": "Gavin Walters",
      "person_id": 3321
    }
  ],
  "release_date": "2009-08-14",
  "scene_id": 1011,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW"
  ],
  "title": "Devin & Gavin Walters - RAW"
}