{
  "collections": [
    "ChaosMen"
  ],
  "description": "I don't know if Julian has decided which he likes better, topping or bottoming.\nOn one hand, he likes to be bossy and loves fucking ass. But when it comes to bottoming, he is usually a bit skittish to start with, but once his cherry is re-popped, he just gets lost in the sensation.\nTony begins by sucking his cock and things were going well. Neither guy is very experienced at sucking cock, yet! But they give it their all.\nBut once Julian started sucking on Tony's cock, I could sense he was becoming worried about how big Tony's dick was. To be honest, I kind of forgot that Tony has nearly 8-inches of thick cock. It just looked BIG on this day.\nAfter swapping head, Julian got doggie-style and Tony puts his cock in. Julian winces as he gets penetrated, but buckles down and takes it. As he gets fucked, you can see his body language change from pain to pleasure.\nAfter that, I suggested that Julian ride Tony's cock, so he could monitor the depth and speed. That really helped a lot, and by the time Julian was on his back, he was eager to cum. He shoots his load easily with just the right speed and angle.\nTony blows a long load, first coating Julian's cock, and then with cum still leaking out, he breeds Julian's hole. Tony left a nice cummy butt hole, with his jizz even dripping down the bedspread!",
  "models": [
    {
      "name": "Julian Brady",
      "person_id": 9960
    },
    {
      "name": "Tony Romero",
      "person_id": 9989
    }
  ],
  "release_date": "2020-08-14",
  "scene_id": 10127,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Julian Brady & Tony Romero - RAW"
}