{
  "collections": [
    "ChaosMen"
  ],
  "description": "These two got along quickly before the shoot. They both were cracking each other up while I was hunting down some porn that they both might like. But once I yelled, \"Action!\" they shifted gears immediately.\nI told them to just go with it, and whomever got their cock hard first got their dick sucked first. This inspired giggles from the two, as they realized it was now a competition.\nOf course, Bailey gets hard first. He a lot more relaxed on set these days, so Landon slid down and began sucking on his cock. He is an excellent cocksucker, who paid attention to Bailey's foreskin.\nBailey returned the favor and got Landon's dick standing at attention.\nThey then 69 suck, followed by doing one of Landon's favorite things, eating ass.\nThey end with Landon on his back, sucking on Bailey's dick and balls while he stood over him. He ramped up his jerking and shot an even better load than the day before during his solo. It took him a bit of time, leaving Bailey edging his own cock, always about to blow his load.\nBailey literally shot his load seconds after Landon, and I barely got time to catch it on my close-up camera as I was doing a nice leisurely pan up Landon's cum-soaked body, when Bailey cums on Landon's face!\nThis was a great pairing, and good sign that Landon is ready to take on some more dick!",
  "models": [
    {
      "name": "Bailey",
      "person_id": 9929
    },
    {
      "name": "Landon Pierce",
      "person_id": 10132
    }
  ],
  "release_date": "2020-09-09",
  "scene_id": 10137,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Bailey & Landon Pierce - Serviced"
}