{
  "collections": [
    "ChaosMen"
  ],
  "description": "Shawn has done some straight and gay studio work before. It doesn't sound like a lot of experience with guys. He definitely identifies as straight, but I think he is down to try new things.\nHe is also another guy with 'presence'. Beautiful blue eyes, and bulging muscles, and confidence. You will definitely notice when he walks into a room.\nShawn also is bulging in other places. He is rocking an 8-inch cock that is a show'r AND grow'r. He has a downward curve that hangs very long while soft. It is hard to tell when he is hard, though, it does get much thicker!\nHe told me it takes him a while to cum, but I put on some videos for him that seem to be model favorites, and he certainly didn't have any trouble getting hard for the photos.\nDuring the video, he did get a little nervous while watching the video and checking himself out on the monitors. He winds his cock up to hard mode, and when he gets up on his knees and swings his club around, I was shocked to see how big it had become.\nHe of course is a total package with a nice ass to go with his amazing body. I can't tell if I would rather see him bottom with his great ass, or fuck a dude with his thick cock.\nI set the TV up for him to watch for his cum shot, and I was worried given what he had said, that it would take him a bit of time to cum. Especially since I had told him to get comfortable to cum and he ended up halfway propped up on his left elbow. It just didn't look too comfortable to me.\nBut sure enough, he cums very quickly but quietly. A huge glob of cum shoots out and the rest makes a nice sticky mess!\nThere is moment at the end where he looks up at the camera and smiles, and it will capture your heart!",
  "models": [
    {
      "name": "Shawn Westin",
      "person_id": 10158
    }
  ],
  "release_date": "2020-09-14",
  "scene_id": 10160,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Shaved",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Shawn Westin - Solo"
}