{
  "collections": [
    "ChaosMen"
  ],
  "description": "Although Shawn Westin has interacted with guys both on and off the set, he really was ready to kick back and get a good blow-job. I recently released some compilation videos of guys being sucked and jerked until they are made to cum. I was hoping to add some more of these to add to the collection.\nOf course, Ransom is a pro, so I had him in to really make a couple guys cum, and this one was a total success.\nShawn has this downward curve, and when you suck and push down on it, it looks like it isn't very hard. His dick seems to be all the way outside of body, with no foundation to lock it into place. One of the reasons it is so big is so much is completely outside that he can easily fuck in any position, but with some sucking pressure, it looks like it goes back up into his body.\nJust know his cock was very hard on this and you will go back and forth on deciding his cock size. When Ransom sucks down on it, it bends back in, and then when he pulls on it, you see how his cock is easily over 8-inches thick.\nAnd Ransom fell a little bit in love with Shawn. He loved his attitude, eyes, body, his cock, and even rimming him he was hungry for his hole.\nI thought for sure Shawn would just sit and watch the porn playing for him, but he REALLY got interested in what Ransom was doing since it felt so good and kept an eye on the techniques Ransom was doing on him.\nHe mentioned the ladies can't make him cum, so the gauntlet was thrown and Ransom was bound and determined to make him cum.\nRansom ramps up his jerking technique, working up a sweat, while Shawn fixates on the porn playing for him.\nShawn is very quiet, so I think both Ransom and I were surprised when he started to cum. It took Ransom about 5 minutes to make him cum, and Shawn was shocked at how much strength Ransom put into it. He complained the women he is with are just too gentle and have long fingernails that get in the way and jab his thick cock. Score 1 for big biceps!\nAfter the shoot, Ransom gave him a car tour of Austin before taking him to the airport. I think Ransom was hoping to convince Shawn to move here, or at the very least come back so he could see his new crush again.\nRansom rarely gets crushes on the guys he works with, but Shawn has such a great body and energy, that despite this being 'just a blow job video' there is quite a lot of passion and effort to pleasing Shawn.",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Shawn Westin",
      "person_id": 10158
    }
  ],
  "release_date": "2020-09-23",
  "scene_id": 10162,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Shaved",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Ransom & Shawn Westin - Serviced"
}