{
  "collections": [
    "ChaosMen"
  ],
  "description": "There is so much chemistry in this video, I found the video time and file size growing larger and larger. So many hot moments I couldn't bring myself to trim it down!\nBoth these guys are versatile, but with Mitch having a bit of a daddy-vibe, I had him take control. Landon loves a bossy top, so they were really in their groove this day.\nMitch begins by a quick rubdown, but it quickly turned into a bit of an ass-worshipping session. Mitch began by rimming him and paying extra attention to his hole. He flips him over and starts working on his cock until Landon is hard.\nThen Mitch straddles his chest and makes Landon suck his cock. They then 69-suck, but I think Mitch was obsessed with Landon's ass, giving it even more rimming action.\nMitch was worried Landon might struggle to take his cock, so he fingered his hole first and then ever so slowly slid it in until Landon was ready for some pounding. This kid can really take a dick!\nNext, Mitch fucks him on his back and strokes his boy's cock. He really goes deep inside of Landon, trapping his legs with his shoulders and going balls deep.\nDuring the last video, Landon said that riding a cock was when he felt like most cumming. So, he straddles Mitch's cock and really grinds on it from every angle.\nLandon finally finds just the right position, and easily busts a load all over Mitch's stomach.\nMitch flips Landon over and starts fixating on Landon's freshly-fucked, stroking his cock until he drops a load on his hole. He shoves the load in with his cock.\nAfter breeding his hole, Mitch licks up the cum and shares a hot kiss with Landon.",
  "models": [
    {
      "name": "Landon Pierce",
      "person_id": 10132
    },
    {
      "name": "Mitch Matthews",
      "person_id": 9998
    }
  ],
  "release_date": "2020-10-30",
  "scene_id": 10164,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Landon Pierce & Mitch Matthews - RAW"
}