{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jake Ducati was way into Ransom's daddy-vibe. They actually start with some passionate kissing.\nI suspect normally that Jake takes the lead during sex. But he relied on Ransom's pro skills and followed his lead at the beginning of the video.\nJake mentioned he loved getting rimmed, so we actually started from there. Ransom gets him on his back, sucks his cock for a bit, then dives into showcasing and rimming his tight boy hole. Jake jerks on his own cock, and sure enough, he got rock solid.\nThen Ransom really focused on sucking his cock, and a couple times I thought for sure Jake was going to cum. A very good sign!\nJake finally gets more confidence to take charge, and rolls Ransom on his back and starts sucking him until he is hard and squirming around in pleasure.\nHe also rims Ransom eternal bubble-butt. Jake then slides under and Ransom fucks his face while Jake continues to stroke his own cock. This led to some great 69 sucking.\nWe took some photos, and I asked Jake if he thought Ransom could make him cum. He didn't seem very positive about it. He focuses very heavily on his head, but I knew Ransom could duplicate Jake's technique.\nI told him lets just try for 5-7 minutes and see if Ransom could pull a load for him.\nAt first, he is a bit nervous, but then kicks back and gets lost in the sensations. Ransom keeps at it, varying his speed and pressure. You can tell he is bound and determined to make this guy cum!\nSure enough, Ransom makes him cum!\nBonus points to Ransom for crawling over on top of Jake, and quickly giving him a facial for a perfect finale!",
  "models": [
    {
      "name": "Jake Ducati",
      "person_id": 10165
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2020-10-07",
  "scene_id": 10176,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jake Ducati & Ransom - Serviced"
}