{
  "collections": [
    "ChaosMen"
  ],
  "description": "I actually asked three models if they wanted to take on Jake Ducati's thick dick, and two of them humbly said it might be a bit too much. Of course, they were verse guys who could bottom in a pinch, but Aiden Asher replied right away that he was more than willing to take on Jake's cock.\nI also felt like I got lucky, because these two were complimenting and flirting with each other before they got on set. Always good sign!\nAiden was walking around the set before hand, with dildo in ass, not wanting to fail on the first try. Well, his trick worked. After some mutual cock sucking, Jake slid his dick slowly into Aiden. Occasionally, the guy bottoming will tap-out for a break, but Aiden was really loving being filled with Jake's cock.\nIn other words, this was a perfect pairing that I wasn't too sure would work, but so glad my worries were allayed.\nThere were a couple times Aiden lost his hard on, but he was fighting not cumming. Every time he would jerk his own cock, he had to stop.\nThis always makes me happy, because I know I will have at least one guy ready to bust.\nTurned out both guys were ready to nut by the end of the video.\nJake fucked the cum out of Aiden, who shot a ton of cum! Jake then easily bred his hole, then made Aiden clean his cock. Culminating with a passionate kiss!",
  "models": [
    {
      "name": "Aiden Asher",
      "person_id": 9826
    },
    {
      "name": "Jake Ducati",
      "person_id": 10165
    }
  ],
  "release_date": "2020-11-13",
  "scene_id": 10205,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Aiden Asher & Jake Ducati - RAW"
}