{
  "collections": [
    "ChaosMen"
  ],
  "description": "This was my first-time seeing Jay Tee in action and I wasn't disappointed. He is a fantastic Top!\nAlso, Maverick has been MIA for a bit, but he is back with longer hair, perhaps pandemic hair? And he was eager to get fucked.\nFirst thing to do was suck on Jay Tee's cock. There is a bit cock-worship by Maverick and he deep throats Jay Tee's cock like a pro.\nJay Tee returned the favor and then they ended up 69 sucking. Maverick would lose his boner but as soon as Jay Tee stuck his cock in his mouth, it poped right back to hard.\nIt had been a while since Maverick was last fucked, so Jay Tee took it nice a slow. Once inside, Jay Tee increased the motion, Maverick letting out some pleased groans.\nNext, Maverick rode him. Not Jay Tee's favorite position as his cock kept popping out, but hey, we get to see him slide his cock back in Maverick's hole.\nThey ended with Maverick on his back, which is his favorite position. He was a little anxious as he said he doesn't cum often while being fucked. I told him to coach Jay Tee in the perfect motion to stimulate his prostate, and WOW! Maverick busted a huge load that looks great on his tan skin!\nJay Tee then lifted Maverick's ass so it was before him like a platter. He jerks his cock till he unloads all over his hole. He lowers Maverick down and fucks the cum into him!",
  "models": [
    {
      "name": "Jay Tee",
      "person_id": 10145
    },
    {
      "name": "Maverick Magnussen",
      "person_id": 9695
    }
  ],
  "release_date": "2020-11-20",
  "scene_id": 10215,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jay Tee & Maverick Magnussen - RAW"
}