{
  "collections": [
    "ChaosMen"
  ],
  "description": "Boris is kind of a small-framed guy. I was worried that Jake's cock might be a bit too much for him. Boris would text me and say it might too much. So, I added third guy to line-up, trying real hard to get TagTeam going to give Boris a little break.\nI setup about 6-8 TagTeam videos a year, and they are cursed. Someone misses a flight or something comes up, and I quickly get down to two. I think from now on I need to setup a 4-way just to get a 3-way!\nSure enough, the third guy couldn't make it. So, I was concerned that Boris might have to contend with an extra thick cock.\nBut he was a trooper, and we started with him slowly inserting Jake's cock while sitting on it. It was indeed a challenge, but Boris got it in all the way, and seemed like he had just conquered Mt. Everest. Jake also started-off slow, and soon we had Boris opened-up for some proper fucking.\nMy anxiety finally went down, and Boris was really getting in to it, though occasionally Jake went a bit deep on him and would bounce away.\nJake did a fantastic job, listening to his buddy, and making sure his pain turned in to pleasure.\nOne thing was for sure, there was no way Boris thought he could cum while being fucked at the end.\nJake breeds him, and then instead of fucking the cum out of him, he brought his cum-soaked cock up to Boris's mouth, and had him clean his cock. Boris latched onto Jake's cock like a lifeline.\nThis REALLY turned Boris on, and he immediately busted his own nut. Honestly, I think this kind of what Boris likes. A good fucking to get his prostate tingling, and then to worship with his mouth the cock that was just fucking him.\nAnyway, that is the back story on this video. I am proud of both guys respecting each other's limits and still making an amazingly hot video!",
  "models": [
    {
      "name": "Boris",
      "person_id": 9908
    },
    {
      "name": "Jake Ducati",
      "person_id": 10165
    }
  ],
  "release_date": "2020-12-18",
  "scene_id": 10236,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Boris & Jake Ducati - RAW"
}