{
  "collections": [
    "ChaosMen"
  ],
  "description": "Silas referred a model to me recently (Jake Ducati) and mentioned he himself was still in great shape. Now at 37, he wanted to do another video, and I think he looks fantastic!\nI also got a blast from the past when Jake Hart, out of the blue, said he would be willing to come in and do a full shoot. Though it has only been a couple years since we last saw Jake, I thought this would be a good 'flashback' pairing.\nHis limits were still fairly narrow, but I knew Silas would not mind. He just wanted a good prostate massage. I was eager to see this tatted-boy's long dick in action again.\nAnd with Jake's extra-long, nearly 9-inch cock, I was a little worried for Silas. But he took one look at Jake's dick and said as long as he didn't go deep, he could easily handle it. Girth was more of a concern for Silas.\nSilas sucked his cock and rimmed him. Jake was a little wobbly, so he took a few peeks at the porn playing for him. When Silas rimmed him, he got extra hard.\nJake commented fucking Silas would be easy. Silas is shaved but is also naturally hairless. Jake kept looking down imagining it was a girls' ass. He also got-off on dominating Silas, who took his cock whimpering here and there when Jake would go balls-deep on him.\nJake came first, blasting his load on and into Silas.\nSilas only needed a few moments to ramp-up to cum, and he shot his load soon after, Jake still recovering.\nIt was great seeing Silas again, so I hope you enjoy seeing both these guys in action once again!",
  "models": [
    {
      "name": "Jake Hart",
      "person_id": 9167
    },
    {
      "name": "Silas",
      "person_id": 3229
    }
  ],
  "release_date": "2020-12-25",
  "scene_id": 10238,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jake Hart & Silas - RAW"
}