{
  "collections": [
    "ChaosMen"
  ],
  "description": "My friend who referred Novak to me, kinda kept Novak thinking about doing more. So thanks to my friend who kept Novak informed and interested.\nI think he sold Novak on doing more when he mentioned the Edge videos. I have said before that the guys all think the concept is kind of hot, but they seem to miss one important detail...the dreaded fantasy sequences where we try to push the model's limits.\nThese videos have always been great at slowing showing the guys they can do more, and Novak was the perfect candidate.\nNovak and I talked in detail about the shoot and he was a little surprised to find out that it just wasn't sitting in a chair getting a blow job. So I felt like I wouldn't be able to push it too far. In fact I thought it might just be a re-run of his Serviced video.\nBUT, he told me that he was thinking of doing more anyway. His car repairs just kept mounting and he was liking the added income.\nSo we pushed his boundaries a little bit AND he was definitely not as stoic as he was. The boy talks!\nAnd I gotta say, I LOVE making these guys cum. He kept talking to me, letting me know what was working, encouraging me with lots of breathing. I should be tired of making guys nut by now, but it's just amazing and satisfying to be able to make them cum. (Yes I have control issues!)\nI hope you guys feel like you are the ones doing the blow job, and a making jock straight boy lose his nut!\nOnce again, doing an Edge video did the trick. As he was leaving he was saying to me, \"Alright sign me up for full on sex!\"\nSweet!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Novak",
      "person_id": 3324
    }
  ],
  "release_date": "2009-09-09",
  "scene_id": 1024,
  "tags": [
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Novak - Edge"
}