{
  "collections": [
    "ChaosMen"
  ],
  "description": "I knew Shaun was not going to be an easy guy to make nut. He is a fast jerker, and he pretty much stays just below his cockhead. At a blistering pace no less!\nThe next day after his solo, he was ready to do the Serviced video, his dick a bit worse for the wear from the previous day's session. But he wanted to give it a try.\nI put on same gay porn again, but he barely looked at it. I think actually straight porn would have done him just fine.\nHis body language is great as he starts off with his arms crossed a bit defiantly, then slowly succumbs to the feeling, then becomes an active participant.\nWe did some rimming and I did rub my hard dick against him to see if things might get a bit out of control.\nI got him upright and to blow him at the edge of the bed. He seems to like that 'on his knees' position in order to cum. He did it for his ending position during his solo.\nHe was slowly getting hard and was looking a lot at the TV. Finally I just decided maybe if he had a cock in his mouth he could get off faster.\nSo this video has me with my dick out again (sorry!) but it is fascinating to see him suckle on it and you can tell he is totally using it to get off. So maybe the gay porn was the right choice.\nI was doing a lot of dirty talk, hoping that would put him over the edge, and was getting a little close, despite he wasn't really sucking... just kind of mouthing my dick.\nWe both pulled back a bit, and as soon as he was close he put my dick right back in his mouth so he could enjoy it. You can tell it totally put him over the top.\nBUT then, he just shuts down. I go ahead and try to play catch up and bust a nut, but his energy for the experience is clearly gone, so I wonder if a wave of guilt washed over him.\nAnyone remember those days?\nOn top of that, his legs had been trapped under him while he sucked on me, and he was cramping up. I didn't really even get time to do some aftermath shots as his legs REALLY needed to get out of that position.\nIt's a cool video. Not nearly nutty as the Lansing vid, but it does have that 'something' that makes this an extra special Serviced video.\nNot sure where Shaun is in his sexuality, but I think he is willing to do more, and perhaps this is a safe outlet. He will for sure be back for 'more!'",
  "models": [
    {
      "name": "Shaun",
      "person_id": 3333
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2009-09-16",
  "scene_id": 1026,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Shaun - Serviced"
}