{
  "collections": [
    "ChaosMen"
  ],
  "description": "I don't do very many TagTeams, mainly because they cost more, and I really don't make more on them. So if you love more than two guys, tell your friends and get them to join, 'cuz I like shooting them, but dang they get expensive.\nEconomics aside, I thought I would just toss three of my veteran guys onto a bed and they would just go for it. Didn't really happen that way.\nInstead, all of them, even nutty Zane, seemed a lot more reserved. The video starts off a little awkward, but it does start to really ramp up during the sucking and fucking.\nI had A LOT of footage and it was tough piecing it together AND keep the video to a downloadable size. Anytime a movie creeps up to the 25 minute mark, I know I will have members complaining about download speeds. There are some fast cuts and fades as I tried to edit this video down to a tolerable size, so forgive me if it seems a bit jumpy.\nI thought for sure Zane would be the instigator, but Davin was the talker and he generally kept things going.\nDyson actually busts up inside Zane, and just like real life, there is just not much to show for it. I really tried to talk Zane into spreading his ass and squeezing the last drop out kind of thing, but I think I need to show them how it's down for them to get it right. Thrust, thrust, thrust, pull out, squirt once, shove back in! But it' the real deal.\nWhat's not real is Dyson swore he could stay hard after cumming. He can with a girl after all. But can you really blame him?\nSo we did give him some time to reset and he continued to fuck Zane for a few. Zane loves to get fucked while he cums. Well, Dyson was spent. Somewhere along the way he plops out but keeps on thrusting, and thankfully Zane nuts in no time. I think Davin's giant cock in his face did the trick this time out.\nAnd Davin! Talk about good timing! Zane barely catches his breath from nutting and is still in recovery mode when Davin cums all over his face.\nIt's dang hard to get these guys to cum near or at the same time and 3-ways are even more challenging. But each guy was able to cum in their favorite position(fucking, fucked, facial!), so not a bad ending to a crazy TagTeam!",
  "models": [
    {
      "name": "Dyson",
      "person_id": 3259
    },
    {
      "name": "Zane",
      "person_id": 3306
    }
  ],
  "release_date": "2009-09-18",
  "scene_id": 1027,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Self Suck or Self Facial",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Davin & Dyson & Zane - TagTeam RAW"
}