{
  "collections": [
    "ChaosMen"
  ],
  "description": "We are working on pushing Devin's limits. Still haven't got him to touch/taste cock, but I am working on it. I think Elliott has that certain steamy \"something\" that you can't help but respond to. He moves like a cat, toying with his prey.\nI knew from his Serviced video that Devin enjoyed having his ass rimmed. So I started him face down in his tighty whiteys. What is cool is with his downward slope of a dick, it is just sitting in almost full view, giving Elliott ample opportunity to taste his ass and suck his cock like a sample platter. Both boys got hard real quick!\nYou might also want to look at Elliott's cock. It is a true meter of how hot things were and weren't. When Devin truly gets excited, up goes Elliott's cock...or when he knows he is pushing Devin's boundaries...up goes his cock!\nAnd today's boundary was kissing. One of the hardest things for straight guys to get past. The video is a little long, as Elliott kept coming up to kiss, then moved away, toying with him...all this build up to a simple but erotic kiss.\nFinally Devin surrenders, and it is pretty hot to watch a kiss become so much more. AND his dick didn't wilt either!\nDevin has got skills when it comes to fucking, and with his rope-like length of a cock, you can see him diving in and out with long quick strokes. Poor 'lil Elliott was walking funny the rest of the day. Even though he didn't stay hard for the fucking, he LOVED every minute of it. I need to get him in to Top...he is really good at too!\nOnce again we took advantage of Devin's cascading angle, and he gave Elliott a very hot facial, which only moments later made Elliott nut, cum all over his face.\nShowman that they both are, Devin withstands some ticklish after-cumming cock sucking, telling Elliott to \"Suck all the cum out of there.\"\nFrankly, I think he likes the idea of someone eating his cum. He has a dirty streak that I hope we are only beginning to tap.\nThis is Premium Blend boys!",
  "models": [
    {
      "name": "Devin",
      "person_id": 3314
    },
    {
      "name": "Elliott",
      "person_id": 3256
    }
  ],
  "release_date": "2009-09-25",
  "scene_id": 1028,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Facial  Cum Eating",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW"
  ],
  "title": "Devin & Elliott - RAW"
}