{
  "collections": [
    "ChaosMen"
  ],
  "description": "After the briefest of getting fucked during his Edge video, Ceasar decided he could bottom. I knew from my experience with him, he really couldn't take much thrusting action.\nGrant was eager to top a dude, but I wanted to have Ceasar try one position bottoming near the end of the video, while Grant did the initial bottoming.\nCeasar is improving a bit on his cock sucking skills, but just barely. He DID however keep sleepy-eyed Grant hard.\nGrant finally perked up after sucking Ceasar's dick, and then his dick perked up even more as he sat on his cock.\nGrant eventually road him reverse cowboy style, and though it is a bit hard to see, Ceasar is literally balls deep inside of Grant.\nThen it was Ceasar's turn to get fucked. Grant tried to go slow and easy, but Ceasar was yelling and screaming out in pain most of the time. If you dig 'anal pounding', this portion will turn you on. If you aren't so inclined, then you might cringe during this portion.\nI was hoping maybe Ceasar would learn to get fucked on on his back and nut, but that was obviously not going to happen.\nCeasar was so glad for the fucking to end that he agreed to a facial, which actually seemed to turn him on. Goopy handed Grant, spooged all over Ceasar's chin, neck and cheeks. No cum in the mouth, but Ceasar does suck a few remaining drops out of Grant's cock!",
  "models": [
    {
      "name": "Ceasar",
      "person_id": 3623
    },
    {
      "name": "Grant",
      "person_id": 3334
    }
  ],
  "release_date": "2009-09-30",
  "scene_id": 1033,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating",
    "Ethnicity - Middle Eastern",
    "Theme - Wrapped"
  ],
  "title": "Ceasar & Grant - Wrapped"
}