{
  "collections": [
    "ChaosMen"
  ],
  "description": "I knew I wanted to personally do Hagan's Serviced video, just based on the fact I knew I could nail his jack-off technique. Ok, the fact that he is super hot also came into play in the decision!\nHagan is a pretty quiet guy to begin with, so I wasn't expecting him to writhe around in ecstasy. He seems very contained and almost uncomfortable.\nWhat you don't see is him actually trying to not bust most of the time. He's trying to think of not cumming and a couple times I ease up seeing his balls go up. Danger! Premature firing!\nHe said he liked having his balls sucked during his solo. This is something I hardly ever do, because it is so hard to play the right note when doing that. I can't tell if I am tickling him, or if he is enjoying it.\nHagan did struggle with the ass eating, and I was for sure tickling him with my whiskers. I finally just tried to showcase his ass, but geez, the kid was jumpy. You'd think I had a 10 inch dildo in my hand poised at his butt hole!\nSo I flipped him back over and got myself more inline with his jack-off technique and wow, it was really hard to NOT have him bust.\nFinally after the last, \"Whoa, too close.\" I told him let's just go for it.\nIt's hot to finally hear him say something and that was \"Eat it.\"\nNow that was motivation to make him cum!\nLeft a little outtake at the end so you can see how he switched gears from being so serious to relaxed.",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Hagan",
      "person_id": 3341
    }
  ],
  "release_date": "2009-10-21",
  "scene_id": 1043,
  "tags": [
    "Ethnicity - Mixed Heritage",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Build - Mature",
    "Sex Act - Facial  Cum Eating",
    "Ethnicity - African American"
  ],
  "title": "Bryan & Hagan - Serviced"
}