{
  "collections": [
    "ChaosMen"
  ],
  "description": "Nash was in town for a week to shoot a couple videos, and do a bar event with some other models.\nThe day he arrived, Nash almost missed his flight. And his scene partner missed his ride to the airport, then struggled with long lines and security and then almost missed his flight, so by the time he got to the gate, he said, \"Everything was telling me to not get on the plane, so I bailed!\"\nI understand gut instinct (and of course his plane never crashed mid-air!), but I had one horny Nash on my hands, and he was ready and raring to go!\nI knew Davin was going to be in town and he was prepped and ready to shoot.\nBefore officially pairing them last minute, I did warn Nash that Davin is extremely thick-dicked. I think Nash took it as a challenge, and figured how bad could it be after being fucked by Zane.\nYou REALLY see how big Davin's dick is when Nash is trying to blow him. I think for a moment Nash thought he had literally bitten off more than he could chew.\nThankfully Davin enjoys sex in general and went bottom's up first. There is some awesome footage, and for a pairing I wouldn't have made, these two really clicked!\nAnd when it came time for Nash to bottom, I will be danged if he didn't take Davin's big 'ole cock AND not only stay hard, but kept almost busting! Watch for a quick moment when Nash pushes Davin's hand away from playing with his cock. Danger! Too close!\nSince Nash was so ready to bust with that ginormous cock in him, I quickly scrambled up a ladder (little shaky sorry) so I could see him spill while Davin fucks him, and angle often hard for me to get.\nAfter Nash busts, Davin continues to fuck Nash, thinking he could cum. But Nash was ready to be \"done\" being fucked after nutting. Davin finally pulls out and squirts soon after- Nash's dick barely wilting in the interim.\nI think these two boys, not meant to ever work together, enjoyed each other and as Nash says at the end, \"That was fun.\"",
  "models": [
    {
      "name": "Davin",
      "person_id": 3316
    },
    {
      "name": "Nash",
      "person_id": 3315
    }
  ],
  "release_date": "2009-10-09",
  "scene_id": 1045,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck"
  ],
  "title": "Davin & Nash - RAW"
}