{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would surprise everyone with hot RAW scene this Wednesday.\nThis is kind of the official 'live action' adventures of Grant & Houston, who are boyfriends in the 'real world.'\nI wanted to do something a bit more romantic and sensual than full-on hardcore fucking (which is certainly present as well)\nWe start in the shower where they kiss and explore each others' bodies, eventually giving each other some oral service.\nIf you have been following the Summaries on these two, you might recall that both are pretty much Tops. For this video they wanted to flip-flop with Houston going 'botttom up' first. He picked his favorite most passive position of just laying flat. I think he has some Passive/Aggressive sexuality that needs to be explored.\nA hard position to film, but the sensuality mixed with the pounding is extremely hot! Houston's face is in total bliss.\nNext, Grant flips Houston spread-eagle. Houston had a couple moments where he thought he was almost gonna cum, and he was eager to dump a load up inside Grant. So they got into a spooning position.\nThe spooning position seems to a challenge for most anyone, but this is the position I think Houston likes to fuck Grant in, perhaps because he can stare into his eyes while fucking him. (Very intense!)\nGrant keeps telling him to fuck him harder, while Houston keeps popping out, inserting his cock over and over. He finally gets some good steam going, pulls out at the last second, squirts one giant load, and promptly deposits the rest inside of Grant.\nThey quickly change positions, and Grant nuts all over Houston's faces, kissing and spreading the cum around.\nThis is a VERY satisfying video, and to me, it reminds me of young love.\nNow let's see how they do with the straight guys!",
  "models": [
    {
      "name": "Grant",
      "person_id": 3334
    },
    {
      "name": "Houston",
      "person_id": 3336
    }
  ],
  "release_date": "2009-09-23",
  "scene_id": 1048,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Self Suck or Self Facial",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Grant & Houston - RAW"
}