{
  "collections": [
    "ChaosMen"
  ],
  "description": "I finally found someone to match Zane's height, stamina, and size!\nI had been stepping Novak through the idea of doing more with dudes, and the Edge video kind of snapped him into the idea of doing full-on work.\nSo when he said he would top a dude, I knew Zane would love to take Novak for a ride.\nAnd I really think Zane loved every minute of this video. He knew Novak would be nervous, got him hard with the skills he has learned, and he himself was hard practically the whole time. I think because finally someone could manhandle him!\nNovak's still not ready to suck dick, but Zane did sneak a short kiss out of him and we got Novak in a position to jack Zane off, I guess pretending Zane's dick was his own. This gave ample opportunity for Zane to eat his ass out, truly one of the things he loves to do.\nNovak soon got into it, and the notion of fucking Zane had him worked up.\nSome amazing fucking going on as Novak and Zane are so evenly matched.\nOnce again we succeeded in having the cum fucked out of Zane. I love when this happens, because the top just can't believe that the bottom isn't in pain and is actually getting off to being fucked. I think that's the reason some of the \"I will only Top\" guys change their minds and try bottoming.\nZane was done, but Novak kept fucking him, pulling in and out and using a combo of jacking-off and plunging into Zane's tender asshole. He jizzes all over Zane's hole, and cum fucks him a bit with his rapidly wilting cock.\nExtra extra HOT ending!",
  "models": [
    {
      "name": "Novak",
      "person_id": 3324
    },
    {
      "name": "Zane",
      "person_id": 3306
    }
  ],
  "release_date": "2009-10-16",
  "scene_id": 1053,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Theme - RAW"
  ],
  "title": "Novak & Zane - RAW"
}