{
  "collections": [
    "ChaosMen"
  ],
  "description": "Guess who came out of hiding and asked to do another video?\nThat's right, Lansing is back!\nI don't know if he needed money quick, but Davin was available, and I did warn Lansing that he would be working with a big-dicked dude if he wanted a gig fast.\nI made sure Lansing showered up good, and sat on a big toy before we started out. When Davin's cock popped out of his jeans, I think Lansing realized why I was pushing the XL dildo at him before the shoot!\nI keep thinking, based on my own video with him, that Lansing prefers to bottom.\nHe really watches the straight porn and seems keen on having a three way with two girls.\nBut I think mainly he asked to bottom because he didn't think he could stay hard to top. Though he certainly doesn't complain about bottoming, you can tell his hands are trying to gently keep Davin from diving in too deep. He is an enigma for sure.\nThey struggled for the initial insert. Davin's got that big floppy donkey dick and normally I make lube easily accessible for the first insert. But Davin just spat on Lansing's hole and his cock and just tried to wedge the monster in. Plus they couldn't seem to get the height and angle of entry right.\nBut after that, it was all pro, and both Davin and Lansing began to bliss out on the fucking.\nLansing finally rides Davin's cock, and there is some great shots of his big tube going up Lansing's ass.\nThis was one of the easiest, yet hardest cumshots to shoot. Davin kept getting close as Lansing rode his cock. He kept saying he was cumming so Lansing started ramping up to cum right along him.\nIt took Davin a bit of jerking off, but he cums all over Lansing's hole. Before I can scramble around and get my cameras all moved for Lansing's cumshot, Lansing announces that he is, \"Ready.\" I barely got over to my camera in time to catch his awesome load.\nThese two started off a bit clumsy, but half-way through they 'clicked' and over all, this is a VERY hot video with a nice cream covered hole ending!\nWelcome back Lansing!",
  "models": [
    {
      "name": "Lansing",
      "person_id": 3274
    },
    {
      "name": "Davin",
      "person_id": 3316
    }
  ],
  "release_date": "2009-10-30",
  "scene_id": 1055,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Davin & Lansing - RAW"
}