{
  "collections": [
    "ChaosMen"
  ],
  "description": "I knew Drale would be cool with a Serviced video.\nI did have one of the younger gay guys setup to do this shoot, but he didn't want to get cum in his mouth, didn't have a lot of experience with uncut guys, and basically I figured I'd better take one for the team.\nI also figured I could push his limits since he already had an earful of what goes down at ChaosMen from his brother Teo.\nOn the drive to the studio, he thought he could eventually fuck a guy, so I knew he was ready to dive right in. I thought we may as well push his limits during the Serviced video and he agreed.\nSo perhaps a few small toys up his bum might open him up to the idea of bottoming, not just topping. His brother sure gets fucked like a champ!\nFor the oral portion though, it was typical of uncut guys in that I had to really keep his foreskin over his head. Sorry not much room for showcasing his dick.\nIf you watched Drale's solo, then you know he has a fast and furious jack-off style. I knew I was gonna have to duplicate this, which wasn't going to lend itself to the cum in the mouth technique.\nAnd SERIOUSLY, I think Drale wins the 2009 Cum Shooter of the year award! It went everywhere! All over the pillows next to his head, his face and chest! He even hit ME in the eye! An hour later, with my right eye bloodshot, I was wishing I had been down there covering his fire hose with my mouth.\nIt's a ridiculously crazy cum shot with some fun toy play to jazz up an awesome Serviced video.",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Drale",
      "person_id": 3338
    }
  ],
  "release_date": "2009-11-04",
  "scene_id": 1058,
  "tags": [
    "Sex Act - Toys",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer"
  ],
  "title": "Bryan & Drale - Serviced"
}