{
  "collections": [
    "ChaosMen"
  ],
  "description": "Hayden said he would come back and fuck a dude. We scheduled for almost a month later, mainly because of scheduling conflicts. During this time, he quit his job, moved, and in doing so, put himself in need of an \"advance.\"\nSo every week he was needing a little bit more to keep himself afloat, and I was nervous, because Hayden had a severe streak of Straight Boy Attitude. Was I advancing money to a dude that would not be able to perform?\nAnd of course, he was saying he would have no problem and was gonna do his best to show he could do anything and everything. Uh huh.\nThe day the shoot rolls around, the three of us discuss everything that everyone will be doing, but when it came to the oral portion, Hayden blanches at the notion of sucking dick.\nI was thinking, \"Great, we are off to a bad start.\"\nBut Sebastian put him at ease, and didn't act offended that he wouldn't be getting his dick sucked. I did tell Hayden he had to at least try to keep Sebastian hard. Which is not challenging. Sebastian is one of my ringers who stays hard even while being pounded.\nNo reciprocal cock-sucking aside, Hayden did amazing!\nYou can tell he is more mature than other models. He KNOWS how to fuck and the slight curve of his dick gives us lots of great views of his cock in action.\nEven though I was disappointed that I wouldn't be seeing a cock in Hayden's handsome face, I was thrilled at the ending of this video!\nIn between me moving around with the camera while filming Sebastian getting fucked doggy-style, he said that the thought he could actually cum that way. Actually I was underneath the two of them and you could see he was jacking his dick furiously. I quickly jumped up and came around the front cuz I knew he would nut on the bed.\nSo we had Hayden slow down on the fucking and I will be damned if Sebastian nutted while getting fucked! Hayden didn't know what to think! Should he stop fucking or keep going?\nHe paused for a moment and I asked him if he could cum while fucking Sebastian, and he said, \"I have been trying not to cum the entire time I have been fucking!\"\nI asked Sebastian if it was ok, if Hayden fucked him some more (I hate getting fucked after nutting) and I think Sebastian was still in a fog (or numb!), and said sure.\nAlmost instantly Hayden ramps up, pulls, out and cums all over Sebastian's hole, then shoves it back in! It was PERFECT!\nCreampie! Sweet!\nIt's a perfect cum shot for both of them, and despite Hayden's initial worries about sucking dick, this video was super smooth and easy to shoot, and was a dream to edit.\nSeriously, you don't want to miss this ending if you love creampie or breeding action!",
  "models": [
    {
      "name": "Hayden",
      "person_id": 3330
    },
    {
      "name": "Sebastian",
      "person_id": 3283
    }
  ],
  "release_date": "2009-11-27",
  "scene_id": 1066,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Hayden & Sebastian - RAW"
}