{
  "collections": [
    "ChaosMen"
  ],
  "description": "I knew that Parker Thorn had done a tiny bit of oral servicing in the past, and I also knew that Hagan was willing to give a guy a blow job, so I thought it we be perfect to put these two guys together.\nHagan is still on the fence on full-on interactive sex with a dude, so I wanted to make sure I got him in to at least suck a guy's dick. Parker wants to ease into it, but I think he is going to be down for it all.\nMany of viewers don't believe these guys are straight, but you have to admit, they both are truly amateur at this. Parker at the very least throws lots of energy and enthusiasm in it, and he scores high in that. I think he needs a few lessons is all. But he kept Hagan pretty hard and did lots of showcasing. He did try to deep throat Hagan's monster cock and gagged pretty hard. I whispered to him he didn't have to do that...focus on his cock.\nWhat I found surprising during this shoot is how quiet Hagan was. Hagan was not nervous before the shoot, very chill about everything, but he is practically motionless in this video.\nWhen editing the video I couldn't read his face. Was it not feeling good or hurting? Was he freaked out? And then I looked closely, and a couple times his eyes rolled back and his hand goes to his forehead. He's trying to not nut a couple times! I remember him doing that in his Serviced video.\nI know from my own Service video with him, that I made him cum real fast, and if you hit his bull-sized dick at the right spot he will nut.\nThen the came the part I was most nervous about. Would Hagan actually blow Parker?\nParker took off his boxers, and moved closer for Hagan to reach out and jack him off. He kept leaning towards it, but it didn't look like it was gonna happen.\nFinally Parker declared it was his turn from some head and went to the edge of the table where Hagan would have better access.\nOk, so Hagan is not a natural cock sucker. Hello! He is straight. So you gotta give him credit for doing it, and I must say he is even more handsome with a dick in his mouth!\nBoth these guys are BIG, but they managed to do some 69 action up on the massage table.\nI knew there wasn't gonna be any cum eating or facials. So before the shoot I asked Hagan if it was ok if Parker shot on his chest, so we could see the load on his beautiful skin tone. He thought that was fine, just no aiming towards the face.\nI made sure that Hagan nutted first, just in case Parker's load being spilling out on him ruined his mojo and we would have to wipe it off so he could nut.\nHagan came quick, so Parker quickly had to ramp up.\nParker went into full aerobic mode to nut while Hagan kept his dick reasonably hard. Parker nutted soon after. Easy as pie! Hagan didn't even fall asleep!\nAlso, before the shoot I asked if I could get a kiss out of them at the end. They both balked at this idea, which is so ironic considering they are sucking another dude's cock. So I left it up to them to do it on their own.\nAfter they both nut, Parker gives a little shrug as if to say, \"Why not?\" and bends down and plants one on Hagan!\nDontcha love watching straight boys kiss!",
  "models": [
    {
      "name": "Hagan",
      "person_id": 3341
    },
    {
      "name": "Parker",
      "person_id": 3342
    }
  ],
  "release_date": "2009-11-11",
  "scene_id": 1067,
  "tags": [
    "Sex Act - Oral Only",
    "Ethnicity - Mixed Heritage",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Massage Table"
  ],
  "title": "Hagan & Parker - Serviced"
}