{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought on everyone's day -off, I would give you a present to get you off! If you need an escape from the family/in-laws, this special pairing is for you!\nEven though Nash enjoys bottoming, he LOVES when he can fuck and show off his topping skills. And Lansing responded to his dominate attitude spectacularly!\nWe get down to business right away as Lansing submissively sucks Nash's cock on his knees. Nash eventually lays flat and gets Lansing in the mood to have his ass fucked. Sucking on him and playing with his butt hole and ass cheeks.\nNash really ramps it up and Lansing really takes it!\nWe managed to get a bit of a creampie cum shot on this one. Nash fucks Lansing till he is really close, then pulls out and starts jacking and jacking and jacking. I thought for a minute there it was going to be a false alarm. But he kept getting more and more tense and he finally nuts all over Lansing's hungry hole, shoving his dick back in, all cum-soaked!\nIf I remember rightly, Lansing's last shoot with Davin had him almost nutting too soon. We did a quick clean-up on Lansing, laid him down, and we were gonna have him suck on Nash's cock while he came. But I think he was ready to go the second Nash's cock came near him. He let's fly, practically apologizing as he is shooting!\nWhat a load too! Glad I didn't miss it! Nash starts playing with all the cum and gives him a good kiss at the end.\nI think both these guys REALLY liked filming this video. There was chemistry there for sure and the two really clicked.",
  "models": [
    {
      "name": "Nash",
      "person_id": 3315
    },
    {
      "name": "Lansing",
      "person_id": 3274
    }
  ],
  "release_date": "2009-12-25",
  "scene_id": 1068,
  "tags": [
    "Chest - Smooth/Natural",
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Lansing & Nash - RAW"
}