{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would put these two extra-large-dicked boys together to see if they could get as well as they could give.\nIn my opinion, both guys actually did better at bottoming. The both stayed hard so they were clearly getting off to being stuffed with a cock that matches their own dick size.\nClay still amazes me how good he can take it, considering how set against ever bottoming he initially said he was. Davin, who took it slow, eased him into opening his hole and Clay was eagerly enjoying getting his ass plowed.\nI like this video. Both boy are evenly matched. They flip-flop, kiss, and both can really suck dick for straight guys.\nYou have to pay attention and listen to Davin as he is fucking Clay doggy style. At one point he slows down a bit and says something like, \"Whoa, got to watch it or I'll cum.\" So I quickly repositioned the cameras and thought we would use his inertia for a quick cumshot.\nDavin does his technique of fucking till the last second, pulling out and staring at the butt hole he just pillaged, all the while underhand stroking his dick.\nHe cums all over Clay's hole (and back!) He rubs it around and tries to shove it in, but he goes wobbly fast. So he gives us a bonus by licking his own cum off of Clay's back.\nThe last couple videos, Clay has been upright while nutting. Honestly he is a \"lay on his back and flex his legs\" type of guy. So we gave him an easy cumshot this time out, and I believe it was the most he has ever nutted!\nI wonder if all that sticky warm cum still on his ass made him shoot quicker!",
  "models": [
    {
      "name": "Clay",
      "person_id": 3622
    },
    {
      "name": "Davin",
      "person_id": 3316
    }
  ],
  "release_date": "2009-12-18",
  "scene_id": 1072,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Clay & Davin - RAW"
}