{
  "collections": [
    "ChaosMen"
  ],
  "description": "Eli is sexual dynamo! Put him with Nash and it's a Dynamo Duo!\nI wanted to put Eli with Nash right away. They both have the same energy and their looks are so similar. I knew their personalities would click.\nI told Eli he had a video, but wasn't very specific about what was gonna happen. I picked both of them up at the same time, and I tried to clarify what all he would be willing to do.\nKissing? \"Sure why not?\"\nGive Head? \"Never done it, but will try.\" (He sucked dick unbelievably good for a first time, but that's what he said!)\nBottom for one portion of the video? \"If he can take my dick, surely I can handle his!\"\nI had told Nash he had a scene with another thick-dicked boy, so he was pleased to not be bottoming the whole time. It's not that he minds, he just likes a little of everything and is eager to do both Top and Bottom. So we were both pleased Eli was being so easy going. He is very dominate in bed, so he likes to take charge.\nAs for Eli, WOW! You put him in a room, turn the cameras and he was way into it. Both of them trying to one-up each other! It's amazing!\nThis is another pairing of straight guys who would actually likely be friends in real life. They got along great the day of the shoot and kind of had to hang out afterward as their travel arrangements were similar.\nSo you can tell they had instant chemistry, while not sexual \"off camera\" it sure did work on camera.\nNash gives us another cum shot while Eli fucks him. Eli pops out at the last second as Nash's legs straighten in ecstasy, but Eli definitely fucks the cum out of him.\nEli knew he could do a creampie, so we flipped Nash over and he ramped up to shoot all over his ass. He totally coats Nash's furry butt hole, then tries to shove his wobbly dick in.\nThis is a VERY HOT VIDEO with two VERY HOT tough guys fucking the Hell out of each other!",
  "models": [
    {
      "name": "Eli Hunter",
      "person_id": 3340
    },
    {
      "name": "Nash",
      "person_id": 3315
    }
  ],
  "release_date": "2009-12-04",
  "scene_id": 1073,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Eli Hunter & Nash - RAW"
}