{
  "collections": [
    "ChaosMen"
  ],
  "description": "Von is a tall lanky country boy. He was concerned about the interview and him sounding too much like a hick, as his Southern accent can get pretty thick.\nVon was a referral from a scout, and I sent out my standard letter to Von. It basically spells out everything he would do during his solo and photo shoot, the pay, and what he needed to bring with him. It is VERY to the point.\nWell, apparently he didn't read the whole letter, and was surprised to learn that he was jacking-off on VIDEO and not just photos.\nThe funny part, is he showed up with his sister, her two-month-old baby, and his brother-in -law.\nI gave him a tour of the studios, showing him the bathrooms, where we would be shooting photos and where we were shooting the video. No problem.\nWe started to get ready to do the photos when he confessed he had no idea he was doing video.\nI told him that \"Yes, it was in the email I sent!\" and no wonder he brought everyone with him. I had agreed he could bring a buddy, but I didn't think that his sister and a newborn baby being around for a video shoot would be the best thing.\nSo that explained the whole family being there. He thought he was just there to take a few nakie pics. Even still, it's kind of unusual, but I guess they were his ride to the studio.\nWell, he finally understood exactly what he was there for, and went into the waiting room, and told them they needed to go shopping and make themselves scarce for an hour or two.\nHaven't had a missed communication like that in..well...ever. Kinda funny actually.\nFor the solo itself, Von really focused on the porn playing. It was challenging to get him to play to you, the audience. But there is a boy who likes to show off his stuff hidden in there.\nYa know, when I sent him my initial intro email, he did email back, specifically saying that doing guy-on-guy work was not in his future as he was 100 percent straight. Many of the guys say that, so I just kind of roll with that. But this left me wondering why he was confused about having to do a solo video if he was already spelling out that he wouldn't do gay porn.\nWhen he was leaving though, he was asking about how much getting a blow job paid and he seemed more interested.\nI will have to think about this one. I don't really like Serviced videos where the guy sits and stares at the straight porn playing, and I fear that might be what would happen. But ya never know. I sometimes get surprised when the interactive element is added. Guys are pretty quiet when they jack off, and he may turn up the volume for a blow job.",
  "models": [
    {
      "name": "Von",
      "person_id": 3346
    }
  ],
  "release_date": "2010-01-04",
  "scene_id": 1077,
  "tags": [
    "Theme - Solo",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Video - HD - High Def"
  ],
  "title": "Von - Solo"
}