{
  "collections": [
    "ChaosMen"
  ],
  "description": "While Van was here filming a solo, he was pretty certain he could do an oral video.\nI scheduled Grant to do the Servicing, but he dropped off the radar. I kind of felt guilty telling Van that I would be doing it. It felt a little bit like I was baiting and switching him.\n\"Sure come on out and the next day I can have another model blow you!\"\n\"Did I mention that that other model would be me?\"\nHe took it in stride and like most of the models, was a bit relieved that wouldn't be dealing with someone else. That the familiarity of having me there during their solo gives them a bit more confidence that they can do this simple video.\nVan has a girlfriend, but she either doesn't like or wont give head. So his experience with getting head is practically non-existent. Being rimmed was also a new sensation and he really enjoyed it.\nVan was a stealth cummer, as he didn't give me any indication he was cumming. He got real quiet and the next thing I know cum is shooting down my throat and dripping in giant streams out of my mouth.\nHe seems confident that he can do guy-on-guy work. He doesn't think he can suck dick..but a lot of the guys say that to start with, so never say never. But topping and even bottoming didn't seem out of his limits.\nSPOILER ALERT!\nOk, so here is a bit of a spoiler. DO NOT READ if you enjoy the full on fantasy of these videos.\nYou might notice Van is fairly wobbly through out this video. For good reason.\nIf you look at the cumshot, you will see I am a bit surprised, he is a little horrified, and then I am smiling.\nWhy?\nBecause I had sucked on him less than 90 seconds! I had just got him hard, and he nutted. Big time.\nCrap! Barely 2 minutes of video and we were done. Van was a bit flabbergasted, and sheepishly embarrassed that he came so quick. He did say that it felt WAY too good, and just couldn't hold back.\nThe irony is the day before I figured I would have a tough time making him nut. Van has that rapid-fire, piston-like jerking action that isn't really part of my technique. I thought it would be a hard Serviced video to uh...pull-off.\nSo what to do?\nI asked him if he had a little break, could he get hard again? He said he could cum with his gf several times, and wanted to make the scene work, so he was certain he could go again.\nWe waited a half hour, leaving him to watch porn. I came back in, and though it took a bit to get him hard, I got him back up and standing, but had to keep constant attention to it.\nThe rimming though, that did turn him on, and he stayed hard for that, and when I rolled him back over and played with his ass, he perked up again. Hmmmm...\nBut in all honesty, the cum shot at the end of this video actually occurred mere minutes into the shoot and all the build up was shot after. All brought to you via the magic of editing- and the stamina and recuperative abilities of an 18-year-old!",
  "models": [
    {
      "name": "Van",
      "person_id": 3347
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2009-12-16",
  "scene_id": 1085,
  "tags": [
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Build - Mature"
  ],
  "title": "Bryan & Van - Serviced"
}