{
  "collections": [
    "ChaosMen"
  ],
  "description": "I didn't believe it at first, but Taylor said he would be willing to fuck a guy. Same thing all the new guys say. No kissing, no sucking back, maaaaaybe play with their dick.\nI also know that these guys tend to expand their limits as they go along, but Taylor really didn't want to do much beyond fucking a dude.\nI knew from his Serviced video, he has a pretty strong dominate streak. I figured passive Lansing could take his dick and not freak him out.\nLansing gets his shorts off and quickly wakes Taylor's dick up.\nAnd YES, we have a talker! What Taylor lacked in things he was willing to try, he more than made up for it with his verbal skills, along with some really good Topping skills.\nThe boy knows how to fuck! His dirty talking worked great on Lansing, who responds to being told what to do.\nI was determined to get a good creampie on this one. I think my mic and my head/hair pop up on some of the camera angles. But I laid down on the floor and stuck with it until Taylor nutted all over Lansing's hole. He then shoves in and out, cum oozing out of his hole. VERY hot!\nThis time I made sure Lansing wasn't close to cumming as I shot Taylor's cumshot. I knew I couldn't scramble up from the ground. He is quick shooter when the other guy nuts!\nLansing gave me a full minute to get myself settled and ready for him to shoot.\nLansing confuses me. he struggles to stay hard until he gets fucked, and when we do the cum shotcumshot, it makes him spill all the more quicker. Yet still wants to watch straight porn between shooting. ~shrug~\nAnyway, I hope you love watching these two elite dudes sucking and fucking with an amazing creampie finale!",
  "models": [
    {
      "name": "Lansing",
      "person_id": 3274
    },
    {
      "name": "Taylor",
      "person_id": 3343
    }
  ],
  "release_date": "2009-12-11",
  "scene_id": 1086,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Lansing & Taylor - RAW"
}