{
  "collections": [
    "ChaosMen"
  ],
  "description": "I am still trying to \"spread out\" the Serviced videos with some of the other models. Right now it may seem like I have stepped way, but no worries for you fans of the Bryan Ockert Blow Job, there will plenty coming up at the end of the month.\nI was actually set to do AJ's Serviced video, as well as another model coming in the same week as AJ. Both models were coming in to do a solo, and maaaaybe might get their dick sucked the following day if they felt comfortable.\nSo far everyone has opted to do the Serviced videos when I do this 'no pressure' offer. But because they might not do it, I don't normally schedule another model to \"stand by\" in case there is a blow job to be done.\nBut Davin had a bunch of drama with his rent, and despite just having done a video, was texting me for more work. Wife and kid soon to be evicted. ~sigh~\nDavin's main strength is his big cock. He sucks dick pretty good in the videos, but he is straight and we all know the straight guys doing the Servicing usually don't want cum in their mouth or will even rim. I wasn't sure about him doing these, but again, have been interested in these video not being me every week.\nDavin said he would rim and not be worried if he got cum in his mouth.\nAs for AJ, he was nervous only for a moment or two as he worried he wouldn't stay hard. That was not a problem!\nBetween camera shots, AJ asked Davin if he was gay, because he could feel Davin's cock on his leg and thought he was hard. Davin and I laughed because his dick wasn't hard, it's just so big that even soft it seems hard, and fills up his underwear.\nIt wasn't exactly an invitation, but I figured AJ might not freak out if Davin took his dick out, if only to see what we were talking about.\nI usually don't expect the straight guys to \"make\" the guys cum, so I asked AJ if it would bother him if Davin took his cock out and stroked along with him. \"Naw,\" he said. SoAJ got an eye-full of Davin's hummer.\nDavin hadn't had sex in days and was certain he could cum right alongside of AJ.\nSure enough both boys fired their guns at virtually the same time!",
  "models": [
    {
      "name": "AJ",
      "person_id": 3349
    },
    {
      "name": "Davin",
      "person_id": 3316
    }
  ],
  "release_date": "2009-12-02",
  "scene_id": 1089,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "AJ & Davin - Serviced"
}