{
  "collections": [
    "ChaosMen"
  ],
  "description": "How about an Edge video for last video of 2009?\nSince Hagan appeared on the site, you may notice it's only been orally-oriented videos.\nWith his dick size, great looks, and awesome body, he is eager to do straight porn. But apparently there is a line around the block of dudes willing to fuck porn chicks, and for practically free.\nAfter his mutual blow job with Parker, he was trying hard to get hooked up with one of the straight companies, but was not making much progress. Rent and bike payments eventually came due, and at the last minute he was texting me for more work, but still not willing to do more than oral. ~sigh~\nHe had heard about the Edge videos and suggested doing it. I told him that it's just me basically giving him another blow job, and I wasn't too sure the audience wanted to see me blow him again.\nBut at the same time, I have had such luck getting the guys to come back to do 'more' after these Edge videos, that I thought it might be worth having him come out to do one. Maverick is a perfect example. I just kept sucking away until he gave in!\nPlus, I admit, the image of him tied-up and bound in the silver chair- it's a powerful image!\nAs always with these films, I struggle to find new and different fantasy elements to do with the guys that still fit in their rather narrow boundaries. I did push him here and there, and my cumshot is actually kind of cool, cuz I TOTALLY surprised him with what I was up to. So just know that was very unexpected for him!\nI do hope he comes back for more. He is super easy to make cum, and that cock and body is amazing. I just don't know who would be willing to sit on that cock of his! So him sticking to oral only may really be all I can get him to do. But ya never know!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Hagan",
      "person_id": 3341
    }
  ],
  "release_date": "2009-12-30",
  "scene_id": 1091,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Edge",
    "Pubic Hair - Trimmed",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - African American"
  ],
  "title": "Bryan & Hagan - Edge"
}