{
  "collections": [
    "ChaosMen"
  ],
  "description": "It took a while for Rush to decide to receive head from another guy.\nBut in a way I am glad he really thought about it, because when he wrote me, he thought maybe he might be able to blow the guy back.\nAs usual, I am looking for some mature gay guys to take on the Servicing duties, and Colin was interested in getting some straight boy action (though Rush kind triggers my gaydar). So we bypassed a solo on him and he went to the head of the cocking line!\nI told Rush that during the blowjob, Colin would make his dick \"available\" and he could chose or not chose to jerk-him-off or blow him. No pressure.\nAnd WOW! Colin DOES know how to give head! He is a lean 'lil guy, but he has skills to turn these guys on (and make them cum!).\nI was worried that Colin wouldn't be hard during the shoot. Myself and the other guys, rarely get aroused, as you are doing all the work, and you are focused on the dude. But Rush was breathing hard and making little moans, and when Rush flipped over to have his ass eaten out, you could clearly see Colin had pitched a tent.\nHe pulled it out and started stroking it, all the while licking and playing with Rush's ass and cock.\nAfter a little ass showcasing, Rush flips over and Colin moves into a good spot for Rush to have access to Colin's hard cock.\nSure enough he went for it, and did a very good job, given the awkward position.\nI don't know if it was the cock in his mouth, but Rush signaled he was getting close so Colin ramped up his attention and literally makes him cum.\nI did some pans over the aftermath and I thought that was the end of it and turned off my cameras.\nWell, Colin of course wanted to nut, so I asked Rush if he could teabag Colin while he got off, figuring his dick was out of commission for the next half hour. Most of the guys just want to \"move on\" after they nut, but he thought it was only fair.\nI also worried Rush's dick would be too sensitive after just nutting, but it woke back up as Colin licked his balls and sucked on his cock. He either liked the oral service or watching Colin jerk-off in front of him, but he got bone hard again.\nAnd with a little bit of verbal encouragement from him, Colin shot a massive load.\nThis is a VERY satisfying oral video so I hope you enjoy!",
  "models": [
    {
      "name": "Rush",
      "person_id": 3337
    },
    {
      "name": "Colin",
      "person_id": 3351
    }
  ],
  "release_date": "2009-11-25",
  "scene_id": 1094,
  "tags": [
    "Sex Act - Oral Only",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Colin & Rush - Serviced"
}