{
  "collections": [
    "ChaosMen"
  ],
  "description": "Finding models is very competitive here in California. I have to compete with all the major studios, and even the smaller studios.\nWhen I stumbled on Gary, I was so relieved. Hot guy, willing to pose nude, and all that great body hair. I asked him to do a video, quite a bit of convincing and explaining. He even thought about doing video for a week or two, and after much thought, decided he wanted to do a video. Figured it was a lark.\nFast forward to me waiting to get my theatre online. Three times I saw models I thought I had exclusives on go work for one of the other studios. I convince them, make it a cool experience, and after that, the guys understandably seek out other sites to work for.\nThat happened with Gary. Here I was sitting on a hot model, waiting to show him off to you, only to be skooped by one of the other sites. Oh well. I still think this is a hot video, one of the best I did, but I so wanted to bring you Gary first. So it kind of took the wind out of my sails. I really totally enjoy the other site that his vid/gallery is on (His stage name is Josh Warren on that site) and obviously we are looking for models in the same location. One thing I have to say, I think Gary seems more turned on. His dick seems much harder (he seems kind of at \"half mast\" through much of the other video) The quality of the other video is great, but I think I got a touch better performance.\nAnyway, Gary is AWESOME. If you haven't joined the theatre section, you should do it now, cuz despite maybe spotting him on another site, his video is hot!\nHe's got some amazing low-hangers, and his dick just kept getting bigger and bigger. If you love body hair, this guys for you!",
  "models": [
    {
      "name": "Gary Newman",
      "person_id": 3124
    }
  ],
  "release_date": "2005-10-20",
  "scene_id": 110,
  "tags": [
    "Theme - Solo",
    "Build - Lean",
    "Build - Hairy",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Video - Standard Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Gary Newman - Solo"
}