{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Jayce had done about a dozen Chaos videos, we figured it was time to give him a break. With the temporary \"lay\" off, Jayce was more than ready to get to work.\nI knew Hayden was a great top, and Jayce loves to get fucked - a perfect pairing for Hayden to get back on the horse, so to speak. Not only that, I think I had Hayden convinced that he himself could bottom - if the dick wasn't \"too big\" of course.\nHell, he might even suck some dick this time...remember these videos don't air in the order I shoot them. Hayden's Edge video was shot quite a bit after this video.\nJayce can really suck cock well, and we started the video by him getting Hayden hard. Frankly, it turned him hard enough for Hayden to give sucking dick a try. I think Hayden was embarrassed to admit his cock got harder when he was sucking on Jayce's dick. Jayce sure noticed it and said so!\nAfter the mutual cocksucking, Jayce was eager to get fucked again. Hayden delivers, and Jayce was in butt fuck Nirvana!\nThen we switched gears, and Jayce took Hayden quickly through some toys, picking larger ones each time to ease him into getting fucked.\nHayden claims he can handle quite a bit of pain, and true to his word, he toughs it out - getting his ass gently fucked by Jayce. It's definitely not an ass pounding, but we can consider Hayden's cherry officially popped.\nJayce has become a bit of a cum eater, so for the cumshot, he asked to do a facial. When Hayden puts his mind to cumming, he can literally cum within a minute. Jayce is usually waiting for a bit for the other guy to nut, since he seems to be able to nut right along with whoever he is with.\nI think Hayden surprised Jayce by cumming so quickly, especially after just being fucked for the first time, so Jayce wasn't quite ready to eat his load, but he got his mouth open in time. Say AHHH!\nJayce had to play catchup, as he usually can cum right along with the other dude. You gotta give him props, maybe a minute later, with cum all over his face, eyes, and in his mouth, he shoots a big gooey load!",
  "models": [
    {
      "name": "Jayce",
      "person_id": 3226
    },
    {
      "name": "Hayden",
      "person_id": 3330
    }
  ],
  "release_date": "2010-02-26",
  "scene_id": 1102,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Hayden & Jayce - RAW"
}