{
  "collections": [
    "ChaosMen"
  ],
  "description": "Doing this video was a bit of a surprise. Damian was just coming in to do a solo but afterwords thought he could get head. So I thought why not? He was a bit nervous during his solo, so maybe I could pull him away from watching the TV too much and get some real emotion out of him.\nIt took me 2-3 minutes to wake his cock up, and I pretty much stick to the rhythm that he was most responsive too. The technique is not super great at showcasing his cock.\nFortunately he was just sneaking peeks here and there of the pussy flick and was giving me lots of breathing and feedback that told me what I was doing was working.\nThe biggest surprise to Damian was how much he enjoyed the rimming. His reaction after the shoot was one of those, \"I wish my camera was on right now!\" moments. We pause in the middle of the rimming because he was going to nut.\nSo after the shoot, he was a little freaked out as to what that \"meant.\"\nFrankly I don't think it means anything other than now he has something new to try with girls or that he discovered his asshole has erotic nerve endings too.\nBut it is always hot (to me anyway) when I get them so turned on they are saying slow down. Especially when it's challenging to make them hard in the beginning.\nI knew making him nut was not gonna be a sweatfest for me, and once I got him turned back over, I went to town on making him nut. His gaze switches to me, the TV and himself getting blown on LCDs on the camera.\nHe makes lots of noise and warnings like, \"I'm gonna nut man!\" He shoots a couple globs down the back of my throat. I pull away so you can watch him shoot, forgetting that just the day before I learned he could get some distance going.\nHe hits me right in the eye, and you would think I would know better by now. Ouch!\nHis cumshot is really hot, and I remembered that the rest of the day cuz I had one very red and achey eyeball!",
  "models": [
    {
      "name": "Damian",
      "person_id": 3353
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2010-06-22",
  "scene_id": 1108,
  "tags": [
    "Ethnicity - Asian Guys",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Bryan & Damian - Serviced"
}