{
  "collections": [
    "ChaosMen"
  ],
  "description": "Clay and Eli are almost the exact same height. They are both packing some big meat, each in own flavor- cut and uncut. An awesome match!\nClay is now no longer nervous doing videos, and was a bit embarrassed when his dick got hard before the shoot. So it was nice to see him hard through his shorts, and Eli zeroed right in on it.\nEli gives him some great head, and with a little coaching, gave Clay's uncut cock the right amount of attention. I think that was the first time Clay said one of the straight guys gave him head the way he likes it.\nEli then climbs on top and feeds him is own rather significant dick. All the while keeping Clay hard with a back-handed jerk.\nBoth guys enjoy topping and bottoming, but I knew Eli might be not have handle a dick his own size, so we had him get fucked once. Frankly, I think he can handle anything I send down his chute. He's a tough little fucker!\nI know I say this occasionally, but this was a pretty easy film to shoot. Both guys were into it, without a lot of starting and stopping. Their personality clicked to as they two are huge fans of Family Guy and they kept breaking into famous lines from the show.\nThe cumshot is not terribly \"interactive\"as we have learned Clay needs to bust with his legs locked. Leaving him as a platform to shoot on. He is still not able to take a load to the face, so we just had Eli nut all over his cock.\nWhile it may not be entirely interactive, the timing was great because the entire shoot, Eli was asking if he could cum yet. I would say, \"Not yet!\" So when it finally came to bust, he pretty much unloads moments after Clay!",
  "models": [
    {
      "name": "Eli Hunter",
      "person_id": 3340
    },
    {
      "name": "Clay",
      "person_id": 3622
    }
  ],
  "release_date": "2010-01-08",
  "scene_id": 1109,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer"
  ],
  "title": "Clay & Eli - RAW"
}