{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wow, it was dang hard to make this shoot happen.\nI had originally set Parker Thorn to work with another model. Parker missed his first flight and spent the day traveling. He was relieved to finally get to Austin, but very nervous about doing full on fuckin' around with a dude.\nThen the other model just never got on his plane. So we rescheduled it a week later, both models re-booked. Parker once again missed his flight, and spent the day all nervous and traveling.\nAnd then the other model.....didn't show up...AGAIN!\nPoor Parker.\nSo I called on my most reliable model, Nash, and made sure he was here the day before Parker was due to be back.\nParker actually made it to plane on time and was not stressed out after so many failed attempts.\nOf course, Nash made him feel immediately comfortable, and I have to say the pairing worked out awesome!\nParker dived ride in by blowing Nash, who then returned the favor. I do believe Nash's cock sucking skills have really improved. Enough so that he just spun around and sat on Parker's dick. I think Parker was \"somewhere else\" during his first ass fucking.\nBut once we get him upright, he gets way into it, and it still astounds me that once we get Nash on his back, he can't even touch his dick for fear of cumming. Parker tries to lend him a hand and Nash shoves his hand away.\nI figured it was time to let Nash cum, so I told him to go for it, and Parker fucks the cum right out of Nash.\nIt takes Parker a minute to catch up, and unloads gobs of jizz all over the load Nash just shot!",
  "models": [
    {
      "name": "Nash",
      "person_id": 3315
    },
    {
      "name": "Parker",
      "person_id": 3342
    }
  ],
  "release_date": "2010-02-12",
  "scene_id": 1116,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer"
  ],
  "title": "Nash & Parker - RAW"
}