{
  "collections": [
    "ChaosMen"
  ],
  "description": "AJ got home after doing his solo and blowjob video and was excited about the money and how much fun he had.\nHe told his best friend Jasper, who immediately wanted to get in on the action. Apparently they discussed it all and had a scene together all mapped out, so they approached me about doing a scene together.\nDespite it being a little weird having sex with your best friend, AJ was very nervous about doing full-on sex with a stranger the first time. Plus I think AJ has a little bro crush on Jasper. Jasper seem kind of cavalier and calm about the whole idea.\nAlso, Jasper thought it would be easier doing it with his friend. So we started with the premise of them doing a side-by-by side, but we pretty much knew that they were willing to try everything.\nThe video runs a little long as I kept the footage of them blowing each other until they got hard.\nJasper adjusted to getting fucked much more than AJ did, and you can tell it was both of these guy's first time. A little clumsy, but that should be expected.\nI plan on doing an oral video with Jasper, which will air in the coming weeks. He has a very military look and his eyes are quite nice, so I want to do a photo shoot with him.\nFor the ending, AJ busts all over Jasper's hole, sliding his cock all around. Jasper nuts leaving a pure white load on his tummy.\nNow to see how these guys do with some of the veterans!",
  "models": [
    {
      "name": "AJ",
      "person_id": 3349
    },
    {
      "name": "Jasper",
      "person_id": 7435
    }
  ],
  "release_date": "2010-01-29",
  "scene_id": 1117,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - Best Friends",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "AJ & Jasper - RAW"
}