{
  "collections": [
    "ChaosMen"
  ],
  "description": "Well AJ stepped up his game for this shoot!\nNash of course is very sexy, no matter how you cut it. And, as always, he makes the new guys feel at ease.\nPlus, I think it was awkward doing the last scene between AJ and his best friend, Jasper.\nThey both get way into it; AJ is learning that he can take a cock and it can actually feel good.\nNash struggles not to cum when he gets fucked on his back again. It's funny to watch him brush AJ's hand away when he tries to play with it.\nA little cream-pie action at the end, and AJ nuts doggy style while Nash is \"almost\" fucking him. We are getting him closer to getting the cum fucked out of him!\nBut I guess the fun part of this video is the OutTakes at the end.\nWith amateur guys who have never fucked a dude, we usually stick to 3-4 positions. I know it can be boring, but since I have so few gay guys working for me, they just aren't good at Gay Porn Acrobatics.\nBut between takes, the boys were watching a straight porn where the guy had picked up his girl and was fucking her standing up. Nash said he does that with his girl, and he didn't think the extra 20 pounds little AJ would be that much different.\nI wasn't so optimistic, but figured it would be fun to try a new position.\nSo it's lots of fun to watch them try to get the position to work. I think you can see they are having fun on the set, and I gotta give 'em props for thinking creatively!",
  "models": [
    {
      "name": "AJ",
      "person_id": 3349
    },
    {
      "name": "Nash",
      "person_id": 3315
    }
  ],
  "release_date": "2010-03-19",
  "scene_id": 1122,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "AJ & Nash - RAW"
}