{
  "collections": [
    "ChaosMen"
  ],
  "description": "I sure didn't bring Angelo out of his Porn Watching Trance. I tried my best tricks to dazzle him and get him from watching the porn, but he pretty much is entranced by it. Almost the complete opposite of last weeks' Serviced video.\nSeriously, I think even at the age of 20, he really hasn't had any opportunity to watch porn. He even asked if he could bring some home with him. So he has been porn deprived all his life!\nThat did make my job easier as he stayed hard and close to cumming through out most of the video.\nI guess the highlights of the video are when he watches himself getting his ass ate out, as well as some pretty funny facial expressions when I switch to hand-job mode.\nWhen I know I can easily make one of the guys cum, I do try to balance the cumshot so that the first squirts go down my throat, and the rest spill out so you can see he is actually cumming.\nI usually leave the cum on his cock or stomach, so I can take the \"after\" photo still, but his cum tasted awesome, and I think I ended up eating most of it. Which ironically I think turned him on.\nHe is a stoic one and I am not sure he has the ability to \"act\" and do a full scene where he would actually have to move and NOT watch the straight porn playing for him.\nI think he has a hot body and cock, but this might have been his limit. So enjoy this video cuz, it might be all he is up for.\nHe sure has a nice cock though!",
  "models": [
    {
      "name": "Angelo",
      "person_id": 3358
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2010-02-10",
  "scene_id": 1129,
  "tags": [
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Angelo & Bryan - Serviced"
}