{
  "collections": [
    "ChaosMen"
  ],
  "description": "Genetics and good \"rearing\" make this one of the most beautiful men, inside and out!\nThis my officially owned ChaosMen.com video of Ryan C. I have shot with Ryan a handful of times. We started off doing photos in Austin, and then he did a couple videos for SeanCody.com.\nI love working with Ryan. He is one of the politest models I have ever worked with, easy to talk to, and someone you just want to hang with. I knew I wanted to get my own video of him for our little collection we have here, and Ryan was completly down with a trip to the West coast. Between two jobs, finishing school, and maintaining that incredible body, Ryan doesn't have a lot of free time, so I booked him a quick overnight stay.\nAfter shooting some artistic photos we got down to business. Ryan is such a solid performer. He is never nervous and completley at ease with having a pervvy photographer inches away from him.\nI do have to tell you a bit of a spoiler. During the cumshot, I eased in to the wide angle shot. You could see me and my big head plain as day.\nI've gotten used to hearing my voice, but dont' like the way the video reads when the videographer steps in. I like the vid to pretty much go from interview, to getting charged up, to them getting lost in the moment, then bringing them back to reality and \"stepping\" back in with a few questions. But not physically.\nSo I got busy with After Effects, and though its not Industrial Light and Magic, I am pretty proud of the fact you cant see me during the cumsot at all, and I mean I was totally full on in the shot!\nWatch the video once with your hand in your pants, and the next time with your eyes on the whole room to see if you can spot anything unusual.",
  "models": [
    {
      "name": "Ryan Charles",
      "person_id": 3125
    }
  ],
  "release_date": "2006-04-21",
  "scene_id": 113,
  "tags": [
    "Theme - Solo",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Video - Standard Def"
  ],
  "title": "Ryan Charles - Solo"
}