{
  "collections": [
    "ChaosMen"
  ],
  "description": "I honestly didn't think Clay and Parker Thorn would be a good match, mainly because of their height difference.\nBut once I got them in the room together, they were laughing, and Parker was finally relaxed and cool with everything. Clay quotes a lot of lines from\nFamily Guy\n, so he was cracking Parker up. Walking past Parker with a boner and saying in his best Stewie voice, \"Just passing through, let me know if you see something you like.\"\nPlus, I didn't realize having these two blonds together looked pretty hot.\nI would say Clay is now an eager bottom and has no trouble accommodating a dude's cock. Once Parker realized that Clay was into it, he fucked the hell out of him. He grabbed and held both his arms behind him as he ass rammed him. Something I have not seen any of the other models do!\nWe got cocky cuz we were getting such good footage. Clay suggested he stand (precariously) on the edge of the bed frame so he could be at the perfect height for Parker's tall frame. It was a challenge for Clay to hold that position, but it did the trick and allowed Parker to ramp up and nut all over Clay's hole.\nAfter making a sticky mess, I gave Clay a break and let him do his \"leg lock\" technique to cum, all the while sucking on Parker's cock and balls - which had surprisingly sprung back to life.\nFans of OutTakes should wait to the very end to catch a goofy moment.",
  "models": [
    {
      "name": "Clay",
      "person_id": 3622
    },
    {
      "name": "Parker",
      "person_id": 3342
    }
  ],
  "release_date": "2010-03-05",
  "scene_id": 1135,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Clay & Parker - RAW"
}