{
  "collections": [
    "ChaosMen"
  ],
  "description": "Lansing was finally getting confident with his dick staying hard for shoots, so he asked if he could try topping.\nEli has no problems bottoming. Actually, I think he is excellent at both positions.\nBut we started off with Eli giving Lansing the briefest of massages, playing with his hole and generally getting him worked up to be fucked.\nEli wanders around front and feeds his fat cock to Lansing, and that did the trick. He flips Lansing over to get a quick kiss in just before Eli starts sucking on Lansing's dick, which is standing straight up.\nEventually, Eli bends him over the table and slowly inserts his cock, stretching his hole and letting us all see how big his dick is.\nLansing then turns over and Eli crawls on top and sits on Lansing's dick. Lansing plays with his cock and they kiss. You can tell that both of them are really into it.\nAt last! Lansing finally tops!\nLansing did admit that Eli was pretty skilled, and we both wanted to see if Eli could fuck the cum out of him.\nI know the \"On The Back\" position is usually the best, and sure enough we get to witness one of the best cum fuckings I have ever seen.\nWithout missing a beat, nor wilt of Lansing's cock, Eli pulls out and splooges all over Lansing's hole, shoving his cum-soaked cock in and out.\nI gotta put the massage table into play more often, cuz this is seriously one of the best vids on the site. It's got great video coverage, there is chemistry between the models, and, of course, a creamy pie at the end!",
  "models": [
    {
      "name": "Lansing",
      "person_id": 3274
    },
    {
      "name": "Eli Hunter",
      "person_id": 3340
    }
  ],
  "release_date": "2010-03-12",
  "scene_id": 1136,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Eli Hunter & Lansing - RAW"
}