{
  "collections": [
    "ChaosMen"
  ],
  "description": "Nathaniel took some time off to think about doing more. I kept kind of putting him off because he had basically hit his limits. I had great feedback on him, so I was pleased when he called me up to say he was done worrying about doing more and that he would try everything. And....that his long hair was back!\nThen Dante comes along. Does a solo and the Edge video. Calls me up the same day, saying, \"Sign me up for everything. No Limits\"\nNormally, I like to have a \"ringer\" as part of the team. One of the guys has to know what they are doing, but for some reason I thought these two complete novices could make it happen, and there might even be some charm in that.\nNow you may be thinking Nathaniel isn't a complete novice. But he's only had his dick sucked and fucked a dude or two. Never sucked dick nor got fucked.\nBoth those boundaries were crossed for these guys in this video.\nNathaniel was totally committed but got nervous as soon as we were in the room. Dante had a more enthusiastic take on the situation...until he saw how big Nathaniel's dick was!\nThe goal was to have Dante fuck Nathaniel for a couple positions, and since I knew Nathaniel's dick is an \"advanced\" sized cock, we would see if we could get it inside of Dante for one position.\nWe started off with Dante fucking Nathaniel, and that went great.\nBut when Nathaniel shoves his big ol' cock in Dante's virgin hole, he screams bloody murder.\nFreaked me out a little bit, but his tone changes and then he decided he liked it! His dick was down for the count though, so instead of him fucking Nathaniel again, we just kept pummeling Dante.\nNathaniel shoots a load all over Dante's ass and tries rubbing it in and around, never quite shoving it back in. But it's pretty hot.\nWe gave Dante some time to ramp up, and he shoots a giant load while sucking on Nathaniel's nut sack!\nIf you like your guys super masculine and beefy, this video will be a taste treat.\nMAN UP!",
  "models": [
    {
      "name": "Dante",
      "person_id": 3355
    },
    {
      "name": "Nathaniel",
      "person_id": 3258
    }
  ],
  "release_date": "2010-03-26",
  "scene_id": 1146,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Long",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Dante & Nathaniel - RAW"
}