{
  "collections": [
    "ChaosMen"
  ],
  "description": "I gave Degan a little time off, and every time Taylor would come up, I kept thinking how much these two would look good together. Even the thumbnail picture for their gallery where they are kissing, they look like brothers.\nThey both are muscle guys: one more mature, one more of a muscle cub.\nSame height, same thick dick. The only real difference is Degan likes to be dominated, while Taylor has a bossy streak. A match made in Porn Heaven.\nI think this is Taylor's third fuck video, and I told him it was time to suck a dick. I figured their dicks were kinda the same and he could imagine he was sucking his own dick, which turns out he never has attempted...straight guys, what are ya gonna do with em!\nHe actually did pretty good in the cock-sucking department. Not really diving in deep but more showcasing Degan's cock, while still keeping him hard. But I won't be having him take over any Serviced videos anytime soon.\nBut I wanna give Taylor props, that's one more hurdle he has conquered. That leaves only one more to go, and that's to see if he can take a cock up his ass.\nBut this time out he gets to dominate and really fuck the hell out of Degan.\nTried a new position with Degan rolled up, but it was a bit challenging.\nThe best parts, of course, are the cumshots. Taylor fucks the cum out of Degan, then we flip Degan over and Taylor fucks him until he is close, pulls out and shoots his load all over his hole, plunging his cock back in and out.\nWithout a doubt one of the best cream pies on the site!",
  "models": [
    {
      "name": "Taylor",
      "person_id": 3343
    },
    {
      "name": "Degan",
      "person_id": 3276
    }
  ],
  "release_date": "2010-04-09",
  "scene_id": 1147,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Degan & Taylor - RAW"
}