{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wow! I just didn't think this shoot would happen. After 2-3 oral videos, Hagan finally came around to doing full-on fucking.\nHe goes in my top 5 of Most Reluctants. He has a kick-ass body, 10-inch dick, and is gorgeous. He and I both figured the straight production companies would love to have him.\nAs it turns out, he got hooked up with one, got paid nearly nothing, and overall had a pretty negative experience. Thus he ended up back in my studio.\nI was actually pushing him to do straight porn. His dick is pretty big, and with me having mostly straight guys, I have very few guys that wouldn't take one look at his ginormous dick and turnaround and leave the studio.\nBut I figured I had a couple guys who always like a challenge. Silas being my first thought.\nSilas sized him up and said he could do it. I asked around to a couple other models and they said they would be game too, though a few suggested that he should try bottoming himself. Which I will keep nudging him to do. He's just been awful jumpy every time we have gone near his ass.\nSo this is Hagan's first time fucking a dude and he did pretty good. I think he is always gonna be very quiet, and not much of a dirty talker. Silas threw some energy his way, but I think it bounced off of Hagan's ripped exterior.\nI also think Hagan needs to learn to fuck. I kept waiting for him to take long in and out strokes- his dick certainly was hard enough. But I suspect with a dick his size, he is used to taking it easy on the girls and just kind of finds a spot and gently fucks them.\nREALLY nice cum shot on this one as Hagan pulls out and busts all over Silas's hole, then shoves it in at out..cum drippin out of Silas's hole. Had to reset cameras cuz I was on th floor recording the Hagan's cumshot, so barely caught Silas nutting after his hot creampie!\nIf you have been aching to see Hagan fuck a dude...it's time to join!!!",
  "models": [
    {
      "name": "Silas",
      "person_id": 3229
    },
    {
      "name": "Hagan",
      "person_id": 3341
    }
  ],
  "release_date": "2010-02-05",
  "scene_id": 1154,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Ethnicity - Mixed Heritage"
  ],
  "title": "Hagan & Silas - RAW"
}