{
  "collections": [
    "ChaosMen"
  ],
  "description": "Chad was one nervous guy!\nNot so much that a guy like me was sucking his cock, but if you watched the outtake from last week's solo, you realized he busted a bit too soon. He was worried that he would cum too soon.\nChad never uses lube and after giving him some half-way through the solo, he basically lost control.\nI rely heavily on lube and spit to keep the guys going for the 10-12 minutes these oral videos last. Chad suddenly had a phobia of using lube.\nSo his main worry was he was gonna bust too soon and ruin the film and his chance of getting paid.\nI also wanted to get some ass shots of him, since during the solo, he nutted before he got to show off his ass for you hardcore Tops that don't really care so much about their cocks.\nBetween moving cameras around, he started to relax and was saying things like, \"It feels good, I but actually don't think I am gonna even get close or be able to cum.\"\nWell, I didn't think it was gonna be a problem. Not because I suck cock professionally (yeah...I guess I do!), but because I was taking it easy on him.\nIf you watch the beginning, he is all tense though I am actually pretty gentle on him. Anytime I felt his dick pulsate a bit too much, I eased up. So yeah, he wasn't feeling like he was gonna nut. I wasn't even going to try to Edge him!\nAfter licking his AMAZING ass (seriously, his tush is awesome!), I flipped him on over and despite him saying \"no way\" he was gonna cum, I ramped it up and went full throttle.\nThe look on his face is subtle, but it's kind of funny to see his \"Whoa Reaction\" as he nuts after only a few minutes of putting my mind to it.\nNot sure he will be back to do more. He was dead set against any penetration. But ya never know with these guys.",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Chad",
      "person_id": 3365
    }
  ],
  "release_date": "2010-04-07",
  "scene_id": 1157,
  "tags": [
    "Build - Mature",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Pubic Hair - Intact",
    "Hair - Blond"
  ],
  "title": "Bryan & Chad - Serviced"
}