{
  "collections": [
    "ChaosMen"
  ],
  "description": "I can't believe how far along Nathaniel has come.\nFrom, \"I only want to get my dick sucked by a dude if I can't see him\" to full-on fucking and sucking.\nOnce again I paired him with a guy who wasn't gonna split him in two, but I think in the future I might put him with a dude who is as big as he is. That way he can see what he has been dishing out!\nAnd Sebastian surprises me with the ease he takes the guys' cocks. He stays hard, and never complains, but I don't think it's ever gonna make him cum.\nI think Nathaniel was a bit surprised how little fuss Sebastian made. Earlier Nathaniel had jumped off of Sebastian's cock on the first insert, while Sebastian took his cock with one gentle slide.\nLittle did I know that Nathaniel had prepped for the shoot using a butt plug the size of one's pinkie, while I had warned Sebastian that Nathaniel was packin', so he used a giant dildo just before we got started.\nDespite their size difference, the two weren't clumsy. Nathaniel really worked on his cock-sucking skills and fucked Sebastian in a standing position that left a giant gooey cream pie all over Sebastian's asshole - all while shoving in his cum-soaked cock.\nSebastian was close but took a minute or two to ramp up, and I do believe that is the biggest load I have seen out of him!\nI think it's time to buy another bed spread!",
  "models": [
    {
      "name": "Sebastian",
      "person_id": 3283
    },
    {
      "name": "Nathaniel",
      "person_id": 3258
    }
  ],
  "release_date": "2010-04-30",
  "scene_id": 1167,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck"
  ],
  "title": "Nathaniel & Sebastian - RAW"
}