{
  "collections": [
    "ChaosMen"
  ],
  "description": "Could these two look anymore perfect for each other? They look like military brothers, or heck, big and little brothers.\nThis was Bastian's first time full-on with a dude, well, other than the Edge video and that was very brief and quick, and mostly one-sided.\nHe blanched when I asked him if he would suck Ransom's cock. So I just told him Ransom would make it available and if he wanted to reach out and jerk him, then go for it.\nI really shot Ransom blowing him in real time as Ransom tried to get Bastian hard. Once he got him going, Bastian's attitude changes from passive to seeking out Ransom's dick.\nAnd eventually, he tentatively, then eagerly starts sucking Ransom off. I love it when they get turned on enough to suck dick back!\nAfter a little 69 action, Bastian starts fucking Ransom, who has actually been eager to get fucked. With most models, the Top goes soft and we have to stop and get hard. \"CUT!\"\nBut for some reason with Ransom, the Top stays hard. However, but Ransom is always jumping off of the cock 'cuz he is about to cum. It's the opposite of what I am usually dealing with.\nThe cumshots in this video are perfect. Bastian fucks the cum out of Ransom, who shoots himself in the face.\nBastian pulls out, ramps up and glazes Ransom's hole with tons of cum!\nIf you like your boys military-esque, with a touch of cream pie, you will love this video!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Bastian",
      "person_id": 3361
    }
  ],
  "release_date": "2010-05-14",
  "scene_id": 1170,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Red",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Bastian & Ransom - RAW"
}