{
  "collections": [
    "ChaosMen"
  ],
  "description": "There is a certain amount of irony to this video that isn't readily apparent...until the end.\nOriginally we set this up as a flip-flop video, but AJ had a GIANT purple bruise in between his ask cheeks (can't decide if someone literally kicked his ass or his surfboard nailed him) but it was enough for me to try to shoot around it.\nPlus, AJ is still new to bottoming and was shocked at how big Eli's cock got. He was glad his ass was bruised and not gonna be split in two!\nDoesn't really matter to Eli. He is a great bottom, though it seems a waste of good meat not to see it in action.\nThe irony portion is before we got started, I suggested that after AJ sucks Eli's cock he should stand up and while taking down his pants, give Eli a big kiss.\nKiss a dude?!?!?! I forgot he hadn't done that and it was apparently beyond his limit.\nWell, he had missed his flight and I was like, \"You messed up getting here - the least you can do is kiss him for 15 seconds!\"\nSo when you watch the transition from them sucking each other, there is just this little peck that is practically non-existent. Grrr..\nWell, then we started discussing the cumshot and he says he can take a facial.\nWhat??!?! You won't kiss a guy but you will let him nut on your face?\nAnd I didn't want any pinched closed-mouth facial either. I wanted it to look good.\nHe insisted he could do it. Eli is super easy to ramp up and cum and AJ is a little tight mouthed, but he opens his mouth eventually and a little cum bubbles out.\nSeriously, he looked like a glazed donut!\nSo how can he go from not wanting to kiss a guy's lips to taking his load on his face and mouth?\nOh yeah, and there is a really hot cream-pie action as AJ unloads into Eli's hole!",
  "models": [
    {
      "name": "AJ",
      "person_id": 3349
    },
    {
      "name": "Eli Hunter",
      "person_id": 3340
    }
  ],
  "release_date": "2010-06-04",
  "scene_id": 1174,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "AJ & Eli - RAW"
}