{
  "collections": [
    "ChaosMen"
  ],
  "description": "Talk about a trigger-happy guy! Tad was nervous about doing the blow job.\nClearly he is a bit uncomfortable to start with, but I think that discomfort turns into more of, \"Stop I'm going to cum!\"\nI asked him if he was able to cum from a blow job, and he said sure. If you have been playing along with these Serviced videos, I am always worried about the plan of attack with an uncut guy.\nWell, I must have been hitting on the right notes. Twice we had to stop.\nThe second time, I pull off quickly, and there is this beautiful shot of his dick twitching and standing at complete attention. I couldn't help myself and gave it a little lick, and out spurts a glob of cum.\nShit! Did I make him cum? I decided I better jerk on it and make him cum all the way rather than leave him squirting with half an orgasm.\nBut it was false alarm, he didn't cum. Phew!\nI had it in the back of my mind that did actually did cum, just one squirt, and his dick would go limp. But it stayed hard. So I flipped him on over to see if he would enjoy having his ass rimmed.\nI had to be careful playing with his cock while I did it, 'cuz he was twitching while I did that.\nI dunno, I feel like I have had a fair number of stoic Serviced guys, so it was nice change to work with someone so easily turned on.\nKind of a short video, 'cuz as soon as I flip him back over and start on his cock full tilt, he just unloads as easy as can be.\nI know I have some cock-sucking skills, but these guys that cum so fast make me wonder if something on a deeper level is going on...or they just have had terrible blow jobs all their lives!",
  "models": [
    {
      "name": "Tad",
      "person_id": 3370
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2010-05-12",
  "scene_id": 1178,
  "tags": [
    "Build - Mature",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Chest - Smooth/Trimmed",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Bryan & Tad - Serviced"
}