{
  "collections": [
    "ChaosMen"
  ],
  "description": "I think Nash and Taylor both have dirty talking down, and I knew their energy would be awesome together. They both like to get down and dirty!\nSo I wanted to get them down on the ground. See two muscle boys going at it!\nI tossed down some mats and a bit of gym equipment and let them have it.\nYeah, I know, not very gym-like, but our main goal was to use the floor AND finally get Taylor fucked.\nCan't say by Taylor's shouting that he took to it like I duck to water, but his cherry was officially popped!\nIt took a bit, and his hand is slammed against Nash's quad to not go so deep. At first I think Nash went really slow and was trying to go easy on him, but after a while I think he was thinking, \"Fuck, I took this guy's giant dick, he can take mine!\"\nTaylor actually wants to be a versatile player and commented maybe he better get a dildo to practice on at home. (Homework!)\nFor the cumshot, we used the little sex wedge thingy I bought (Geez, that's an expensive piece of foam!) and it worked beautifully. With them down on the ground, you can really see Taylor's fat cock going in and out of Nash, all the while Taylor is encouraging him to cum for him. Hot, Hot, HOT!\nTaylor ramps up and finds himself a little off center for a cream pie, but he recovers and wipes and plunges his cum-soaked cock into Nash.\nTruly, one of the best matches on the site!",
  "models": [
    {
      "name": "Taylor",
      "person_id": 3343
    },
    {
      "name": "Nash",
      "person_id": 3315
    }
  ],
  "release_date": "2010-06-11",
  "scene_id": 1183,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Nash & Taylor - RAW"
}