{
  "collections": [
    "ChaosMen"
  ],
  "description": "It's funny how I can't seem to guess how these guys will react to their first guy-on-guy thing, even if it's only to get their dick sucked.\nOrlando told me he wanted to move on to doing full-on scenes right away, but as usual, I like to see how they do with straight porn playing, and minimal contact with another guy first.\nHe got a little nervous but spent a fair amount of time \"in the moment\" rather than watching the TV. He just didn't \"go for it\" like I thought he might.\nRansom sure has been going at the cock-sucking duties with gusto, and I gotta give him props - he really kept Orlando going for most of the video.\nNot only that, Ransom finally did some lite rimming, as well as an excellent job showcasing Orlando's ass and turning him on.\nI also wanted to get Ransom in a position to see if Orlando would play with Ransom's cock. Ransom lays sideways but Orlando only laid his hand on his waist. Damn.\nSo I am thinking it's better that we stepped Orlando through a Serviced video first, because if he wasn't able to even rub Ransom's cock through his underwear, he was for sure not ready to fuck or get fucked.\nHaving said all that, Orlando DID engage Ransom. He watched himself get sucked off and wasn't afraid to reach down and touch Ransom.\nI am pretty happy with the \"baby step\" that Orlando took. I think he can take on more for sure!\nHe sure is adorable!",
  "models": [
    {
      "name": "Orlando",
      "person_id": 3373
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2010-06-09",
  "scene_id": 1189,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Orlando & Ransom - Serviced"
}