{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would toss a sex film at ya this Wednesday instead of an oral video. My knees need a break!\nIf I remember correctly, AJ worked with Eli last. AJ topped the entire time. Mainly 'cuz he was being a bit of a baby about bottoming but also 'cuz he had a tennis ball-sized bruise between his legs.\nNow Ransom, we know he loves to get fucked. It's hard for him to NOT cum while being fucked. But I also know he can top really good, and he also knows the sweet spot to nail a guy's prostate.\nSo AJ thought he was going to top this entire video but as Ransom road his cock, he saw how hard Ransom was. He thought maybe he could take it. Clearly Ransom was loving getting fucked, so why shouldn't he?\nI really need to leave the cameras rolling between takes. It was so funny to watch AJ admit he was loving getting fucked. We had to stop once because he said he was gonna pee or cum, which cracked both Ransom and I up.\nAJ was determined to cum while being fucked, and though it sure looks like it isn't going to happen, AJ kept telling Ransom where to hit his sweet spot. \"Not so deep, slower, no faster...no...right there!\"\nI have seen a lot of porn and usually when it takes a while for the bottom to cum, the top usually becomes droopy. But Ransom stayed rock hard and fucks him after AJ cums, pulls out and then busts all over AJ's hole -shoving his cum-covered cock in, breeding AJ's ass.\nRansom is normally not much of a talker, but listening to him tell AJ to take his load is VERY hot!\nAs for AJ, I think he has no fear of bottoming and is now looking forward to the extra intensity of cumming while being fucked!",
  "models": [
    {
      "name": "AJ",
      "person_id": 3349
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2010-06-23",
  "scene_id": 1191,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "AJ & Ransom - RAW"
}