{
  "collections": [
    "ChaosMen"
  ],
  "description": "It took a while, but Gennaro kept circling the studio (figuratively) with the idea of getting his dick sucked.\nHe thought he could do it, if he didn't have to see the dude. An EDGE video was out of the question 'cuz there was no way he was going to be able to do the fantasy sequences.\nThe the idea of being blindfolded and tied-up did seem appealing to him. He has fantasized about a girl doing it to him- hence the rather loud porn playing, sorry about the loud girl in the video, but I thought it would help him.\nI am not overly fond of the blindfolded Serviced video. I dunno, it implies a little shame or maybe even not having the guts to fully go through with it.\nIf a straight guy can't see the other dude, I have always relied on the Glory Hole, now no longer available. I have GOT to scout a new one...mmmmm..Research!\nSo I went for doing some very lite bondage.\nThis is a rather long Serviced video. More typical of the length of a sex film. But I just felt like I had to leave it all in, but even then I did a fade to shorten it and keep it under 20 minutes.\nThe tying up, the getting him hard, the rimming..typical fare for a Serviced video.\nBut half-way through the video, something shifts in Gennaro, so you kind of have to watch the first half till after the rimming, and then wow, he really gets into it! It's like night and day.\nThere is one portion where he ask me to slow down, cuz he is gonna cum, and I was like, \"Uh, you're supposed to cum now.\" But he was more keen on making it last, and I don't think that has ever happened in one of these videos.\nFinally, I decided talking dirty would put him over the top, and you can literally see his cock get bigger and it's just very hot to seem him get turned on by a dude wanting to eat his cum, and not the annoying girl moaning and groaning on the video.\nThis video was a long time coming, and it was worth the wait!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Gennaro",
      "person_id": 3368
    }
  ],
  "release_date": "2010-03-10",
  "scene_id": 1203,
  "tags": [
    "Build - Mature",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Bryan & Gennaro - Serviced"
}