{
  "collections": [
    "ChaosMen"
  ],
  "description": "Lansing's first sex video was with Vance, and I have always wanted to do another one with them, sans the rubber. I thought a re-match would be great but wanted to add a twist to it- that twist being Van!\nI have a bottle-neck of too many models needing work, and mixing & matching is getting tougher as some of the guys won't bottom. Top heavy as usual. This time though, I was a little bottom heavy.\nLansing and Van have primarily bottomed, so I thought they would look good together being fucked. So why not combine these three taste treats together.\nVance, being the veteran, takes charge and for most of the shoot Van is Lansing and Vance's bottom boy. I get such a kick out of seeing Lansing top. He's really pretty good, taking nice long strokes so you can see his long veiny shaft dip in and out.\nAfter Vance and Lansing finish fucking Van, Lansing gets on his back to get fucked by Vance. Van bends down and sucks on his cock, and the look on Lansing's face as he tries to not cum is fun to watch.\nTypical of TagTeam videos, it runs a little long, so I basically had everyone cum at different times to keep it under 24 minutes.\nContinuity is a bit off as I just edit them together, but you have to catch Lansing's cum shot!\nIt shoots out of him like a laser beam, and you can see Lansing trying to stifle a laugh, as he must have shot five or six feet!",
  "models": [
    {
      "name": "Lansing",
      "person_id": 3274
    },
    {
      "name": "Van",
      "person_id": 3347
    },
    {
      "name": "Vance",
      "person_id": 3281
    }
  ],
  "release_date": "2010-06-25",
  "scene_id": 1204,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer"
  ],
  "title": "Lansing & Van & Vance - TagTeam RAW"
}