{
  "collections": [
    "ChaosMen"
  ],
  "description": "Let's say just say it. Gerin is a Bottom with a capital B. Sweet!\nI am so happy to have this little tyke doing scenes for me. He is more than happy to get as big of cock in him as he can, so I thought I would start off with the biggest one I had available. Gerin said Double Penetration wouldn't be out of the question too, so I am hoping to make that finally happen.\nSome of the gay guys that work for me struggle to do a scene with a straight guy. They realize quickly that the dude they are working with IS really straight, and though they can get into having sex, and put full energy into it, there really there isn't any true \"magic\" (usually) going happen. Yes, I get some great energy between them, but for some reason, the gay guys struggle when they learn that the straight guys aren't really going to be \"into them\" and we depend on straight video playing for them to recharge.\nGavin and Elliott are perfect examples of gay guys who don't care what the straight guys are like. They get off to just working with a straight guy, and don't take anything personally.\nI had Gerin all prepped emotionally for working with a guy that might not be able to toss sexual energy back at him.\nHagan, as we have learned, is very quiet, but his dick always had, but he is definitely a \"stealth performer.\" Even the girls he is with complain he doesn't even breathe.\nI think I figured out why he is like this. His cock is so big, that he can't properly fuck. He has leaned to to cum with very little motion. So when is IS actually fucking he is literally trying to not cum the entire time.\nGerin easily takes Hagan's monster cock, and I think Hagan 'let go' a little when he realized this little guy half his size was going to be able to really FUCK. It's fun to watch Gerin really pound back against Hagan, with wild abandon.\nMy favorite part of this video is when Gerin rides Hagan's cock in reverse cowboy position. We really get to see Hagan's cock slide in and out of Gerin's hungry hole.\nWe got a great cumshot out of Gerin as the always-hard Hagan pummels Gerin till he nuts.\nHagan nuts all over Gerin's ass, plunging his cum-soaked cock in and out. His aim was a little off, but it turns out to be an awesome creampie ending!",
  "models": [
    {
      "name": "Gerin",
      "person_id": 3369
    },
    {
      "name": "Hagan",
      "person_id": 3341
    }
  ],
  "release_date": "2010-05-28",
  "scene_id": 1208,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Ethnicity - Mixed Heritage"
  ],
  "title": "Gerin & Hagan - RAW"
}