{
  "collections": [
    "ChaosMen"
  ],
  "description": "I wasn't sure if Rusty was going to come back and do more. He took a month to think about it, and was very nervous about having his dick sucked by a guy.\nI had forgotten how big his cock was. He is fairly tall at 6'1\", so he is a big guy and his dick just looks kinda big on his frame. But when you get up close to it, you realize it takes two hands (or more) to grab it, and my hands never wrapped all the way around it.\nFor a guy so timid to get his dick sucked, he really got off to watching himself get sucked off. He rarely looks at the TV, and in fact is kind of watching the whole thing on one of the camera LCDs.\nFor the solo, he was very reluctant to show off his ass. In this video I wanted to really get him loosened up to the idea. He is grinning the whole time I am playing with it. I did my best to ease him into an ass eating, but just felt that I couldn't push that limit too far.\nThe irony, of course, is he got really hard during that portion, so something was working on him.\nMaking him nut was a little challenging as I worked up a sweat trying to cover all the real estate he has down there. I finally had to go with his jerking motion and he spills a major load that dumps into his now fully-grown-out pubes.\nI dunno, I think Rusty liked it, and was surprised he stayed hard and actually nutted from it. As of writing this, I am not sure he will be back for more, but he did seem to have a moment where he thought he could do more.",
  "models": [
    {
      "name": "Rusty",
      "person_id": 3375
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2010-06-16",
  "scene_id": 1210,
  "tags": [
    "Build - Mature",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Bryan & Rusty - Serviced"
}