{
  "collections": [
    "ChaosMen"
  ],
  "description": "How about a mid-week sexcapade?!\nDante has been pretty determined to be a Top in these videos. He is a very dominate guy in Real Life, but each time he goes to fuck, his dick just curls up and doesn't want to come up and play.\nOn Top of that (pun intended) he is actually a great bottom. He started off with some pretty big cocks, and despite the super-sized dicks, he actually finds it easy to bottom, and dare I say, it feels good.\nBut he just wants to be in charge. (I haven't told him he can be a bossy bottom if he wants!)\nAfter a little oral and a small attempt at docking their cocks, Clay sits on Dante's dick. But it just never is quite right.\nFinally Clay is like, \"Fuck this shit, I'm gonna fuck you.\" And so he does, with great skill!\nClay tries to deliver a creampie, but he is not known for giant loads, and goes limp pretty quick.\nTo make up for it, and cuz he reads what fans say about him, he thought he could do a full-on open-mouthed facial. I told him we would try it as long as he didn't make a face like someone put a lemon in his mouth.\nHe was way ahead of me, because he agreed he hated when girls looked disgusted when they get a facial.\nSure enough, Dante delivers a massive load, and Clay goes to town, cum gurgling everywhere and sucking the last bits of cum out of Dante's cock.\nTruly one of the best facials on the site!",
  "models": [
    {
      "name": "Dante",
      "person_id": 3355
    },
    {
      "name": "Clay",
      "person_id": 3622
    }
  ],
  "release_date": "2010-07-07",
  "scene_id": 1212,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Clay & Dante - RAW"
}