{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought it was time for Hayden to get properly fucked.\nHe's got a great cock, and he is an awesome Top, but he is always kind of talking up about how tough he is.\nWe went pretty gentle with him with Jayce, but of course Nash knows how to give as good as he gets.\nI will be danged if Hayden's dick didn't shrink either, and I think he discovered that \"zone\" - the fine line between pleasure and pain.\nThey both start of doing some great cocksucking. Both have come such a long way, and it is awesome to see Hayden stay hard while sucking a dude's dick. Something he swore he would never get past.\nNash fucks Hayden first, and I think that is when he had the epiphany about getting fucked. Between takes he admitted that it could easily make him cum. Sweet!\nNash eventually climbs on top and ride's Hayden's cock, like the pro he is.\nFor the cumshot, I was determined to have Hayden cum while being fucked. I didn't get my cameras just right to see Nash's cock, but rest assured, Hayden came quite easily while being fucked.\nNash shoots all over Hayden's hole, and though you would be hard pressed to call it a creampie shot, Nash certainly was trying his \"hardest to press\" himself inside after he came.\nAs usual, anytime Nash is involved, there is lots of great energy in this video!",
  "models": [
    {
      "name": "Nash",
      "person_id": 3315
    },
    {
      "name": "Hayden",
      "person_id": 3330
    }
  ],
  "release_date": "2010-07-09",
  "scene_id": 1213,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Chest - Hairy/Hair"
  ],
  "title": "Hayden & Nash - RAW"
}