{
  "collections": [
    "ChaosMen"
  ],
  "description": "In the coming months, a flow of Edge videos will be coming online. I finally felt creative again, and with Ransom helping out, it is allowing me to do more- well maybe not do more, but get some nicer angle and film a little more interesting.\nSo to kick off the upcoming releases (remember I dish them out slowly so they are special), I thought I would release this video I did with Silas.\nOne of the best things about Silas (other than his Italian good looks, flawless skin, always hard cock, and perfect ass that begs to be fucked) is there is a REALLY raunchy boy hidden inside of him.\nWhich is at odds with how he is in real life. He is a very quiet sort, kinda of shy and reserved. But he has a lot of dark fantasies- from kink, bondage, piss play...you get the idea.\nI thought we would explore some of those in this Edge video, that originally aired as a bonus scene on one of the Edge DVDs. I had been getting request to see this one online, so I thought it was time to air it, and the timing with newer ones was excellent.\nThe piss play certainly isn't for everyone, but it's fairly 'vanilla' as far as this kind of stuff goes. Though if it bothers you in anyway, you might want to skip this Edge video.\nAnyway, hope you enjoy this special airing of of Silas's time in the Edge Chair!\nMore to cum as they say. And Stay Tuned until, I dont know, until January The next 3-4 months have some new and different things going on now that I feel a bit more....dirty!\nThe Summer is ending extra hot!",
  "models": [
    {
      "name": "Silas",
      "person_id": 3229
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2010-08-18",
  "scene_id": 1214,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Pubic Hair - Trimmed",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Bryan & Silas - Edge"
}