{
  "collections": [
    "ChaosMen"
  ],
  "description": "For the first time ever, Ransom got shy with a model, and I think it was 'cuz he really thought Vander was hot. Ransom is mostly straight, but every now and then a dude attracts him, and Vander was it!\nThere is just something about Vander anyway. He's calm, confident, nicely built, big cock, and as I said, just smells great. But something that says raw sex.\nRansom keyed into all of these things the minute he walked into the room that Vander was waiting for him in. I left in some of his nervousness at the beginning of the film.\nBut once his clothes are off, all bets were off and this seriously turns into a feeding frenzy.\nVander is very verbal, and I don't think I have ever seen Ransom suck a cock so eagerly...or eat ass!\nAnd watch Vander, his eyes never leave Ransom's body, totally drinking him in and worshiping his body. Though Vander was a bit wobbly at times, we finally got what he needed, a cock in his face, compliments of a very turned on Ransom.\nKnowing that Vander likes to fuck ass, Ransom then sits practically right on Vander's face, toying with him. Vander gets even harder having a hole to play with!\nAs I said, Ransom really went to town rimming Vander, rubbing his scent all over himself.\nVander from the get go said he doesn't usually cum from blow jobs, and when a gay guy says that, I tend to believe it. So I knew we were gonna skip out on having Ransom try.\nWe get Ransom to feed him his cock and that gets him to blow his load easily. Ransom didn't take to long to play catch-up and adds his load to Vander's hairy pecs.\nI gotta say, this is one of the best Serviced videos! Finally some competition! ;-) Maybe I can retire my kneepads?!\nThis video is just plain old-fashioned hot chemistry!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2010-07-14",
  "scene_id": 1216,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer",
    "X-Tras - Piercings"
  ],
  "title": "Ransom & Vander - Serviced"
}