{
  "collections": [
    "ChaosMen"
  ],
  "description": "What can I say?\nThis video has something for everyone..ok..most everyone.\nJasper was a little freaked about the size of Eli's cock, so I told him that Eli would take a toy to him to loosen him up.\nBut first they start off with some Grade A cock sucking. Jasper doesn't get tears in his eyes from gagging like he used to, and he sure kept Eli hard. Eli returns the favor and I just love how his dick doesn't even wilt while giving head.\nThen it was finally Jasper's turn to bottom up and to be honest, Jasper was saying the toy hurt more than a cock. So Eli quickly moves into position, and sure enough, Eli's over sized tool was no problem, he had Jasper rolling his eyes back into his head with bliss.\nJasper was kind of psyched because he also was going to be able to top this time out. He felt confident he could stay hard, and when he found out Eli enjoyed it (pay attention as Eli's cock gets harder the longer Jasper fucks him!) he really found he wanted to fuck Eli so it felt good for him.\nThe ending is pretty awesome with Eli cumming all over Jasper's hole and then shoving his cum covered cock in. Pie with cream?\nFor Jasper, we just put Eli's cock in his mouth (It's a quick take to his cumshot as the film was getting long at 26 minute!). Eli, ever the showman, laps up Jasper's jizz, and then cleans his cock off, then proceeds to swap cum kisses.\nWhat might normally be kind of a boring ending where the bottom just jerks off, turns into a very naughty ending!",
  "models": [
    {
      "name": "Eli Hunter",
      "person_id": 3340
    },
    {
      "name": "Jasper",
      "person_id": 7435
    }
  ],
  "release_date": "2010-07-16",
  "scene_id": 1219,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Eli Hunter & Jasper - RAW"
}