{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ok, so I got a little overconfident with how much hole abuse Antonio could take.\nHonestly, I thought these two would be a great match-up. Antonio likes to get fucked, and Taylor loves to have his cock worshiped. Perfect!\nThey start off kissing and we get a little frottage action as Taylor rubs his cock all over Antonio's. Taylor takes the lead giving Antonio head, but soon after climbs on top and basically does push-ups into Antonio's mouth.\nTaylor gets him doggy style and properly fucks Antonio's face. Very hot and you see just how big Taylor's cock gets.\nThen, unfortunately for Antonio, he gets to FEEL how big Taylor's cock gets!\nI dunno what was going on, but Antonio was running away from Taylor's stick for the first part of the video. Is it pleasure or pain? (I say pain!) The funny thing is, Taylor just keeps at it, not letting him slide away!\nFinally we switch to the couch and I let Antonio ride Taylor's cock so he can monitor the depth. Taylor can't stay hard with a girl when he is laying down, (he really is pretty dominate!) so I was hoping the sitting position wasn't too much like laying down.\nTurned out fine and we really get to see Antonio split in two.\nFinally, Taylor fucks him doggy-style, showing no mercy. He unloads all over Antonio's asshole, fucking him with his cum.\nA quick cut to Antonio busting his nut. Taylor instinctively took some of Antonio's cum and started spreading it around Antonio's mouth..well..chin.\nHe was not sure if Antonio would go for it, and you can tell because he is a bit tentative about doing it.\nFinally realizing Antonio wasn't gonna put up too much of a fuss, Taylor bends over and they share a cum soaked kiss! Gooey stickiness everywhere!\nSo extra props to Taylor for not only delivering a great cumshot, but for pushing the limits of Antonio's cumshot!",
  "models": [
    {
      "name": "Antonio",
      "person_id": 3360
    },
    {
      "name": "Taylor",
      "person_id": 3343
    }
  ],
  "release_date": "2010-07-23",
  "scene_id": 1220,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Antonio & Taylor - RAW"
}