{
  "collections": [
    "ChaosMen"
  ],
  "description": "I actually didn't have much information about Brayden before I met with him.\nAll I knew was that he is a Power Bottom. I am always in need of guys willing to take the straight guys through their first time Topping, so to the front of the line he went, not many questions asked.\nAs usual, I wanted to work with him one-on-one and get a solo out of him first. You know, check out his personality and and see what his energy was like.\nOn the ride to the studio, come to find out, he has done plenty of work so was not going to be a nervous first-timer.\nThis is where we get sidetracked.\nIt is actually quite challenging to make sure there is an oral video each and every week, and I knew I was running low.\nSo I dangled a bit more money and I told Brayden ONLY if he wanted to to reach out and let me suck his dick during the filming.\nTo be honest, I think Brayden was relieved to not have to do a solo and was pleased to not only be getting paid more, but getting his dick sucked.\nSo that's how Brayden's solo turned into a Serviced video. It wasn't exactly unplanned like saaaay- Lansing or Shaun.\nBut the choice was up to him up till the last moment, so forgive some of the lighting as I just kind of ran with the moment and wasn't exactly setup to do Serviced video.",
  "models": [
    {
      "name": "Brayden Jaymes",
      "person_id": 3387
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2010-08-04",
  "scene_id": 1240,
  "tags": [
    "Theme - Solo",
    "Build - Lean",
    "Build - Mature",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Brayden Jaymes & Bryan - Serviced"
}