{
  "collections": [
    "ChaosMen"
  ],
  "description": "The night before this shoot I told Ransom to save a load for his Serviced scene with Rory. From the vibe I got from Rory, he was going to be more than happy to have a dick to suck while being Serviced.\nI love it when these videos naturally turn into a suckfest. Ransom does an awesome job handling Rory's big uncut cock, and then makes his own dick accessible.\nThree minutes in, and Rory was sucking dick like a pro. Rory says he is on the Bi side, but from talking to him, I think he is getting more and more interested in dudes. Its kind of hot when these Mid 20's guys have been playing \"undercover straight\" and just tend to have the masculine traits as second nature. Being in the Service, I think he tended to butch it up.\nRansom continues to step up his game in wanting to do these blow job videos. Once again, I think he was truly turned on by this military dude. He eagerly eats his ass, and fingers his hole.\nAfter that, Ransom was keen on getting his dick sucked properly, and I love seeing Rory's bubble but flexing while he hungrily sucks Ransom's cock.\nI knew Rory was gonna have to really beat his meat hard to nut, so we let him have at it. And after me giving Ransom a hard time about claiming to have actually let one of the models cum in his mouth (I sure couldn't see it!) he was determined to take a load properly.\nRory comes all over his lips then dumps the rest in his mouth. Ransom holds it there then spits it out and uses it to lubricate his dick. Very VERY hot!\nHe stands up, cum still dripping off his chin, then unloads all over Rory's cock and chest.\nIf you don't like the one-sided-ness of a standard Serviced video, this one will please you as both guys eagerly try to get the other off!",
  "models": [
    {
      "name": "Rory",
      "person_id": 3389
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2010-08-25",
  "scene_id": 1242,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Ransom & Rory - Serviced"
}