{
  "collections": [
    "ChaosMen"
  ],
  "description": "Rory was formerly in the Air Force, and wasn't liking the boredom of it all. When he was offered a chance to get out early, he jumped on it. As of this airing he has only been out a month or so.\nSo he still has that military tang to him. Very polite, and \"Yes sir No Sir.\"\nRory crashed his motorcycle and took a good knock to his head. Apparently the insurance will repair everything, but re-aligning his one eye. So believe it or not, his quest to do porn is about getting surgery to correct his eye. I love it when the guys take their money and use it for self improvement, like Nash and his braces. Which will soon be off just in time for him to have done so many movies you will be tired of seeing him. (I hope not 'cuz he is awesome to work with, and I want to see him take a facial with his perfect teeth!)\nRory is also exploring his bi side. He's had full on sex with guys, top and bottom, but prefers to top. He's kind of passive though, so not sure if that makes him a Lazy Top, but hopefully we will see him in action soon.\nFor the solo he says he has been dating mostly women, but I played gay porn for him, which he really liked. I can tell already he has a fondness for little tight twinks, and I have in mind a few guys he could fuck. So I think he has already has developed a \"type\" of guy he likes, so I think he might be on his way to the gay side.\nI dunno. Ransom spends most of his free time with women, but if a dude is involved (and money!) he's happily down to play with him.\nHmmm..Ransom ought to look real good with Rory. Maybe I will have them do a blow job video together?\nI am actually really interested in where we go with Rory. See if he broadens his boundaries, do his self-improvement project, and also see how he handles civilian life.",
  "models": [
    {
      "name": "Rory",
      "person_id": 3389
    }
  ],
  "release_date": "2010-08-16",
  "scene_id": 1244,
  "tags": [
    "Theme - Solo",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Rory - Solo"
}