{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video has a small tribute at the end to\nRoss Mathews and his segment he did with the Crocodile Hunter\n.\nYou know I already love the way Clay just dives in to any scene he is in. As reluctant as he was to bottom, he now doesn't flinch when I tell him his partner is super hung.\nI told Clay that Vander's dick seemed a bit larger than normal, and like Ross, he could yell out his safeword, 'PINEAPPLE!\" if it got to be too much.\nWe watched the clip before the video and Clay was yelling, \"PINEAPPLE!\" every chance he could.\nTurns out though, Clay took it, well, like a man though. Nothing seems to phase him anymore.\nMaybe a full on facial would have him screaming Pineapple?\nFor those of you who like the way a dude smells, that ever so slight ripeness, well, Clay and Vander both have that going on, and Vander in particular wouldn't mind licking a musky armpit given half the chance.\nI knew there would be chemistry in the air. Literally!\nVander didn't lick pit this time, but knew he would respond to Clay's great body smell, and that is exactly what happened.\nIt's fun to watch Vander. He is mesmerized by his scene partners. He Connects with them, drinks them in visually, orally - and nasally!\nThis dude can fuck too. And though he told me he was mostly a top, he can take Clay's substantial cock while his own dick gets harder for it.\nc\nClay delivers a nice load all over Vander's hole, but the fun part is watching Clay take a facial, and a the little bit of comedy at the end. There is even a wee tiny outtake at the end to watch for.\nAnyway, I am really looking forward to putting Vander with all kinds of guy. He is so fucking sexy and into it, that you'll wish you were there!",
  "models": [
    {
      "name": "Clay",
      "person_id": 3622
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2010-09-03",
  "scene_id": 1246,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Long",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Video - OutTake",
    "X-Tras - Piercings"
  ],
  "title": "Clay & Vander - RAW"
}