{
  "collections": [
    "ChaosMen"
  ],
  "description": "I'm not sure why I had my doubts about putting AJ with Gerin.\nAfter all, AJ is the type of guy who gets too drunk and ends up making out with everyone around him, guys included. So he is definitely not in the 100% straight category.\nI had him figured for being into big buff guys that could lift him up and toss him around, like the scene he did with Nash.\nTurns out he is a dominate little scamp, and their skin tone and matching size really looked great together! And their energy was awesome!\nAJ LOVED having someone he could bitch around! Which of course makes Gerin happy. He prefers older guys, another reason I worried this pairing wouldn't go smoothly, but he totally got off to worshiping AJ's cock, and making him hard.\nAnd of course, getting fucked HARD by AJ's over-sized cock.\nThey were clicking so well, we moved over to the couch and took on a challenging position. Gerin road AJ's dick cowboy style without nary a slip out! They just kept fucking and fucking and fucking!\nThough Gerin seems to be one of those bottoms that doesn't seem to get hard while getting fucked, he truly was enjoying himself. We got him in his favorite position, and AJ, like a porn champ, fucks him until Gerin gets hard, and nuts all over the place.\nAJ shoots all over Gerin's hole, dipping in and out, and making Gerin's hole all happy to be cum-soaked! (and not bruised this time!)",
  "models": [
    {
      "name": "AJ",
      "person_id": 3349
    },
    {
      "name": "Gerin",
      "person_id": 3369
    }
  ],
  "release_date": "2010-09-17",
  "scene_id": 1252,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "AJ & Gerin - RAW"
}