{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ransom's been getting a lot of gigs lately. Mostly I am having him help with the oral videos. He's so good at making the guys nut. It gives me a chance to ease up and \"semi-retire.\"\nSo it might seem like there is heck of a lot of Ransom going around, but that's what happens when I start dishing out the Serviced videos to some of the local guys.\nHaving said that, he is so incredibly \"fuckable\" that I just love to get him fucked.\nHe loves it too.\nRansom is one of the few models that that their dick never wavers while being fucked. And if you have been watching him over the years, you know my main issue with him getting fucked, is he is constantly halting the action because getting hammered is going to make him cum too soon - hands free.\nWhich I don't think has ever actually happened.\nIt is kind of funny though. The irony of this issue is, the model who Tops sees how turned on Ransom gets, and they begin to think maaaaybe they are missing out on something.\nThis was a great pairing. Parker KNOWS how to fuck and I think it turned him on seeing Ransom so hard the entire time.\nThe massage table was also a good location, as the two are very different heights. Kind of leveled the playing field.\nParker is getting better and better at sucking dick too. I think he is definitely a pro at it- seems to strike the right note with Ransom anyway.\nAs usual with Ransom, he prefers to be fucked while he cums because it makes the orgasm twice as intense.\nParker unloads a MASSIVE load all over Ransom's hole, and shows no mercy, shoving it in and out.\nWe leave the video with Ransom's asshole spread wide open with a total gloppy mess of cum everywhere.\nThat vision alone will make you want to nut!",
  "models": [
    {
      "name": "Parker",
      "person_id": 3342
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2010-09-10",
  "scene_id": 1253,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Parker & Ransom - RAW"
}