{
  "collections": [
    "ChaosMen"
  ],
  "description": "I was having a tough time convincing Dwight to do more with a guy, so I offered him an Edge video.\nHe said yes, but took his time thinking about what he could do with another dude for the fantasy sequences.\nI've been trying to ease out of cock sucking duties, and since I did his Serviced video, I thought I would finally take a chance and have someone else do the Edging.\nRansom has come a long way with his cock sucking skills. He likes to dominate and be dominated. The thought of having a straight guy at his mercy really turned him on, \"You mean I can do anything to him?\"\nNo of course, but the idea was to push his limits.\nI put Dwight out of his comfort zone right away with some very tight blue undies that fit him snugly. Despite him being a hard and fast baggy-boxer-boy, the undies themselves got him hard. He thought he looked weird in them, but did admit it felt good and his package was really showing. Frankly I think he looked a bit like a bound-up superhero!\nI extended the fantasy sequences, so they are practically a movie in and of themselves. I feel like the oral part gets lost, but I keep getting feedback that you all want more. This is a long Edge video at 27 minutes!\nIt was awesome to be free to film, get a few more angles that I don't normally get, yet retain the 'feel' the other Edge videos have.\nThe star of the show was actually the massage device my barbershop uses. I practiced on myself first (Research!) and sure enough it felt amazing.\nDwight loved it too, and there is even an out take at the end showing just how much he liked it!\nDwight left the studio thinking that maybe doing more might not be as hard as he thought, so who knows, maybe he will be back for more!?\nFor those of you who enjoy my cocksucking skills, there is a Serviced video with him as well, but I figured it had been far too long since I aired an Edge video.",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Dwight",
      "person_id": 3388
    }
  ],
  "release_date": "2010-07-21",
  "scene_id": 1267,
  "tags": [
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Dwight & Ransom - Edge"
}