{
  "collections": [
    "ChaosMen"
  ],
  "description": "Hagan has that perfect body, face, and a huge dick, but I am still trying to get him to really ramp -up and use that giant stick of his like a jack rabbit.\nRansom was next up to take his huge tool, and like a good bottom, he could have taken a pounding. But Hagan slowly fucks him, tentative about hurting his scene partner. It did keep hitting Ransom's spot and we had to cut while we waited for him to NOT cum.\nRansom, a seasoned professional by now, gets his dick sucked by Hagan to start with, and he does get hard for it, but you can catch this little moment where he is like, \"Enough of this, let's get down to some serious dick sucking!!\" He tosses Hagan over and goes after his cock with gusto.\nA little bit of face fucking too. When you see Hagan's cock flop out and lay against Ransom's face, you can see just how big it is. It's almost as long and big as Ransom's face!\nAnyway, Ransom totally gets off to Hagan's body and was truly enjoying the cock up inside him.\nRansom rode Hagan's cock, and his dick just got harder and harder, and I figured why not have him cum that way? Hagan stays hard for the moment, and after Ransom nuts, he pulls out and strokes for a minute then unloads, the cum oozing down his cock.\nNot one to let his load be wasted, he plunges it in to Ransom, who by then was ready for a post-cum nap and eager to de-cramp his legs!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Hagan",
      "person_id": 3341
    }
  ],
  "release_date": "2010-10-01",
  "scene_id": 1268,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Ethnicity - Mixed Heritage"
  ],
  "title": "Hagan & Ransom - RAW"
}