{
  "collections": [
    "ChaosMen"
  ],
  "description": "Dunham seems pretty down the center on the sexuality meter, though I think he leans a bit towards the straight side, as that is the type of porn he requested to watch for his solo and Serviced video.\nBut having said that, this is one of the few videos where the guy is not constantly checking out the TV to keep himself going. Dunham is actually THERE in the moment. So who knows?\nI think he has a dominate side to him and seems happy to have anyone suck his dick, guy or girl.\nThe rimming was also a pleasure for both of us. He tasted great, smelled great, and let out little moans. He stayed rock hard for it, and I think he might be ok with bottoming if the price was right.\nI normally ask the models if they can cum from a blow job before we get started. Dunham was a, \"Nope. Never. Don't think it will ever happen.\" kind of guy.\nI would take this as a challenge, but when the guys have it so set in their head that they can't, then I know I will have to resort to other methods...much like we do when one of the straight guys is doing the Serviced video. Let the dude finish himself off.\nNot to ruin the spontaneity of the video, I did ask him before the shoot if there was something that would help get him over the top. I just didn't want him to jerk-off and feed me his cum. I wanted something more interactive.\nHis response, \"A cock in my mouth.\"\nOk!\nWell, I didn't have any spare models lounging about the studios, so I took that to mean my cock.\nSo when it came time for him to nut, I get my dick sucked. Yes, I know, me in the video again. But I do try to stay out of frame, and DO try to make the movie about the model. I'm just there as a conduit and energizer.\nAnd I am glad he was doing his own stroking, 'cuz I would have torn my rotator cuff trying jack off like he did.\nI talked a little dirty to him, keeping him encouraged, and in all honesty, he gave pretty good head. I was only moments behind him in adding my load to his.\nI guess what I like most about this video is Dunham is Present for the video. He is not in TV Pornland, nor are his eyes closed lost in a happy place. He is There Looking, Watching and Absorbing everything.\nIn other words, I think he was really into it!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Dunham",
      "person_id": 3394
    }
  ],
  "release_date": "2010-10-27",
  "scene_id": 1271,
  "tags": [
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Bryan & Dunham - Serviced"
}