{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would put wholesome looking Orlando with bad boy Hayden.\nI really like Hayden. He is mature, so I can relate to him better than the other models. But Orlando, my friends and I all agree, he is definitely boyfriend material. If only we all were 20 years younger and Orlando was actually gay.\nHe is just so adorable, and every time I am around him I think how much fun it would be to snuggle with him. That smile of his is irrepressible! (Actually Hayden would be fun to play with too!)\nBut Orlando brings out the romantic side out of you, whereas Hayden makes you think dirty thoughts.\nSo we start of this movie with Orlando taking the lead, kissing down Hayden's body and sucking his cock till it is hard. I tossed in some POV-CAM for fun, and I am really like this new feature. It's not too obtrusive, and kind of fun to watch the guys filming each other work their equipment.\nIt's a tricky thing to pull off as I kind of need guys like Hayden who's dick stays solid for a long time. It takes skill to fuck and hold that camera!\nOrlando has pretty much resigned himself to being a bottom, consistently struggling to stay hard when he Tops. But I wanted him to give it one more try and he did great. I still think Bottom works best for him and a couple times his dick got hard while being fucked, so he is now finally enjoying it, rather than just \"taking it.\"\nI have been scoring some really good cum shots lately. Hayden unloads his first squirts all over Orlando's hole, then lets the second half breed him good.\nHayden has become aware that he has filmed a half dozen films and is keen on keeping you interested in him, so actually suggested a facial to show he is pushing his limits for you.\nIt took Orlando some time to ramp up, and Hayden busted another small nut, which actually made Orlando cum. Hmmmmmm....\nNot sure where all of Orlando's cum went, but I know some got in Hayden's mouth as he spits some up and I coaxed Orlando into kissing Hayden with his cum in his mouth.\nHe didn't even flinch.\nJust awesome.",
  "models": [
    {
      "name": "Orlando",
      "person_id": 3373
    },
    {
      "name": "Hayden",
      "person_id": 3330
    }
  ],
  "release_date": "2010-10-15",
  "scene_id": 1272,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Video - POV-CAM"
  ],
  "title": "Hayden & Orlando - RAW"
}