{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jasper is always a great top, and he was wanting to see about just topping in a video.\nSeasoned Pro Brayden loves to bottom, and I thought a little Twink-On-Twink action might be fun.\nBrayden gets Jasper's cock hard by sucking him until his stick is standing straight up. I think Jasper's cock sucking skills have improved, or at least his eyes didn't water fighting off his gag-reflex. He got Brayden hard quickly too.\nBrayden likes to eat ass, so I even though he was the bottom, I am always eager to get some rimming in, so Brayden eats out Jasper's hole.\nJasper than fucks him slow and steady for a couple positions. Brayden eventually asks, \"Can he fuck harder and faster?\"\nJasper is used to working with straight guys and as is typical, they fuck slow and gentle cuz they are worried about hurting the other guy.\nWell, Brayden was having none of that, and asked for a major fucking. Jasper fucks him really Hard and really Fast, making Brayden lose his nut.\nThe bonus of this was Jasper was barely holding back from cumming himself and literally pulls out just in time, (but enough time to ask if he can cum..worried I might miss the shot!). Jasper adds his jizz to Brayden's.\nNicely timed cumshots, and thankfully I had all my cameras aimed at the right places at the right times!",
  "models": [
    {
      "name": "Brayden Jaymes",
      "person_id": 3387
    },
    {
      "name": "Jasper",
      "person_id": 7435
    }
  ],
  "release_date": "2010-12-26",
  "scene_id": 1275,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW"
  ],
  "title": "Brayden Jaymes & Jasper - RAW"
}