{
  "collections": [
    "ChaosMen"
  ],
  "description": "I knew Micah was going to be on for guy-on-guy work, as long as we took it slow.\nSince AJ discovered he can cum while being fucked, and had 'escaped' getting fucked in a previous video, I figured he could do all the work with Micah.\nI like watching Micah get his dick sucked by AJ. AJ does a really good job, and Micah seems to really like to watch having his dick sucked by a dude. He is into it for sure.\nAJ crawls up eventually to give Micah access to his cock, but couldn't bring himself to suck dick. I told him after the shoot, he needed to tackle that limit in the future and he thought he could. They are always more optimistic about doing more after a successful shoot. But he blanched at doing it this time.\nWe start of doggy style, so Micah can see what he is doing, and get the angle right. AJ takes it like a champ too.\nMicah was staying so hard, that I thought we would try fucking in a chair. This is a hard position for these amateurs to take on. Lots of falling out and re-inserting, but eventually they find a really good rhythm and you can see how big Micah's cock is as they both spread AJ's bubble-butt cheeks apart to really showcase the action.\nFinally AJ gets fucked on his back. He felt a couple times that he might be able to cum while being fucked. I'm not entirely sure Micah stayed up inside of him while he came, but AJ's cum shot is EXPLOSIVE. It's completely over the top in volume!\nThere is one great screen capture that shows how he coated his entire torso- even the pillow at his head!\nMicah needed to ramp up after that, but it sure didn't take him long unload all over AJ's hole, and shove it in, breeding him good.\nAJ hams it up for us by rubbing his cum into his stomach and taking a little taste.\nThis is a great pairing, and Micah did an awesome job for his first time fucking a dude!",
  "models": [
    {
      "name": "AJ",
      "person_id": 3349
    },
    {
      "name": "Micah",
      "person_id": 3390
    }
  ],
  "release_date": "2010-11-03",
  "scene_id": 1277,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "AJ & Micah - RAW"
}