{
  "collections": [
    "ChaosMen"
  ],
  "description": "Still trying to draw a performance out of Hagan. His cock is awesome, always hard, beautiful body and face, but is just so tentative and quiet when he fucks. More than a handful of you have noticed this and written. I don't know what to say other than he is a stealth fucker.\nSo it seems in this video, super animated (And turned on!) Eli fucks circles around Hagan.\nWe do a little POV-CAM during the oral, but Hagan was having problems holding the camera during the fucking- he often has to reach down and make sure his dick is not bending funky, so he needs both hands free. It's kind of cool to watch the oral with a bit of POV thrown in.\nMy favorite part of this video is when Eli rides Hagan's cock reverse cowboy. He started by getting fucked doggy style and for the first time since working for me he didn't think he was going to be able to take a cock.\nBut once he started riding him, it clearly felt good as it got him hard. Eli was fucking working over Hagan's cock like a pro, bobbing his ass up and down on his cock confidently.\nEli was so surprised that it was turning him on that he figured he might be able to nut while being fucked.\nI know Hagan can stay hard long enough to fuck a dude till he cums (We've all seen vids where the Top has clearly lost his wood and all but popped out) but Hagan keeps solid and Eli has an intense orgasm.\nAnd though Hagan is quiet as can be, he fucks Eli a bit more, pulls out and nuts all around and in his hole, making sure his cum gets shoved inside his hole. He may not make much noise, but he sure can perform on command.\nA super hot video for a Wednesday! Two giant cocks and amazing cumshots. Awesome!",
  "models": [
    {
      "name": "Eli Hunter",
      "person_id": 3340
    },
    {
      "name": "Hagan",
      "person_id": 3341
    }
  ],
  "release_date": "2010-10-20",
  "scene_id": 1279,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Ethnicity - Mixed Heritage",
    "Video - POV-CAM"
  ],
  "title": "Eli Hunter & Hagan - RAW"
}