{
  "collections": [
    "ChaosMen"
  ],
  "description": "So I had several issues I wanted to solve during this video.\nGerin is a voracious bottom, but he seldom stays hard while being fucked, which is odd cuz the straight guys usually don't have too many issues standing at attention while being fucked. Gerin is certainly enjoying it, but what's missing for him is....The Daddy Effect.\nGerin is gay, but he likes his guys mature. Oh he likes a really big cock as much as next power bottom, but add some gray hair in there and a dominating voice and he gets way turned on. He actually thinks I'm hot, proving there is just no accounting for taste! (and perhaps airing this film after the Serviced video early this week is a bit too much \"Bryan\")\nMy other issue was, well, doing something different. I myself have tried doing some POV work with my There series. I tried doing it once with Felix, and then one other attempt where I wasn't part of it. And despite my numerous appearances, I try to lay low in most of the videos. (Yeah I know hard to believe.)\nBut I wanted to give the POV ;There' thang another try and I thought I could solve two problems at once.\nIn other words, get Bossy with Gerin. Integrate myself into the video so I could keep him hard and turned on, and at the same time, give you all the feeling that you are There, taking part in the scene.\nYou will all have to be the judge, but I think this video is VERY VERY hot. Everything but the kitchen sink thrown in!\nI'm not real fond of me being in it, but I dunno, there is just SOMETHING about this video that I think will appeal to most of my viewers.\nSo don't miss this movie. I don't want to say much more, but I think it will be a fan favorite!",
  "models": [
    {
      "name": "Heath",
      "person_id": 3376
    },
    {
      "name": "Gerin",
      "person_id": 3369
    }
  ],
  "release_date": "2010-10-29",
  "scene_id": 1281,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - There",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Video - POV-CAM",
    "Theme - Tag Team"
  ],
  "title": "Gerin & Heath - There"
}