{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video has a little secret right in the center of it. One that Parker didn't share with me until we took a break.\nAs I have said in the past, Dante has resigned himself to being a bottom, despite his domineering attitude. Truth be told, the dude can take pretty much any dick I have shoved in him. And Parker is actually quite hung.\nThe pairing seemed a little off to me- Lean tall muscular Parker with beefy mature Dante. But geez, when they got in the room together they went at it full-tilt, full-energy, and full-thrust! Parker fucks Dante with wild abandon!\nNow the secret is Parker came twice in this video.\nWhile Parker was fucking Dante doggy-style, I was underneath getting an under shot. Now normally, we have to start and stop during filming to get hard (Yeah..they are straight and have to watch a little straight porn to get back in the zone), but Parker was rockin' hard this time and he just kept fucking him. Like he hasn't been able to fuck anyone before. Dante was really taking it!\nAnd then white stuff started oozing out of Dante's ass. I was thinking, \"Well as long as it not brown we are good and that sure looks like jizz.\"\nSure enough between takes, Parker admitted that he \"kinda\" came while fucking him but he was staying hard and thought he could bust a second time. So didn't bother mentioning it or make any noise the he was cumming. He knew I would worry that his dick would be out of commission for a couple hours.\nTurns out he was a bit wobbly when he lays down and Dante rides him. I will be damned if he didn't get that sucker hard and up in him in no time. Seriously, we didn't take even a 3 minute break- Just enough time for me to smack my head and say, \"You came?!?!\"\nParker also fucked Dante with the POV cam and he is just so hard in these shots. It's pretty amazing. Holding that cam and fucking a dude (a hairy dude too!) presents a special challenge for the \"advanced\" performers.\nParker delivers his second nut on Dante's hole and then breeds him again.\nWe give Dante a break to ramp up, and he shoots like four loads straight up in the air!\nA very hot pairing from one that I didn't think would work! Stellar!",
  "models": [
    {
      "name": "Dante",
      "person_id": 3355
    },
    {
      "name": "Parker",
      "person_id": 3342
    }
  ],
  "release_date": "2010-11-05",
  "scene_id": 1283,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Dante & Parker - RAW"
}