{
  "collections": [
    "ChaosMen"
  ],
  "description": "When I told Ransom he was going to be doing Jeremy's Serviced video, I warned him to avoid sex beforehand, because chances were pretty high that Jeremy would want to suck his dick back.\nSo not exactly the Nervous Straight Guy video, which is nice to toss into the mix.\nTwo eager guys wanting to suck the cum out of each other.\nJeremy still starts off a bit nervous, and surprisingly has straight porn playing on the video he is watching.\nRansom actually works like a dog trying to keep Jeremy hard, but Jeremy is a bit wobbly. Finally Ransom positions himself so that Jeremy has access to his cock. Ransom's dick was hard and ready to come out and play!\nThis finally flipped the switch in Jeremy who took his cock out and stroked it. Jeremy was pretty hard after that, and eventually they started some 69 action.\nRansom was actually quite keen on getting his dick sucked and just finally got up and shoved his cock properly into Jeremy's mouth.\nThat flipped Ransom's switch and then he was bound and determined to make Jeremy cum, taking part of the load in his mouth, gooey cum dripping down his fists.\nHe jumps up and uses the cum as lube, working it into cottage cheese by rapidly jerking his cock, cumming quite quickly.\nPan back and there is a giant glob of Jeremy's cum on Ransom's chin!\nGreat timing and super hot!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Jeremy Torch",
      "person_id": 3396
    }
  ],
  "release_date": "2010-12-23",
  "scene_id": 1284,
  "tags": [
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Jeremy Torch & Ransom - Serviced"
}