{
  "collections": [
    "ChaosMen"
  ],
  "description": "Trying to pin down Kristopher's sexuality is going to be a tough one.\nHe seems to be into guys, only on occasion, and doesn't mind the taste of his own cum. Which is kind of gay or at least Bi. But he sounds and moves...well...like a typical straight guy. There are only few moments at the end of the video where he shows some sugar- it's cute.\nHe watched straight porn to get hard for the photos and most of the video and for the cumshot we put a gay video playing. I have worked with him since shooting this, and he pretty much feels more confident when straight porn is playing. Yet he really gets into guys. So who knows.?\nSo enough of labeling him- lets start with the adjectives!\nDreamy, Adorable, Sexy, Suave, Playful, Cute, Gorgeous, Sophisticated, Silly- all wrapped in a very naughty frat boy body. This kids got that 'something' and you will fall in love with him.\nHe has a pretty good scar on his stomach and I thought I better mention it so I don't have to answer emails about it. He had a Spleenectomy when he was young, when, get this, he had a teeter-tooter accident! Horrifying and cute all at the same time!\nAnd as an adult he still plays with toys. He has gotten in the habit of using a vibrator. Later I found out it wasn't a vibrator for your bum, , but like one you would find at Walgreen's- a personal massager if you will. Not shaped like a cock in any way.\nHe just basically holds it under his cock head in the front until he nuts. He has become very reliant on it, so we will see how he does getting head, or even doing full on fucking. He is promising to practice nutting without it, because it will be hard from him to pull that out each time he does a scene.\nBut for this one, I let him have at with a twisty one that got him going, and frankly it is nice to see something new in a solo.\nI asked him if he uses his vibrator on his ass, and the thought never occurred to him. (Now it seemed like a stupid question knowing now how large the personal massager was..no way it would go up anyone's but!)\nSince the one I have him was more 'insertable,' I told him to try a little butt play and see if he liked it. He liked it.\nI also knew everyone loved the vibrating hand unit that was used in Dwight's Edge video. So Kristopher uses it to cum.\nI told him to keep a hold of his cock and make it shoot with it vibrating, but to turn it off so we don't have the buzzing sound and could hear him breath.\nInstead he turns it off just before he nuts, which is still pretty good cuz the look on his face is very really and very intense. But I kind of wanted to see him cum with his cock vibrating like a a tuning fork.\nHe finishes the video by coyly licking the cum off his fingers.\nI am happy to say, Kristopher will be back for more!",
  "models": [
    {
      "name": "Kristopher",
      "person_id": 3401
    }
  ],
  "release_date": "2010-12-06",
  "scene_id": 1290,
  "tags": [
    "Theme - Solo",
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "X-Tras - Tattoos"
  ],
  "title": "Kristopher - Solo Toys"
}