{
  "collections": [
    "ChaosMen"
  ],
  "description": "I figured for Jamison's first time fucking a dude, I better put him with an aggressive bottom.\nI wouldn't say Jamison is quiet, but he is \"self-contained\" and I was thinking maybe he needed some coaxing from an eager bottom to bring out his dominant side.\nGerin blows him expertly and Jamison kind of kicks back passively and enjoys the head. He wasn't ready to suck dick (next time though!) but he did reach out and touch Gerin's dick. Baby steps!\nJamison then starts with a little dirty talking and coaxes Gerin to ride his cock. Can you coax the willing? We got some fun and different angles.\nJamison then shoves him down flat and fucks him. It's not a position that works for seeing penetration, but its very hot to see Jamison's bubble butt shake up and down as he pounds Gerin's ass. A more \"real world\" fucking, that may not be the best for our viewing, but it sure was hot to see Jamison go at it. But we still get to see Jamison's cock buried in and out of Gerin's ass.\nWe got lucky again with Jamison fucking the cum out of Gerin. A little tough to see him actually fucking him, as Jamison's arm and Gerin's leg seem to block the butt-fucking, but you don't have to look too close to see that he's really fucking him and not just grinding his pubes to his ass. We've all seen that before!\nJamison takes a moment to ramp up and delivers a truly massive load all over Gerin's balls and hole, shoving all the gooey cum inside of him.\nGerin does a great job, and I think we got Jamison properly broke in and ready for more!",
  "models": [
    {
      "name": "Gerin",
      "person_id": 3369
    },
    {
      "name": "Jamison",
      "person_id": 3392
    }
  ],
  "release_date": "2010-11-12",
  "scene_id": 1297,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Gerin & Jamison - RAW"
}