{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had two hot guys with dicks that never seem to wilt during a shoot. I thought I would put them on the massage table, which is always an extra challenge, and these two took to it like lube on dick.\nEli and Heath start of with some serious kissing and playing with each others tools.\nEli falls a bit behind in getting hard, so Heath offers to get him hard. His expert cock sucking skills gets Eli going and from that point forward the video just takes off!\nAfter sucking Eli's cock, Heath shoves his own down Eli's throat, trying to gag him on it. Eli then spins Heath around and eats out his ass, which totally turns Heath on.\nEli gets him up on the table and continues the rimming, lubing up Heath's hole for his massive cock.\nTakes a little wedging, but Eli gets it in, and I will be danged if Heath loves every minute after the initial insert.\nEli lets loose and fucks him on his back too.\nFinally it was Eli's turn to get ass-rammed, which is truly Heath's favorite thing to do. He knows he is a good Top, as his dick just gets rock hard and stays that way. He is really good at showcasing for us as to what he is doing, so us viewers really get to see the action.\nThere is an extra hot ending on this one.\nHeath unloads all over Eli's hole, shoving his cum in. Then Eli nuts on his own stomach.\nHeath was still hard after cumming, so he scoops up Eli's cum and coats his dick with it, then he shoves his cock back into Eli- fucking him with his own cum and mixing their load together!\nBoth of them really got off on this, and so will you!",
  "models": [
    {
      "name": "Heath",
      "person_id": 3376
    },
    {
      "name": "Eli Hunter",
      "person_id": 3340
    }
  ],
  "release_date": "2010-11-17",
  "scene_id": 1298,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Sex Act - Massage Table"
  ],
  "title": "Eli Hunter & Heath - RAW"
}