{
  "collections": [
    "ChaosMen"
  ],
  "description": "As I have mentioned in the past, Vander kinda likes that manly scent.\nNash is straight, but he is always running up to me making me smell his pits cuz he gets the funk going and knows I like it and tries to torture me by giving me a whiff and dashing away.\nNash liking the way a dude smells is about the only really gay thing I can think he does. Ok, so taking Vander's cock up the ass is pretty gay, but I am talking Nash in Real World life.\nNash didn't have to go but a day, and was a little musky, and when Vander walked into the room, you could tell he was turned on by not only Nash but just the way he smells. Like a dude. No cologne or deodorant.\nMy goal for this video was to do something I have never got on film, but get plenty of suggestions for, and that is for some armpit fucking. You know, get the cock nice and musky, and make the other dude suck it.\nLick some pit and kiss with the smell of the other dude all over you. Trading scent.\nYou may be a bit vanilla for this one, but it is pure hotness for me and those who like the way a dude REALLY smells.\nThe two are way into it too. You can just tell.\nThis is one of the very few videos that I could do a Director's Cut. People ask me for them all the time, but frankly I use every last bit of useable footage.\nThe video was over 36 minutes and there was scene where Nash fucks Vander, doing push ups into him. It's hot, but hit the cutting room floor to get the video down to a downloadable size.\nThat's not to say this video is lacking in any way. It is off the hook energy, and both guys creampie each other. And there is plenty of fucking. I just wanted the focus to be on pit worship.\nNash discovered that fucking Vander while doing push ups was making him get too close, so we used that to cum and its one of those rare moments when you see a guy fuck someone till he starts to actually cum, pulls out, and then shoves back in, cum oozing down Vander's back.\nIf you are grossed out by the armpit worship, I am sorry, but this video had me hard when I shot it, and when I edited it.\nIt's a keeper!\nSniiiiiifffff!",
  "models": [
    {
      "name": "Nash",
      "person_id": 3315
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2010-11-19",
  "scene_id": 1303,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Video - POV-CAM",
    "X-Tras - Piercings"
  ],
  "title": "Nash & Vander - RAW"
}