{
  "collections": [
    "ChaosMen"
  ],
  "description": "There is no getting around it. Taylor is an awesome Top. He's aggressive, takes delight in watching his thick cock split someone in two, and eager to fill someone's hole with his load.\nBut he wants to be a team player and also wants to mix things up a bit. He takes the initiative, not wanting to be a One Note Player. He did bottom for Nash, but he really struggled to find any pleasure in bottoming.\nWe both thought it was time for him to be properly fucked, and Ransom had the perfect dick to do it.\nBut I wanted to play off of the video that Taylor did with Bastian. Taylor tied him up and had his way with him, but this time we would reverse the roles.\nRansom loosely binds Taylor's hands and then face fucks him. We even get some POV Cam in there. Very hot to see him bound up and fed a cock.\nThen my next goal was to get a butt plug up him and have it stay in him a good long while so his asshole would be nice and loosened up for the fucking.\nOf course Ransom makes him suck his dick some more while Taylor keeps his butt plugged ass in the air.\nFinally Ransom takes it out, and eases his cock in...and no shrieks of pain from Taylor this time!\nIn fact, it got him hard!\nRansom fucks him good, and I think Taylor is no longer afraid to bottom. Though he still likely going to be top dog most of the time..he is just too dominant.\nThe dominant side come out a third of the way into the movie. Taylor gets up on the bed and makes Ransom finally suck his cock. We get some fun POV cam on that too.\nFinally, Taylor is back in his element, teasing and toying with Ransom's hole with his fat cock. Some POV cam here as well and you can see that Taylor has a little malicious side to him as he pushes his cock in Ransom.\nI timed this video so Ransom would have a cock in his ass just long enough that it would make him cum. Followers of the site know that Ransom is often jumping off the cock that is banging him for fear he is going to cum.\nSo this time I just let him unload as Taylor fucks the cum out of him.\nTaylor takes a few moments to ramp his cock up hard, and as always, delivers a perfect load all over Ransom's hole, then stuffs it in, cum dripping from the top and bottom of Ransom's hole.\nWe leave with Taylor fingering the cum, shoving any that got away back in up inside of Ransom.",
  "models": [
    {
      "name": "Taylor",
      "person_id": 3343
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2010-11-26",
  "scene_id": 1307,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding",
    "Video - POV-CAM"
  ],
  "title": "Ransom & Taylor - RAW"
}