{
  "collections": [
    "ChaosMen"
  ],
  "description": "Surprise! Another mid-week sexcapade!\nI have minor crush on Orlando. He is just one of the models that I think is boyfriend material. I get to spend time with when he is here, and I just adore his personality and presence.\nToo bad he has that whole heterosexual thing going on... and is half my age.\nBut I love working with him. He still has not regained his confidence to top and as he says, \"I don't mind bottoming at all.\" Which I think is as close to getting him to say \"It feels good.\" as we are going to get.\nThere was a little bit of genuine chemistry, at least during the kissing. I think Orlando must be a really good kisser, and when he goes to take his pants off, he keeps his eyes right on Jasper.\nNow Jasper, he had just broke up with his girlfriend, and was a little sad and hadn't had sex in weeks. Didn't even feel like jacking off that whole time.\nUh oh.\nI said to him, \"Haven't you accidentally cum too soon before?\"\nTo which he replied, \"I will be fine, that was when I was getting fucked. I'm topping the whole time right?\"\nOk we should be fine, I thought.\nBut a couple weeks is a long time to go without nutting when you are his age.\nI set them upon each other, and the two kiss enthusiastically and trade blow jobs. Orlando sure can suck cock with the best of them.\nJasper then starts to fuck him and really gets some steam going. Perhaps too much steam.\nA look of horror passes over his face as he realizes he is about to cum, then looks over at me as if to ask, \"What I do?\"\nWe just play right though and even though I didn't have a close up, at least all cameras were aimed at him, and Orlando just runs with it.\nAs I am switching to get a Top shot, Jasper is apologizing and I am like, \"Just go back to fucking him and do 'something!' scrambling to get my camera in focus.\nSo Jasper uses his cum to fuck Orlando then \"kinda\" starts licking it up off of Orlando's back.\nI thought, \"Well, that's one short video.\"\nJasper was determined to finish the video, certain he had another load in him.\nOk, so he is a little wobbly after we switch to Orlando on his back. Perhaps we should have given Jasper 15 minutes more to \"re-set\".\nBut sure enough, he hits his stride again, and fucking Orlando in a couple more positions pretty solid.\nWhen it comes time to nut, his load falls short of Orlando's hole, but he makes the best of it by shoving his cock in. Well, it was his second load after all.\nBy this time, I kind of felt sorry for my boyfri...I mean Orlando, and told him he could just chill and rub one off while he sucked on Jasper's balls.\nNext time though, I think I want to find out if Orlando can cum while being fucked.\nYou know, we always have to set higher goals!",
  "models": [
    {
      "name": "Jasper",
      "person_id": 7435
    },
    {
      "name": "Orlando",
      "person_id": 3373
    }
  ],
  "release_date": "2010-11-24",
  "scene_id": 1308,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Orlando & Jasper - RAW"
}