{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would put Parker with someone who could really take a cock pounding. Parker has a lot of sexual energy and he really likes to ramp up and fuck hard.\nParker is usually hesitant to go full-force 'cuz he is such a...well...baby about bottoming himself. His little adventure with a small toy and a couple times we have tried, he just has no tolerance to get over the pain.\nThe beginning of this video feels a little like Parker is about to get fucked, but I just wanted to showcase his ass, and Silas gets turned on eating a guy's ass out. Parker didn't seem to mind either.\nThen the boys get down to it, with Silas riding on top of Parker's big stick. It's one of those challenging positions, but Parker has the stamina and energy to really fuck Up and Hard.\nThe two go at it for a couple more positions. Parker finally nuts, but he gets no distance and the cum basically falls on the blanket. How he missed being so well-prepared and sooo close to Silas's butt hole is beyond my understanding?!\nFortunately he squeezes a few gobs of cum into Silas's ass as he tells Silas tells Parker to breed him.\nThis actually makes Silas nut and I scramble to get out of the line of fire.\nIt's hot because I get to pan out and see the last globs of Silas's cum dripping out of his dick, while cum is still oozing out of his butt hole!",
  "models": [
    {
      "name": "Parker",
      "person_id": 3342
    },
    {
      "name": "Silas",
      "person_id": 3229
    }
  ],
  "release_date": "2010-12-03",
  "scene_id": 1311,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Ethnicity - Mixed Heritage"
  ],
  "title": "Parker & Silas - RAW"
}