{
  "collections": [
    "ChaosMen"
  ],
  "description": "These two practically look like brothers! I am so pleased to put them together!\nMicah and Nash really hit this out of the ballpark.\nWe started with Micah giving Nash some head while he chilled in his chair. Micah finally stands up and WOW, his dick just seems to get bigger each shoot. Nash handles it with ease, and the two swap the POV camera a bit. Very hot!\nMicah was up for trying to bottom during this video, but I knew he would be down for only one position. I also kind of had it in my head that he might be able to cum from being fucked. With that brand on his arm and tatt work, clearly the kid gets a little pleasure out of pain.\nSo Micah starts off fucking Nash in a couple positions, again we get some fun POV camera in there.\nMicah did so well fucking AJ in a chair that we went for that again, and this time there was no fumbling about. This was some professional ass pounding!\nFinally it was time for Micah to get fucked, and well, he really got off to it. While moving to get the undershot he mentioned that he thought it would make him cum, and I was like, \"Well, that's how we will do your cumshot then.\"\nThankfully Nash stays hard long enough to keep fucking the cum out of dude, but honestly it didn't take Micah long to squeeze the jizz out of his cock. GEEZ he came hard and intense.\nNash gives a big finale with a splash of cum to Micah's pillaged and gaping hole.\nI know they aren't actually brothers, but if you have Bromance fantasies, you might be able to trick yourself into thinking they really are!",
  "models": [
    {
      "name": "Nash",
      "person_id": 3315
    },
    {
      "name": "Micah",
      "person_id": 3390
    }
  ],
  "release_date": "2010-12-08",
  "scene_id": 1319,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Video - POV-CAM"
  ],
  "title": "Micah & Nash - RAW"
}