{
  "collections": [
    "ChaosMen"
  ],
  "description": "I finally found a fairly safe location to film Glory Hole vids again. It's been a while.\nYou have to be a fan of this genre to truly appreciate it, but for me, it gives the straight guys one more option to try \"a little more\" and get themselves sucked off.\nI think the Serviced video is the easiest, and then the G:hOle video is a bit harder (though only if the straight guy sucks back, and this one does!), then the Edge video, where all the fantasy sequences push their boundaries even more, is the hardest of the \"oral only\" vids.\nMarkham is definitely rough trade. Instead of tattoos he is going for scarring, which you may or may not find hot. Some look like tiger scratches so they do look kind of like he has been through an amazing battle.\nA little bit of noise filters in from another bathroom, startling us a couple times. But Ransom felt most secure, and went at attacking Markham's cock with gusto.\nThere is an out take at the end, so stay tuned for to the last for an narrowly averted misfire.\nAs I mentioned, Markham actually sucked back, and clearly you can tell, it is his first time.\nRegardless, Markham's cum shot is intense.\nRansom, as always, delivers a timely nut shot, sucking the last bit of cum out of Markham while he does it.\nI feel pretty confident with this location, I have filmed some full on sex films here- Coming Soon! You can see lubey hand prints on the walls already.\nI figure I can do some cool sex films here, and maybe get some piss play in action. Step it up from a standard oral video on occasion.\nBut I thought this video would be a nice simple intro to our new G:hOle Location!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Markham",
      "person_id": 3407
    }
  ],
  "release_date": "2010-12-13",
  "scene_id": 1324,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Red",
    "Theme - G:hOle",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Markham & Ransom - G:hOle Oral"
}