{
  "collections": [
    "ChaosMen"
  ],
  "description": "I am not sure who is Servicing who in this video.\nKristopher identifies as straight, but every now and then he finds a dude hot and from the looks of this video, has definitely messed around with a guy before.\nTeo does a fine job keeping him hard, but Kristopher steals the show with all the dirty talking.\nThat's right folks! We have another dirty talker! I LOVE IT!\nThen to top it off, Kristopher was fascinated with Teo's uncut cock, and was eager to suck on it. At one point a tear is weeping out of Christopher's eye as he sucks with such energy and fighting back his gag reflex. HOT!\nTwice the two go into 69 and twice you see Kristopher in real time wake up Teo's cock. It got Teo really turned on and was so ready to do the cumshot that he had no problems ass eating, nor taking Kristopher's load down the throat.\nIf you watched Kristopher's solo, then you know he got in the habit of using a personal massager at the base of his cock head to make himself cum. He was finding it hard to jack off without that extra stimulation.\nBut we get him to unload \"pretty much\" into Teo's mouth and seconds later Teo is busting a HUGE load. Certainly he is not grossed out by another dude's cum anymore!\nKristopher is a ham and starts eating some of Teo's cum and then finally bends down and kisses him with a nice cum-bination of their loads.\nTeo has come a long way. I love that he really pushed himself in this video. Yeah, he can't seem to get the cock sucking down, but everything else about him is so on the money. I really adore working with him.\nAs for Kristopher, he is back for more in the future. In fact some day I am going to have to put him on Servicing another dude, cuz the boy has no limits and loves to be dirty, and wow! he can suck a cock!",
  "models": [
    {
      "name": "Kristopher",
      "person_id": 3401
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2010-12-15",
  "scene_id": 1325,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Twink",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Kristopher & Teo - Serviced"
}