{
  "collections": [
    "ChaosMen"
  ],
  "description": "It was time for Jamison to get fucked, and for his first time I wanted someone smooth and could stay hard so there would be no rushing to shove it in before it goes down type of Trauma.\nThe thing I like about working with Hayden is he creates energy between the model. He is very good about actually getting the other dude aroused and almost begging to do whatever he wants. Its a subtle vibe or energy, but you can see Jamison is just taken by Hayden, and with all the sexual tension, he got fucked easily.\nHayden plays with his cock, then toys a little bit with his ass, but then decides to make him suck his cock, you know, get it wet so he can stick it in!\nThen he tosses Jamison on his back, and as he has learned, getting fucked feels better if your own cock is hard. So Hayden sucks him until Jamison is hard, and we get a little chest hair worship in the process.\nSometimes we struggle behind the scenes to get that first insert, but with Hayden's vibe, he slowly slid his cock into Jamison, who hardly even flinches. He's tough!\nWe even get Hayden to do push-ups into Jamison's ass. Great angles on that!\nI promised Jamison he only had to fuck one position and the rest of the movie he could fuck Hayden. So they switch gears and Jamison shows us he is equally skilled as a top.\nHayden's dick never wilts the entire time, and I think that turned Jamison on.\nHe flips Hayden on his back and then fucks him till he shoots his load all over his hole, squishing his load into Hayden's hole.\nWithout skipping a beat (and me struggling to get cameras repositioned!) Hayden switches places and poor Jamison who is ready to call it a night, gets fucked a bit more because Hayden cums easier from actual fucking, so he has to fuck him a bit, then pulls out and we get a double creampie/breeding action on this one!\nI think it is safe to say, Jamison is no longer afraid of getting fucked and will be a versatile team player!",
  "models": [
    {
      "name": "Hayden",
      "person_id": 3330
    },
    {
      "name": "Jamison",
      "person_id": 3392
    }
  ],
  "release_date": "2011-01-05",
  "scene_id": 1329,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Hayden & Jamison - RAW"
}