{
  "collections": [
    "ChaosMen"
  ],
  "description": "For Kristopher's first time, I wanted to pick a guy about his size and has the same energy level as he does.\nOrlando, still kind of resigned himself to bottoming, was actually pretty turned on by Kristopher. He was a bit sheepish admitting it, but Kristopher is a hot dude, no way around it.\nPlus, Kristopher keeps a runny monologue of dirty talk, and I think Orlando, who is a bit passive, totally got into it. He was hard most of the shoot, and was telling me he was more confident that he could Top in the future.\nI REALLY like Orlando on a personal level. He's one of those guys that is total boyfriend materials, and I enjoy spending down time with him. Too bad he has this thing about liking girls!\nMost of the other guys are 'all business' but Orlando is just a genuine and amiable guy. So it's cool he is getting more confidence and wants to keep coming back.\nAs for Kristopher, he excels at dirty talk, and loved every minute of having his cock worshiped. That's not to say he didn't pay attention to Orlando's cock too- this kid can really suck a dick!\nAnd he can fuck with style too. He got harder and harder as the shoot went on, and was especially excited when Orlando wanted to try cumming while being fucked. Kristopher was impressed that he could actually fuck the cum out of him, and the intensity that Orlando had, I think Kristopher is now willing to try getting fucked himself.\nKristopher pulls out just after Orlando's last squirt, and with a little bit of buildup, lays his load right on Orlando's hole, instinctively shoving his cock in, breeding Orlando with his seed.\nThis is a dang good video with two hot boys, who really seem to be into each other. I love when chemistry happens!",
  "models": [
    {
      "name": "Orlando",
      "person_id": 3373
    },
    {
      "name": "Kristopher",
      "person_id": 3401
    }
  ],
  "release_date": "2011-01-07",
  "scene_id": 1330,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Kristopher & Orlando - RAW"
}