{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a pretty long Edge video. It is almost 30 minutes which is a bit long for a blow job video.\nThis was a very interesting Edge video to do. It was hard to not leave out any of the fun stuff!\nVander steps in to do the blow job this time. He is very cock hungry and we do struggle to get Tobin in a hard zone. The boy does not jack off and really seems a bit out of touch with his body. Kind of like he expects the girls to figure it out for him.\nVander and I both tried all kinds of tricks (ok, to Vander's embarrassment, I had him standing at attention in about a minute- Vander IS fucking amazing, but i got 30 years cock sucking under my belt, so to speak)\nAnd this is the truest of Edge videos. We had a guy who would not kiss, suck cock, nor put a toy in his butt. he grudgingly sucked Vander's cock (which is really hot cuz you can tell he is pushing his limits!) and we even have a little ass play and Vander cums all over the toy and fucks him with his load. (oops, shouldn't give away fantasy scenarios!)\nTobin is gorgeous and pristine, and Vander is a dirty boy, and its hot to see him use and abuse the tender 'lil Tobin.\nVander had to work like a dog to make Tobin cum, and part of the reason the video runs long is I wanted one steady shot showing how fucking hard and long Vander worked to make this boy nut.\nHe deserves the Carpal Tunnel Jack Off Syndrome Award for 2010!\nSo enjoy this Edge video. Next one airs the beginning of December!",
  "models": [
    {
      "name": "Tobin",
      "person_id": 3403
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2010-11-10",
  "scene_id": 1332,
  "tags": [
    "Chest - Smooth/Natural",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Theme - Edge",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "X-Tras - Piercings"
  ],
  "title": "Tobin & Vander - Edge"
}