{
  "collections": [
    "ChaosMen"
  ],
  "description": "So far Rory, who really thinks of himself as a Top, has been (willingly) bottoming for most of the guys he has been with.\nKristopher has topped once and never bottomed. When I suggested to him that Rory had been bottoming a lot lately and he might like a to show off his topping skills, I thought I would get at least a little reluctance from Kristopher, but he just seemed down for anything.\nBoth guys totally get into the scenes they do, and Kristopher is one of the best dirty talkers I got. I just love to listen to him to tell the guy he is a, \"good boy\" for sucking his cock.\nSince Kristopher said he had not bottomed before (I too never know to believe them or not) I was a little worried he wouldn't take to it. So we saved his bottoming last.\nKristopher just has all the right moves. He tosses his arm behind naturally, and moves his body in such a way to really show off all the action. Most videos I am trying to move the Tops arm out of the way because he is cock-blocking his own cock. Not Kristopher. He has natural showmanship!\nRory takes Kristopher's cock with great skill, and I think Kristopher really is getting the hang of fucking a dude. I love to see Rory's cock all hard while he is riding his cock too.\nFinally it was Kristopher's turn to go Bottoms Up, and to his own surprise, his dick got harder and harder, and he told me he thought it was going to make him cum.\nThrough the magic of editing, we have in the past waited a bit for Kristopher to nut. Mostly at the beginning when he was addicted to having vibrating action at the base of his head to make him cum. He has been doing his homework by jacking-off in such a way that is more conducive for filming.\nBut this time out, Rory just picks up his pace and Kristopher busts a huge intense load while being fucked.\nWithout missing a beat, he was then spreading his cheeks and telling Rory that his hole was the target. Rory hits the bull's eye, but really goes down fast before he can fuck him with his cum.\nThis is a dang hot video with two guys that appear to really be into each other!",
  "models": [
    {
      "name": "Kristopher",
      "person_id": 3401
    },
    {
      "name": "Rory",
      "person_id": 3389
    }
  ],
  "release_date": "2011-02-25",
  "scene_id": 1338,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Kristopher & Rory - RAW"
}