{
  "collections": [
    "ChaosMen"
  ],
  "description": "Rush had done a solo and an oral a while back. His wife wasn't too keen on him doing gay or straight porn, so he kind of laid low. He did try doing some straight porn, but the pay was lousy, especially given the travel time. I think he did work for another gay studio, but realized my rates were higher, plus I am actually driving distance for him.\nSo that is basically why Rush hasn't been on the site...and is making another appearance.\nWe talked a lot about him doing a scene, but was adamant that he was only going to Top.\nI can \"sell\" bottoming to the straight guys if they think other guy will bottom too. It evens things out.\nRush wasn't ready to, but I guess bills caught up with him, so he was back saying he would try getting fucked but, \"Not too much\"\nEnter Micah, who excels at topping or bottoming. He just goes with the flow, and is a complete joy to work with. He has his limits still, but he can fuck like a jack hammer, and take it up the ass till he cums. Very versatile type of guy.\nBefore the shoot, Rush mentioned the best way for him to cum was to fuck till the last minute and pull out and nut. Whereas, I think Micah wanted to try to cum while being fucked again. Cool.\nThat led us to the final position of Micah riding Rush's cock until he busts a massive load all over Rush's chest.\nAnd I gotta give props to Rush, he fucked him a bit longer and sure enough came in no time- Micah's load still wet on his chest. He polishes it off by fucking him some more with his cum.\nThis video is surprisingly awesome given how narrow Rush's limits were to start with when we first started working together.",
  "models": [
    {
      "name": "Rush",
      "person_id": 3337
    },
    {
      "name": "Micah",
      "person_id": 3390
    }
  ],
  "release_date": "2011-02-11",
  "scene_id": 1339,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Micah & Rush - RAW"
}