{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is one of those funky Serviced videos that just leaves you wondering what is going on in model's head.\nBrooklyn is the epitome of a nervous straight guy, clearly uncomfortable with having a dude suck his dick. The body language says it all.\nBrooklyn was also one of those guys that claims he can't cum from a blow job, so actually Ransom and I were thinking we were going to be in for a long haul.\nBut every time Ransom got Brooklyn hard, even semi-hard, he was saying he was about to bust.\nI left them all in, not even counting them as an \"Outake.\" It just happened too many times and it is basically what kind of makes this video special.\nHe glares at the TV, but occasionally sneaks a peek at Ransom. Verrrry nervous. But I think he was more worried that he was going to cum too soon. He kept fighting it off.\nWe do a little ass play to give him some relief. He was pretty uptight about that.\nHe knew that when that part was over, he could nut. Knowing it was time to cum, he totally relaxed and got into the moment. He stopped looking at the porn playing for him, and started breathing and getting way into it!\nA most excellent nut shot!\nAfter the shoot, Brooklyn was telling Ransom that was the best head ever, and I am pretty sure Ransom took pride in the fact that he is now at a level that he feels confident he can make most anyone nut.\nIf you like your straight guys nervous for their first time, this movie has got ya covered!",
  "models": [
    {
      "name": "Brooklyn",
      "person_id": 3410
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2011-02-02",
  "scene_id": 1342,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Brooklyn & Ransom - Serviced"
}