{
  "collections": [
    "ChaosMen"
  ],
  "description": "Director's Cut with all the action!\nEver since I got the G:hOle back in service I have wanted to do more than oral.\nDon't get me wrong. It works great for straight guy first-timers as a way to introduce them to at the very least getting head.\nBut since I have a few pros working for me, I figured we could theme it out with full on raw sex.\nVander had of course seen Eli on the site, but Eli never looks nor remembers the other models. So it was fun watching him explore Vander's big cock at the urinal for the first time. He truly was surprised!\nVander unloads his bladder, then Eli heads for the stall. Vander signals him to go ahead and stick his dick through. They then trade oral back and forth, and much like Taylor did when he did a scene with Vander, was basically worshiping Vander's amazingly large and perfect cock.\nHe sucks the last drops out of Eli, getting him hard again. He then spins around and gets Eli's cock up his ass. A little hard to get good insert footage, but I knew we would be moving on to other positions.\nEli sits on the toilet while Vander rides him reverse and we really get to see these two go at it.\nThey switch places and Eli just barely fits Vander's cock in his hole. He grinds around on it, and THAT finally brought his dick to full standing attention.\nFinally they move into some open space, and Vander fucks Eli over the garbage can.\nVander fucks him until he cums. Eli shoots his load into Vander's hand and then uses it as lube to fuck Eli until he himself unloads all over and in Eli.\nThis video is definitely a winner if you like down and dirty raw sex!",
  "models": [
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Eli Hunter",
      "person_id": 3340
    }
  ],
  "release_date": "2011-02-18",
  "scene_id": 1347,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding",
    "Sex Act - Piss",
    "Theme - Director's Cut",
    "X-Tras - Piercings"
  ],
  "title": "Eli Hunter & Vander - G:hOle RAW DC"
}