{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought this video was gonna be a super easy one!. Not so much.\nBralin emailed me wanting to do a couple gigs, and I figured fans of Bralin might like to see him in the saddle again. Plus he is a versatile player, top or bottom, and I wanted to get some raw footage of him.\nHe'd been doing straight porn, so showed up with a few whiskers as pubes....grrrr...I didn't even think straight porns want their guys shaved anymore.\nAnd Dunham was ready to get fucked and to fuck for the first time on film. I think much like his Serviced video, he was most happy laying on his back with a cock in his mouth, while he jerks off.\nWe actually had a lot of \"down\" time during this video, and Bralin was taking forever to nut. VERY unusual as he always pretty much cums on commands and then shoots 8 feet.\nBralin got it into his head that if I would just suck on him he would get close and do the creampie ending. I have to say, this does not happen often at all. Like maybe 5 times out of close to 800 videos. But he remembered his Edge video and I think I had fluffed him once before, and he had it in his mind that I would do the trick.\nSo there is a spoiler/outtake at the very end, that gives me an ego boost, but also shows how on VERY rare occasions we have to make the cumshots work. I never like doing the ending this way because there is an obvious disconnect between the pull-out and the cumshot, but sometimes even the pros get in amateur mode.\nOverall though, I think it turns out to a rather nice flip-flop fuck film.",
  "models": [
    {
      "name": "Bralin",
      "person_id": 3166
    },
    {
      "name": "Dunham",
      "person_id": 3394
    }
  ],
  "release_date": "2011-01-12",
  "scene_id": 1349,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Video - POV-CAM",
    "Video - OutTake"
  ],
  "title": "Bralin & Dunham - RAW"
}