{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jamie is a friend of one of the scouts that sends me potential models. Not wanting to mix friendship with work, the two never really talked about him doing some adult modeling.\nI don't know if the economy just got bad, or they both had an epiphany about Jamie doing a solo for me, but I am glad they did.\nI was assured Jamie was a super nice guy, and wow...he really is. Very calm, self-assured, not cocky...beautiful eyes. Dreamy.\nWe did his photos and I often don't tell the models how to style themselves, but I definitely wanted to style up his hair for the video. It was amazing how for the photos he has this kind of a standard generic hair cut. So with only a small amount of product, I pushed his hair up off his forehead, and his look totally changed. I was surprised at how thick and wavy his hair was.\nWhich leads me to his body hair, which he grew out just for us. I think he has the perfect amount of body hair and he just looks like a dude to me.\nHe was very natural for the photos and the video, he performed like a pro. His feet were cold, so we kept his socks on, to which I thought maybe the foot fetish (or sock fetish) crowd might like the nod to their favorite thing.\nI wish I could say Jamie will be back. He pretty much knows the score about what kind of scenes he would be doing, and I think doing the solo helped him out of tight spot. I would love to have him back for more, but we might have to wait for a financial need before seeing him.\nI loved working with him, and I think it shows in both the photos and videos.",
  "models": [
    {
      "name": "Jamie",
      "person_id": 3412
    }
  ],
  "release_date": "2011-01-10",
  "scene_id": 1351,
  "tags": [
    "Theme - Solo",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer"
  ],
  "title": "Jamie - Solo"
}