{
  "collections": [
    "ChaosMen"
  ],
  "description": "As soon as Tobin came on board to do more work, I knew I had to put him with Taylor. Only problem was, like most new guys, Tobin wanted to top his first time out.\nTaylor is a pretty dominant guy and truly makes a better Top than a Bottom. And he has been lately getting into bottoming.\nTobin and Taylor both stay hard for the cock sucking. Tobin, though a bit \"distant\" and \"checked out\" sucks dick pretty good for it being his first cock, as well as it being one that is so large it practically flattens his luscious lips.\nThen Taylor saw how big Tobin's cock was and was literally having high anxiety about having to take Tobin's cock. He was staying hard, but every couple minutes he would comment about how much it was going to hurt. Not whining, Taylor is no wuss, he just didn't think he could take.\nMeanwhile, after the oral, Tobin's cock gave out. It didn't mind being sucked or even sucking dick, but sticking it in a dude's hole, gave him and it anxiety. He just wasn't going to stay hard long enough to get footage.\nI actually kind of thought this was going to happen. I was very nervous making this pairing happen. Tobin struggled a bit during his Edge video, and Taylor's always worried about how much it's going to hurt before the shoot.\nI had them both do some prep before the shoot (Ya know..douche and stretch with a dildo) - just in case we might need to switch positions around.\nTaylor said he could barely take the smallest toy, while Tobin said it was no problem.\nSo they actually were both relieved that we would have to change position. Took the pressure off of both of them.\nWhile I can't say Tobin looks like he is enjoying it, he no longer fears bottoming like most newbies do. Honestly, he took one of the fattest cocks I have in my team of guys, so a few ouchie faces is to be expected. I would love to put him with a smaller dicked guy and see if he can actually get off to it.\nWe got some interesting angles, and Taylor unloads quite nicely into Tobin meaty ass.\nIt did take Tobin some time to nut, and in the interim Taylor's dick recharged and was ready to shoot again. So he adds his second load to Tobin's.\nA lot of background activity to make this shoot happen, but I sure am glad we made it happen, 'cuz they look mighty fine together!",
  "models": [
    {
      "name": "Tobin",
      "person_id": 3403
    },
    {
      "name": "Taylor",
      "person_id": 3343
    }
  ],
  "release_date": "2011-02-04",
  "scene_id": 1352,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Taylor & Tobin - RAW"
}