{
  "collections": [
    "ChaosMen"
  ],
  "description": "You guys probably guessed that once I saw Stone and all his natural body hair, I just had to put him with Vance so we could have a furfest!\nStone's first time fucking a dude. Pretty nervous. He likes anal sex anyway, and he chills pretty quickly. Still, you can tell it is his first time.\nVance takes him through the motions, and Stone gets more and more into it. That disbelieving smile like, \"I can't believe I am actually doing this with another dude!\" soon turns to the serious business of fucking.\nVance has never really been keen on bottoming, but I think he has always ended up with really big cocked guys. I still feel a little twinge of guilt having Zane fuck him...oops!\nBut this time he liked that Stone's cock was like his own and even got off to the oral. The guys seem to respond better if the cock is just like theirs.\nIt also turned to pleasure for Vance when he got fucked, and I think, and now I'm not entirely sure, but I think it is the first time Vance came when a guy was actually fucking him. I could be wrong 'cuz I certainly haven't seen all of his videos for other production companies (I actually I have only seen part of one only). But he sure seemed surprised that it made him nut AND was more intense.\nAnd Stone got all \"pro\" for the ending, delivering a nice creamy load to Vance's hole.\nThere is still that bit of mechanical-ness to the video when you have straight guys who just don't let themselves go, but overall, I think it was a fine pairing, and Stone certainly is now ready to do more work soon!",
  "models": [
    {
      "name": "Stone",
      "person_id": 3398
    },
    {
      "name": "Vance",
      "person_id": 3281
    }
  ],
  "release_date": "2011-03-25",
  "scene_id": 1353,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Stone & Vance - RAW"
}