{
  "collections": [
    "ChaosMen"
  ],
  "description": "Nathaniel laid low after either friends or family found out he was doing gay adult work.\nI have always liked this big dude. He is the epitome of the straight ex-marine type.\nHe hit me up for more work though when he got in a tight financial spot. I guess figuring the cat was already out of the bag (or is that the dildo is out of the drawer?) he was down for more dick sucking.\nUnfortunately the only model I had primed and ready to work with him was Kent, who really wanted to of course start by topping.\nSo I told Nathaniel he would be bottoming the entire time, which I think he was almost relieved since he struggles to stay hard for Topping.\nI also wanted a quick mid-week movie. Been doing a lot of 20-30 minute movies that require long downloads, so a quickie seemed appropriate, and though Nathaniel isn't hating getting fucked, he was relieved to not be pummeled by Kent's big stick for the extra time.\nKent LOVES getting his dick sucked, but he did struggle at the beginning to stay hard. But once Nathaniel said \"Go to town\" on him, he amp'd up and really started to fuck him good.\nHe creampies Nathaniel and I barely catch Nathaniel's load.\nIt's nice to see Kent sliding into the top position. Now to get him to bottom!\nNathaniel has a fan base too. They love his masculine look, and I think they will dig the the irony of this uptight straight ex-marine taking a cock an entire video!",
  "models": [
    {
      "name": "Kent",
      "person_id": 3399
    },
    {
      "name": "Nathaniel",
      "person_id": 3258
    }
  ],
  "release_date": "2011-02-09",
  "scene_id": 1356,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Long",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Video - POV-CAM"
  ],
  "title": "Kent & Nathaniel - RAW"
}