{
  "collections": [
    "ChaosMen"
  ],
  "description": "Vander himself actually suggested he work with Heath. He saw him on the site and decided he he wanted to mess around with him.\nI figured I could make that happen.\nAs for Heath, he wasn't to sure. He looked up Vander on the site too.\nHeath is a better top than a bottom. Oh he will bottom, and even accidentally nut from it, but the dude stays hard once he is up for the entire shoot. He knows how to fuck! An Ever Hard Top...a production companies dream come true.\nVander pretty much stays up a whole shoot too. He's a power Top, but does take great pleasure in bottoming.\nThey decided they would flip-flop to even things out.\nWe start off right away with some POV. Just something different, that I think actually worked quite well. Probably the best use of the POV cam to date.\nBut once Heath saw how big Vander's cock was in person, he was second-guessing bottoming. Actually he was choking on it when he realized how big it was, so really couldn't say much at the time.\nI promised him he could take it, after all, his dick isn't exactly small either, and others have done just fine with it.\nYou will have to wait till the very end for some Out Takes as, Heath yells out the official \"Safe Word, for ChaosMen...\"Pineapple!\" It made me laugh playing it over and over again.\nAnyway, aside from Heath checking out while being fucked, the two have undeniable chemistry together.\nThis vids got a different vibe to it than the standard suck and fuck. It's subtle, but something is going on.\nDon't miss it!",
  "models": [
    {
      "name": "Heath",
      "person_id": 3376
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2011-04-15",
  "scene_id": 1358,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Video - OutTake",
    "X-Tras - Piercings"
  ],
  "title": "Heath & Vander - RAW"
}