{
  "collections": [
    "ChaosMen"
  ],
  "description": "With Stone's hairy bod, I guess it has been my goal to keep him with other hairy guys. Problem is, they are so few and far between.\nSo I opted to go with someone who really likes to fuck and be fucked. Someone who really throws all their energy into the scene.\nEli is just that guy. Stone's first video was \"tentative fucking.\" He was a bit worried that he was going to hurt Vance.\nBut this time out, Eli informed him that once he got in the groove, to go ahead and fuck fast and furious.\nIt's great to see Stone really let go and fuck with no fear of hurting a guy, AND it made him wonder if bottoming might not be too bad since Eli stays hard for most of it AND actually nuts from being fucked.\nEli, ever the helpful guy, also told Stone that the orgasms are twice as intense. Stone took one look at Eli's ample cock and I don't think he was persuaded that he could take Eli's cock, but maybe someone a bit more \"starter\" size.\nFor two guys that look totally different, they sure meshed well. Eli's energy was infectious, and Stone stepped up his game. He's still not completely polished (at times looking to me to see if things are going right), but he is light years ahead of his first time.\nAs I mentioned, Eli unloads while being fucked, and Stone frosts his asshole and plunges his cock in afterwords.\nWe'll see if Stone will bottom. He does have a nice size dick for new guys to take on, but I would love to see him be versatile. We will have to wait and see!",
  "models": [
    {
      "name": "Stone",
      "person_id": 3398
    },
    {
      "name": "Eli Hunter",
      "person_id": 3340
    }
  ],
  "release_date": "2011-05-06",
  "scene_id": 1359,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Eli Hunter & Stone - RAW"
}