{
  "collections": [
    "ChaosMen"
  ],
  "description": "We had several failed attempts to make this video happen. Jamison had to back out because of scheduling, and then we had travel delays. Plus you may or may not notice (well, now you will) Jamison is keeping his right hand out of play- broken finger.\nDidn't think it was that bad, but turns out he had to get some pins put in a couple days later. We won't see him again for a month or two as he heals and is in a proper cast.\nBut he made this one work, and it worked well, despite the added challenge of fucking on a couch. It's just so much easier using a bed, plus it allows me to get good angles. But we managed quite nicely and we get some awesome angles of Micah drilling Jamison's ass.\nJamison had no problems getting fucked and thankfully he is a switch-hitter when it comes to jacking off. I think he had an epiphany that it could actually feel good and tried once to cum from being fucked, but his hand just gave out.\nThese two genuinely seem to be into each other, and I think Micah was pleased to fuck the heck out of someone.\nWith Jamison's bum hand, we kind of did the cumshots separate as Jamison needed to really focus on cumming. So there is that disconnect between cumshots. I'm usually pretty lucky and everyone nuts reasonably close to each other. But we had to fade into his cumshot. I hate that, but you gotta do what you gotta do.\nThe upshot is, we get a double creampie on this one. So the ending has a Double Stuff frosting ending!",
  "models": [
    {
      "name": "Jamison",
      "person_id": 3392
    },
    {
      "name": "Micah",
      "person_id": 3390
    }
  ],
  "release_date": "2011-04-08",
  "scene_id": 1360,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Jamison & Micah - RAW"
}