{
  "collections": [
    "ChaosMen"
  ],
  "description": "Dwight thought long and hard about doing full-on sex with another dude. He felt he had pushed his limits as far they would go. He went months and months before thinking of doing more.\nBut after his dog got sick with mounting vet bills as well as having to paying for school, he thought he might be able to push them a bit further and make...um...ends meet.\nFortunately, Taylor was trying to push his own limits by bottoming an entire video. Dwight and Taylor have similar builds and I thought they would look good together.\nNot trying to disparage Dwight's cock size, but it's actually the right size for the straight guys to get fucked by. Perfect for straight guys to \"first time\" with.\nTaylor wasn't intimidated by it like he was when he worked with Tobin. He actually aggressively bottoms in this video.\nFrankly, he had to, because Dwight was very passive. He still has that, \"I can't believe I am fucking a dude!\" look on his face.\nBut he stays hard the entire time, which was good because Dwight says he has never fucked a girl, so didn't really know what he was doing. And Taylor struggled to get Dwight's cock inside a couple times. I left that in, and it's kind of hot watching them try to find the back door.\nOnce inside though, Dwight slowly fucks Taylor and Taylor FINALLY takes a cock with some pleasure tossed in there. Dwight ramps it up a bit, but you still can tell he was worried he was hurting Taylor.\nI wouldn't go so far to say Taylor is now fully versatile, but sitting on a cock doesn't seem to freak him out as much.\nDwight says he will come back for more. I don't know if I can get him to suck dick, which along with getting fucked seems to be beyond his limits. But I get the sense he will be able to work pass them.\nMeanwhile, it's awesome to see Taylor's ass get juiced again!",
  "models": [
    {
      "name": "Taylor",
      "person_id": 3343
    },
    {
      "name": "Dwight",
      "person_id": 3388
    }
  ],
  "release_date": "2011-05-13",
  "scene_id": 1369,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Dwight & Taylor - RAW"
}