{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kristopher bottomed the entire time during his previous video. So he was eager to Top someone.\nVander, though leans towards Top, is fairly easy going, especially for a guy as sexy as Kristopher. So we agreed before the shoot that Kristopher would be Top Gun the entire video.\nWell, if you watch the video, you clearly see how Kristopher takes it as a personal challenge to deep throat Vander's huge cock. No teary eyes and just a tiny bit of gagging. I think Vander was impressed.\nKristopher gets blown by Vander but they quickly move to Kristopher ramming Vander. I don't think I have seen Kristopher fuck with so much aggression before. Perhaps Vander brought the animal out of him?\nBoth Vander and I kept hinting that maaaaaybe if Kristopher was so keen to swallow Vander's cock, it might be a personal challenge to see if he could sit on it.\nHe was running out of steam, and his dick was getting a little wobbly, and he just shrugged and said, \"Let's do it.\" Under his breath, I am sure he was muttering something like, \"What the Hell am I thinking? This dude's cock is huge!\"\nKristopher goes to sit on it, and is all prepared for the impact, when Vander suggests maybe he eat his ass out to get them both more in the zone for the switch of positions. So we get some interesting rimming.\nThat did the trick, and he slid Vander's cock in like a pro. Vander thrusts into him, but eventually Kristopher gets a little bossy and grinds around on his cock, asking him if that feels good.\nKristopher even indicated that he could cum this way, so Vander fucks him till he is about to bust. Vander was in the mood to swallow some dude DNA and Kristopher fed him his load.\nVander takes a moment to reset, Kristopher's load drying on his chin, and delivers a massive load to his ass. Despite being spent, Kristopher helps Vander slide his cum-soaked cock inside.\nThere is a cute out-take at the very end. Kristopher hits the Mic above the bed, and I thought it was nice to see them both smiling and not so serious. I don't get many goofy moments.\nBut these are two very seriously sensual guys that really work well together!",
  "models": [
    {
      "name": "Kristopher",
      "person_id": 3401
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2011-05-27",
  "scene_id": 1371,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Video - OutTake",
    "X-Tras - Piercings"
  ],
  "title": "Kristopher & Vander - RAW"
}