{
  "collections": [
    "ChaosMen"
  ],
  "description": "I noticed that Micah was not shy or hesitant about sucking another guy's dick, and realized he could do some of the Serviced video. He is still not keen on taking a load to the mouth, but he seems to have some skills and the persistence to actually try to make another guy nut.\nCrew said that he had been blown by a guy before and actually has blown back, but when we were setting this up, he made it plain that he only wanted to receive head. Not sure why. Maybe it was a bad experience or he just decided first-hand it wasn't for him.\nYet he seems to be eager to do more work, and, I dunno, I guess I thought he would be willing to push his limits and put on a good show.\nNot that Micah cared. He was kind of happy that he wasn't under any pressure to perform, other than the work out of jerking a guy off till nuts...which was a bicep builder for sure.\nCrew does a fine job of engaging Micah, and he does reach out grab his dick and it's kind of nice to see him make hand contact with him through out the video.\nHe was pretty \"jumpy\" when it came to the ass eating, or even rubbing a finger across his hole, so maybe he isn't the best candidate for doing \"more.\"\nBut after the video, he was talking about doing more, so I dunno. I think he is a very cute guy and has the perfect sized dick for first-time bottoms. I just thought it was ironic he didn't push his limits on this video, when he had already in his personal life.\nI guess Baby Steps for Crew. But I like him and hope he does come back for more. He sure has cute face!",
  "models": [
    {
      "name": "Crew",
      "person_id": 3413
    },
    {
      "name": "Micah",
      "person_id": 3390
    }
  ],
  "release_date": "2011-02-23",
  "scene_id": 1372,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Crew & Micah - Serviced"
}