{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kent wanted a chance to really FUCK a guy. Ya know, go fast and furious.\nEnter Jake L., an eager bottom willing to please.\nJake was quite happy to suck on Kent's over-sized cock, and I do believe Kent was impressed with his ability to suck his big cock.\nTo get started fucking, Jake likes to be pretty much laying on his stomach- it just seems to break him in and loosened up for some big cockage. The problem is, you just can't see penetration. The dude's balls usually hang down and though it is natural position for us gay guys to fuck in, it's just not conducive for filming porn.\nBut we tried it anyway, and I actually got some good angles of the penetration.\nAfter that, Jake was ready to get fucked in all sorts of ways, and we even get some spooning action, which is dang hard to do unless the Top has a long dick AND stays hard. I love it 'cuz we get to see everything at once...two hard cocks, penetration, and even their faces.\nAnother great thing about working with Jake and Kent is both stay hard, and Kent could fuck a rather demanding bottom like Jake till Jake nuts. He must love that feeling of being pounded while jerking his cock. He sure unloads a lot!\nKent matches him in the DNA dispersal department, juicing his ass and fucking him with his cum.\nThese two guys definitely worked well together, and it shows!",
  "models": [
    {
      "name": "Kent",
      "person_id": 3399
    },
    {
      "name": "Jake Lyons",
      "person_id": 3400
    }
  ],
  "release_date": "2011-12-19",
  "scene_id": 1375,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Jake Lyons & Kent - RAW"
}