{
  "collections": [
    "ChaosMen"
  ],
  "description": "I guess I was on a mission to put Stone with other hairy guys, but I have so few that I ran out quickly. I try though!\nBut Stone says he is up for flip-flop fucking as long as the dick isn't too big. I told him Heath's cock was an \"advanced\" size but not ginormous.\nAnd I had to allay Heath's fears about bottoming again after his stint with Vander. He is such a great Top he just wants to fuck. I assured him that Stone wasn't going to split him in two.\nThey trade oral and both Stone and Heath have come along way in a short time. They both keep each other hard and turned on.\nHeath goes bottom's up first and he actually was quite happy with the feeling. We almost had a moment again where he nutted too soon while being fucked. He looks kind of closed off while being fucked, but honestly I think this time he was just trying to not nut!\nWe even got to do a nice sideways fuck!\nFinally it was his turn to fuck Stone and he just goes after it. He is one of the few models that can fuck until he cums, and poor Stone just took it while Heath ramped up to cum and pulls out at the last second, showering him with jizz.\nWe definitely had to wait for Stone to get close and cum, but I don't think it took too long because Heath was still pretty hard.\nA very interesting pairing that worked really well!",
  "models": [
    {
      "name": "Stone",
      "person_id": 3398
    },
    {
      "name": "Heath",
      "person_id": 3376
    }
  ],
  "release_date": "2011-10-28",
  "scene_id": 1384,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Heath & Stone - RAW"
}