{
  "collections": [
    "ChaosMen"
  ],
  "description": "I kind of was putting Danny off to start doing gigs. He is exceptionally tall, and pretty lean. His dick is pretty big too, and he of course wanted to start off by topping. So I just didn't have anyone I thought he would fit with.\nBut he kept texting me and said he would try bottoming and would really try hard.\nOrlando was looking for a gig and he wanted to try topping after staying so hard with Kristopher.\nSo I didn't think this was an ideal pairing, but once I got them in the room together, the two couldn't stop kissing and get enough of each other!\nThey both suck each other till they get hard, something I get to show in real time. So fans of \"soft to hard\" will be happy.\nAs far as I can tell this truly is Danny's first time messing around with a dude, and being true to his word, he totally threw himself into it.\nAfter a bit of 69ing, Orlando climbs on top and he seems to have no problem taking Danny's cock. He even gets hard while riding him.\nFinally it was time for Orlando to fuck Danny, and as I feared, Danny is so tall that Orlando is on his tiptoes trying to fuck him, but manages quite nicely.\nWe got Orlando on his back and Danny fucks him until he nuts.\nDanny nuts all over Orlando's hole, but with the height difference and wobble dick action, we didn't get any juicing action.\nBut still, this is a dang good video considering the how tall and inexperienced Danny is!",
  "models": [
    {
      "name": "Orlando",
      "person_id": 3373
    },
    {
      "name": "Danny",
      "person_id": 3393
    }
  ],
  "release_date": "2011-02-28",
  "scene_id": 1385,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer"
  ],
  "title": "Danny & Orlando - RAW"
}