{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wesley was surprisingly nervous about this part of his trip out to do video work. The solo, eh, no big deal. But getting his dick sucked by a dude made him wonder if he could stay hard.\nKristopher and Wesley road over to the studio together and immediately hit it off. They had all kinds of military stories, and of course, unfinished tattoo stories to exchange.\nBy the time I got them in the room together, Wesley was turned on, and once again Kristopher just vibrates sex like a tuning fork.\nI didn't really have to give these guys any direction, they just went for it. Well, once when Wesley almost nuts too soon do I give some guidance to Kristopher. That is an out take at the end, and I am trying to do some flashing !Out Take! at the time when it happens so you know to go to the end of the video to watch what really happened.\nI really should add Out Takes as a Search feature, but with me nearing 900 videos, I can't remember which ones have them. I get so few of them too.\nOK, back to the Servicing. Once again Kristopher just hoovers him up and he must have pheromones going cuz Wesley got into it. Subtle things, like always touching Kristopher.\nHe most especially liked having his ass eaten out (He says his wife does it) and I warned him to be careful to not nut because it is verrrrry easy. Turned out it was, hence the out take.\nWesley barely pays any attention to the video except at the very end when he is trying to get over the top. Just a few quick glances though.\nBravo for Kristopher, who got a bicep workout stroking Wesley's bone till it squirts. The smile of satisfaction on Kristopher's face from making another dude nut just makes me happy. Like Ransom, you have to really be committed to making these guys cum.\nAs I mentioned before, not sure Wesley is coming back for more. Which is a damn shame 'cuz this guy has potential!\nEveryone give a round of applause to Kristopher, he really worked Wesley over!",
  "models": [
    {
      "name": "Kristopher",
      "person_id": 3401
    },
    {
      "name": "Wesley",
      "person_id": 3417
    }
  ],
  "release_date": "2011-03-30",
  "scene_id": 1387,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Kristopher & Wesley - Serviced"
}