{
  "collections": [
    "ChaosMen"
  ],
  "description": "Yup I wanted a nice easy video to film with two power players. We even work the couch, 'cuz I know both guys are confident in their skills.\nIt's ironic to watch Isaiah put so much intensity into his scenes. Isaiah is on his 4 or 5th film and he is pure unbridled energy. Hayden, a seasoned pro with many films under his....belt, was taken aback by the energy tossed at him.\nHe is used to being the one in control. I might have mentioned this before, but it is quite typical in straight guys doing gay sex for the guys to never make eye contact. It takes them a while to do, and some never can. Isaiah though, he drinks in the other model, and Hayden just doesn't know where to look. It's just something to look for - a \"tell\" when watching straight guys have sex.\nNot saying Isaiah is gay at all, but he is a performer who never once sneak a peek to see where the cameras are - he is TOTALLY in the moment when Action is called.\nI love when Isaiah sits on top of Hayden's chest and forces him to suck his cock. The angle looks pretty challenging to get some deep throat action, but Isaiah LOVES to have his cock head licked and geeeez, you can tell it was doing the trick for him. Most guy's cocks would go down from so little contact, but Isaiah was loving it.\nAs I said, we work the couch and neither of them had any problems, though Hayden texted me the next day that his quads were REALLY sore.\nSo it's nice to get a few new angles, but we rely on the Isaiah to fuck the cum out of Hayden while he is on his back.\nIsaiah unleashes a giant load, coating Hayden's balls and asshole, with a little cum play at the end.\nThese two REALLY worked well together and I think it was an awesome pairing!",
  "models": [
    {
      "name": "Hayden",
      "person_id": 3330
    },
    {
      "name": "Isaiah",
      "person_id": 3397
    }
  ],
  "release_date": "2011-05-20",
  "scene_id": 1388,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Hayden & Isaiah - RAW"
}