{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jamison sure has come a long way. He bottoms for this entire video, and does all the cock sucking. He seems to have found some peace with doing the guy on guy stuff, and stays hard for most of the video...ok..so a few sneaks at the straight porn playing, but he takes charge in this video, knowing full well he has to bottom the whole time.\nDwight steps it up a bit, though still not willing to suck cock, nor Bottom of course. He seems pretty set against it so I dunno if we can push past it.\nI kind of need the guys to be as versatile as possible so I can mix and match and I have new guys all the time that have narrow limits.\nThat's not to say Dwight isn't an awesome Top. He stays hard the entire shoot and is so awesome to be on the set with. He is so polite and attentive. He still has this look on his face that he can't believe he is fucking a dude.\nJamison starts off by blowing Dwight, and I wanted to push Dwight's limits by having Jamison come up and kiss him, with the taste of his own cock on Jamison's lips. Sneaky!\nJamison starts off by sitting on Dwight's cock, and I should do this more often as Jamison liked having the control initially. By the time he is used to being fucked, Dwight takes the steering wheel.\nI tried real hard to get Jamison to cum while being fucked by Micah in a previous video, but I think Micah lost his steam near the end and popped out. But with Dwight staying solid, I knew he could fuck Jamison till he ramps up to nut. Also Dwight's cock is a more \"average\" size, and Jamison felt more pleasure than pain. Micah's cock is actually quite wide.\nSo I finally got Jamison to truly nut from being fucked. I think he liked it too. I don't think I have seen him shoot so far and so much ever!\nDwight delivers his load before Jamison's own cum dries, covering his hole and breeding him good!",
  "models": [
    {
      "name": "Jamison",
      "person_id": 3392
    },
    {
      "name": "Dwight",
      "person_id": 3388
    }
  ],
  "release_date": "2011-06-10",
  "scene_id": 1391,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Build - Hairy",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Dwight & Jamison - RAW"
}