{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Tobin's dick gave up on him during his shoot with Taylor, we both pretty much figured he was going to have to bottom. His dick just does not want to go into a bootie hole. His brain sure does, because he is used to doing the fucking.\nAnd as he says, \"I don't mind bottoming.\" Not exactly enthusiasm or pleasure, but he was a relieved that Kristopher's cock was not nearly as fat as Taylor's. He even got hard a couple times while being fucked, so maybe we are watching a bottom in the works?\nAs for Kristopher, he was on his best game. Hard and ready to fuck and just wanted to dominate the entire time. Tobin is very passive too, so it actually fit nicely. I don't get the vibe that Tobin would rather be somewhere else like I did in his first fuck video.\nEverything went smoothly, but daaaang, it took forever for both of them to nut. I am so spoiled by most of the models (actually even Kristopher is good at ramping up to nut in under a minute or two) but it took them both like 45 minutes.\nThey would run up, jerk, and almost cum. I think Tobin took like an hour. I have had it happen on solos, but I dunno, I guess it's been a while.\nSo the cumshots are a bit disjointed. Kristopher couldn't cum crouching down to nut on Tobin's hole while he laid on his back, so we switched him back to doggy and that did the trick.\nTobin well, he needed to be sitting upright at the edge of the bed and Kristopher took a load to the face. I asked him if he would try a little cum in the mouth if he could push that limit.\nHe did do it, but I think that is the last time for him. He doesn't look like it is unpleasant or anything, but I have noticed in some of the Serviced videos he is avoiding the cum in the mouth thang.\nA nice pairing all the way around. In no way are the cumshots terrible, just disjointed and amateur like you would see in many productions. I've just been luckier with Quick Shootin' Dudes!",
  "models": [
    {
      "name": "Tobin",
      "person_id": 3403
    },
    {
      "name": "Kristopher",
      "person_id": 3401
    }
  ],
  "release_date": "2011-04-29",
  "scene_id": 1393,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Kristopher & Tobin - RAW"
}