{
  "collections": [
    "ChaosMen"
  ],
  "description": "As I said last week, this video begs the question, \"Who is Servicing Who?\"\nDalton hit me up to do some more work and it had actually been a couple years since he went away to play semi-pro sports and go to school. Out of State Tuition hit him and suddenly he was back in Texas, and tired of waiting tables.\nHe is very adorable, and I can count on him cumming (too soon sometimes!) and I think he is game for trying new things this time out.\nBut to get him some quick money I knew I had Mason in very last minute, and Dalton was nearby so it all worked out well.\nNow, if you are looking for guys who can really suck cock, move on. But if you like your straight guys to be a little ham-handed with the oral, because well, it's more realistic, then this video is for you.\nDalton starts off doing the oral on Mason. I knew Mason wanted to do more down the line, so I figured if Dalton's dick was up to the challenge they could actually trade head.\nMason is a bit better at the oral, though he really isn't the best position to do some hard core sucking. But he seems to have a bit more enthusiasm for it than Dalton did. He's had some practice before.\nThey 69, and Dalton has to take a couple moments to stop sucking because it felt too good. I worried he was close to cumming whenever he tossed his head back to moan!\nAfter that, they both ramp up. Mason nuts and then Dalton takes about a minute to play catch-up and adds his load to Mason's! Nice sticky mess!",
  "models": [
    {
      "name": "Dalton",
      "person_id": 3240
    },
    {
      "name": "Mason",
      "person_id": 3421
    }
  ],
  "release_date": "2011-04-13",
  "scene_id": 1400,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Shaved",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Dalton & Mason - Serviced"
}