{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had three eager guys wanting to try something new. A quick TagTeam adventure for your mid-week pleasure!\nKent was the most nervous, yet ironically stayed hard consistently, whereas Kristopher was excited, especially with the idea of being fucked and sucking a dick. The boy is straight, but he does love to perform, and a little anal stimulation does him good.\nNash was a little nervous after seeing Kent's cock, but then realized he has taken much bigger.\nI thought for sure Kristopher and Nash would 'carry' the film, but with Kent's ever hard cock, and Kristopher's on the set 'directing', they lead the way.\nIt's so cool to see Kristopher just take charge of a situation. There is a moment when he was going to go sit on Nash's cock then realizes it wasn't gonna be hard enough to sit on, he switches gears and sucks on it, and then pulls Kent back into the scene, guiding Kent's cock into Nash's mouth as if to say, \"Hey! Stay busy!\"\nWe try a few challenging positions and I thought I had a bit more footage then I had, but a lot of it was scrambling to hurry and get a dick in a hole before it goes down. Not something to highlight.\nBut there are a couple cool highlights. We have seen Nash nut like 20 times by now (he is on hiatus for 6 months, though some other videos might still be due to release in the coming months), but this was a major nut for him!\nThen Kristopher always needs something extra, like a vibrator on his dick, or a butt plug up his ass, to get him over the top.\nWhen it came time to nut, all the other dicks were spent, and I think Kristopher was counting on some prostate stimulation to make him cum. We of course have a few toys around, and he sneaks a butt plug up there, pulling it out just after coming.\nI will have to remember that trick with him the future, but frankly, I think with him, it always has to be something different. So, who knows? Maybe next time he will want a female blow up doll.\nOverall, some super hot oral, nice fucking, and three awesome cumshots!",
  "models": [
    {
      "name": "Kent",
      "person_id": 3399
    },
    {
      "name": "Kristopher",
      "person_id": 3401
    },
    {
      "name": "Nash",
      "person_id": 3315
    }
  ],
  "release_date": "2011-04-20",
  "scene_id": 1401,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Kent & Kristopher & Nash - TagTeam RAW"
}