{
  "collections": [
    "ChaosMen"
  ],
  "description": "Dante wanted to come back and do another video and he suggested we capitalize on his bondage fetish.\nI am not super keen on hard core \"tie-em-up\" stuff. I always like a hint of it, or implied. My studios just aren't setup for that genre of video.\nSo we do the shoe string thing with some easy off cuffs and near the middle of movie we just decided to go hands-free 'cuz its just too hard to shoot, even with the length of rope he had.\nBut the key element of this video was the Surprise Factor. I just didn't want Dante to know how big of a cock he was in for. So I blindfold him and Taylor just enters to use Dante as his Toy. That of course keys into Taylor's 'bossy' side.\nWe use a few toys here and there, but mostly its about Taylor 'using' Dante to get off. I think Dante got more and more nervous as Taylor's cock grew in his mouth and realized it wasn't even fitting in his mouth. How was he gonna handle it in the ass?\nBut Taylor works his cock in to him slowly, and I am certain Taylor loved having someone take his cock balls deep.\nTaylor delivers an awesome cumshot, juicing Dante good!\nWe eventually lose the blind-fold as I kind of wanted to make Dante see or have Taylor's ass riiiiiight there in his face while he comes. He even gets off to having him sit on his face while he nuts.\nIf you like a little lite bondage, and seeing a big beefy man take it with some 'cock size surprise,' this video will float your boat!",
  "models": [
    {
      "name": "Taylor",
      "person_id": 3343
    },
    {
      "name": "Dante",
      "person_id": 3355
    }
  ],
  "release_date": "2011-06-24",
  "scene_id": 1402,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Dante & Taylor - RAW"
}