{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ok, so this isn't technically a Serviced video. More like an Oral only video.\nI really liked working with Johannes, but he has a boyfriend who has put some limits on what he can and can't do. (No eating ass too?)\nBut I loved his energy and I thought it would be awesome to have two animalistic gay guys go at it with full-on fury.\nAnd that's what we get as the two practically gobble each other up!\nJohannes stays soft until he gets Vander's cock in his mouth and I think needs to be more upright. Vander just leads the way and I love the shot where Vander takes off his underwear and Johannes just looks with wonder at how big Vander's dick is. I think it has been a rare thing for him to find guys with as big a dick as his.\nJohannes is greedy for it, and blows Vander every way possible. Vander, not to be outdone, hungrily sucks Johannes back.\nBefore the shoot I taught them a \"fake fucking' technique that I have used on a number of occasions. The Top usually is fooled into to thinking they are up inside you, and it worked for Vander who felt like he was fucking Johannes. We, on the other hand, don't get quite the satisfaction.\nThey do a little 69-action, then move onto to busting a nut.\nVander takes control of his cock, while Johannes stands ready to eat every last drop of Vander's load.\nJust like the G:hole video he performed in, Johannes took that creamy load into his mouth and used it to nut almost under a minute into Vander's eager mouth.\nYou have to watch his cumshot closely. He unloads into the air, then onto his tongue, and you think he is done shooting (or at least Vander did too!) so he starts sucking the last few drops out of Johannes' uncut cock. It pops out and another substantial squirt of jizz hits Vander in the face.\nYeah, I know, it would have been hot to see these to leviathan-cocked guys fuck, but we stuck to everyone's limits and still got one of the hottest oral videos on the site!",
  "models": [
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Johannes",
      "person_id": 3415
    }
  ],
  "release_date": "2011-05-04",
  "scene_id": 1403,
  "tags": [
    "Sex Act - Oral Only",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Facial  Cum Eating",
    "X-Tras - Piercings"
  ],
  "title": "Johannes & Vander - Serviced"
}