{
  "collections": [
    "ChaosMen"
  ],
  "description": "I was hesitant to put Micah with Vander. Micah can get off to being fucked if the dick isn't too big. Well, Vander doesn't exactly have a 'Starter' cock.\nWhat I forgot was Micah's ability to take a good dose of pain and turn that into pleasure.\nBefore the shoot, I usually will warn the other model that Vander has an...uhhh...enviable cock. They STILL get surprised, and Micah was no exception.\nThey start off doing some kissing and oral.\nI originally told Micah he would only have to bottom once, and he was gonna hold me to it after seeing Vander's cock balloon up in his mouth.\nTurned out, with a lot of lube, Vander hit Micah's sweet spot and he said he was down to be fucked on his back, his favorite position. He probably could have busted a nut that way, but Micah is as good a top as Vander, so it was time to flip-flop.\nVander rides Micah like a pro. There is a little bit of trying to get it in, but Micah can really fuck like a piston in that position and Vander, well, he's got skillz!\nEventually Vander ends up on his back, and in both positions, he is hard as rock.\nA lot of the audience doesn't really believe these guys are straight, but Vander knows after one 45 minute car ride with them that they are. He knows pretty quick that he is dealing with a straight guy. I think it turns him on extra knowing he got fucked by one, but also that he gets to fuck them with his big tool.\nMany of us have the fantasy of fucking around with a straight guy. It makes Vander extra hard knowing this. I think he gets to repeatedly have his fantasy come true each time he does a scene with one.\nIn other words, I think he really likes his job!\nMicah fucks Vander till he cums. He's was good at trying to stay in, but I think he wilted a bit while Vander ramped up. It still was enough to really turn Vander on and put him over the top, but Micah struggles to stay the course.\nBut Micah is never far behind the other model's cumshot. This time he aims a bit high when he unloads on Vander's ass. He tidies up by using his cock head to \"sweep\" all his cum into Vander's hole!",
  "models": [
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Micah",
      "person_id": 3390
    }
  ],
  "release_date": "2011-07-08",
  "scene_id": 1405,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Micah & Vander - RAW"
}