{
  "collections": [
    "ChaosMen"
  ],
  "description": "Van is back after \"practicing\" with a toy while trying to stay hard, and actually nutting with it. He's in better shape too, and I was eager to get this guy back who never complains, and though not self-admittedly a \"bottom\", seems to enjoy it.\nHeath never droops during his shoots, unless the cock is really big. He feels he is a Top and just wants to fuck guys. I tend to agree, but it's hard to find guys that will take his steel rod all the time.\nBut Van was up for it.\nWe worked the blue couch for this one, which has all kinds of challenges. Its too low, it wiggles around, and ideal fucking positions don't really allow for a clear shot of the fucking.\nHeath is always hard, so I knew he could just fuck in any position, and sure enough the two worked really hard to allow us to see all the action.\nThe two definitely had some chemistry and I dunno, when Heath just gets to fuck a dude who can take it, he is in his element.\nHe still astonishes me that he is one of the few models that can fuck right up to the last second and unload. He's great with creampie action.\nVan nuts on the couch, and though Heath isn't fucking him, he nutted pretty easy.\nIn fact, this is one of those videos that shot themselves and didn't require too much \"direction\" and was shot in \"real time.\" I don't that isn't that ringing of an endorsement, but the flow and chemistry is so much more noticeable!",
  "models": [
    {
      "name": "Heath",
      "person_id": 3376
    },
    {
      "name": "Van",
      "person_id": 3347
    }
  ],
  "release_date": "2011-06-22",
  "scene_id": 1409,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Heath & Van - RAW"
}