{
  "collections": [
    "ChaosMen"
  ],
  "description": "Dalton is back for his first RAW scene, and this time he is taking on veteran dudes Eli and Silas.\nMy main goal was to finally get Dalton fucked!\nHe did have a fair amount of anxiety, but I knew Silas would go slow and easy on him for the insert. In fact it was a bit too slow, but Silas eventually gets some motion going. Be patient as Silas was trying a little too hard to be kind on his first try. Frankly I think Dalton could have handled more.\nIt was very hot to finally see Dalton getting fucked AND have Eli's giant cock in his mouth!\nI knew Silas and Eli would have really good energy, but Dalton has always been a bit reserved. But he was 'in the moment' and really kept busy, trying to keep his mouth, hands, or cock doing 'something' at all times.\nEveryone gets sucked and fucked in this video and there is a bit of something for everyone. Even a bit of rimming.\nSilas rarely gets to top, and he unloads onto Eli's hole. He's not quite mastered the \"Cum at an angle so we can see you cum,\" but there is plenty of juicing action and squirts so you can eventually see the shot. Thank goodness for multiple camera angles!\nSince Silas is not fussy about cum on his face or mouth, I thought we would end with a double facial. Eli was supposed to wait until Dalton nutted, but he just got too close, and nuts first. Leaving Dalton way behind. I think most of Eli's nut dries by the time he nuts. Plus, we had to wipe Eli's cum out of his eye! Oh the burn!\nThere is still gobs of DNA everywhere and it is a great ending to a rather long video! (Be patient! It is a 30 minute video!)",
  "models": [
    {
      "name": "Dalton",
      "person_id": 3240
    },
    {
      "name": "Eli Hunter",
      "person_id": 3340
    },
    {
      "name": "Silas",
      "person_id": 3229
    }
  ],
  "release_date": "2011-07-15",
  "scene_id": 1417,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Dalton & Eli Hunter & Silas - TagTeam RAW"
}