{
  "collections": [
    "ChaosMen"
  ],
  "description": "In Joshua's previous real life experience, he had attempted to suck dick and play with a guy only a couple times. I think he is exploring his bi-side with us. Previously it was more of a \"I'm really drunk, let's try this\" kind of thing.\nHe was down for sucking Ransom in return. 'Excited' might be too strong of word, so I think 'eager' would be more appropriate to describe his enthusiasm.\nJoshua is actually hard during this entire video, and I think his dick just has a lot of bend at the base. The kind that would be useful fucking someone upside down on a jungle gym!\nYou can tell Joshua is eager to suck dick, but still not quite sure what to do. Oh, he has the basics, but he is just getting started trying a lot of techniques all at once...not hitting a rhythm.\nRansom was just happy having his dick sucked!\nThe two do some really nice 69 oral action too!\nI also love it when we get to see Ransom hammer a dudes dick, making him cum. He's got more energy than me, so I am glad he has been stepping in!\nI almost could call this video a facial, as Ransom was going for distance when he nutted, narrowly missing Joshua's face and splattering the pillow by his ear.\nLike Johannes and Vander, it's just fun to see two guys go at it now and then, with no reservations. Sure the straight guys have that nervous charm, but every now and then it is nice to have two dudes both way into sucking each others cocks!",
  "models": [
    {
      "name": "Joshua Cohen",
      "person_id": 3424
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2011-05-18",
  "scene_id": 1422,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Joshua Cohen & Ransom - Serviced"
}