{
  "collections": [
    "ChaosMen"
  ],
  "description": "Mason has been doing straight porn, but his experience with dudes has been pretty limited.\nI thought he would adapt faster, but he did struggle a bit with all the cameras and having to stop now and then for everyone to get hard. Shooting a straight porn...well...straight through, has been common for him. So he was surprised his dick wasn't staying up the entire time. I wasn't surprised.\nIsaiah's cock did stay standing at attention, though he did get a little wobbly while Mason rode his cock. But it is always nice to pair a 'ringer' with a new guy.\nSpecial props to Mason who WAS indeed nervous taking his first cock and volunteering to bottom first time out. He just didn't think he would stay hard enough.\nIsaiah is so confident in staying hard, he just went nice a slowly. No terribly Ouchie moments!\nDuring the first part of the shoot, Mason was getting fucked doggy-style, and a couple times he asked me \"How much longer do I have to bottom?\" I didn't have the heart to tell him that we were just getting started.\nBut once Mason got on top of Isaiah and could control depth, a switch was turned. Then by the time we got him on his back, he was stunned that he kept getting close to cumming while being fucked. So much for him watching the clock the entire time!\nIn fact it did make him cum, muuuuch quicker than it did for his solo and oral videos.\nStill, he is eager to Top, and asked for a flip-flop film next.\nIsaiah delivers a massive load and juices Mason for his first creampie!",
  "models": [
    {
      "name": "Mason",
      "person_id": 3421
    },
    {
      "name": "Isaiah",
      "person_id": 3397
    }
  ],
  "release_date": "2011-07-27",
  "scene_id": 1424,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Isaiah & Mason - RAW"
}