{
  "collections": [
    "ChaosMen"
  ],
  "description": "I knew from the beginning that Oliver was not going to be a typical Serviced video.\nEven though he is married, he is clearly \"orally-fixated.\" For his solo, he wanted to watch guys sucking each other, and unloading in each others' mouths. Hot!\nHe even needed a small toy to stimulate his prostate to get him over the top.\nOliver is fairly passive, so I didn't think he would respond to laying there and simply getting his cock sucked. I figured he would get charged up by having a cock in his mouth to begin with.\nAnd like a married man starved for a cock down his throat, he went for it! I could tell right away Ransom was pleased that this Serviced video was gonna be one all about him. No nervous first-timer that he had to be careful about pushing the wrong limit button.\nOliver eagerly sucks Ransom's cock to the point that tears run down his face.\nBy this time Oliver's dick was up are ready for some attention, and knowing Oliver wanted a cock in his mouth, they go right to 69ing it.\nEventually Ransom fingers his hole, then takes some vibrating toys to his ass. His dick gets even harder.\nHe finally shoves a vibrating butt plug in there and lets Oliver have full access to his cock while Oliver jerks off.\nHe nuts a huge load, and I swear, I had to scramble fast to get Ransom's cum shot. It turned him on so much seeing Oliver lay there with the toy in his ass while getting sucked off, he was holding off on cumming the entire time.\nI should have it as an outtake but it's basically Ransom saying he is gonna nut and I am saying. \"Wait! Wait!\" as I try to get a focused close-up shot of him unloading into Oliver's mouth. As it is, my close-up shot swings in to place just as Ransom is literally pinching off his nut shot.\nOliver said he wanted to eat all the cum before the shoot, and I told him he needed to showcase some of it before he swallowed it. The kid literally gargles in it! It's kind of funny.\nDon't get too many guys willing to eat loads, so Oliver, you're hired! My guess is you would make a hungry bottom as well!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Oliver",
      "person_id": 3425
    }
  ],
  "release_date": "2011-05-25",
  "scene_id": 1431,
  "tags": [
    "Build - Lean",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Oliver & Ransom - Serviced"
}