{
  "collections": [
    "ChaosMen"
  ],
  "description": "Tobin Tops!\nEvery video he gets more and more confident and actually enjoys getting fucked now too!\nNormally we struggle with him staying hard, but his ass and body are so amazing that well, he makes a great muscle bottom!\nThis was Joshua's first sex film, and he was all set to to top. But ast the video progressed and Tobin's cock was standing up, I lamented that it would be a shame to waste using his big tool.\nJoshua, although not jumping for joy in anticipation of being speared by Tobin's cock, actually volunteered to bottom for one position. Joshua was very realistic about it. He wants to keep working, and knows that when a guy only tops, it is dang hard for me to keep finding guys for them to fuck.\nSo he was game for bottoming, despite not having a couple days mental preparation that most of the guys go through.\nTobin's dick is long and if it is even the slightest bit wobbly, has has to keep his hand bracing it. Though, after a minute or so, he gets the motion going, and is topping handsfree!\nI really want to thank Joshua for allowing Tobin to top. We usually stick to a plan and I don't like changing things up on the guys as it seems like they feel bait and switched.\nOn top of all this topping, Joshua learned he can cum while being fucked. So he will be a versatile player in the future.\nAnd Tobin is ready to take on anything (except a load to the mouth! That's hard for all of them!)",
  "models": [
    {
      "name": "Joshua Cohen",
      "person_id": 3424
    },
    {
      "name": "Tobin",
      "person_id": 3403
    }
  ],
  "release_date": "2011-07-04",
  "scene_id": 1432,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Joshua Cohen & Tobin - RAW"
}