{
  "collections": [
    "ChaosMen"
  ],
  "description": "I learn something knew every video shoot.\nI knew if I put both Heath and Micah together, that it would be a much easier shoot than normal. Both are \"Pros\" by now, and their biggest strength is that once they get into the scene, their dicks rarely, if ever, droop.\nI tend to be able to shoot straight through without having to stop and watch some straight porn. (Sorry if that ruins the fantasy for you all, but Straight Porn On Set is always rolling!)\nBut neither one of these guys has to rely on it much. Figured it would be a simple shoot with real chemistry. And it was for the most part, with the exception of one moment.\nHeath has done a fair amount of videos, and I am VERY confident he will stay hard. He can do a niiiiiice and slow insert on a new guy and not wilt.\nWell, in today's video I discover that he's not so good fucking someone while on his back. It is the only time I have seen him get wobbly!\nAnd like Pros, they both realize it's not working and switch positions. Finally Heath fucks Micah on his back, making him nut. It's an awesome to see Heath's cock at full potential, sliding in and out of Micah while he nuts.\nWe get a really cool undershoot of Heath unloading onto Micah, scooping all his jizz into his open hole!",
  "models": [
    {
      "name": "Heath",
      "person_id": 3376
    },
    {
      "name": "Micah",
      "person_id": 3390
    }
  ],
  "release_date": "2011-08-26",
  "scene_id": 1433,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Heath & Micah - RAW"
}