{
  "collections": [
    "ChaosMen"
  ],
  "description": "Today's goal: Get Curtis fucked!\nHe has been hinting that he wants steady work. He has a daytime job, so does ok on money, but the extra boost in income is quite nice for him.\nAlthough not eager, he was willing to try and be a versatile player.\nNow, Stone, he seems to have gotten in the 'zone' to be fucked. So he was not nearly as worried about tossing his legs in the air.\nBut I figure with all the tatt work Curtis has, he could handle some initial ass pain.\nI wanted the two to really get all riled-up for the fucking, so I had them sit and watch a straight porn together. It feels \"setup\" as it is neither of their's first time. The idea was to give them some visual stimulation and then more naturally move into some cock sucking.\nBoth guys suck cock, well, like a straight guy! I think they were both conscientious about teething the other guy. Despite the amateur technique, over all it actually worked to keep them hard. It was awesome to see Curtis WAY hard with Stones cock practically chocking him while they 69 it. Whatever they were doing or NOT doing was working!\nWe decided to leave Curtis's fucking until last just in case his cock went unresponsive after being ass fucked.\nI think it helped Curtis seeing Stone take his cock AND staying hard.\nCurtis eventually took Stone's cock, and stayed reasonably aroused for it.\nI really wanted to see Curtis get cream-pied and bred, and Stone did a magnificent job.\nI also wanted to showcase Stone's chest hair, and knew that Curtis is much better upright when he busts, so we had him spray paint Stones's chest hair with his load!",
  "models": [
    {
      "name": "Curtis",
      "person_id": 3406
    },
    {
      "name": "Stone",
      "person_id": 3398
    }
  ],
  "release_date": "2011-08-12",
  "scene_id": 1436,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Curtis & Stone - RAW"
}