{
  "collections": [
    "ChaosMen"
  ],
  "description": "Mason was confident he could be Top. He has no problems doing straight porn, but says he has given it up 'cuz he finds the porn girls to be um...off-putting.\nI wasn't so sure he could stay hard enough to carry a shoot as a Top, and Heath is ever-hard. So I told him he could top one position.\nHeath starts off by sucking Mason's cock, it goes up and it goes down. So I was starting to be a little concerned.\nMason sucked back and did a great job keeping Heath hard, and in fact when they got in the 69 position, Mason's cock really started to wake up! OK, so maybe this will happen!\nWe start Mason getting fucked doggy style, and you have to watch real close as he almost accidentally nuts. He comes upright and lets go of his cock fast. Heath wasn't going balls deep, but he was clearly hitting the right spot.\nThen it was Mason's turn to fuck Heath. Now Heath, he just zones out, and is too afraid to touch his cock while being fucked after accidentally nutting too soon. He stays hard, which shows he is turned on, but it is \"all hands off\" when he is getting fucked.\nWe finally got Mason on his back, which works so well for the guys to cum in. It just hits the sweet spot. Well, Mason said the doggy-style position was making him nut while the being on his back, not so great.\nOh he stays hard, but he knew wanted to go back to doggy in order to cum.\nBut we were committed and Heath was ready to nut too. We just let Heath jab around Mason's hole while he tries nutting.\nAnd Heath, like a pro, delivers frosting to Mason's hole like a master chef, swirling around all that baby batter!",
  "models": [
    {
      "name": "Heath",
      "person_id": 3376
    },
    {
      "name": "Mason",
      "person_id": 3421
    }
  ],
  "release_date": "2011-08-08",
  "scene_id": 1439,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Heath & Mason - RAW"
}