{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is Austin's first time fucking ass, even including women! And a 3-Way TagTeam on top of that!\nKind of a trial-by-fire for him. He liked the idea that all the pressure wasn't going to be on him to stay hard the entire video.\nVan is there to be everyone's 'Boy' and as Vander says, \"You take it like a champ dude!\"\nVander just wanted to fuck a passive bottom again, and he thought Austin's body hair was hot. He was in TagTeam Heaven! We even get some armpit licking in there.\nVander gets his cock worshiped by Van, while he and Austin kiss with genuine passion. Finally Austin dives down to suck cock for his first time. He gags a couple times, but he does a fine job.\nThen it's Austin's turn to get his cock sucked. Vander goes to town on him and you can tell Austin is literally blown away. Eventually Van gets down on the ground and we get a nice cocksucking tree going on.\nFinally we get Van ready for some big cock as Vander eats out his hole to loosen him up, but to also get his dick fully charged.\nVander pillages Van's hole while Austin has him suck his dick.\nThey switch places and Austin gets his first chance at fucking ass. I think Vander got-off on filling both of Van's holes at once.\nAustin loses his wood and Vander jumps right back in. Austin recharges but this time he fucks Vander, making a Vander Man Sandwich.\nVander can't move much as Austin fucks his ass, but we get a pretty good daisy-chain-fuck going! Sweet!\nThey finally flip Van over and Austin fucks him with no remorse, ramping up to nut.\nHe unloads from a distance and I KNEW that Vander would love to fuck a cummy hole, and sure enough it puts him over the top, and he double cream-pies Van moments later.\nAnd then it just kind of ends...unless you stay till the very end for an Outtake.\nWe tried to figure out how best to get Van off. He was basically used during the video and had to get himself off. Vander and Austin were keen on helping him out, but Van knew he needed to really stroke himself off.\nVander was willing to eat his load too. So Van sat down and watched some straight porn.\nHe takes about 20 minutes and I normally keep my video cameras rolling. I got them on just as Van and the boys jump into position to nut into Vander's mouth, Austin behind to help encourage.\nVan is cumming as everyone is moving.\nSome cum flies wild, while the rest hits Vander's mouth.\nVander, still trying to save the shot, stands up and kisses both guys with his cum-coated mouth and face. It's a very hot ending actually, but the continuity is not there to make for a smooth ending...hence it as an outtake.\nI could have left it out, but I thought it was hot to see Austin actually kiss a dude with cum on his lips. He REALLY pushed his limits!",
  "models": [
    {
      "name": "Austin",
      "person_id": 3426
    },
    {
      "name": "Van",
      "person_id": 3347
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2011-08-05",
  "scene_id": 1443,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Video - OutTake",
    "X-Tras - Piercings"
  ],
  "title": "Austin & Van & Vander - TagTeam RAW"
}