{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a very misleading video. You think Jamison is going to get fucked hard by Vander, but we didn't go down that..um...chute.\nMisleading the viewer wasn't intentional at all.\nBefore the shoot I had told Vander he was most likely going to have to bottom the entire shoot. He likes to flip-flop. He is a most excellent Top and Bottom. He doesn't mind bottoming the entire time, he just likes EVERYTHING.\nI just didn't think Jamison could take Vander's rather significant cock.\nBut once they got in the room Vander took control and was all over Jamison's cock, and most especially, his ass. Vander is cool with eating ass, but it has got to be the right guy, and Jamison certainly put him in the mood to toss some salad.\nThe video 'feels' like Jamison is about to be fucked, and in fact, it was going so smoothly, Jamison DID try to take Vander's cock 4-5 times, but he just kept wiggling away or jumping away like he was being stabbed with a hot poker. Didn't even think it was Outtake material as it's just kind of awful seeing how frustrated he was that he couldn't do it.\nSo we switched back to the original plan, and both parties were fine. Vander got to be fucked by a cock \"just the right\" size to nail his sweet spot, while Jamison really got to ramp up his speed and do some ball slappin' action.\nJamison fucks the cum out of Vander, the two of them trading verbal the entire time. Jamison even does a great job unloading in a timely manner all over Vander's hole!",
  "models": [
    {
      "name": "Jamison",
      "person_id": 3392
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2011-08-19",
  "scene_id": 1444,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Jamison & Vander - RAW"
}