{
  "collections": [
    "ChaosMen"
  ],
  "description": "I wanted to do a nice flip-flop film, and mix Stone with a non-hairy guy. Somethig for everyone.\nStone has been better at Topping than Bottoming, though at one point he thought he as going to nut while getting fucked. Progress!\nWhile Joshua seems to be equally at home Topping or Bottoming, my instinct tells me he really enjoys bottoming. His cock rarely goes limp while getting fucked, and so far it makes him nut pretty easy.\nI threw an extra challenge at Stone to fuck Joshua up on the bed doggy style. This of course requires balance and also really knowing your trajectory angle, but he did fine. I tend to avoid this position because it is complicated, and sometimes it is hard to show the action, but I am really pleased with both their abilities in showcasing the fucking.\nAnd again, Joshua stays pretty hard while Stone does a balancing act on top of him, while fucking him pretty deeply.\nStone gets fucked too. His face is funny to watch. He goes from, \"Easy there fella!\" to \"Ok, this is feeling good!\" Like I said. progress.\nFor the big finale, Stone and Joshua swap positions. Stone does a fine job fucking the cum out of Joshua who has a pretty intense orgasm.\nI don't know what Stone is eating, but his loads just get bigger and bigger and he delivers a giant creampie to Joshua's hole!",
  "models": [
    {
      "name": "Stone",
      "person_id": 3398
    },
    {
      "name": "Joshua Cohen",
      "person_id": 3424
    }
  ],
  "release_date": "2011-09-23",
  "scene_id": 1459,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Joshua Cohen & Stone - RAW"
}