{
  "collections": [
    "ChaosMen"
  ],
  "description": "Manning was down for a blow-job and I planned ahead to have Micah in town to do the honors.\nQuite the dichotomy between hairy-dude Manning, and smooth-skinned Micah, but I actually like the way the two look together.\nMicah had no problems blowing Manning, who kept trying to get Micah to, \"Suck harder.\"\nBefore the shoot, Manning thought there might be a chance that he would suck Micah's cock.\nSo Micah, who was turned on by the fact he was keeping Manning aroused, made his cock available to him.\nManning eventually takes it out and strokes it, but just can't bring himself to return the oral back. Ironically, though, Manning's cock doesn't wilt. A good sign!\nMicah gives up on the idea of getting blown, so rubs his cock on Manning's leg.\nI love little body-language moments like this. It shows Manning, despite not being able to suck back, was not turned-off by Micah's cock, and in fact, seems to get harder.\nMicah does his best to showcase Manning's ass, but I think rimming is beyond his limits.\nMost of the guys say they can't cum from a blow job, and if they are under 20, I tend to think they just haven't been with girls experienced enough. But since Manning is 25, I figured he knew his body well enough to know his limits.\nSo we switch it up so Manning is upright and has a view of the pussy porn. Micah lays down under Manning and the two of them try to match their unloading.\nYou can tell that Micah is just 'edging' himself the whole time, waiting for Manning to spurt.\nManning nuts all over Micah's chest, who moments later adds his own DNA to his body.\nTwo well-timed giant loads! Gotta love it!",
  "models": [
    {
      "name": "Micah",
      "person_id": 3390
    },
    {
      "name": "Manning",
      "person_id": 3437
    }
  ],
  "release_date": "2011-08-24",
  "scene_id": 1470,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer"
  ],
  "title": "Manning & Micah - Serviced"
}