{
  "collections": [
    "ChaosMen"
  ],
  "description": "Rudi emailed me saying he was up for a blow job video, but actually wanted to suck some dick back, as he thought, \"That might be hot\"\nRudi is married, but has got that whole bi thing going on. Not sure how much guy/guy experience he has had, but he seems relatively new to it.\nEnter Jessy, who was actually a last minute insert. I am trying to avoid having Ransom on week after week (Yes, I listen) and Jessy was free.\nThe only problem was, he woke up that morning and had nutted, then found out he was doing a blowjob video that he was actually going to have to get his dick hard for.\nAfter all, most of the Serviced videos, the \"Blower\" usually doesn't even take their pants off.\nSo he was a little nervous he could even get hard when he found out that Rudi wanted to get hard by sucking some dick.\nThankfully Jessy's cock perked right up and that helped Rudi get some momentum on his own cock.\nWhen it came time for Rudi to get his cock sucked, he was impressed with Jessy's skill. His dick gets pretty big from the attention.\nThey do some 69 action, but both are relatively quiet. I think Rudi is in that \"Covert Mode\" as it is usually something he is doing on the sly.\nI told Jessy he didn't have to nut, since in most Serviced videos, it is the new guy that is supposed to nut, so he was relieved.\nRudi's solo aired quite some time back, but you might remember he had an unusual jack-off technique.\nI didn't think Jessy could make him nut, so Rudi does his \"press-down\" on his cock motion and then tries to shoot on Jessy's chest. Some hits but most falls to the bed.\nNot one of the smoother Serviced videos, but clearly you can see Rudi was pleased to have a cock in his mouth, and if you like an amateur feel to these videos, the two definitely look like they are nervous about what to do!",
  "models": [
    {
      "name": "Rudi",
      "person_id": 3429
    },
    {
      "name": "Jessy",
      "person_id": 3436
    }
  ],
  "release_date": "2011-09-07",
  "scene_id": 1482,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Jessy & Rudi - Serviced"
}