{
  "collections": [
    "ChaosMen"
  ],
  "description": "So you might know Jack already, but he is Chip here at ChaosMen.com\nEconomic times, and the scouts and models are hustling to get in as many gigs as they can with apparently as many studios as they can.\nChip did a solo and an oral video a while back. (which I did so some of you will be relieved, while others will be glad I am back, cock in mouth/hand!)\nBut I thought I would pop is first sex-scene online, since his solo aired elsewhere.\nBelieve it or not, there are fans of solos and oral only vids, so I will just save those maybe for the end of the year blow out, or some other marathon.\nBut today you get to meet him in Raw action for the first time.\nAnd this was kind of a last minute partnering.\nKent's scene partner had girlfriend drama, so dropped out last minute.\nChip was here doing his solo and Serviced video, and he volunteered right then and there to step in.\nI told him that Kent kind of had a big cock, but Chip was eager to get a motorcycle, and making another wad of cash sounded more appealing than a big dick up his ass.\nSince he was in town, I could get him tested fairly quickly too, so it worked out well.\nSo Chip didn't have the full mental prep that most guys go through. One week he is jerking-off, the next week he is fucking a dude.\nHe does dang good too. We start off with him fucking Kent, and he does a fine job showcasing the action.\nFor his first time getting fucked, I figured Kent could stay hard enough for Chip to slowly slide his giant cock inside of him, monitoring the depth himself while he road Kent's cock.\nThe first part is tentative, but Kent eventually gets most of his cock inside of him. Chip even had a moment of pleasure as he was riding Kent's cock.\nSo much pleasure that instead of topping again, he thought he could lay on his back and take Kent's cock. That of course gave Kent a better angle to dive in deep, and Chip keeps his hand firmly planted on Kent's thigh to stop him from going in too far.\nChip pretty much lost his wood on this position, cumming this way now a pipe dream, so Kent ramps up and juices Chip's hole.\nChip needed a breather after taking his first big cock so deeply, so we let him lay and rub one out on his own. I am not fond of these endings, but Chip had done a great job, and was so enthusiastic about doing all this without complaining, I figured I would give him a break.\nCan't wait to see Chip grow as a performer. I think he will just get better and better. For his first time, he did pretty dang good considering the cock size he started with!",
  "models": [
    {
      "name": "Kent",
      "person_id": 3399
    },
    {
      "name": "Chip",
      "person_id": 3439
    }
  ],
  "release_date": "2011-06-03",
  "scene_id": 1486,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Chip & Kent - RAW"
}