{
  "collections": [
    "ChaosMen"
  ],
  "description": "For Darius's first time I wanted to put him with someone with a similar build, though I think of Jamison as being a mini-version of Darius.\nCome to find out Darius's girlfriend likes to use toys on him, and he was not going to be squeamish about bottoming at all. Usually the first time out, they want to top. But once on set, he was all, \"Oh bottoming wont be a problem!\"\nThe two trade oral, and you can just tell Darius is way into it. He is not gonna be shy about it, and goes full-tilt.\nJamison also handles Darius's uncut cock quite well, keeping him nice and turned on.\nDarius fucks Jamison first, and it takes him a bit to keep solid. At that point I was glad that Darius was planning to bottom the next position.\nBut then he hit his groove and he was fine.\nThen as soon as he flops on his back to get fucked, his dick literally gets twice as hard. The dude LOVES to be fucked!\nThis big masculine stud is a Bottom!\nJamison fucks him good, and then they flip back.\nBut this time Darius is on his game, and I am back to thinking this dude is a great Top too! Completely versatile, but I think he likes having his ass played with more.\nCase in point, he wanted a small butt plug in his ass in order to nut quicker.\nI love this pairing, and I am really glad to have Darius on the team. He has great sexual energy!",
  "models": [
    {
      "name": "Darius",
      "person_id": 3435
    },
    {
      "name": "Jamison",
      "person_id": 3392
    }
  ],
  "release_date": "2011-07-01",
  "scene_id": 1490,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Darius & Jamison - RAW"
}