{
  "collections": [
    "ChaosMen"
  ],
  "description": "What would Monster Cock week be without Vander's ginormous cock?!\nHis dick looks super-sized when matched with Oliver's tiny frame.\nVander loves to Top, and he had been asking me if I had any guys that would let him fuck the dude with wild abandon. No tentative fucking of a straight or even a gay guy.\nI asked Oliver if he could take Vander's cock full-speed, and he said, \"No problem.\"\nI have mentioned before, Oliver is definitely Orally Fixated. He loves to suck cock, or even just watch it being done. Letting him suck on Vander's knob was like giving a baby a pacifier. He was in cocksucker bliss.\nTrue to his word, he was able to handle Vander's ample cock, and with only a few \"ouchie\" moments, he takes a pretty good pounding.\nI think Vander gets a cardio workout on this one, so I think he got his wish of having his way with a bottom boy.\nOliver \"kind of\" nuts (I sure can't see it, I know you wont be able to) when Vander fucks him in the last position. He is jerking so quickly, that I don't see anything flying. But he was spent, and that was all that was going to come out.\nThankfully, Vander shows that he can fuck right up to the last second. Sliding in and out of Oliver's hole to the point of cumming, then unloading on his hole, squishing all that DNA up into him!\nAnyway, hope you enjoy Vander's Monster Cock doing what it does best- splitting a boy in two!",
  "models": [
    {
      "name": "Oliver",
      "person_id": 3425
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2011-10-26",
  "scene_id": 1494,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Oliver & Vander - RAW"
}