{
  "collections": [
    "ChaosMen"
  ],
  "description": "What can I say, this one seemed like an odd pairing. But it worked!\nRoger wanted to do a sex scene, agreed that bottoming would be easier for him, and also wanted to work with someone uncut, but not TOO big.\nEnter Darius. In my mind, not super hung.\nBut I kind of forget that Darius IS rather well-endowed. He is such a massive guy, tall and thick, that though his dick looks appropriate and it is in scale with his body, his cock is really impressive!\nSo Roger was not too happy when he saw how big Darius was getting.\nDarius was pleased as punch, because he knew we would be playing with some toys, and the dude is just a pro. He loves talking dirty and using the toy on Roger, but moreover, loved having someone take a toy to him.\nHe Tops quite nicely in this video, but the boy seems to be truly a Bottom. I have got to get him fucked or TagTeamed! (Vander! Vander! Vander!)\nRoger struggles a bit to take the cock, but eventually succumbs.\nI think the hottest moment is Roger riding Darius's cock, while Darius has a vibrating toy up in him. Talk about one hard cock!\nLike his last video, he even uses the toy to cum. His cumshot is not trimmed down because I thought it was hot watching him fuck himself with the toy until he cums all over Roger's hole and breeds him.\nWe fade to Roger's cumshot as he nuts then sucks on the cock that was pillaging his hole moments earlier!",
  "models": [
    {
      "name": "Darius",
      "person_id": 3435
    },
    {
      "name": "Roger",
      "person_id": 3440
    }
  ],
  "release_date": "2011-09-02",
  "scene_id": 1503,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Darius & Roger - RAW"
}