{
  "collections": [
    "ChaosMen"
  ],
  "description": "I was really excited about putting these two together.\nMicah is an awesome Top, but he likes to cum from being fucked. Dwight is still on the fence about getting fucked, BUT he finally relented and sucked some cock.\nYes, a cock has finally touched Dwight's lips!\nYou can tell it is his first time, but he adapts quickly enough, and though you couldn't say he has turned pro, he ramped it up to a nice level. He certainly kept Micah hard.\nDwight stays hard while blowing him too. You may notice, most guy's cocks go down when they give head 'cuz they are focusing so much on keeping the other guy hard. But not Dwight. He stays bone hard while sucking cock. Hmmmmm..\nI'm not saying anything, cuz even when I do blow jobs, I rarely get hard, but I am saying that at least he doesn't look like he is hating it, and is in fact enjoying it, despite fighting his gag reflex.\nAnd the fucking goes very smoothly too. Micah has taken some big stiff cocks, and Dwight's seems to be getting bigger, but Micah agreed after the shoot that his cock was perfect for getting fucked by. Again he only wilts a little while getting fucked- truly enjoying himself.\nSome shoots take hours to get 20 minutes, but this was one of those videos where I basically let them do their thing and we just had to stop to take pictures once. It's is so NICE to have a shoot where there is chemistry and a general ease to it all.\nDwight is really making some headway, and I love how Micah has become a seasoned pro!",
  "models": [
    {
      "name": "Micah",
      "person_id": 3390
    },
    {
      "name": "Dwight",
      "person_id": 3388
    }
  ],
  "release_date": "2011-11-16",
  "scene_id": 1506,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Dwight & Micah - RAW"
}