{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Joshua's last shoot, he told me he was really getting-off to sucking cock. I had been telling him he needed to get some technique down. Find something that worked for his partner and stick with it. As it was, I felt like he would try 5-6 different ways to suck cock in under 30 seconds.\nHe confessed he really liked sucking dick, and the power it gave over the other guy, and wanted to do better.\nSo we start of this video with Mason kicked-back, ready for some serious oral. Sure enough, Joshua stepped up his game and wasn't all over the place in terms of technique. Mason was WAY into having his dick sucked.\nEventually Mason gets upright and really fucks Joshua's face, followed-up with Mason blowing Joshua.\nMason gets Joshua all turned on and ready for his cock, and basically shows no mercy despite Joshua keeping a hand planted to stop him from going to deep. There was some Anger Release going on with Mason that day!\nWe try a new position that worked out pretty well. Joshua kind of does this squat action on Mason's dick. At first I didn't think Joshua would be able to keep his balance, but Mason held him up and also fucked like tiger. Eventually Joshua takes over.\nAs usual, Joshua is about to bust the entire time.\nIn the final round, Mason fucks the cum out Joshua who lets his load shoot all over the bedspread. It's pretty hot! I had told Mason to pull out just after Joshua cums, so I think he mistimed when he was supposed to pull out, but even still a second later Joshua busted his nut.\nMason LOVES to have his balls and taint played with. We may do this more often as it really did the trick for him! Joshua mouths his balls and pushes his thumb on his taint and it totally make Mason blow a monster load!\nHe seriously soaks Joshua's body! It's crazy!",
  "models": [
    {
      "name": "Joshua Cohen",
      "person_id": 3424
    },
    {
      "name": "Mason",
      "person_id": 3421
    }
  ],
  "release_date": "2011-11-24",
  "scene_id": 1508,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW"
  ],
  "title": "Joshua Cohen & Mason - RAW"
}