{
  "collections": [
    "ChaosMen"
  ],
  "description": "Did you grow up with a cocky jock who you secretly envied. Maybe he was a nice guy to you, but you figured he was super straight, and you would never stand a chance with him. Kind of full-of-himself, but not in too annoying of a way.\nPerhaps he was so proud of his body that he would parade around the locker room nude, whipping his junk around?\nWhat is great about Solomon is the he IS that dude. He is nearly perfect. His body is amazing, and the only flaws I can find are some road rash from cycling, and few scratch marks on his back from some females drawing some blood.\nAnd he likes it ROUGH.\nThat's right, if you have ever wanted to trade blows with a smug hot straight guy, Solomon is here to make that fantasy come true.\nHe loves pain. Getting punched, scratched, whipped.\nIn fact, I think he is a REALLY NICE guy, but will back talk or goad you until you take a swing at him. He will sit there and gladly let you pound on him. Getting a boner the entire time. You just try to wipe that smug smile of his face. He dares you!\nHis solo is intense too. He is often looking at the video playing for him, but he finally takes an interest in the audience, then his own body.\nThe best part is when he discovered he could slide his cock head into his own ass. I think that was a first for him, as well as ChaosMen.com\nThe fact that he was fucking himself with his own cock made his dick almost too hard to do the backward bend he was doing to push it in.\nIronically he hasn't played with his ass, and that internal pain is something he hasn't explored. He seems ironically leery of it considering how much he is into pain.\nI think I can get him to at least top, based on what he did the next day...\nStay tuned next week for a vicious little Edge video!\nDon't you wanna hear him scream, \"Pineapple!\"?",
  "models": [
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2011-09-19",
  "scene_id": 1510,
  "tags": [
    "Theme - Solo",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Video - HD - High Def"
  ],
  "title": "Solomon Aspen - Solo"
}