{
  "collections": [
    "ChaosMen"
  ],
  "description": "I just love working with Eli. He is always down for anything and really doesn't have too many limits.\nValentino loves to top and he was telling me he loves having women ride his cock reverse cowgirl style.\nI found it hard to believe because he has one of those cocks that stands straight up and doesn't seem to bend down much. So I tossed out the challenge.\nFirst Eli shows off his oral skills and I think it set the tone for the entire video. Valentino knew he was in for a sex ride!\nEventually Eli mounts him reverse \"cowboy\" style and sure enough Valentino's cock is embedded perfectly. Eli really works it and WOW, we get to see some awesome penetration.\nValentino barely moves from his spot while Eli hops off Valentino's dick and begins to fuck him. Valentino is a tough dude 'cuz he barely flinches when Eli sticks his huge dick inside of him. His dick doesn't even wilt, so my guess is, he was enjoying it!\nThe highlight of this video has got to be the cream pie. It is one of the best on the site! Valentino comes a lot, and Eli is awesome at providing a perfect target. Valentino stays hard after nutting and we get lots of cum-plunging action!\nValentino said he would try a facial, but it is one of those close-eyed, closed mouth ones. Not anyone's favorite, but maybe we can get him to uhhh..open up at a later time!\nThe energy in this video is sizzling!",
  "models": [
    {
      "name": "Eli Hunter",
      "person_id": 3340
    },
    {
      "name": "Valentino",
      "person_id": 3427
    }
  ],
  "release_date": "2011-10-14",
  "scene_id": 1511,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Eli Hunter & Valentino - RAW"
}