{
  "collections": [
    "ChaosMen"
  ],
  "description": "As some of you have noticed, Efren has made the rounds since shooting with me. I held-off on airing his stuff because I knew a bunch his videos were soon to be airing. Models who \"site-jump\" tend to take a beating in the blog/messageboard community, but I do want to say, that most members only belong to 1, maybe 2 sites, and detractors fail to realize that most members will being seeing a model's full scene for the first time on the site. I'm not as stringent as some sites with whole \"Exclusive!\" thing. But Efren definitely did a lot more advanced work before this simple blow job video airs. So I hope my members will appreciate bringing this hot guy to our bedroom.\nRegardless of his \"Body of Work\", this is one hot video, and Kristopher, as usual, is a sex puppy!\nKristopher gets right down to business on this one!\nHe took a hot shower and then pumped some iron, and was sweating like crazy on this one. Meanwhile, Efren is calm, cool and collected, and actually gets a little bossy telling Kristopher what he likes and to do it harder or faster.\nIt's IS a lot of work trying to keep the guys hard, most especially when it is time to make them nut. I have sweated up a storm on some of these guys.\nWe get Efren upright and finally Kristopher cools down, and then plays with his ass. I think it was a bit too hairy for him to rim. It's hard to remember that Kristopher identifies as straight, and there are just some things he can't get beyond. Even gay guys struggle with a hairy hole, even if it has been freshly showered and scrubbed good!\nI guess what I like about this shoot is Efren is one of those guys that just loves having his cock sucked. He had claimed he can cum easily from a BJ, which is usually the opposite of what I hear from guys.\nTrue to his word, as soon as Kristopher amp'd it up, he busted in no time at all.\nI don't think Kristopher knew that Efren had not finished cumming when he slid out of the scene. It's hot watching Efren's cock throb and spit out last little bits of jizz hands free!",
  "models": [
    {
      "name": "Kristopher",
      "person_id": 3401
    },
    {
      "name": "Efren",
      "person_id": 3448
    }
  ],
  "release_date": "2011-10-19",
  "scene_id": 1514,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Efren & Kristopher - Serviced"
}