{
  "collections": [
    "ChaosMen"
  ],
  "description": "I do like working with Chip, and Kristopher is always a joy to work with. Kristopher finally finished off his tattoo.\nAfter a brief stint in boot camp he is back to doing full-time sex shoots. I know, you probably didn't even notice he was gone for months! There is just no getting around it, Kristopher is awesome at giving head, so he is taking on more of the Serviced duties.\nKristopher really likes to top. We know he has the dirty talking down to support it, but the dude really nuts fast from being fucked. So I am getting in the habit of having him get fucked for the final position. Hey it works! He always kind of grumbles when he has to take a cock, but he\nAnd Kristopher stays hard pretty much the entire time fucking Chip, as evidenced by him keeping a hand placed on Kristopher's thigh through out the first part of getting fucked. Not too deep dude!\nThese two also sucked each other until they were both hard, in Real Time. This did add a bit of length to the movie, but when it happens in Real Time, I think it shows both players are either skilled at what they are doing, or turned on by what is happening.\nChip pretty much \"takes it\" from Kristopher, and I finally think the standing position he started getting hard from being fucked and \"kinda\" enjoying it.\nHe was happy to start topping, and he did an admirable job fucking the cum out of Kristopher. I love it when this happens, because it plants a seed in the other model's mind that, \"Hey, if we do this right, maybe it will make me cum!?\"\nChip drops his load onto Kristopher who was eager to take it. Nice breeding action too!",
  "models": [
    {
      "name": "Kristopher",
      "person_id": 3401
    },
    {
      "name": "Chip",
      "person_id": 3439
    }
  ],
  "release_date": "2011-11-11",
  "scene_id": 1516,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Chip & Kristopher - RAW"
}