{
  "collections": [
    "ChaosMen"
  ],
  "description": "This Edge video is an exploration of Pain Management...as requested by Solomon himself!\nNot for the faint of heart!\nSolomon was set to do a Serviced video, but when I showed him the Edge chair, and explained how we try to push limits and explore fetishes, he started spilling out what his favorite things to do in bed were. If you missed it, he talks about his fetish in the beginning of his solo.\nThe fantasy sequences are all Solomon's ideas. He wanted to go buy a teeth/mouth guard for some full-on punching to the face, but both Ransom and I balked at it. I think he wanted to come away from the shoot with a black eye. We stuck to standard props like a riding crop, and some spanking and hitting in his meaty areas. Not sure what goes on in Solomon's head, but he loved every minute of doing this video. The dude heals fast too, 'cuz by the time we go to do his cumshot, there isn't in a red mark on him.\nSolomon is beautiful but a little cocky. I mentioned that I think he pushes people's buttons so he can get a rise out of them. He loves a good smack-down! This video allows him to go full-tilt in exploring the fetish. He left the video VERY satisfied, though ironically, he thought we could have gone harder with him!\nIf you always wanted to play rough with a straight cocky boy, this Edge video will satisfy. If you don't \"get\" rough play, then likely you might wince a couple times.\nRegardless, this is a standout Edge video!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2011-09-28",
  "scene_id": 1518,
  "tags": [
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Theme - Edge",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def"
  ],
  "title": "Solomon Aspen & Ransom - Edge"
}