{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a crazy good match-up!\nDarius and Foster start off by stroking their own cocks, sneaking peeks of each other's equipment. Foster dives in for oral first, trying to get a feel to how to jerk and suck a cock with foreskin.\nHe does a a great job as he wakes Darius's cock up all the way. Darius returns the favor then the two go at it 69.\nI slide a butt plug into reach for Foster who inserts it into Darius's eager hole. I had to teach him to tap the butt plug before the shoot.\nThere is this awesome moment when he is tapping the butt plug, sucking his cock, and Darius has a cock in his mouth. It is like he is having the time of his life.\nDarius foggily whispers, \"cut\", but Foster just keeps going because he doesn't hear it, and doesn't realize he is about to make his buddy nut.\nIn a daze, Darius pushes Foster off his cock and sits back quickly, fearing he is going to cum.\nI left in the bit of direction, because it felt natural and really showed just how turned-on and in complete bliss that Darius was. For some reason, I find it one of the hottest moments of the year.\nHe reached an even higher bliss when he finally got Foster's cock up inside him. The dude can definitely handle a big dick inside of him. There is no wincing or keeping his hand on Foster's thigh so he wont go too deep. He is hungry for it.\nHe eventually rides it, and geeeeez...he is grinding on it like a pro! I think Foster was even taken by surprise.\nFrom the previous videos I knew that Darius cums on his back the easiest, and we get one of the best \"Fuck the cum out of me\" sequences to date. There is just no doubt about it. Darius loves to bottom!\nFoster delivers this laser beam squirt almost a full foot away from Darius's hole. How he knew he was going to shoot that far I will never know. But he coats his hole from a distance than juices him good.\nI know I have a lot favorites, but this one is a keeper.\nYou gotta watch this video!",
  "models": [
    {
      "name": "Darius",
      "person_id": 3435
    },
    {
      "name": "Foster",
      "person_id": 3438
    }
  ],
  "release_date": "2011-11-18",
  "scene_id": 1524,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Sex Act - Toys"
  ],
  "title": "Darius & Foster - RAW"
}