{
  "collections": [
    "ChaosMen"
  ],
  "description": "Derek has done a lot of modeling and some video work, as well as live cam stuff.\nAt the time of filming this, he said it was the first time he has had his dick sucked \"on film.\" I run many months ahead so as I write this knowing it will be a while before it airs, I suspect he will have gone far beyond a simple BJ as he drums up financing for his own website.\nSo I am just gonna run with it being his first time \"on film\" (those are \"finger quotes\" and it cracks me up 'cuz surely he has had his dick sucked 'off cam' when he specifically says \"on cam.\" ;-) )\nRegardless, he was still nervous about performing. If he could keep it hard, and of course, or having someone else make you nut adds a lot of pressure. It is always easier to do it yourself onto someone's face or other body part.\nDerek spent little time looking at the video and stays hard though most of it. He is a big muscle dude all snuggled in to get his cock sucked, and I love the way he writhes around in ecstasy as Patrick Rouge blows him with expertise.\nPatrick also loves eating ass and was in piggy heaven as he got to rim Derek's muscle butt every which way.\nPatrick is horny and Derek didn't mind if he took his cock out, but alas, was not going to help his new buddy out.\nNo worries though. After Patrick makes him blow his load, he rolls over and snuggles in next to Derek and shoots a foot or so into the air.\nThis is a VERY hot Serviced video and I love watching these beefy/hairy guys go at it!",
  "models": [
    {
      "name": "Derek Atlas",
      "person_id": 3456
    },
    {
      "name": "Patrick Rouge",
      "person_id": 3450
    }
  ],
  "release_date": "2011-08-31",
  "scene_id": 1532,
  "tags": [
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Derek Atlas & Patrick Rouge - Serviced"
}