{
  "collections": [
    "ChaosMen"
  ],
  "description": "Isaiah has a few battle wounds. I hope this doesn't distract you all, but I think this video will make you realize how great of a performer Isaiah is! (And Patrick Rouge as well!)\nSo you may notice a few scrapes and bruises on Isaiah. He is a hard-working country dude and always seems to be tore-up a bit. A week or so before this shoot, he wiped-out on his mountain bike, and basically destroyed his shoulder.\nHis other one wasn't in very good shape either, so two days after this shoot, he was going to have both rotator cuffs worked on. He will be out of commission for a couple months.\nThe one he damaged, well, his arm just kept falling out of it's socket. It was a bit painful too.\nBut he swore he would be able to do the shoot, despite showing up in sling, he assured me he was on his game and could still fuck like a jack-hammer.\nWhich is exactly what he did.\nThere are so many good parts to this video. There is one part where Isaiah keeps hovering his cock around Patrick's hole, and you might sit there and think, \"Why isn't he sticking it back in?!\" Normally when a cock pops out, it is because someone has gone soft.\nBut since Patrick is such a great bottom, Isaiah kept having to stop so as to not cum too soon. He pulls out 3 times about ready to bust. The final time I left as an out take at the end.\nThe two have so much energy and heat for each other. Patrick was eager to try some on-screen RAW sex, and was super turned-on when he realized that he was going to get plowed by genuine straight guy.\nBefore the shoot, Patrick and Isaiah met briefly then Isaiah headed off to take a shower. So I was alone with Patrick who turned to me and and said, \"Omigod, he IS a straight guy!\"\nYup!\nAnyway, this video is all about the guys trying to NOT cum. And like I said, there is one out take with Isaiah about to nut, along with one where Patrick is about to cum and yells cut. They are both laughing, and you can tell from this out take there is some genuine affection going on.\nI had to put the final out take of Isaiah avoiding nutting, because he had pulled out a couple times already and at that point we were actually TRYING to cum. But because he couldn't see Patrick, he had no idea that Patrick was ready to fire too.\nSo he pulled out and Patrick rolls out of the way. But I was like, \"Let's do it! Get back on him!\"\nPatrick climbs back on, and after a little stumbling trying to get a rhythm going the two ACTUALLY CUM AT THE SAME TIME.\nAnd I got it all on film from every angle!\nNow I am not saying it is an impossible thing, and usually I am pretty lucky having the guys cum reasonably close, but this is like synchronized swimming...err..cumming! You just don't see it that often.\nSo it is an awesome cum shot and I think Isaiah just fed off the excitement Patrick had for being fucked! You don't notice that Isaiah did the whole thing with a bum arm!",
  "models": [
    {
      "name": "Patrick Rouge",
      "person_id": 3450
    },
    {
      "name": "Isaiah",
      "person_id": 3397
    }
  ],
  "release_date": "2011-11-09",
  "scene_id": 1533,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Chest - Smooth/Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Video - OutTake"
  ],
  "title": "Isaiah & Patrick Rouge - RAW"
}