{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a dang hot Serviced video!\nGianni Luca makes an appearance to take on the \"E\" brothers, Everett and Ezekiel.\nI started them all off just jerking-off. When you have three dicks, you just never know if someone or everyone is going to struggle to stay hard. NOT a problem!\nThere is a LOT of eye-contact between the brothers, and though the two don't actually engage each other, it is clear that they enjoy each others bodies.\nIt's all about the eyes!\nGianni finally takes charge, and starts blowing Ezekiel, who seems very relieved and happy to have a pro sucking his cock. They are both tentative to touch another dude, but I think Everett got-off on seeing his little brother getting blown and several times forces Gianni's head down onto his bro's cock, telling him to, \"Take it all the way.\"\nGianni switches over to Everett and Ezekiel gladly sits back to watch his brother get the same professional treatment.\nEzekiel finally gets up and comes around so Gianni can suck both their cocks at the same time. This is when you really get to see the Ezekiel has a dirty mind and a level of expertise that belies his youthful appearance. The kid knows how to use his dick!\nIt grows even bigger and bigger, entering the \"hung\" category and on his tiny frame, the dude is downright packing.\nBoth brothers get-off to having their dicks sucked at the same time, and eventually lay in such a way that Gianni can suck them both, back-and-forth.\nThey had amazing chemistry, and the two boys were eager to give Gianni a facial.\nA few glances of the pussy porn and some hot communication between each other so they could time their cum shots perfectly, and they coat Gianni's face.\nGianni synced into their symmetry and busted his own load just after.\nAn amazing ending to a video that has so many hot moments and chemistry, that you just gotta join in!",
  "models": [
    {
      "name": "Everett",
      "person_id": 3453
    },
    {
      "name": "Ezekiel",
      "person_id": 3454
    }
  ],
  "release_date": "2011-11-23",
  "scene_id": 1538,
  "tags": [
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Uncut",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Theme - Tag Team",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Chest - Hairy/Hair"
  ],
  "title": "Everett & Ezekiel & Gianni - Serviced"
}