{
  "collections": [
    "ChaosMen"
  ],
  "description": "Silas is always eager to get fucked, and though Jamison is pretty versatile, he was wanting to top for a bit.\nOne of the things I like about Silas is he is not afraid to eat ass, and seeing Jamison's bubble butt get munched on is hot. Some of the guys get tickled and are having a tough time trying to not laugh, but I was really surprised when I panned around to Jamison to see his dick standing firm. Maybe he is a bit more of a bottom than I figured!?\nI liked seeing him suck cock while getting his ass rimmed. Cock all hard. Surely he was enjoying it!\nSilas is also always happy to try something different, and doing some upside down fucking was something we both wanted to attempt. Jamison's cock has got some \"give\" to it, so I knew he could aim down and fuck.\nSo we get a little different angles on this one. You can tell we had to recharge Jamison a couple times as it is kind of a challenging position. Plus the bed Jamison was using for support kept sliding away from him.\nI didn't count on Jamison being able to nut so easily in that position. I thought it would take him a while. But cum flies everywhere- from Silas's ass cheeks to his face cheeks. You have to look quick as Silas scoops some up to his mouth and licks his fingers clean.\nI of course always want to keep the furry chest fans happy and Jamison is still not keen on a facial, so Silas unloaded all over Jamison's hairy chest.\nNot sure how this video crept up to the 30 minute mark- but it's hot to see these two boys go at it!",
  "models": [
    {
      "name": "Jamison",
      "person_id": 3392
    },
    {
      "name": "Silas",
      "person_id": 3229
    }
  ],
  "release_date": "2011-12-23",
  "scene_id": 1539,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Jamison & Silas - RAW"
}