{
  "collections": [
    "ChaosMen"
  ],
  "description": "As aggressive/passive as Solomon can be, it was tough trying to figure out what his first full-interaction with a dude would be.\nI know I didn't have any guys on my team that wanted to get in a smack down in the middle of a sex shoot. Micah thought he could be domineering, and Solomon wasn't too sure he could stay hard enough to Top, so he opted to Bottom first time out.\nBesides, a little (or a lot!) of pain doesn't seem to be a problem for him. Though he stated clearly that this was a whole new sort of pain he was expecting and was very nervous.\nI started them off doing some jerking-off together. Solomon comes to attention first, meanwhile, I think Micah has gotten a bit more Bi after doing so much guy-on-guy that he needs some physical contact with a dude to get hard. YEAH!\nSo he starts sucking on Solomon, and that did the trick for both of them.\nI also wanted to get Solomon used to handling another dude's dick. He wasn't ready to suck on one, so I encouraged him to do some cock play or jousting together.\nHe is very intense about it. The dude looks strong!\nWe get to the fucking and Solomon took his first cock like a trooper. Clearly he is hurting, but for him, it seems to be a good thing.\nI tried to get him to jerk-off as much as possible so he could add pleasure to his pain, but for the first couple shoots, most of the guys tend to just \"take it\" rather than focus even on their own cock.\nThey finally hit a pace and though Solomon looks angry through most of this shoot, he was really proud that he handled Micah's cock.\nHe was also worried that the other guy would have a bigger cock than him (I didn't tell him the next guy I was putting him with might make him feel a bit small!)\nMicah nuts all over his hole, while Solomon, like a pro, encourages him to unload.\nBut getting Solomon to nut is going to be an issue. He seems to be used to having girls ride him, and he tends to lay on his back when he nuts. He also does that leg lock thing to get him over the top.\nSo I gave him homework to practice nutting upright and be more \"interactive.\" Because he came back later that week for another ass drilling, I know for sure his next shoot he did a bit better.\nThese two look great together, and though Solomon is hating having chest hair, he grew it out for you all. So I hope you enjoy!",
  "models": [
    {
      "name": "Micah",
      "person_id": 3390
    },
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2011-11-04",
  "scene_id": 1541,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Micah & Solomon Aspen - RAW"
}