{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is Solomon's second attempt at taking it up the bootie and he did soooo much better!\nIt is a tough call with him because he loves pain, so you never know if what he is feeling is a good pain or a bad pain. Or maybe they are the same for him?\nThe biggest hurdle was trying to get a cock in his mouth. I leave in a bit of him contemplating the act and him sighing just before doing it. We cheated and used some flavored lube to make things more...um..palatable.\nHe certainly looks unhappy about it to start with, but after a while, his brain gave up on thinking it was horrible, and he just went back to angry mode. Solomon just has angry sex, that is all there is to it. But for sure, he was not digging sucking dick at the beginning, then he got his mind wrapped around it.\nSo I think we conquered this limit and hopefully we wont have to resort to flavored lube again. It tastes ok, but it stinks and it is sticky. Yuck.\nFrankly, I think Solomon would be fine with sucking dick if someone was MAKING him suck the dick. Maybe punching him until his mouth opens. The kid graduated from S&M boot camp!\nHeath returns the oral, and it just amazes me that Solomon can go from \"distant\" to \"in the moment\" so quickly. He really likes having his dick sucked!\nWe got to use..well, destroy, a new piece of furniture. A chaise lounge I thought would be great for squatting on a dick. I knew I needed a guy with killer quads to handle it, and Solomon actually found it easy despite him not being very tall and having a wide stance. But I think he liked monitoring the depth and really got off to showcasing.\nThen when it came time to getting fucked doggy style, WOW! Heath, though never going balls deep, just kept fucking and fucking him! Solomon hasn't done many scenes, and he was just astounded that Heath's cock stays up until he nuts. There was just no mercy and no relief for his ass this entire shoot!\nWe worked hard on trying to get Solomon to nut more naturally. He is still doing the leg lock thing so gonna see about him standing and possibly Topping someone during his next shoot.\nHeath, as usual delivers a perfect nut shot, and creams Solomon's hole with a copious coating of jizz!",
  "models": [
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    },
    {
      "name": "Heath",
      "person_id": 3376
    }
  ],
  "release_date": "2011-12-16",
  "scene_id": 1543,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Heath & Solomon Aspen - RAW"
}