{
  "collections": [
    "ChaosMen"
  ],
  "description": "Anthony was down for a blow job, and Brooks was eager to make some money before heading off for a Summer job. The timing was perfect!\nAnthony is nervous to start with, but just like an excellent Serviced video, he spends less time looking at the porn, and more time kicking back and enjoying the oral service.\nI think the highlight of this video is Brooks rimming Anthony. Brooks said during his solo that he is a bottom, and he is more used to dudes eating his ass, getting him all riled up to get fucked. So taking the initiative and licking ass is not really in his skill set.\nSo he dives in tentatively, but with Anthony responding so eagerly, he buries he face deep in his ass, and I think we finally have another model happy to lick some hole.\nIn Serviced videos, we do try to make the straight guy nut from the blow job itself. We really had no intention of ending the video that way. Brooks was hard for most of the shoot, and Anthony said before the shoot he didn't mind if Brooks took his cock out and played with at the end.\nPlus Anthony said it would turn him on to feed his load to Brooks and it gave Brooks opportunity to play catchup and nut. I could be reading more into Anthony's mindset, but I think watching Brooks stroke his own cock turned him on too. Anthony ramped up quickly.\nTo be honest, I barely got my cameras lined-up and aimed properly as Anthony was so ready to bust. It is an awesome cumshot as the load goes right into Brook's mouth and all over his chin.\nAnthony makes Brooks suck out the last bit of juice and that makes Brooks pop his nut.\nI love a Serviced video where everyone leaves satisfied!",
  "models": [
    {
      "name": "Anthony",
      "person_id": 3459
    },
    {
      "name": "Brooks",
      "person_id": 3457
    }
  ],
  "release_date": "2011-12-07",
  "scene_id": 1546,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Anthony & Brooks - Serviced"
}