{
  "collections": [
    "ChaosMen"
  ],
  "description": "This was a shoot that almost didn't happen, and kind of made it so there is a number videos featuring of Micah or Mason close together.\nThese two were scheduled to come in and do a shoot. Micah had been lifting and putting on some major muscle mass. A couple days before the shoot he called me and said he was really happy about his body and wanted to take some updated photos and would that be cool?\nOf course it would be.\nWell the next day, which was the day before the shoot, his arm gave out while doing some barbell flies and one of the weights came crashing down on his face. He sent me a picture with his nose broken and a black-eye about to blossom.\nIrony is he is a personal trainer and should have had a spot, but he honestly was doing a lot of weight.\nHe was mad at himself, and sorry to have to re-schedule. Mason took it in stride, and I figured the following month I would have them out, and they could both do other gigs while out.\nMicah got his nose re-set and struggled to get his arm back in working order. By the time he showed up for this shoot he was healed, but had lost most of his muscle gain, and was not eager to take those updated photos :-(\nHowever he was eager to have some fun. He had worked with Solomon only a couple days before, and Solomon's S&M needs kind of threw him. He was pleased to be working with Mason and though Micah still identifies as straight, when he connects with a guy, he gets turned on, and enjoys getting fucked by the dude.\nAnyway, I just thought for the summary on this video I would give you the back story on him. I might post the pic of him all banged up on my blog, but we will see. It could be perceived as \"DUI Accident\" snapshot.\nEnjoy these two guys who really are having fun trying to please the other guy!",
  "models": [
    {
      "name": "Micah",
      "person_id": 3390
    },
    {
      "name": "Mason",
      "person_id": 3421
    }
  ],
  "release_date": "2012-01-13",
  "scene_id": 1547,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Mason & Micah - RAW"
}