{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would give you all some back story on this video.\nMason was in town to do a couple shoots at once, something I try to avoid doing because it is just way too much filming at once. But he was making up a missed shoot from the previous month, and was really needing this shoot to happen financially.\nStone missed his flight and because of his location, he wasn't arriving until 11:50pm. Mason was set to leave the following morning and had to be back home.\nSo it looked like Stone was going to miss the shoot, and actually both of them really needed the money.\nI so didn't want to do an all-night shoot, but relented and Stone got in around midnight. Between travel, shower and prep, filming, etc., we didn't finish until 5am, and then I had to drop them at the hotel, so I basically got back at 6am, and I had a 7am appointment to race to.\nNone of us were tired during the shoot and it actually went quite well. Mason was ready to fuck, and Stone has become an excellent bottom. Every shoot his dick seems to stay hard longer while getting fucked, and he realized that getting fucked doggy style was making him nut.\nHe didn't think he could handle a full pounding, but this is the first video (I believe) that Stone came with a dick in his ass. He busted a LOT of cum too!\nMason unloaded pretty quickly too, so overall, it was a smooth video and both guys are way into it, despite pulling an all-nighter.\nAs for me, well, I am not as young as I used to be and literally slept about 18 hours to make up for 8 hours of lost sleep. I remember the days when I could pull an all-nighter and just take a 2 hour nap to compensate. Well those days are long gone!\nNot sure if the back story anecdotes are boring, but I figure some fans might like a glimpse as to what it takes to pull a video together.",
  "models": [
    {
      "name": "Stone",
      "person_id": 3398
    },
    {
      "name": "Mason",
      "person_id": 3421
    }
  ],
  "release_date": "2011-12-24",
  "scene_id": 1550,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Mason & Stone - RAW"
}