{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is one of those shoots that got \"out-of-hand\" that seems to please much of the audience. What started off as a simple oral video between two guys became complicated quickly.\nReid was not only down for getting his dick sucked, but he said he would suck back, and would even try kissing. I liked that he wanted to really throw himself all the way into it. He had experimented once beforehand (Research!) and didn't think he would have a problem. Tyler loves to rim and be rimmed so was looking forward to having Reid sit on his face.\nAfter his solo, Tyler and I had been flirting a little bit, and I knew he was not opposed to \"working\" with me. We had talked after his solo about doing something together, but I just feel like I should stay behind the camera, yet always, somehow, end up sucking dick.\nThis video is especially long for a scene that only contains oral. I felt like I had to leave in parts showing WHY I was participating.\nThe two had chemistry. It is undeniable. There is real passion there. But Reid was not getting hard, and Tyler would droop anytime inexperienced Reid would suck on him.\nSo I thought I would just step in once, and get Tyler hard. Did that in less than a minute then stepped out of the scene. Jazz Hands!\nReid goes back to sucking Tyler, but then it goes down quickly. Back in I go again, this time Reid and Tyler are kissing full-on.\nI step out and Reid gets his sucking action going and Tyler stays up. Meanwhile I figure maybe I will suck on Reid to get him hard. This section hit the cutting room floor as the video was now 34 minutes long.\nIn fact we filmed 128 minutes straight through and it was challenging to cut this video down to under 30 minutes and still maintain a sense of continuity. I would do a Director's Cut, but honestly, I figure most people want to see penetration, and there is a lot of me moving around trying to keep everyone hard. I know, I am not gonna get a lot of pity! There are some hot moments left out, but it is just crazy to release a 30 minute video of oral only online.\nSo that is why the video is so long. I felt like I had to leave in all the parts of me trying to \"activate\" both models.\nAt one point I am sucking on Reid and I finally have him hard, and he starts saying he is going to cum, and in my head I was thinking, \"Well I finally have him at full attention, and may not get him there again, so let's make this baby blow!\"\nI knew Tyler was getting close to cumming, but he was struggling to get over the top. I figured I would bust my nut and that would help him. I rub one off, giving Reid a pearl necklace (more like a tie). I step out and do a pan of the aftermath, leaving Tyler to nut again all over Reid's hairy chest. A REAL pearl necklace this time!\nI dunno. I know a lot of you will scrub past most of it. But it really has a lot of hot nuance moments in a very long oral video. I say give it a try and if you just HAVE to skip to the cumshots, go ahead. But do give watching the entire video a try.\nI know some of you don't like seeing me in the videos, but this one has an organic feeling that gives you that 'you are there' feeling.",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Reid",
      "person_id": 3444
    },
    {
      "name": "Tyler Shields",
      "person_id": 3460
    }
  ],
  "release_date": "2012-01-18",
  "scene_id": 1553,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer",
    "Theme - Tag Team"
  ],
  "title": "Bryan & Reid & Tyler Shields - Serviced"
}