{
  "collections": [
    "ChaosMen"
  ],
  "description": "Patrick has been going through the site, looking for guys that he wanted to mess around with!\nDarius is his favorite, but I knew he was coming in to do a 3-way and it would be a while to get him in.\nFoster and Valentino were doing a scene together, and since I had the room with the mattress still setup from Darius's 3-way, I figured why not do another 3-way? Patrick was certainly happy to be banged by two big-dicked dudes.\nSo this was supposed to be a 3-way. Valentino was all set. Tested and even the day before had me change his return flight. Then no show. No email. No text. Nada.\nFoster was actually a little nervous doing a 3-way, but I told him they were easier (they are) and as long as he didn't have to bottom he was down for it.\nTurns out Foster, and myself, were relieved that Patrick was there, cuz at least I had two models, and not just Foster left with no one to work with.\nPatrick was only mildly disappointed when he heard it wasn't going to be a 3-way, and couldn't wait for Foster to sit on his face.\nAnd that is how we started this video. I hadn't really seen Foster get his ass eaten, and he sure gets into it. He got all dirty talking and his dick boned up hard. It just makes you think that maaaybe someday he might try bottoming, but it is more likely he is a dominant dude who got turned on by making Patrick his bitch.\nAnd the two have real chemistry! Foster fucks him every which way, and Patrick as usual is struggling to not nut.\nWe even get some pile-driving fucking, which was a hard to do up on the bed. Patrick thought he could cum this way, but Foster just couldn't keep the speed, rhythm, and wood long enough. So we opted for the traditional missionary which made Patrick pop first.\nAnd Foster, that boy can ice a birthday cake with his loads!\nOk, so it might have been more fun as a 3-way, but these two really clicked and it is one hot video!",
  "models": [
    {
      "name": "Patrick Rouge",
      "person_id": 3450
    },
    {
      "name": "Foster",
      "person_id": 3438
    }
  ],
  "release_date": "2012-01-06",
  "scene_id": 1559,
  "tags": [
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW"
  ],
  "title": "Foster & Patrick Rouge - RAW"
}