{
  "collections": [
    "ChaosMen"
  ],
  "description": "A New Year is approaching this week, so how about some fire cracker bush to spark your day!\nI know for many states, fireworks are kind of a 4th of July only thing. Growing up in Colorado I don't ever remember piling out into the cold snowy night to watch fireworks for New Years. Maybe I was too far out in the suburbs. To me it feels like a Southern thing.\nWell, Carl is a Southern boy. Irish of of course. He is extremely personable, always busy juggling like 4-5 jobs, and spends his free time seeking out two of his fetishes.\nHe is a big fan of girls in panties. Strip teases and sex with them on. I am about 99% that he isn't actually wearing them! The other thing he is into, and sadly it is now a fetish because of the shaving, Nairing, and waxing going on, is he likes girls with pubes. YEAH! Maybe pubes will be back in style for girls too?! I know girls are \"supposed\" to be hairless, so I doubt the trend to remove all their body hair will ever go away. But I am running into more models who are seeking it out.\nI had to go through a lot of my collection to find girls in panties that weren't too nutty (the panties, not the girls), and finding pubes was a bit tough.\nWhen you watch Carl getting hard, his eyes are moving about the room, and there is a bit of nervousness that he isn't getting hard. The video I found for him had a girl in panties, and once she got them off, a nice blond bush was intact. She would even pull on it while getting fucked. His dick woke up real quick. In fact, I think after having that visual, he didn't rely to much on the porn.\nI try often to get the guys to lay down and away from the TV when they nut. I dunno, it is one of my favorite positions for a solo cum shot. One camera over his shoulder showing his entire body (Feet too!), another that is a side shot that they can engage the audience, and of course a close up of his cock from his Point of View (POV).\nOnly problem is, most guys need to be looking AT the porn when ramping up to cum, so they are normally facing the TV. But I have had a lot of guys lately that were really turned on, and they were like, \"I don't need any porn! Let me bust!\" Carl was no exception!\nAnd he popped that bottle rocket of his big time. Clear over his head. And the dude is tall too! He got some distance!\nLiterally explosive firecracker action!\nAnyway, I hope fans of Gingers will be happy. It sure is an awesome ending!",
  "models": [
    {
      "name": "Carl",
      "person_id": 3463
    }
  ],
  "release_date": "2011-12-26",
  "scene_id": 1566,
  "tags": [
    "Theme - Solo",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Red",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Carl - Solo"
}