{
  "collections": [
    "ChaosMen"
  ],
  "description": "I think many viewers think the cum shot is likely the best or the highlight of each video, and apparently, Darius thought so too.\nFirst though, I must say in my biased opinion, that Darius again is one of the best Bottoms I have ever seen...ever! He just shines in every way when some is fucking him. Austin steps up his game to match his energy, and you can see his skills in fucking are anything but amateur.\nThe two go at it like they are hungry for each other, and the verbal between them is awesome!\nBut lets just get to the ending.\nDarius assured me he could cum in any position possible, so we do a nice doggy-style cum shot. Austin fucks the cum out of him.\nAustin does need a moment to ramp-up and unload all over Darius's hole, and while waiting, keep your eye on Darius.\nYou might think he is watching a TV while he himself is waiting, but the porn with TV is completely the other direction- the direction Austin is facing.\nWhat he IS staring at is the LCD on the camera showing a close-up of his ass about to be creamed! Now he might have been just trying to make sure his ass was in just the right spot and turned \"just so\", but I choose to interpret as him getting-off to watching Austin unload on and in him.\nWell, it is a toss-up on which intrepretation it is. Though Darius does like dildo play with a girl, he still is on the Team Straight, and readily admits that he is an aficionado of porn, and totally wants to make it hot whoever is watching. Admirable motivation, but he sure looks like he REALLY enjoys it!\nThese two give great sex. Period.\nAlso, doesn't Darius haircut make him look sharp?!",
  "models": [
    {
      "name": "Austin",
      "person_id": 3426
    },
    {
      "name": "Darius",
      "person_id": 3435
    }
  ],
  "release_date": "2012-02-03",
  "scene_id": 1568,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Austin & Darius - RAW"
}