{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kaye is an intriguing dude. He says he is bi- split 50/50 between girls and guys. I dunno, I think he might be leaning towards guys. We'll see if he really IS Bi or just working his way to playing on our team full-time. You just never know.\nI finally got some Bi-porn for the bi guys to watch, so the timing was good. Though he really didn't watch the video much. Kaye dances at night clubs, and gets off on being watched. The guy-guy-girl video was largely ignored.\nKaye has a clothing fetish. He is very fond of thongs- the skimpier the better. I had some on hand but they were more like jocks which he said were, \"OK.\"\nSo we went with some underwear I also had on standby. I actually spend a lot of money on underwear 'cuz there is only so much basic underwear I can bear- and I am pretty Under Oblivious! But he found some that turned-him-on, despite them not being thongs. He was playing with them in both photos and video. If you like underwear, the photos and video might be a little treat for you.\nI also tossed in a jerk-off sleeve to see if he would like the sensation. He sure did! Several times he needed to slow down or risk cumming too soon.\nKaye's asshole is perfect too. I think if he ever comes back for oral or sex, he might be more inclined to bottom, though I am basing this only on the fact that he likes it when guys rim him (but not girls!). He does a great job showing off his ass and fingers himself ever so slightly. (More evidence! LOL)\nHis cumshot is awesome, and he clearly blows every bit of DNA out of his cock. He is in a mental fog at the end it was powerful.\nClearly, this guy had a lot of fun doing his solo.",
  "models": [
    {
      "name": "Kaye",
      "person_id": 3465
    }
  ],
  "release_date": "2011-12-28",
  "scene_id": 1569,
  "tags": [
    "Theme - Solo",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Ethnicity - White Guys",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Toys"
  ],
  "title": "Kaye - Solo"
}