{
  "collections": [
    "ChaosMen"
  ],
  "description": "How about some Latin loving with a touch or shoe/sock fetishto spice up a solo?\nJaime is 24, and has done some online cam work before. All of it non-nude, so he is kind of used to \"requests.\" No I don't know where he cams, and frankly the non-nude part doesn't seem that appealing to me!\nHe has an amazing body with an uncut cock with boomerang action.\nHis body fat is pretty low, and his feet are usually cold. So he started-off the shoot with only one request, to keep his socks on.\nI One-Upped him by having him keep his sneakers on too. I know I tend to be oblivious to some of the fetish type stuff, so I was keen on incorporating some footwear fetish stuff. His shoes looked cute on him when he stepped off the airplane; all unlaces and ready to fall off. I thought it looked sexy for some reason.\nJaime also came with his own underwear. I have mentioned I keep some on hand, but he had a variety to choose from, and I have to say the purple pair in the solo really \"go\" with the room. Yes, I know. I am pretty gay.\nHe likes girls Very much, but has that style and manner that makes me wonder. He was VERY picky about the porn I would play for him. Blonde, big tits, not too old, and of course, we had to find his favorite sex position- reverse cowgirl.\nJaime seems a little nervous during the solo for someone who has done cam work before, but clearly he enjoys showing off.\nI guess the highlight for the sock loving fans is after Jaime unloads, he takes his sock off and cleans up all his cum, including getting every bit out of his foreskin and piss hole. Might not be for everyone, but it is nice to get something a bit different for the big finale!",
  "models": [
    {
      "name": "Jaime",
      "person_id": 3466
    }
  ],
  "release_date": "2012-01-04",
  "scene_id": 1570,
  "tags": [
    "Theme - Solo",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Jaime - Solo"
}