{
  "collections": [
    "ChaosMen"
  ],
  "description": "One again I wanted to get out of 'Serviced' mode, and just do a full-tilt Suckfest. With two gay guys going at it, I had trouble calling this one a Serviced video. I guess I will have to think of a fun name for these oral-only films. Suckfest sounds cheesy to me.\nPatrick gives great head, and Noel is into it, but you can just tell he would rather be sucking a cock then being serviced. Patrick climbs on top and makes him suck his cock. Noel is in bliss.\nWe even get some great rimming in. Noel said he loves to eat ass, and Patrick, as we have found out, likes his ass paid attention too. A perfect match.\nNoel likes his ass played with too, and in order to get some extra zip in Noel's cock, Patrick takes a dildo to his ass.\nWhat finally got Noel going though, was the two of them laying there jerking their cocks together. Our first intention was to use the double ended dildo, but it was a bit short for two massive guys, and they were so excited doing the double jerk-off that I didn't want to mess with their inertia.\nIf you like facials and cum eating then this video is for you. Patrick unloads inside and all over Noel's mouth and face. This sets-off a well-timed cumshot from Noel.\nPatrick bends over a couple times and laps up some of Noel's cum and kisses him with the taste of his own giz on Patrick's lips. Very hot!",
  "models": [
    {
      "name": "Noel Rodriguez",
      "person_id": 3464
    },
    {
      "name": "Patrick Rouge",
      "person_id": 3450
    }
  ],
  "release_date": "2012-01-25",
  "scene_id": 1575,
  "tags": [
    "Ethnicity - Latin Guys",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Toys"
  ],
  "title": "Noel Rodriguez & Patrick Rouge - Serviced"
}