{
  "collections": [
    "ChaosMen"
  ],
  "description": "After two fuck films where Solomon takes it up the ass, he finally gets a chance to Top!\nSolomon knew he would have trouble staying hard, so opted to bottom the first couple times until his confidence grew. He does a fine job topping...a little wobbly here and there, but he is so aggressive that it works. He is an Angry Fucker!\nI sent pictures of Solomon to Vander to see if he would bottom for him. Mostly a Top, Vander certainly likes a good fucking, and if it is a beefcake straight boy, he gets in piggy bottom mode! His answer was a resounding, \"YES!\"\nI wanted to do some toy play, so the two used the FleshJacks on each other. I have to admit, it is pretty hot. Neither had ever used one before, so there is only a teeny bit of clumsiness, then WOW, they both go at it full-tilt! Some really really HOT FleshJack play. (Yeah I know, it seems like the site is FleshJack crazy this week..it wasn't intentional!)\nSolomon then fucks Vander and after having been fucked twice, you would think he would take it slow, but he just shoves it in like he was fucking a pussy. Thankfully, Vander is not a pussy, and rides it out, then starts encouraging him.\nSolomon doesn't wear deodorant, and even though I had sanitized Vander in case Solomon would get freaked from \"man scent\" it turns out Solomon likes the way he smells. Wasn't long before Solomon was making Vander lick his pits. I swear there is some pit-to-kissing action that surely must have been ripe- I think Solomon liked it!\nSolomon hits his groove and Vander busts his nut while being fucked. Solomon then juices Vander and I believe that is the first time he has cum standing (he has been practicing). He still needs to jerk-off in a frenzy, but I think we are going to have a versatile guy on our hands!",
  "models": [
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2012-01-27",
  "scene_id": 1576,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Toys",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Solomon Aspen & Vander - RAW Toys"
}