{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought we could have a little Twink-fest with both Chip and Tyler making up Team Lean. I have just as many fans of the big beefy boys as I do the young and trim guys, so pairing these two seemed natural.\nTyler is gay, but likes to top. I told him he would have to mix it up, cuz if the straight guys will bottom, it is only fair he gets as good as he gives. I think he is cool with that. But this time out, I paired him with Chip, who, while not erect while being fucked, seems to like being dominated.\nAs we have already learned, Tyler loves to rim, so first on the agenda was eating Chip's ass hole. Chip actually trimmed his hole up before the shoot, claiming that he thought the hair was getting pulled while being fucked. Ya know, he may be right. He sure took Tyler's cock with more ease, and seeing his nice young hole being toyed with was a nice change of...uh...scenery.\nThe two trade oral, and Tyler expertly gets Chip hard and ready to get fucked.\nTyler is hard the entire video, so much so that I thought we would try a new position. We have Chip practically upside down at the end of the bed, and Tyler fucks long and deep while blood rushes to Chips head. Tyler had amazing penetration and his cock just got harder.\nFor the ending we get a double treat. Tyler juices Chip's hole, followed-up with Chip giving Tyler and an amazing cum-eating facial!",
  "models": [
    {
      "name": "Chip",
      "person_id": 3439
    },
    {
      "name": "Tyler Shields",
      "person_id": 3460
    }
  ],
  "release_date": "2012-02-10",
  "scene_id": 1579,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Twink",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Chip & Tyler Shields - RAW"
}