{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ezekiel said he would be down for fucking a dude. He wasn't ready to suck on dick yet, so I knew I would have a little lopsided video.\nHayden enjoys getting fucked, and he never takes it personally that a dude won't suck him back. He just gets in there and makes it happen.\nHe takes control of the situation, and I like watching Hayden get Ezekiel's cock hard. Ezekiel is a bit of a talker, and it is hot to hear him coach Hayden into what he likes. Hayden does such a good job it makes me think I should have him do some Serviced videos. He says he isn't afraid of tasting cum in his mouth, so I am thinking it might be a good fit to help mix up the Service Department.\nHayden then starts off by riding Ezekiel's dick. A little wobbly to start with but they both quickly get their rhythm and we see some awesome penetration. Ezekiel is a little guy but his uncut cock can grow to a solid 7-8 inches.\nThe height difference becomes more apparent when they go to a doggy position, and once again the storage chest at end of the bed helps equalize the playing field. Ezekiel is still on his tippy toes, but manages to fuck Hayden good.\nI think Hayden doesn't necessarily mind getting fucked, but he truly does like getting on his back and if the guy stays hard, making himself cum that way. He, like most guys, has discovered it just is more intense.\nAn Ezekiel's first time breeding a guy goes very smoothly. He unloads on Hayden's hole, rubs it round and juices him properly!",
  "models": [
    {
      "name": "Hayden",
      "person_id": 3330
    },
    {
      "name": "Ezekiel",
      "person_id": 3454
    }
  ],
  "release_date": "2012-01-20",
  "scene_id": 1581,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Ezekiel & Hayden - RAW"
}