{
  "collections": [
    "ChaosMen"
  ],
  "description": "Clyde has done some video work before, and decided he wanted to come play at ChaosMen. He is a bit of home boy, and has the \"chill dude\" thing going on.\nFor his Solo I wanted to do something different. Clyde told me he doesn't jerk-off very much but has had good luck with FleshJacks. I have been wanting to try to mix-up the solos a bit, but it is hard because there is just only so much one can do when beating-off.\nI love the idea of guys at home, on a computer or tablet, rubbing-one-off to my stuff. In my mind, watching a guy sit at a desk jerking off has kind of become a small fetish. I like the \"Spy On Them\" feel to them, and watching them get lost in their own world.\nViewers sometime comment about the audio of the girls having sex on the video that plays for the guys during a Serviced video. I do try to keep it low, but it does kind of point out that they are straight, and the audio REALLY helps the model. It is challenging to do an oral, and even a solo video, without that extra audio stimulation. Having Audio is half the battle.\nSo I went with headphones. I uh...jailbroke an iPad to allow Bluetooth mouse or trackpad, in case the guy was getting picky and wanted to scrub forwards in a movie, or just change what they are watching, without slippery fingers trying to navigate an iPad screen.\nI originally included the video he was watching (along with 3 other solos I shot like this) then realized, that though I am sure the Producers of the video would be happy to see hot guys nutting to their product, I don't have the 2257 information for the people in the movie. So I had to get creative and blur it out. Sorry if it is distracting. I tend to tune into their cock, face and ass, but the blur does draw attention to itself. 3 more movies like this to air, and after that I am going to do my best not to include what they are watching. I tried to leave the filter vague enough you can tell it is a straight video...if that is important to you. My friend said that the pussy shots were a lot more distracting than the blur, so I know I will have some people complaining, while others are relieved.\nClyde however was completely happy watching a blonde baby-doll-faced girl get anally probed and stuck with one scene.\nI have to say, having the headphones on, and doing the Bluetooth trackpad is something Apple should integrate into their iPads. It is quite nice to not have greasy (or lube) fingerprints all over the screen. Also, it helped him stay hard and cum. While the headphones might be visually distracting, it is more likely the moaning girl would be more distracting.\nI kind of didn't give Clyde very much direction as I just wanted him to do his thing. He ended up playing to the cameras a bit, breaking the fourth wall. Another challenge was trying to get him to showcase his ass while sitting in a chair. I know many of you may not care about the dude's cock at all, and just want to imagine fucking him. So he did his best to show-off his hairy hole.\nFor the cum shot I told him to just sit in the chair and go till he nuts. I don't think in the thousands of videos I have shot, I have had anyone jump up and completely move out of position where they were at...which is what Clyde did!\nSo basically I got a close-up of his dick busting in 3 angles. I really like the three angles I get cuz I want to see a guy's face when he is cumming. A little disappointing, but hey, we REALLY get to see his dick cum!\nRegardless of that flub, it is a different solo than what I normally have, and you have to admit, this kid is H.O.T.!\nStick around for next week when Clyde shoots his load down the back of a guy's throat!",
  "models": [
    {
      "name": "Clyde",
      "person_id": 3469
    }
  ],
  "release_date": "2012-01-23",
  "scene_id": 1585,
  "tags": [
    "Theme - Solo",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Trimmed",
    "Video - HD - High Def"
  ],
  "title": "Clyde - Solo"
}