{
  "collections": [
    "ChaosMen"
  ],
  "description": "Clyde had done an oral video once before, but I wanted to take him through the paces in case he wants to do more later on. Get a feel for how well he interacts with other models.\nI had Brooks in to do the honors of blowing him, and I think Clyde was actually looking forward to having a gay guy blow him this time. True to our claim to fame, Brooks did us gay guys proud by blowing the...socks off of Clyde.\nIt is just so awesome to see Clyde's cock so hard. He's barely looking at the TV, and though there is some delivery of lines that made even Brooks laugh, he seems to be genuinely into getting his cock sucked.\nIf you remember last week, Clyde SLAMMED his cock into his FleshJack in order to cum. He grabs Brooks head and basically does the same thing.\nThere is always debate when a model unloads inside of a model. I don't do it very often, despite tons of request for \"Cum inside the dude\" requests. I don't do it 'cuz someone always chimes in that it is fake.\nWell, Clyde just busts completely down the back of Brooks throat, not leaving much in the way of evidence. We do squeeze some out his piss slit and Brooks had some on his knuckles, for the ending pan and photos, but for the most part, Clyde coated that back of Brooks throat.\nI dunno. I think it is hot to see his body cum, knowing Brooks is choking down his load.\nWe don't get too many guys willing to suck back a load, so I am super happy to have Brooks helping Service the guys. I asked him if there was any in his mouth to spit out, but when you watch Clyde cum, you know there was no where else to go but right down the gullet!\nAfter working with Clyde on a few sex films (yep they're coming!) Clyde makes it a habit of unloading inside of a dude. It's seems to be the only way for this guy who doesn't really know how to jack-off (?!?!?) to nut.\nSo fans of true Breeding will be happy, while the some of you will, as always, remain skeptical. But it is one of the most requested \"endings\" so we shall see what everyone says.",
  "models": [
    {
      "name": "Clyde",
      "person_id": 3469
    },
    {
      "name": "Brooks",
      "person_id": 3457
    }
  ],
  "release_date": "2012-02-01",
  "scene_id": 1588,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Chest - Smooth/Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Brooks & Clyde - Serviced"
}