{
  "collections": [
    "ChaosMen"
  ],
  "description": "Lyle was a quiet one for sure. He had done a solo and a guy-girl video elsewhere, so at the time of filming this, it was his first time with a dude. He was pretty nervous. Instead of watching the porn, he basically closed his eyes, and I suppose was thinking of some hot girl blowing him.\nAfter watching him jerk-off earlier, I knew that I wanted Ransom to do the oral on him. His technique is one that I know well, and had trained Ransom in using it to \"expert\" level.\nLyle was still kind of wobbly in the video. He does try to reach out and guide Ransom's head, but for the most part he is just kicking back and concentrating on getting head.\nWe flip him over and Ransom REALLY ate some ass. Usually it is not his favorite thing, but Lyle's ass is perfect, and I think it triggered something in Ransom! It also triggered something in Lyle.\nWith him kind of wobbly through out the shoot, both Ransom and I were worried it was going to take a lot of stroking to get him off.\nTurns out we were both wrong, and Lyle was a quick but stealthy cummer.\nRansom jerks on his head for a bit, trying to duplicate Lyle's 'under-the-head' stroke. He then switches to oral which worked like a charm. Since Lyle is so quiet, you really have to watch his body language as he gets more and more tense and eventually surprises Ransom with a load in his mouth.\nUnlike Brooks did in a previous video, Ransom knows to spit some of it out and let the rest squirt out for viewers to see. Ransom was pleased with himself after the shoot saying he actually swallowed Lyle's first load, and he didn't gag.\nI know, you'd think after so many videos, Ransom would have turned into a cum hungry whore, but he still struggles to take it in the mouth. I think though, after tasting Lyle's seed, he won't be so skittish about it.\nThis is a quiet Serviced video. Intense cumshot that you really need to watch the body language on, but the ending with the sneaky cumshot is priceless!",
  "models": [
    {
      "name": "Lyle",
      "person_id": 3471
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2011-12-31",
  "scene_id": 1590,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Lyle & Ransom - Serviced"
}