{
  "collections": [
    "ChaosMen"
  ],
  "description": "Happy Valentine's Day!\nI thought I would give you a nice passionate video to celebrate the day!\nBoth Micah and Stone have both learned to love bottoming, yet both excel at topping, so I thought I would get a nice flip-flop video in with them.\nI dunno what was going on between the two of them, but there was some chemistry happening! The kissing goes on for a while, and they both got hard just from the kissing. As you may have noticed kissing is a bit too intimate for most of the guys. You'd think sucking cock would be, but kissing and eating ass seem to be the last hold out for most of them.\nNot these two! It gets them both charged up, and Stone's sucking now seems intent more on pleasing the other guy, rather than being distracted with thoughts that there is a dick in his mouth. Micah appreciated his cock sucking skills and is bone hard.\nWe even get some awesome 69-action going!\nBefore we got started, the two of them were debating their favorite position to be fucked in, and they both said sitting on a cock is the best. So we had them flip-flop, taking turns sitting on each other's dicks.\nThough he didn't say it was one of his favorite positions, Micah is dang good at cumming while being fucked on his back. Stone does an amazing job getting him close, and Micah nuts so hard he literally cums in his mouth! Look carefully! He spits it out onto his chin pretty quick.\nI know Stone was trying not to laugh, so he stifled it back (good job!), and actually pulled out and nutted before Micah's load had time to dry.\nWe get a teeny bit of cum kissing at the end while Stone plays with Micah's freshly juiced ass!",
  "models": [
    {
      "name": "Micah",
      "person_id": 3390
    },
    {
      "name": "Stone",
      "person_id": 3398
    }
  ],
  "release_date": "2012-02-14",
  "scene_id": 1594,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Self Suck or Self Facial",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Micah & Stone - RAW"
}