{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jacek moved to the U.S. from Poland when he was 9-years-old. Not an accent on him, but he sure has the stereotypical big Polish sausage on him! Actually the big unit on him was kind of a surprise as it just kept getting bigger and bigger as the shoot went on. His submitted pics didn't seem so...well...endowed!\nThe girls love his sparkling green/blue eyes, and his bubble-butt. He is not a Player, but he finds it easy to talk to girls. In fact he had three gorgeous girls chatting him up as he got off the plane and came down the escalators to baggage claim with him. He apparently met them on his flight to Austin. Not shy, but not cocky at all. Confident. Secure. Sexy!\nHe jacks-off a couple times a day, and even enjoys semi-public sex. A very sexual guy. He struggled a bit to stay hard during the shoot, which kind of surprised him.\nLike a pervy old man, I kinda told him he was jerking off all wrong. Between takes I demonstrated a few techniques and he was all, \"I had no idea!\" Kind of surprising given that he gets lot of attention from the ladies- surely they want to go all piggy on his big cock?\nThere is a spoiler at the end with me in it, so if you don't like seeing me in a video, then just turn the video off after the final logo.\nI guess I had planted an idea in his head after the jerk-off demo. He suddenly thought that he was not going to get-off on his own, so if you like behind the scenes OutTakes and want to know what REALLY happened- then stay-tuned to the end!",
  "models": [
    {
      "name": "Jacek",
      "person_id": 3473
    }
  ],
  "release_date": "2012-02-13",
  "scene_id": 1596,
  "tags": [
    "Theme - Solo",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Chest - Smooth/Trimmed",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Video - OutTake",
    "Build - Mature",
    "Video - Bryan Cameo"
  ],
  "title": "Jacek - Solo"
}