{
  "collections": [
    "ChaosMen"
  ],
  "description": "Vance and I have been talking the last couple months about him sucking cock. He has been thinking about doing it. NOT the money mind you (but it makes \"ok\" since he is getting paid, but he was kiiiinda thinking that sucking dick was turning him on after all this time. Maybe he is sexually bored? Maybe he is embracing some Bi attitude after so many years of gay porn, but something had shifted in his thinking.\nOver the last couple months I would send him some pics of a potential \"Serviced\" guy 'cuz he just wanted to \"pick\" who he was going to work with instead of being tossed in with a random guy. He thought he might really be into it if he thought the guy was sexy. I showed him a half dozen guys, and two he thought would be fun, but both only wanted to do solos.\nVance had some specific things he was looking for that weren't hard to meet. He wasn't being picky. No giant cocks and a good build, and nice looking. He didn't want a huge cock, cuz he didn't want to gag, and wanted to try to fully take a cock down his throat.\nI sent him pics of Jacek, and he was totally down for it. I myself couldn't tell that Jacek is actually quite nicely endowed. Ooops! I quickly sent some newer pics of Jacek to Vance, and though he made a size limit, he was eager to do the scene!\nAnd honestly, have you really looked at Jacek? He is beautiful! Who could say no!? Jacek is not only packing some nice semi-uncut dick, but he has those amazing eyes, tight little body, and a personality that is immediately likable.\nI think for the first time Vance is REALLY into sucking a cock and doing his best to pleasure another dude. We both misjudged Jacek's cock size, and though Vance can only take Jacek's cock head, he strokes his cock with all kinds of methods, and truly makes Jacek squirm. I gave Vance a little training in what Jacek liked, and he really goes to town on him and used all the advice I gave him- but really, Vance is in kind of of cock-sucking Nirvana.\nJacek just doesn't lay there either. He is in a Zone too. Oh, a few glances to the TV, but he is totally getting-off to having his dick Serviced.\nVance even stroked Jacek until he cums, which might be the first time for him. He was pretty proud, and um...turned-on after the shoot.\nFor Jacek's part, he was quite pleased with the focus on just his plum-sized/shaped head and didn't miss the deep throat action. I am thinking his experience was so great that he might come back for more. Nothing at the time of writing this, but I really liked working with him and have a good vibe that he will return.",
  "models": [
    {
      "name": "Jacek",
      "person_id": 3473
    },
    {
      "name": "Vance",
      "person_id": 3281
    }
  ],
  "release_date": "2012-02-22",
  "scene_id": 1597,
  "tags": [
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Chest - Smooth/Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer"
  ],
  "title": "Jacek & Vance - Serviced"
}