{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have been kind of being careful with Jamison after he tried really hard to take Vander's cock. I don't want to over challenge him, and have been giving him a chance to Top to restore his confidence.\nI put him with Curtis for a Flip-Flop video. I was a little concerned as Curtis's cock does seem to get bigger and bigger through out a video. But I knew Curtis was down with bottoming for a portion of the video and even stays hard for most of it. Don't think he will be busting a nut anytime soon from being fucked, but he isn't afraid to take a cock anymore.\nJamison seemed fascinated with Curtis cock this shoot. He spends a lot of time sucking-him-off, and clearly Curtis was enjoying it. It was a win-win!\nWe actually tried a position that Vander was going to do to Jamison, but we just couldn't squeeze his cock in Jamison's tiny frame. Jamison is laying flat and though it is not usually the best for getting a camera in there, once Curtis had his cock firmly planted inside Jamison, he could get upright and showcase the fucking action.\nThen it was Jamison's turn to Top and we put Curtis on his back as most guys tend to like that position to nut. Sure enough, Curtis's cock didn't wilt too much and even recharged when Jamison hit the right angle.\nJamison seems to like getting fucked doggy style, and while we were filming that position he mentioned it was going to make him cum. So that's what we went with. Curtis is slowly grinding into him and it makes him bust his load all over the bedspread.\nCurtis unloads on Jamison's hole, giving a wee bit of cock/cum play, then swirls his cum up inside of Jamison with his finger!",
  "models": [
    {
      "name": "Curtis",
      "person_id": 3406
    },
    {
      "name": "Jamison",
      "person_id": 3392
    }
  ],
  "release_date": "2012-04-25",
  "scene_id": 1599,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Curtis & Jamison - RAW"
}