{
  "collections": [
    "ChaosMen"
  ],
  "description": "I might have mention this before elsewhere, but this video really reminds me what at least three models have said about Austin. Two of them (Chip included) sheepishly admitted that Austin is one of the best kissers, guy or girl, they have have lip-locked with. Vander was the 3rd model, which still is saying something as Vander has got some serious skillz himself. But when it comes from a guy that identifies as straight, it does say something about his kiss-ability!\nYou really see in this video how passionate Austin is about kissing. It brings out the \"boy\" in Chip who can't seem to get enough of the make-out session. Austin gets a little bit in Daddy mode, and if you like videos with a mature/young theme, this one really captures that.\nThough Austin has found that bottoming is pleasurable, he really enjoyed tapping into his dominant side, He fucks Chip unmercifully with his ample cock. Chip keeps his hand firmly planted on Austin's thigh to not have him go too deep, but I think Austin was still going balls deep on him.\nThey do some spooning action, and that wakes Chip's dick up for a bit. They both seem to like the doggy style position best, and Austin unloads all over Chip's hole. He tries to get some insert-action after fucking him, but he went wobbly fast.\nChip was pretty far from nutting, so we had him ramp up and Austin caught it in his hands and rubs it into his furry chest. The two end the shoot by getting back to the kissing, and their cocks look hot all freshly spent!",
  "models": [
    {
      "name": "Austin",
      "person_id": 3426
    },
    {
      "name": "Chip",
      "person_id": 3439
    }
  ],
  "release_date": "2012-03-07",
  "scene_id": 1601,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Video - OutTake"
  ],
  "title": "Austin & Chip - RAW"
}