{
  "collections": [
    "ChaosMen"
  ],
  "description": "Omar is of Middle-Eastern descent but grew up in the Southwestern U.S. Basically an All-American guy.\nIt took a while to get Omar in to the studio. Just after scheduling his solo, he hurt his back doing some squats. I think it was the second time he had really injured himself, and found that he was basically trapped in his bed. All kinds of naughty ideas ran through my head at that thought, but my guess is he was would not be able to move around, much less play.\nIt took him almost a month to get mobile and then hit the gym for about a week. He is very conscientious about his build, and wanted to be in the best shape possible. After being laid up for so long, he didn't feel a week was enough to get back in shape, but he sent some pictures and I told him he was being silly. He looked awesome!\nHe was happy that he didn't have to shave his body hair. His ethnic heritage is known for being hairy, and he says he is tired of fighting the battle against his body hair. At last he had an excuse to to put the razor down!\nOmar does pretty well with the ladies, but has such a pleasant demeanor, that he doesn't sound cocky at all. He just sounds satisfied that things go smoothly for him. He doesn't jerk-off but two to three times a week, so not TOO often, but he knows his body well enough to put on a good show for us.\nHe plays beautifully to the still camera as well as the video, and his orgasm is one of the most intense on the site.\nOmar has had a guy suck on him when he had sex with a male/female couple, so doesn't seem that adverse to doing more. As of writing this though, he hasn't committed to doing an oral.\nWe'll see. He had lots of fun, and the more mature he has gotten, the less uptight he has become.\nFor now enjoy this awesome solo!",
  "models": [
    {
      "name": "Omar",
      "person_id": 3475
    }
  ],
  "release_date": "2012-02-27",
  "scene_id": 1602,
  "tags": [
    "Theme - Solo",
    "Build - Hairy",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Ethnicity - Middle Eastern"
  ],
  "title": "Omar - Solo"
}