{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sanitized version for viewers who may not like fetish play.\nI LOVE doing these Glory Hole videos where the guys don't just blow each other! Even better, two eager gay guys who are way into a little dirty action.\nThere are some fancy editing and special camera tricks to help make this video stand out from all the rest. I hope you guys enjoy it. I haven't seen a video like this edited quite like this, and I think it is very effective.\nPatrick and Vander trade oral like pros, and poor Patrick spends most of his time trying to not cum! He is such an eager bottom, one look at Vander's monster cock and he was ready to jump up and down on it. Vander's dick was literally making Patrick cum hands free.\nThey both also solved the problem of the barrier between them. Vander slides underneath, and Patrick rides his cock cowboy and reverse cowboy style.\nThey finally move over to where the trough is and Vander fucks Patrick until he is about to cum. Patrick jumps up and is practically cumming as Vander lays down to take his load in his mouth. Vander sucks all the cum out of his cock, and then Patrick bends down for a cum-soaked kiss.\nVander wasn't done with Patrick as he uses his hole to dump his load all over and inside!\nVery hot, very different editing.\nI KNOW you all will love this pairing!",
  "models": [
    {
      "name": "Patrick Rouge",
      "person_id": 3450
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2012-03-09",
  "scene_id": 1604,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Hair - Bald",
    "X-Tras - Piercings"
  ],
  "title": "Patrick Rouge & Vander - G:hOle RAW"
}