{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have been wanting to put these two together for a LONG time. Super Shy Dwight, with Super Sexual Kristopher.\nKristopher can handle even the largest cock, but there is something about a cock like Dwight's that hits his sweet spot. I think in this video, Kristopher stays hard during most of the fucking, and he truly works the cock around in his ass- just like a toy!\nAnd with Dwight always bone hard, Kristopher just spins circles around him- literally! Dwight plays catch-up admirably, because as usual Kristopher's sexual energy was vibrating through his scene partner's brain.\nWe even get Dwight to show case his ass, which had Kristopher's cock standing at attention. He loves to fuck too, and I think he would have loved some flip-flop action. But with Dwight never wilting, he still feels he can be Top Dog. I just want to see if his dick stays hard while getting fucked himself.\nSo with Dwight ever-hard, Kristopher got adventurous and we got some cool new angles. He rides Dwight's cock, reverse cowboy style, and I think I got some amazing angles from underneath.\nThe best is when Kristopher discovers the headboard will support his weight, and he bounces his ass up and down on Dwight's cock. I swear Dwight was going to cum!\nAfter the bubble-butt bouncing, Kristopher got himself back into riding Dwight's cock face-forward. Earlier when he was doing this position, he had to stop a couple times because he was going to cum. So he starts off a little soft after the squatting exercise he was doing moments before on Dwight's dick, but he goes from soft to hard to nutting in no time at all. Without a doubt, riding a cock is the best way to make Kristopher nut.\nDwight pulls out and ramps up. He is a little confused about where to cum, so Kristopher tries to get that spurting cock in his hole. I think the last two squirts end up inside, but there is DNA everywhere.\nJust to make sure, Kristopher lubes up Dwight's dick with his cum and shoves it back in, making all kinds of cummy squishy sounds!",
  "models": [
    {
      "name": "Kristopher",
      "person_id": 3401
    },
    {
      "name": "Dwight",
      "person_id": 3388
    }
  ],
  "release_date": "2012-02-24",
  "scene_id": 1607,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Dwight & Kristopher - RAW"
}