{
  "collections": [
    "ChaosMen"
  ],
  "description": "I think maybe Darius is happiest with a dick in his mouth AND in his ass! He is definitely an enigma. Identifies as straight, has a girlfriend, watches straight porn to get hard, but geeez, when he is on set, he sure looks like he is having fun in every way possible!\nSame could be said for Eli I guess. He just knows how to have a good time, with a boy or a girl. Solomon. on the other hand, still is a little timid in taking charge. This was his first time pushing his boundaries with two other dudes. He was concerned about \"all that cock flying around.\"\nTurns out, all we had to do was make him the center of attention to start with. Having his dick sucked by two eager mouths got him going, and he got off to sucking dick while having his own cock sucked. Progress!\nEven doing a triad of sucking kept everyone going.\nEli knows the best way to prep an ass for fucking is to eat it out, though I don't know how much prepping Darius needs to have his ass encouraged to take a cock. I think Solomon was just happy he wasn't taking Eli's ginormous piece of meat. He stares in wonder as Eli easily slides his cock into Darius who was more than happy to bounce around on it with Solomon's dick in his mouth.\nSolomon then fucks Darius on his back and Eli sucks on Darius's cock. Worked out pretty good, but Darius kept wanting to bust.\nSo we switched gears and had Eli and Darius use a double-ended dildo. I knew Solomon would get-off to dominating the two of them and making them take the dildo up their asses. I wasn't wrong. His evil streak really shows!\nFor the finale, we went back to Solomon fucking Darius while Eli sucked his cock. Just a little bit of jerking and we had Darius busting all over the place. Solomon ramps up and cums all over Darius's freshly spent cock, and Eli laps up both their loads.\nSolomon goes around and makes Darius clean off his cock. Eli's aims his load for Darius eager hole, and breeds him good. A few cute OutTakes at the end too!\nThis is an awesome TagTeam with three guys pushing it to the max!",
  "models": [
    {
      "name": "Darius",
      "person_id": 3435
    },
    {
      "name": "Eli Hunter",
      "person_id": 3340
    },
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2012-03-16",
  "scene_id": 1609,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Video - OutTake",
    "Chest - Hairy/Hair"
  ],
  "title": "Darius & Eli Hunter & Solomon Aspen - TagTeam RAW"
}