{
  "collections": [
    "ChaosMen"
  ],
  "description": "Carter Jacobs has done some video work elsewhere. He had a fine time, no complaints, but he is best friends/roommate with Austin, who apparently gave me rave reviews and convinced him he should come work for me.\nI was of course pleased that I was getting great feedback from one of my models, and it is always a good sign when your models are sending you their best buds. Carter, or CJ, definitely had a lot more tattoos than I was comfortable with, but when I talked to him on the phone, I just knew he had a great attitude and awesome energy. His face and personality shine!\nThat comes through in the interview actually. He has a great voice, and is very comfortable in front of the camera. He is not hugely endowed, and though so many viewers want ginormous cocks, I have to have to \"standard\" cocks so that new guys who try bottom for the first time, wont have be scared of sitting on a 9-10 incher. So his cock and attitude will work great for first time bottoming. Add on to that, he has an amazing bubble and I don't think he will be worried about bottoming himself. He sounds like a versatile player. Very easy going.\nFor his solo, I am continuing to test out new settings for the guys to jerk-off in. I have been wanting to do solos that reflect a more \"At home, jerking-off at the computer,\" which is basically what most of you viewers and the models are doing anyway.\nAs you may be aware, I included the porn he was watching in some of the shots, and thought it would be prudent hide it for copyright/2257 reasons. This time I tried replacing it with another camera angle instead of blur. So he isn't watching himself as he jerks off, but I kind of like the effect because it is more like a mirror or the cam is on on the computer. Only had to blur once when the camera moved around. It is not Industrial Light and Magic, but it worked pretty good\nIt does make it easier since they have a video playing, and using the headphones will make viewers happy they don't have to listen to girls getting banged. A few people have complained about that. But Carter does not rely on on watching the video much at all.\nThis scenario also presents a challenge for showcasing their ass while sitting in a chair. Some of you don't care at all about their cocks, and just want to see an ass hole so they can see what they would be fucking. Carter Jacobs does a great job of trying show off his ass to you AND the toy he uses keeps him hard the entire time.\nClearly the kid has got skillz, so despite the plethora of tattoos, I am going to slide him into the mix.\nHope you enjoy this solo though. I kept he interview portion in, despite me wanting to do a more \"spy on them as they jerk-off at home\" feel. It's a different solo than I normally do, but still has enough of the same elements so those of you who count on certain aspects being in place will still be pleased.\nStay tuned for more!",
  "models": [
    {
      "name": "Carter Jacobs",
      "person_id": 3476
    }
  ],
  "release_date": "2012-03-05",
  "scene_id": 1612,
  "tags": [
    "Theme - Solo",
    "Sex Act - Toys",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Carter Jacobs - Solo"
}