{
  "collections": [
    "ChaosMen"
  ],
  "description": "Carter Jacobs had already done oral video elsewhere, but I still like to take the guys through the paces. Get them familiar with how I film, see how nervous or uptight they are, see how much they are checking at the porn playing for them- ya know, check out their energy.\nI already said it, but CJ's tatts are quite a bit, but there is just something about his energy that makes me think he will fuck like a tiger given the chance...or maybe I should say GET fucked like a tiger.\nRansom works really hard to get Carter's cock hard, and it takes quite a few of his tricks to wake him up. Initially Carter was trying to not watch the porn, trying to prove he could do the scene without, but I finally motioned for him to just watch the TV.\nThat did the trick, and his dick woke up, which then allowed him to kick back and enjoy the blow job. He doesn't sit there frozen thinking, \"Yeeks, there is a dude on my dick!\"\nBut back to his butt. Ransom went ass eating crazy on him, and Carter's cock really woke up. Ransom does this great sucking-action, pulling his dick behind him, while playing with his hole. Carter grinds his ass around like a cat in heat! It is some of the best ass eating that Ransom has done.\nRight after the shoot he said, \"That guy really smelled and tasted great! We should do a sex scene together!\" Then Ransom, knowing I love ass, gave me huge sloppy kiss, and said, \"See! Doesn't he smell great!?\"\nUhh..Yup. Maybe Ransom and I are spending too much time together, 'cuz I didn't even bat an eye. We definitely have become a lot more casual with our contact over the years.\nAnyway, Ransom flips Carter back on his back, and his dick goes soft as if to say, \"What? Your not going to play with my ass anymore?\"\nBut Ransom had learned the tricks to make Carter hard again, and I love how strong Ransom is. He is SO motivated to make these guys nut. And once Carter knew it was time, it took no time at all to have him unloading.\nRansom was totally not going to nut at the end, but he knew that Carter was fine with someone cumming on him and he was officially turned on by rimming. He of course had not been able to stoke his cock, but like I pro, he goes from 0 to 60 and nutting.\nIt helped that Carter was egging him on. Most guys after they cum get real quiet and cross their arms as if they are finished. Not Carter. The kid knows how to reciprocate.\nThe chemistry wasn't as palpable as it was when Ransom and Vander blew each other, but Ransom learned some new things, and I am pretty sure we might get Carter to get his amazing ass fucked!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Carter Jacobs",
      "person_id": 3476
    }
  ],
  "release_date": "2012-03-14",
  "scene_id": 1613,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Carter Jacobs & Ransom - Serviced"
}