{
  "collections": [
    "ChaosMen"
  ],
  "description": "Teo is Back! I am airing this video a bit earlier than an Edge video that is coming up early 2012. He had some acne issues, so he left that shoot bound and determined to get some color, clear up his skin, build some muscle mass, and get back on top of his game in general.\nHe did it! He would text me about his progress, email me some pics, and was just giving me a lot of positive attitude about working again and NOT being around his last girlfriend. He was all about getting his life in focus.\nVery proud of him. It makes me happy. Nooo..not just cuz I get to see his ass get plowed, but because I get to see someone I am very fond of grow.\nSpeaking of growing, Austin's dick seems to be getting longer! Or maybe he is getting into fucking a dude more and he just seems more rock solid.\nSince he was staying so solid, I suggested the position that Kristopher and Dwight had tried- the head board butt dip. Both guys thought they could pull it off and they did!\nNot sure why, but the guys always do squats at the gym the day before a shoot. Their quads are always aching before a shoot. Maybe they think they need to build their legs for squatting down on a dick? Usually they are complaining about leg cramps on set, \"Dude I should not have done squats yesterday!\"\nTeo had done squats, and bless his heart, but he powered through that crazy position with major leg cramping. We definitely had to stop a couple times in the middle of shooting so he could \"walk it off\"- but you would never know!\nThe other thing I love about Teo is he can cum from being fucked, and Austin can stay hard till he makes a guy bust. A perfect match!\nAustin's cumshots are always double-barreled, and it is a good thing he cums a lot, cuz a huge amount always shots out his piss hole, while another stream flies out of his piercing on the underside of the his cock (have you not noticed before?). It is kind of fun to watch him coat Teo's balls AND hole at the same time.\nBut wait, I coached Austin on the \"Perfect\" cumshot. Ok, so everyone has an opinion of what makes a perfect unloading, but in general a few squirts on the outside, then dumping the rest inside seems to be the most requested thing.\nLast week Clyde and Solomon did a full on Internal, which will always leave people guessing if the top really came, but with the Austin, there is no doubt that he unloaded deep inside Teo. You can literally see his cock twitching Teo's ass milks his cock.\nBelieve it or not, but this is a very hard thing to do. Most guys will just stay locked into position as they cum, so props to Austin for skillfully doing just enough of both external and internal to hopefully keep everyone happy!",
  "models": [
    {
      "name": "Austin",
      "person_id": 3426
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2011-12-27",
  "scene_id": 1614,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Austin & Teo - RAW"
}