{
  "collections": [
    "ChaosMen"
  ],
  "description": "In my ongoing effort to mix-up the Serviced videos, Hayden volunteered to take over some of the sucking duties.\nI told him if he wanted to do more of them, he really need to step up his oral game. I wasn't looking for guys that were shy about rimming or getting cum in their mouth. He assured me he would push his limits.\nAlvaris, on both days of shooting videos, watched girls being gagged with cocks. So although he says he likes fucking girls doggy-style, just by his viewing habits, I think he really gets-off to making girls gag on his cock.\nEven still, he is reluctant to push down hard on the back of Hayden's head, but you can tell he thoroughly enjoys having his dick sucked. We did a little training for Hayden, who has always done quite well doing the cock sucking during a full-interactive video, but to keep the pace and make someone actually nut during a Serviced video, is a completely different process.\nHayden finally hits a motion, and Alvaris is actually quite good at talking to Hayden about what is working.\nI also like that Alvaris got surprised like many of the guys, that they liked having their ass massaged and jerked/sucked with their ass in the air. The little bit of rimming Hayden did also got him really hard.\nFor the cum shot, Hayden had him almost to the point, but Alvaris takes over and puts himself over the top. But he definitely wanted to make sure Hayden was going to eat his load and pushes his head into place to make him suck his cum up.\nHayden eats it greedily and not only stays hard but pretty sure it excited him because moments later he is upright busting his own load all over Alvaris's spent cock. Cum dripping from his whiskers and mouth as he unloads himself!\nI think we have a new guy who can give these guys the Servicing they want...AND some hungry cum eating too!",
  "models": [
    {
      "name": "Alvaris",
      "person_id": 3478
    },
    {
      "name": "Hayden",
      "person_id": 3330
    }
  ],
  "release_date": "2012-03-28",
  "scene_id": 1619,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Alvaris & Hayden - Serviced"
}