{
  "collections": [
    "ChaosMen"
  ],
  "description": "Clyde is like most first-timers. They just want to Top, and they don't want to suck dick. Baby steps.\nClyde wasn't very confident going into this. As I mentioned before, he is used to fucking girls or getting blown by girls till he cums. He is unbelievably bad at jerking his own cock. (How is this possible?!) But I knew that once Solomon got a dick in his ass, and after the initial penetration, he could take a beating and Clyde could just fuck him until he cums.\nWell, Clyde gives him a pounding that's for sure. He is not graceful or smooth when he fucks. I think \"jack-hammer\" would be good adjective for his technique. Poor Solomon. He really just kind of \"takes it\" for the first portion of the video- face buried into the mattress. The dude loves to give and receive pain, but as far as anal play goes, he is still pretty..ummm..uptight.\nSolomon HAS come a long way in a short while. He can now suck dick without flavored lube (yep, trade secret!) and actually really set his mind to getting Clyde's cock hard. Took him a bit, and he looks very intense (when does he not?) but he seems to have had an epiphany when it comes to sucking dick. He took charge.\nI think it helped that he thought Clyde was in fantastic shape and though I don't think he would admit it, thought that Clyde was hot. He also liked that after only a few videos, he was taking a newbie through his paces. Maybe a little proud that only a few short videos ago, he was the one unwilling to suck dick.\nJust like Solomon's first video, I try to get the other model, Clyde, to at least reach out and jerk-off the other dude. Baby strok...steps.\nWhen it came to the fucking though, Clyde stays amazingly hard. It may be hard to tell, but I don't think Clyde's dick goes limp once. A couple angles it looks like Solomon is riding a soft cock, but if you pay attention, Clyde will pull out just enough and the dude is buried balls deep inside of Solomon. I need to teach Solomon to take longer strokes, but he was bouncing up and down on Clyde's dick like it was an exercise ball.\nWe get Solomon on his back and he is writhing around in pain/ecstasy. You can hear him whimper on occasion. Does he like it? Does he hate it? I can't tell because he is such a sadomasochist.\nI'm down on the ground filming the undershot, and Solomon is tossing and biting pillows. I had no idea! He eventually starts stroking his cock and I scramble to catch his cumshot. I have to admit, he usually struggles to nut, but this time it was easy.\nMeanwhile Clyde is telling me that he can cum too if he can just fuck Solomon a few seconds longer. Solomon was about to say, \"No!\" but Clyde was \"There.\"\nI'm get back down on the ground to catch it, but the dude, totally unloads inside of Solomon. Just like I thought he would. Something the audience has been asking for over and over. I usually avoid this, cuz some cry \"Fake\" but mostly, you just never know what is going to spill out besides cum...ruining a good breeding shot. Thankfully, only a slightly discolored cum oozes out.\nSolomon is so pleased to have unloaded easily AND Clyde came quickly that he is just completely wiped out while trying to push out the cum for us. I don't think I have video ending quite like this.\nI kind of left me getting up from underneath so I could catch it all, but I think it adds to it, despite it being very amateur.\nI even talk a bit to the two of them as Solomon lays in a pile of his own jizz while cum oozes out of his hole.\nI think it is a perfect ending for a perfect ending!",
  "models": [
    {
      "name": "Clyde",
      "person_id": 3469
    },
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2012-02-17",
  "scene_id": 1620,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Chest - Smooth/Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Clyde & Solomon Aspen - RAW"
}