{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jacek was ready to take on a full-on sex scene, and like most newbies, he only wanted to top, and was not ready to suck some dick.\nHe smiles a lot during the first part of the video. I don't know if it is because Vander just switches \"On\" and goes full-tilt, taking him by surprise, or if he is just feeling a bit incredulous that a dude is way into him.\nVander was fascinated by Jacek's cock. It may not be quite Vander's size, but it is close and I imagine it is fun taking on a cock comparable to your own.\nYou have to watch Jacek's eyes when Vander takes off his under wear. Jacek's eyes are pretty much glued to Vander's cock. Perhaps he is doing his own comparison, not seeing a dick bigger than his own.\nHe eventually reaches out to jerk-him-off, and I think was surprised his own dick didn't go down while doing it. I'm pretty sure the next time we can get him to suck dick. It is kind of a shame, cuz Vander's cock is so amazing, if you don't suck on it a little, you missed a really great opportunity! And it would have looked hot in Jacek's mouth!\nVander DID take the opportunity to eat some ass. It's not something he does all the time, but if the guy is right, he will dive in eagerly and toss some salad. Jacek didn't seem to mind, so that is also a good sign.\nJacek gets down to fucking pretty quick, and though he has had anal sex with girls, he pretty much uses spit and shoves it in fast and quick on Vander. Vander should be used to the new guys doing that, but it still catches one off their guard. I mean really, what are they thinking? LOL!\nIt is kind of ironic that the straight guys usually won't bottom because they think it will hurt, but then shove their dick in like they are dealing with a loose wet pussy.\nBut Vander takes it like the stud he is, and in no time at all, is encouraging Jacek to fuck him harder. I know I have bottoms that usually aren't hard while getting fucked, but Vander's cock is usually rock hard while getting pounded. Jacek's cock was hitting him in all the right spots, especially when Vander was riding Jacek's dick. Jacek even stroked Vander's monster cock, and I again have hope that he will quickly be pushing through his limits.\nIf Vander is going to bottom, and the top is staying hard long enough, we know we can get Vander to cum from getting fucked. Jacek does a great job, and I haven't really reviewed previous Vander videos, but he seems to have nutted extra-big in this video.\nJacek has to ramp up to do his cum shot, but he delivers perfectly to Vander's eager hole, even playing with his cummy hole at the end.\nJacek is off to a great start, and I think Vander was the perfect guy to show him how intense guy-on-guy sex can be!",
  "models": [
    {
      "name": "Jacek",
      "person_id": 3473
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2012-03-30",
  "scene_id": 1622,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Chest - Smooth/Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Jacek & Vander - RAW"
}