{
  "collections": [
    "ChaosMen"
  ],
  "description": "It seems like anytime I have Darius or Valentino in a video, the length of the movie seems to creep above the 30 minute mark. As usual, there were so many delicious moments during the video, I found it hard to edit it down to below 30 minutes. So while it may take some time to download, I kind of left in a lot of great moments.\nThe two start by kissing, and rubbing their cocks together through their underwear, something I don't get too often. Both their dicks wake up from the rubbing action and Valentino dives in first to suck some uncut cock. Darius then blows Valentino, and just from that moment, you can tell who is going to be in charge - Valentino gets bossy, and Darius gets um..aggressively passive.\nDarius loves to sit on a cock or have a toy in his ass. It is the secret to keeping him hard and nutting. But even blowing a guy he seems to enjoy. Valentino, well, he usually does it, but with Darius, he actually seems hungry for his cock.\nValentino then takes a toy to Darius's ass, getting it primed and eager for his fat cock. Darius loves the anal play and is pretty much begging for Valentino to fuck him.\nWhat I enjoy most about this video is Valentino loves to have someone take his cock, and with Darius so eager to get fucked, they both take their time, varying speed and cock teasing each other. Valentino plays with Darius's cock and as usual, Darius has to get him to stop or risk nutting too soon. Someday I am just gonna let it happen.\nLot of great footage in this as Valentino really gives Darius a pounding.\nValentino literally fucks the cum out of of Darius and man, I just about missed Valentino's cum shot as I quickly try to move my cameras around. He was ready to bust!\nHis aim is a little high, but he takes plenty of time to juice him and coat his cock with his cum and push his seed inside of Darius.\nDarius always leaves the studio with such a satisfied look on his face. He still identifies as straight, but I think he gets to receive what he can't get from a woman during these shoots, and the dude leaves the studio spent and completely satisfied!",
  "models": [
    {
      "name": "Darius",
      "person_id": 3435
    },
    {
      "name": "Valentino",
      "person_id": 3427
    }
  ],
  "release_date": "2012-05-11",
  "scene_id": 1623,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Toys",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Chest - Smooth/Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Darius & Valentino - RAW"
}