{
  "collections": [
    "ChaosMen"
  ],
  "description": "Troy has got some tattoo action, but I just couldn't say \"no\" to this super hot muscle dude, with plump lips, sparkling green eyes, and hefty cock.\nHe has done the military thing, hence a tummy tattoo that might not really be appropriate for porn- with or without condoms. He really wants to branch out into mainstream modeling, and was having trouble with all his tatt work. His tummy tatt he was going to cover with crows or birds, but I think I have him talked into \"removing\" tatts, rather than just adding more, and work on his dream to do modeling.\nI am having two of mine removed , kind of as a test, and I think he is going to do it too. He is down for more work, so hopefully we will be seeing a tatt or two fade as we go along. Maybe I can talk a few models into removing them if they are in those crazy awkward spots that always seem to be in every camera angle.\nHaving said all that, I LOVED working with Troy. His solo is amazing, and loves to play with his ass. He identifies as straight, but there is one dude that he had been friends with for years, and they basically had a long standing \"bromance\" that one drunken night turned into full-on fucking session. Kissing, eating ass, fucking each other. They went all out.\nOk, so one drunken roll in the 'gay' could be blamed on the alcohol, but the two have since rolled around some more and he is interested in exploring if it just this one guy that gets him going, or if other guys will do it for him. Not sure exploring your sexuality through porn is the best way to Come Out, but we get to watch, and let's admit it, we are voyeurs here!\nWhile doing photos for the solo, Troy knew the following day he was going to be getting and giving head. But he was just so turned on he kept asking if maybe he could do more than suck. We finally switched from straight porn for him to watch to gay porn, and his eyes just got super wide and he was even more insistent that he really just didn't want exchange oral.\nI told him it was possible since he and his scene partner were already tested and I said that I might even have another guy to jump in if he wanted all his holes filled. He loved that idea!\nSo enjoy today's solo, but fans of the Serviced video will likely be disappointed to not see him being made to cum from a bj. I guess next week they will have to \"suffer\" through him getting tag teamed!\nStay tuned for next week, 'cuz the 3-way action is super hot, especially knowing it was only supposed to be a Serviced video!",
  "models": [
    {
      "name": "Troy",
      "person_id": 3479
    }
  ],
  "release_date": "2012-03-26",
  "scene_id": 1627,
  "tags": [
    "Theme - Solo",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Troy - Solo"
}