{
  "collections": [
    "ChaosMen"
  ],
  "description": "As I mentioned last week, this was supposed to be a Serviced video.\nI actually get viewers who complain when there isn't a Serviced video on Wednesday. They are fans of them, and are quite vocal about having a sex film instead. ~sigh~ I would have thought otherwise, but everyone has their favorite theme.\nSo I guess I have to apologize to the fans of Serviced videos. Surprise! It's a TagTeam RAW video instead.\nLike I said, Troy was set to do a Serviced video with Patrick. But during the solo, we switched him to gay porn, and he was getting all eager to do a full-on sex scene. He was so horny I thought maybe he was hinting for me to come play with him. But I stayed strong, and stayed behind the camera, mainly cuz not only did I KNOW Patrick would love to just not do oral, but that Ransom was going to be there also. Patrick has been after me for a while to put him and Ransom together.\nRansom has more of a military vibe that I thought would fit better with Troy, and I momentarily thought about switching Patrick out. But when I mentioned that both Patrick and Ransom were fully-tested and ready to play, Troy was eager to have TWO new buddies.\nIt was a bit much to throw at Troy for his first film. Not the cocks, he was good with that! But you can tell he just doesn't know where the cameras are so he can showcase. Not entirely his fault either, Patrick and Ransom were pretty hungry that day, and they were all over Troy. I had a tough time keeping up with them.\nTroy loves to rim! He not only gets his salad tossed, but rims both Ransom and Patrick. Ass-eaters will be so pleased!\nTroy is wobbly at the beginning of the video, but as soon as a finger is inserted, his dick gets hard. Both Ransom and Patrick take turns fucking him, and I think Patrick gets his wish to be drilled by Ransom.\nThere is even a tiny bit of daisy-chain fucking as Ransom fucks Patrick while Troy sits on Patrick's cock.\nFans of Serviced videos will still get a charge out of seeing Ransom fuck the cum out of Troy, and Patrick swooping in to eat some of his cum and suck the last drops out. Kind of like the end of a Serviced video?\nRansom then unloads and juices Troy. He hops on over to Troy and makes him lick clean his cock covered in jizz. Meanwhile Patrick is turned on that he gets to fuck a cum-filledhole and adds his own load to Ransom's. Sloppy seconds are sometime the best!\nI think everyone left this shoot feeling VERY satisfied. I think you will too.!",
  "models": [
    {
      "name": "Patrick Rouge",
      "person_id": 3450
    },
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Troy",
      "person_id": 3479
    }
  ],
  "release_date": "2012-04-04",
  "scene_id": 1628,
  "tags": [
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Patrick Rouge & Ransom & Troy - TagTeam RAW"
}