{
  "collections": [
    "ChaosMen"
  ],
  "description": "Chip pretty much is a the perfect bottom. He may not get very hard, and he says it feels, \"ok.\" but every guy that has worked with him seems to really enjoy fucking him. They all seem to stay extra hard, and the videos are pretty easy to shoot.\nStone had been bottoming quite a bit, and was eager to show off his topping skills. I have been kind of working the Daddy/Son thing with Chip's partners. I think it works, especially if you the viewer are a bit more mature, but still love a young dude.\nThese two do not disappoint either. Chip Services Stone beautifully, getting Stone's cock nice and hard.\nThe two try some different positions, including one of Chip laying on his stomach while being pile driven by Stone's cock. Normally it is kind of a position I avoid. The bottom can't scoot away from the cock if the Top is going to deep, and Chip usually keeps a hand firmly placed on his scene partner's quad so he can push back a little if he is feeling it in his spleen.\nI also avoid the positions because it is dang hard to get a camera angle in there is the Top is staying hard and can support himself. Well Stone was doing push-ups into Chip and we got some great penetration shot.\nStone had been saving up to nut all week, and wow, you could really tell! He pops a major load all over Chips' asshole.\nChip was not too far behind Stone either, so it makes for a very nice Happy Ending!",
  "models": [
    {
      "name": "Stone",
      "person_id": 3398
    },
    {
      "name": "Chip",
      "person_id": 3439
    }
  ],
  "release_date": "2012-12-30",
  "scene_id": 1633,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Chip & Stone - RAW"
}