{
  "collections": [
    "ChaosMen"
  ],
  "description": "I just love the body language on this Serviced video!\nFirst, we didn't set this up as a standard Serviced video. Jet had already done an oral scene and was fine sucking dick, though he wasn't quite ready for an uncut one. Though to be honest, he adapted fast and really stroked it how most uncut guys like- using the foreskin like a cock-sleeve.\nThe two start-off jerking it. Teo, ever the pro, gets his dick hard quickly. They both sneak peeks at each other equipment, and I think Teo realized Jet is just not going to wake-up on his own, so dives in for some cock sucking.\nTeo has been watching my Serviced videos, and is really focused on trying new techniques. They worked pretty dang good (in fact too good if you watch the ending..which of course you will!). Meanwhile, Jet has his head turned to the side, eyes closed, perhaps thinking of a girl, or maybe Willing his cock to become hard.\nIt gets there and Teo sits back to get his dick back to full potential.\nJet dives in without a second thought, and he sure looks good sucking dick. He seemed more skilled than I thought he would . did do a little rehearsal, and Teo told him how to handle his foreskin beforehand so it wasn't complete intuitiveness.\nBut he kept Teo nice and hard, and I do believe he was enjoying it.\nTeo is also pushing himself for the ass eating, and though Jet is smiling from the whisker tickle, he encourages Teo to finger him...and go deeper. His dick really wakes up, and even though I have yet to film a sex film at the time of writing this, I think Jet will enjoy being ass fucked. He has his ass all propped and ready for eager insertion!\nI told them after the ass eating, for Jet to get up on his knees and that was the position he would likely cum in. I asked \"Can you cum on your knees?\" to which he replied simply, \"Sure!\"\nNormally they move into the \"cumming position\" and I have to move all my cameras around to try and catch various angles. But I think Jet REALLY liked his ass played with and as soon as he was upright, and Teo was using a really good technique, he was busting.\nThe look of surprise on his face is awesome, and Teo, not normally fond of cum in his mouth, was I think equally surprised. He has done a lot of video, an I can't remember him every making a guy cum from sucking. So his skillz have improved.\nFortunately I had all the cameras aimed..just not a super tight shot of Teo's face. But you get the idea. And Teo goes all out playing with the cum. Jet is just spent and trying to catch his breath. Amazed he came so hard and so easily. It will make you wonder about his sexuality, but at the same time if you go back to the beginning of the video, Jet is clearly looking away and \"distancing\" himself from getting blown by a dude.\nThey quickly swap places, and Jet was willing to take a load to his chest. Teo unloads A LOT, and Jet, like a natural porn performer, plays with the cum. Watch carefully as some cum lands on his lip, and he quickly licks it up. I don't think he intended to eat cum, more instinct, but at least I can tell him he has already ate some cum so may as well take a full-on open-mouthed facial next time!\nI might have Jet do an Edge video. He really is turned on by bondage, and we can push his limits some more before doing full-on sex!",
  "models": [
    {
      "name": "Teo",
      "person_id": 3261
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2012-02-15",
  "scene_id": 1635,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Video - OutTake"
  ],
  "title": "Jet & Teo - Serviced"
}