{
  "collections": [
    "ChaosMen"
  ],
  "description": "It was time for Clyde to suck some dick. I think he had done it once before, but he was certainly putting it off for me. I told him I would let him get by with one video, but after that, he needed to step up his game, after all, this IS gay porn.\nI thought it would make it easy on him by blindfolding him, and having Vander use the rope cuffs on him. Make him feel \"passive\" about it...but also I didn't want him to see how big Vander's cock was.\nFor those of you guys who don't think that most of these guys self-identify as straight, you likely will realize that Clyde is pretty dang straight. He does look 'made to' suck Vander's cock, and though he is gagging and fighting back the urge to toss his lunch, he tries. He actually did um, urp up on one take. I think Taylor had the same problem with Vander.\nI noticed right away while he was blindfolded that he was pretty much deep throating Vander's dick... causing him to spew. Plus he was kind of trapped there and couldn't pull away if his gag reflex was going into overdrive. So I had Vander take off the blindfold and told him every time he felt he was going to gag, to just lick around his cock. He did much better, and though there are some grimaces and dry heaves, he did a fine job with a very \"Advanced\" cock.\nI also like the idea of Vander eating out his hot muscle ass, and I am a little irritated with myself that I didn't catch/film continuously on the ass eating cuz Clyde had gotten a boner. I was REALLY surprised when Vander lifted back his cock and it was hard. Not that having your ass eaten isn't arousing, but Vander has a lot of scruff that I thought would tickle him, plus he HAD just got done being throat fucked. I figured he would be down for the count.\nSo maybe the tying thing worked. It sure was easy to flip him on over to suck his hard dick. Clyde doesn't wear deodorant, so Vander was in armpit piggy heaven licking his pit and sucking his cock.\nYou would think that Clyde would be getting fucked, but alas, he is likely not going in that direction (ok so he is a big baby about it..but so was Taylor!) Vander just goes from sucking him to sitting on his cock.\nClyde is pretty dominant and he loves to be serviced in any way. Fucking in any position he is dang good at.\nApparently too good. If you notice, Vander accidentally dumps his load while riding Clyde's cock. Gotta give Clyde AND Vander props. Clyde stayed hard with another guy's jizz on him, and Vander just kept at it until his dick woke back up again. Vander said at the time he didn't cum \"all the way\" but after reviewing the footage, he pretty much busted!\nAs for Clyde cumming, he does have the one issue where he has to fuck someone till he cums. He is terrible at jerking-off. I think he grew up humping his pillow, which is hard to do on a porn set.\nVander was certainly ready to take his load deep inside like Solomon did, but I didn't want to duplicate the same thing for those of you who cry, \"Fake!\" for internal cumshots...even though everyone keeps requesting it. It is kind of a No Win situation.\nSo he busts all over his hole and shoves it in. What is awesome is there is cum dripping out of Vander's hole, and Vander just busts out his second load! My \"under light\" gets in the shot as I wasn't totally ready for him to bust, but it is pretty damn hot!\nVander came with his own idea about the ending. He really loves it when a guy gets dumped in, then the Top goes around and makes him clean his cock off. He really wanted it to be shot continuously so there was no doubt he was having to clean his own cum of Clyde's dick. I did have to get out of the way, but believe me, Vander is eating Clyde's load fresh from his own ass.\nVander left that shoot EXTREMELY satisfied! I think you will too!",
  "models": [
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Clyde",
      "person_id": 3469
    }
  ],
  "release_date": "2012-04-20",
  "scene_id": 1636,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Clyde & Vander - RAW"
}