{
  "collections": [
    "ChaosMen"
  ],
  "description": "Over the course of the last year, Nash had been sending me update photos. He was looking extra beefy, got his braces off, and I really have been wanting to keep Solomon with guys who have the smae muscle mass he does...though I think Solomon actually likes being the most muscular. Top Dog!\nPlus Nash said he would bottom or flip-flop and Solomon was ready to try Topping again. Well, that plan didn't work out so well. More on that later.\nI bring up Nash's teeth for another reason. He smiles more and he seemed more eager to suck dick without trying to hide his teeth. Solomon's attitude on sucking dick has changed too. He seems more relaxed, confident, and more interested in pleasing the other guy, rather than worrying that there is a cock in his mouth.\nNash too attacked Solomon's cock with new enthusiasm. Solomon refuses to watch the straight porn playing, so I have noticed he closes his eyes and just goes with the feeling. He tends to get very passive, but once his dick wakes up, he LOOKS at the model sucking him. He is There for sure. I like that.\nThey 69 for a bit, and also do some standing cock play. Nash sucking Solomon's dick, then going up for a kiss, sharing the taste of his cock. Love that!\nThen things went wrong.\nOriginally, Solomon spins Nash around and starts fucking him doggy style. I have noticed that when the pressure is on Solomon, his dick will go down. Performance anxiety. He tried really hard to get his dick in Nash's hole, pincihng it off and shoving hard. Too hard. He got a little bruise on the top of cock and pretty much hurt it to the point it wasn't going to wake up soon. He wasn't hard enough to actually break his dick, but squeezed and bent it to leave a painful mark...which isn't always a bad thing for Solomon. But it took his dick out of commission for a while.\nNash was only too happy to Take Charge as he is kind of Bossy, so we flipped it around, and Solomon took Nash's cock instead.\nAfter some ass spanking and hole pounding, his dick was nearing recovery, but by then Nash wanted to bust. He cums all over Solomon's hole, juicing him real nice.\nThen we do a fade to Solomon's cumshot. We just weren't sure his dick was up to the challenge, but Solomon swore his dick now felt pretty good, and he needed to nut. Like Clyde, he grew up pillow or blanket fucking, and he thought a pillowcase would make him cum quick and well, gently! Though to be honest I don't know how he doesn't start a fire under there.\nBut it was the quickest he has ever cum, so from now on, I am keeping a blanky on set for Solomon. I know, such a Bad Ass dude, and the blanky trick works.\nAnyway, I hope this behind the scenes history doesn't ruin the scene for you. They both had fun, were willing to roll with the punches, and ultimately, it is two very hot dudes getting on with lots of energy!",
  "models": [
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    },
    {
      "name": "Nash",
      "person_id": 3315
    }
  ],
  "release_date": "2012-04-06",
  "scene_id": 1637,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Nash & Solomon Aspen - RAW"
}