{
  "collections": [
    "ChaosMen"
  ],
  "description": "I don't know what it is about watching Foster suck dick, but he sure looks like he is happy doing it! His dick gets hard, and he does seem like he is trying his best to please his partner. I think he was also into Eli's big cock...kind of like sucking on his own dick.\nEli likes to rim, and we got some cool under shots. I just love seeing Foster's cock hammer hard while he gets his salad tossed. He still won't bottom, but he sure enjoys the anal attention. Maybe there is hope?\nRegardless of him bottoming, he is such an amazing Top, and Eli can ride a cock like no other. He bounces up and down on Foster's big dick and when he runs out of steam, Foster really starts banging him.\nWe try a new position since I know Foster just never wilts until he busts. Kind of a T-position. It seems like the angle is a little off, but Eli really had a chance to play with his cock and got bone-hard from the fucking.\nEli and I were talking before the shoot, and he swears he had not cum while being fucked before. I thought he had, but no, but he was willing to give it a try.\nFoster fucks him right at the prostate point, and sure enough Eli blows an intense load.\nFoster is a distance shooter, and it always worries me that he is like 2-feet away from busting on the hole. He usually nails the hole with laser precision. But his first squirt falls short and then he quickly recovers the next couple squirts to the proper target. He even shoves it in and finishes unloading inside of Eli.\nThere is sticky cum everywhere, and Eli even pushes the load out. You should like this nice external/internal creampie, and this one is nearly perfect, complete with cum oozing out of Eli's hole!",
  "models": [
    {
      "name": "Eli Hunter",
      "person_id": 3340
    },
    {
      "name": "Foster",
      "person_id": 3438
    }
  ],
  "release_date": "2012-05-04",
  "scene_id": 1641,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Eli Hunter & Foster - RAW"
}