{
  "collections": [
    "ChaosMen"
  ],
  "description": "I don't know why I keep forgetting that Jacek truly has a formidable cock. It is up there in length/width with Vander and Foster. Jacek still isn't sold on the idea of bottoming, and not just anybody can sit on his fat Polish sausage.\nSilas of course has sat on some mighty big cocks, in fact the bigger the better it seems. He has been chilling and doing video only sporadically, but I definitely needed him to wrap his ass around Jacek's cock.\nSince Jacek wasn't ready to bottom, I told him it was time to suck some dick. He did so reluctantly, but wow! Jacek subscribes to the notion, if you are going to do it, do it right and with showmanship. He talks a big game off set, and when he really started sucking Silas's cock with gusto, all the sexual umm..bragging he does really became reality for me. A few tears stream out of one eye, but he sucked like a pro.\nAfter he got the cock sucking 'over with', he was ready to chill and get his dick sucked. I really think it is one of his favorite things, no matter who is doing it. He loves having his cock worshiped! And you really see how big his cock is. Silas does some rimming while Jacek strokes his cock.\nAfter the oral, Silas takes it nice and slow trying to wedge Jacek's uncut cock in his ass. It is a great to watch as he slowly works it in, all the while being in a very challenging position.\nI can tell already that Jacek is a lazy Top. He stays hard the whole time he is laying on his back, letting Silas ride his cock both cowboy and reverse cowboy style, letting Silas do all work.\nOnce he is standing up and fucking in a more doggy-style position, one where he has to do some work, he gets wobbly here and there. He focuses real hard on the cumshot and misses his mark a little but then quickly recovers. Uncut cocks tend to be extra sensitive after they nut, so it is challenging for them to juice a guy properly, but he gets the job done.\nSilas nuts soon after that, and then spins around to lick the cum and ass juice off Jacek's spent cock!",
  "models": [
    {
      "name": "Jacek",
      "person_id": 3473
    },
    {
      "name": "Silas",
      "person_id": 3229
    }
  ],
  "release_date": "2012-06-01",
  "scene_id": 1646,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Jacek & Silas - RAW"
}