{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had actually been trying to get these two together for quite some time. When Austin started working for me, I thought I would put him with Jamison his first time. Then Duty called and Jamison was unable to make the shoot, and the second shoot, Austin was too wrapped up in work to get time off.\nFinally things settled for both of them, and I could make the match happen. Austin said he wasn't pee shy, so I figured a G:hOle video would work. Jamison said he would try, but is definitely pee shy. He did try a couple times, but there is a lot of pressure to perform when someone is hovering over you with a camera. We kept the piss play separate from each other, so CCBill wouldn't make a fuss.\nAustin also had been doing homework with his girl on receiving some anal play and felt pretty confident he could handle bottoming with pleasure instead of just \"taking it\".\nThey start off by eye-balling each other's equipment at the trough. Austin pisses and then they both start stroking each other till they are hard. Jamison heads for the stall, and Austin really sucks Jamison's cock with enthusiasm.\nHe even unloads more piss on the floor while sucking Jamison off.\nJamison returns the favor by sucking on Austin. Jamison's cock is all hard and ready to be sat on, so Austin climbs aboard while Jamison sits on the toilet. This isn't exactly an easy position to film but the two really do a fine job showcasing and having fun.\nThey move over to the floor to make things a bit easier. Jamison fucks Austin on his back, his balls slapping against Austin's ass.\nI know Jamison nuts faster while being fucked, and Austin really likes to be dominant, so Austin literally fucks the cum out of Jamison doggy style.\nAustin is not far behind, giving his dual-squirt action he is infamous for. Lot of nice cum play at the end of this one.\nIf you like 'em hairy and hot, this video is awesome!",
  "models": [
    {
      "name": "Austin",
      "person_id": 3426
    },
    {
      "name": "Jamison",
      "person_id": 3392
    }
  ],
  "release_date": "2012-05-25",
  "scene_id": 1647,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Sex Act - Piss"
  ],
  "title": "Austin & Jamison - G:hOle RAW"
}