{
  "collections": [
    "ChaosMen"
  ],
  "description": "Yet another Serviced video that gets out of hand!\nBooker has done video work before, but I wanted to see how he was on set working with another guy. I will always till want to do an Oral or Solo only video with any model that has done previous video work. See their energy, but get them used to how I film. I know it seems like a backward step, but it has a lot of value for me to work out any habits they may have picked up, test their limits, or evens showcase a particular skill.\nBooker was eager to show off his Topping skills, and Allen, well, he was pretty horny before the shoot. I don't believe Booker has Topped before, and Allen kinda gets-off on being fucked.\nSo we intended this to be a Serviced video. Starting the video off like we normally do. Allen can really suck a dick, and he had Booker all charged-up and super hard with his sloppy blow job. I knew both guys liked eating ass, and after Allen eats out Booker's hole, I think Booker was ready to return the favor. I think he loved rimming while getting his dick sucked.\nAllen flips around and makes Booker suck his dick, inching his ass ever closer to Booker's cock. He finally slowly slides it in, and before we knew it, we had a full sex scene unfolding!\nBooker did an awesome job Topping, only making a few rookie mistakes like not moving his arm out of the way and blocking his cock fucking action. Allen was really happy to once again get the added stimulation of being fucked while jerking-off.\nI still wanted this video to end like a Serviced video, so Booker lays back into his starting position, and he jerks his load off into Allen's mouth. I think most flies clear of his mouth, but a couple big glops land on his tongue.\nAllen, ever the showman, goes upright and unloads onto Booker's cock, then strokes him with his load, finally sucking and licking both their loads off!",
  "models": [
    {
      "name": "Booker",
      "person_id": 3482
    },
    {
      "name": "Allen",
      "person_id": 3477
    }
  ],
  "release_date": "2012-04-11",
  "scene_id": 1648,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Allen & Booker - RAW"
}