{
  "collections": [
    "ChaosMen"
  ],
  "description": "I think this is the best that Jacek has done as far as Topping and getting in \"the moment\" Darius of course likes to be fucked, and is even happier when the Top can really go deep on him.\nWe start off with a nice rub down, and I am still trying to get Jacek used to having his ass played with. It sure makes him hard, but bottoming is still only a passing thought. No need for him to bottom in this video as Darius is eager to suck his fat uncut cock and get it inside of him.\nWe tried some reverse cowboy action. I think it is the only time I have seen Darius unable to stay hard, and he really had to focus to keep Jacek in side of him. Jacek's dick doesn't have much bendy action so fucking in reverse was a challenge to not only do, but to film. But hey, we tried!\nWatch for how much sweats starts pouring of Darius in this position, he is working dang hard to get that dick up in him!\nJacek does an awesome job showcasing his fucking action in the other positions, pulling all the way out, then plunging all the way back into Darius's perfect hole. Making him beg for more and deeper.\nDarius can cum in any position, but on his back is his favorite. He really jerks fast and furious, practically demanding that Jacek, \"Keep going!\"\nWe reset and Darius unloads and creampies Darius hole.\nI love this video- watching these two uncut boys go at it like they are hungry for it all.",
  "models": [
    {
      "name": "Jacek",
      "person_id": 3473
    },
    {
      "name": "Darius",
      "person_id": 3435
    }
  ],
  "release_date": "2012-08-31",
  "scene_id": 1655,
  "tags": [
    "Sex Act - Oral Only",
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Darius & Jacek - RAW"
}