{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jet was very eager to work, and after his Serviced and Edge videos, he was looking forward to trying some major ass play. It seems to make him nut super quick! I think in both those videos there are some Out Takes where he is about to cum too soon.\nThis video is no exception. I know many of you get discouraged if the bottom doesn't stay hard while getting fucked, but most you will over look. For the most part I am pretty lucky and have guys like Silas, Eli, Darius, Vander, Micah...etc..who usually are all boned up while bottoming.\nWe can add Jet to the list. Ever hard Isaiah has been off working the rodeo circuit (this kid is always banged up!), but was also eager to get back into the swing of things. He is always so passionate on set, and I think he must be one of the best kissers. Isaiah always gets his hands in there, pulling his partner in for deep kiss.\nAnd Deep is where this video went. Both dudes really pushed their oral skills, often gagging or tearing-up as they both did their best to deep throat.\nI think there are two Out Takes in this video. One mid-movie where it organically fit in while Isaiah sucks on him and fingers his hole. The other one is at the end, and \"spoils\" the cumshot of what really happened without some fancy editing to make it feel more continuous...which it really was either way, just no racing around to get the cameras setup!\nJet has done dildo play with his girlfriend, so he was only a little worried about taking Isaiah's cock. Still, he wanted to start off by sitting on it so he could monitor depth and speed. Didn't take much adjusting and he was grinding like a pro.\nWithout a doubt, Jet was happiest on his back while being banged by Isaiah. Like I mentioned earlier, you can go to the very end of the video to see just how happy his ending was!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Isaiah",
      "person_id": 3397
    }
  ],
  "release_date": "2012-04-27",
  "scene_id": 1656,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Video - OutTake"
  ],
  "title": "Isaiah & Jet - RAW"
}