{
  "collections": [
    "ChaosMen"
  ],
  "description": "I think Chaz Riley has been in the business for about 5 years now. When I air someone who has a body of work out there, invariably I get an email saying \"Seen him! You are supposed to bring us new meat!\"\nWell, I don't see anywhere on my site or banners where I say that. Same goes with bareback content as well as the guys being straight. I do absolutely no advertising, and none of the banners I create say anything about any specific genre of thing I am trying to sell the site as.\nWe all know some of guys are Bi, some switch teams, while most stay playing for Team Hetero. So I do no marketing like \"Hot Straight Guys Getting It On!\"\nI have just seen so many sites that banner advert that, and well, it's just not believable. I have no Bareback or Freshest Meat marketing either. I simply state on the site that it is a RAW video, and describe what happens in the summary or state how they identify sexually.\nNow affiliates/blogs, they tend to create a theme or angle for the site's content, but that's up to them.\nI have always taken in guys that have done previous work...not many, but I always need solid performers for the new guys. I rarely put two complete newbies together. It's just too hard. I admit it t can be charming to see them both fumble about, but normally, I need a ringer in there.\nChaz is such a chill guy. He is down for anything, and just an overall super hot guy. He likes what he does and wants to keep you all entertained.\nI still wanted to do a solo and oral (well....Edge!) video with him to see how he does, any habits he has, and his energy level, but wanted to make it different from anything else he has done before.\nI asked him if he had used a FleshJack in any previous videos, and he said no, so we added that into the mix to make the solo fresh.\nHe certainly knew how to work it, and my favorite part is when he is fucking it doggy style while fingering his ass!\nThe dude has got skills!\nI can think of so many of guys on my team he would look great with...Solomon, Vander etc. So stay tuned and lets see how far we can push his limits!",
  "models": [
    {
      "name": "Chaz Riley",
      "person_id": 3485
    }
  ],
  "release_date": "2012-05-07",
  "scene_id": 1658,
  "tags": [
    "Theme - Solo",
    "Sex Act - Toys",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Chaz Riley - Solo"
}