{
  "collections": [
    "ChaosMen"
  ],
  "description": "If you remember from last week, I mention that Bentley really amps up his performance during his Serviced video.\nNot sure if it because he got more comfortable, or if Allen brought it out of him. Allen pretty much goes full-tilt on him. For those of you who think Ransom and I are too \"quiet\" during an oral, here is your chance to see and hear someone going all Gag Factor on a dude. He gets pretty piggy with it!\nBentley's dick gets wobbly here and there, and for those that complain about the stealth sucking, really, there is a reason for it. We try to stay as quiet as possible so the guy can not be too distracted or reminded there is a dude on his cock. I think Kristopher really strikes the best balance of \"getting down to it\" yet also engaging the model in some way.\nOnce Allen moves over to the side, Bentley gets some thrust action, and his cock starts busting at it's seams. Allen is gagging on in, and at the time I felt like it was a bit \"too much\" noise, but after editing the video and seeing just how FAT Bentley's cock is, and how far down Allen was going on it, that I am surprised he didn't choke to death on it! It certainly made his eyes water.\nAllen loves to munch on ass, while Bentley was a little unsure to start with. I gotta say though, it is so hot seeing him getting his salad tossed!\nAllen's got stamina, and likely could have made Bentley nut, but since I knew Allen is fine with cum in his mouth, I wanted to get some nice cum eating. Allen lays down and sucks on Bentley's big bone, a tear still running from his eye.\nBentley ramps up and cum is flying everywhere. Not sure how much made it into Allen's mouth, but cum and saliva come streaming out of Allen's mouth. Juicy!\nIf you dig facial with messy cum endings, you well definitely be saying to yourself, \"It's about time!\"\nThis is a sexy, hot, piggy Servicing!",
  "models": [
    {
      "name": "Allen",
      "person_id": 3477
    },
    {
      "name": "Bentley",
      "person_id": 3486
    }
  ],
  "release_date": "2012-05-30",
  "scene_id": 1661,
  "tags": [
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Allen & Bentley - Serviced"
}