{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had a couple goals for this video. Get Booker a \"standard\" size cock that he might enjoy getting fucked with, and the other, step-up the cock-size that Carter would sit on.\nI know many guys prescribe to the Bigger is Better, but having a cock that isn't overwhelming and hit's that sweet spot just right, really can turn a fucking scene from \"just taking it\" to a \"You're gonna make me cum if you don't stop fucking me!\" scene.\nThey both start off with oral, and CJ turned nervous when he got a close-up look...and a mouthful of Booker's cock. He suddenly didn't think he could take it.\nBooker will rim, and from previous experience, I know that will put CJ in a more receptive mood...which it did.\nFirst though, Carter fucks Booker, who pretty much realizes he is is staying hard and struggling to not cum.\nWe flip-flop with Carter sitting on Booker's cock, easing it in nice and slow, and then it was a pretty simple matter of them revving up speed. I don't think CJ has as much fear about bottoming. Now if I can move him to the same level as Booker!\nFor the first time, Booker felt certain he was going to be able to nut from fucking. There is a great out take where he almost shoots too soon. He barely keeps it in. For the real money shot, Carter fucks him, though Booker does a leg straightening lock, forcing CJ to keep himself planted in him, rather than fucking him while he nuts.\nBut we got him to realize it feels good, and I think in the future he will use this trick to make himself cum easily. CJ was certainly surprised that he has had two guys (Jet) also nut from being fucked.\nCarter juices Booker's hole and we get some nice cum play for the ending!",
  "models": [
    {
      "name": "Carter Jacobs",
      "person_id": 3476
    },
    {
      "name": "Booker",
      "person_id": 3482
    }
  ],
  "release_date": "2012-06-15",
  "scene_id": 1665,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding",
    "Video - OutTake"
  ],
  "title": "Booker & Carter Jacobs - RAW"
}