{
  "collections": [
    "ChaosMen"
  ],
  "description": "Clyde is still working on his cock sucking skills. He really has a pretty strong gag reflex. I was hoping letting him have free reign to move about and suck would help, but he still looks like he is getting dental x-rays.\nAllen hardly notices though, or at least his dick didn't. One thing we have learned about Clyde is that getting his ass eaten makes him hard. So Allen went to town on his back door, and sure enough Clyde boner-ed up! Allen flips him over an gives him his trademark sloppy blow job.\nLike you, I think the ass eating makes me think Clyde should bottom, but he has his hands firmly crossed on that. We will see, but he tends to be an \"extra sensitive\" guy, and there is quite a bit of fear there. Might not be able to overcome that.\nWe continue to try play to everyone's strengths. I know Clyde likes to be ridden, and Allen likes to control the insert, so we start off with Allen riding Clyde. Clyde is a little wobbly so we get him upright and he got his momentum going.\nSpeaking of momentum, truly Allen loves being fucked. His dick just loves having something in his ass! Clyde really can stay hard as long as he is fucking full-speed, and thankfully, Allen enjoyed it.\nI really wanted to do an undershot of Allen nutting, and it is pretty awesome to be underneath as Clyde slowly moves his dick around, making Allen shoot out giant jets of cum!\nClyde was pretty close to cumming while fucking, but I think after Allen's intense cum shot, he was not up for Clyde fucking him till he nuts. So Clyde juices him instead, and overall, this match-up was stellar!",
  "models": [
    {
      "name": "Clyde",
      "person_id": 3469
    },
    {
      "name": "Allen",
      "person_id": 3477
    }
  ],
  "release_date": "2012-06-08",
  "scene_id": 1666,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Video - OutTake"
  ],
  "title": "Allen & Clyde - RAW"
}