{
  "collections": [
    "ChaosMen"
  ],
  "description": "I knew I needed to get Carmine a \"Daddy\" type in order to keep him truly turneded-on for doing adult video. Watching gay porn doesn't seem to work for him, and he kind of relies on the other model to keep him going. So it will be challenging as a lot of the straight guys have their backup plan (straight porn) to help jump start their engines.\nFortunately, Austin already likes to be a bossy daddy type, no matter if it is with a girl or guy.\nIt is super hot seeing a hot, hairy, mature dude with a younger Latin twink.\nCarmine really responded to Austin's fatherly presence! I think most viewers would categorize Carmine as a bottom, especially with his bubbly Puerto Rican ass, but he really just likes to please whoever he is with. But he is fairly passive, so bottoming works for him.\nIn his private sex life, he doesn't actually have a lot of opportunity to have sex, much less bottom, so he was a little worried that Austin might be too big for him. It showed how little experience he does have as he thought Austin was super hung. Not saying Austin, isn't very nicely endowed, but there are some jumbo cocks out there. Have I ever mentioned that Austin calls Vander \"Pringles\" since doing a scene with him...a nickname that has stuck!\nAnyway, Carmine handles his cock nicely and stays hard for most of it. Austin does start off a bit wobbly but I think once he realized that Carmine could take it, AND was enjoying it, it turned him on.\nUnlike the oral video, where it took Carmine a fair amount of time to nut, having him get fucked made him shoot a super big load easily. And with Carmine practically demanding to be bred, Austin fires-off a couple shots then dumps the rest inside of Carmine- making him one very happy Boy!",
  "models": [
    {
      "name": "Austin",
      "person_id": 3426
    },
    {
      "name": "Carmine",
      "person_id": 3483
    }
  ],
  "release_date": "2012-06-13",
  "scene_id": 1672,
  "tags": [
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Austin & Carmine - RAW"
}