{
  "collections": [
    "ChaosMen"
  ],
  "description": "Surprise!\nI just couldn't wait to bring you Delaney's Serviced video, what with St. Patty's day so close behind us. Hope you didn't over do it with green beer!\nThis is ONE SCORCHING HOT Serviced video! I can't tell if it is because Brooks is so into it, or because Delaney is so into it. They both just had amazing chemistry!\nI think Delaney took the lead, which is not very typical for a Serviced video. Telling Brooks what he likes and to play with his hole. The ass play really got him going. We even got a small toy in there.\nThere is a quick Out Take in the middle where he almost busts. It is funny to watch Brooks not really stop playing with Delaney's cock. He hasn't had anyone just suddenly nut on him, but I am sure he will, and after it happens to him, I bet he will drop that cock completely immediately! Some of these guys have got hair triggers!\nAs I said, we got a small amount of toy play. Delaney clearly is just born to perform, but having his back door played with was not act. It's as if he loved every minute of the whole video, especially busting in Brooks mouth and on his face. You can hear me quickly maneuvering to get cameras in position, because after the toy play, he was ready to nut!\nBrook's timing is awesome and with Delaney encouraging him to unload, he bust his nut with cum dripping all over his face.\nThis video has that extra \"something\" that makes it one to remember and to keep for always!",
  "models": [
    {
      "name": "Delaney",
      "person_id": 3492
    },
    {
      "name": "Brooks",
      "person_id": 3457
    }
  ],
  "release_date": "2012-03-22",
  "scene_id": 1678,
  "tags": [
    "Build - Lean",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Facial  Cum Eating",
    "Video - OutTake"
  ],
  "title": "Brooks & Delaney - Serviced"
}