{
  "collections": [
    "ChaosMen"
  ],
  "description": "Talk about a nervous first-timer!\nFor both of these guys, it was their fist-time doing oral on video, and the difference between the two guys is astonishing.\nCarson is very uptight, checking in with me, the cameras, the porn playing for him, and is uncertain pretty much the whole time.\nMeanwhile, Bishop is working like a finely tuned sex-machine! His stick shift is standing straight at attention, and in his intake valve is working overtime all over Carson's cock. Truly a natural performer, but I think he is just naturally good at having sex. (Ok, way too many \"machine\" references in that description- sorry! :-)\nA couple times Carson gets wobbly, but jerking on Bishop's cock seemed to help. Hmmmmmm... Carson enjoyed jerking him just enough, but not enough to actually put in his mouth. And seriously, who wouldn't want to put Bishops' dick in their mouth?!?! It's perfect in so many ways. Over-sized, bone hard, straight, and pre-moistened- ready to insert!\nI am SO glad that Bishop was here for this scene. He took control and just blithely charged ahead. Bishop loves to eat ass, so we have some awesome rimming, though I need to teach Bishop how to share/show what it is he is doing. I wasn't going to complain, because it kept Carson charged up. It's interesting to watch Carson go from all clinched-up to pushing his ass back into Bishop's face.\nFor those of you who love cum-eating, Carson drains his entire load right down Bishop's open mouth. Some might have dribbled down into his nose, but down the gullet it all went.\nThat was enough to trigger Bishop into cumming and I quickly had to move about and get a hand held shot of him busting. Sorry if it is a little shaky.\nSo I leave this video CERTAIN Bishop will be back. I think Carson can do better with some training. We just need to shake the nerves he gets.\nLike Delaney's videos, I \"fast-tracked\" aired these videos very close to filming so I could add some March Madness videos. So it may be awhile before either of these guys show up again, so be patient!",
  "models": [
    {
      "name": "Bishop",
      "person_id": 3493
    },
    {
      "name": "Carson Temple",
      "person_id": 3489
    }
  ],
  "release_date": "2012-03-29",
  "scene_id": 1681,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Bishop & Carson Temple - Serviced"
}