{
  "collections": [
    "ChaosMen"
  ],
  "description": "Both Booker and Jacek are amazing in this video! Both guys took to their Top and Bottom positions like pros. Even the cock sucking is pro level!\nEver since Booker realized that if we take a little extra time to ease him onto the cock, he can stay hard and actually nut. He kinda looks forward to the extra intense cum shots!\nAnd Jacek Topped like he was was born to fuck ass. We got alot of plunging in and out of Jacek's open hole for those who love seeing it spread wide. With Jacek's rather large cock, it was bound to be stretched to the max.\nFor a while there Booker didn't think he would be able to cum from being fucked. Jacek's cock IS really big and he just didn't think it would happen. I told him to not worry, that once we got him on his back, Jacek would hit his sweet spot, and sure enough, Jacek fucks the cum out of him. I know that Booker has bottomed a half dozen times before, but something about the way we approach it, he really enjoys it!\nI wanted to do Jacek's cumshot a little different, so we just kind of fade into him nutting into Booker's open hole while he lays upside down against the bed. Jacek fills him up and geeeez, we get some amazing cum play. YOU will shoot your own load during his cum shot!\nLeaving everyone with very satisfying cum shots all the way around!",
  "models": [
    {
      "name": "Booker",
      "person_id": 3482
    },
    {
      "name": "Jacek",
      "person_id": 3473
    }
  ],
  "release_date": "2012-07-20",
  "scene_id": 1683,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Booker & Jacek - RAW"
}