{
  "collections": [
    "ChaosMen"
  ],
  "description": "I definitely have to find verbal \"daddy\" types for Carmine. He's not really into having his own gay porn playing in the background. I worry 'cuz he relies on the other models to have chemistry with him, and some of the guys just are there for the money.\nThankfully, Foster was WAY into being verbal and fucking the heck out of Carmine! Foster really does love to Top and have his cock worshiped! He still won't bottom, and again, he just stays bone hard the entire shoot that I can't think of any reason for him not to, well, other than seeing his rugby ass being pillaged!\nSpeaking of pillaging, that is pretty much what Foster did to Carmine. Oh, Foster blows back, but Carmine kind of loses his wood. He is always rock hard when someone is dominating and taking control of the situation. He can take care of his own dick. Foster still enjoys sucking dick, or at least he looks like he means it.\nWe get some nice pile-driving-action and Carmine's little hole might not be the same. He thought Austin was hung, and Foster is almost soda can sized! Poor 'lil guy. ~eg~\nThere is some great Ass To Mouth action too. Foster repeatedly makes Carmine clean-off his cock after fucking him. ATM anyone?\nOnce again Foster was surprised he didn't shoot quite as far as he normally does. He quickly recovers though and juices Carmine, who loved having his daddy's cum inside of him. Carmine didn't think he could nut with Foster drilling him, so we had him take care of it while he sucked on Foster's cock.\nCarmine blows his load all over himself, then Foster scoops it up and makes his boy eat it!",
  "models": [
    {
      "name": "Foster",
      "person_id": 3438
    },
    {
      "name": "Carmine",
      "person_id": 3483
    }
  ],
  "release_date": "2012-07-23",
  "scene_id": 1684,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Carmine & Foster - RAW"
}