{
  "collections": [
    "ChaosMen"
  ],
  "description": "I myself find \"First Time\" videos to be dubious at best. I rarely go that marketing angle. It is a tough sell to an audience who has seen just about everything, plus my air dates are often long after I film them. They might have moved onto another studio and gotten a lot more adventurous by the time my video airs.\nBut for some models, it is very believable. Glenn really struggled through his oral video, and for his first sex film, he could only bring himself to play a little with Kristopher's cock. This time though, he had an epiphany, and said he was just going to try it all.\nEven Jet who had done some work before, still had to take some time to suck some dick. But he moved into the Fast Lane quick when he put his mind to it. That is what Glenn did too, though I doubt I will get him eating ass anytime soon, but Jet sure gave it a try.\nWe start-off with Glenn giving his first BJ to Jet. He does in fact look clumsy, but he is intent on trying to please him. Jet, always quick to fire-one-off, even had to pause during the blow job to avoid cumming. I was shocked because it didn't look like Glenn was going full-tilt on him. Then again, Jet is always about to nut!\nGlenn also tackled another first by taking Jet's cock. Not a peep of a complaint, and Jet did his best to take it easy on him. I had told Glenn to not just sit and \"take it\" but to stroke his cock, so he could turn the pain into pleasure, and I will be damned if his cock stayed hard while getting fucked. I am going to see if we can make him nut from being fucked in the future!\nI can't remember if this is Jet's first time Topping a guy, but I think his cock enjoys being fucked better. His dick always gets super hard, and he is always just about to nut when someone is up inside of him.\nFirst Jet rides Glenn's cock, and they have a little bit of awkwardness trying to move about (they both are smiling as they move around, I can't figure out what they thought was funny myself) Glenn gets at the perfect angle to hit Jet's sweet spot, and in he goes, and Jet takes off like..well...a jet!\nI was underneath, filming the undershot, and hadn't really adjusted the other cameras to get his cock on the other cameras, and sure enough he just goes a little too far and practically nuts on the camera. He did cum on me and you can hear it splatter on the carpet. I am SO glad I bought my own steam cleaner! So we might not have every angle, but it is fucking intense.\nIt's a great angle, but that wasn't the best cum shot in this shoot! Now I haven't seen this much before, I think Austin did it with Teo, but that was no where near as dramatic as Glenn's spasming cock.\nGlenn ramps up, spilling a little seed on Jet's back, then goes to shove his cock in to unload deep inside Jet. He misses the hole first try and a bit of cum oozes out, but then he gets his dick planted inside, and I have never EVER seen a guy's cock twitch and spasm so much! You can literally see it pumping his load into Jet!\nHe pulls out to do some cum play with his cock, and a big 'ole wad of DNA slides out. Fucking awesome.\nSo the lessons I learned from this shoot. Newbies can be Pros....and buy your own carpet steam cleaner if you are going to shoot porn! (and maybe wear a bib if you are in the Splash Zone!)",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2012-07-06",
  "scene_id": 1686,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Glenn & Jet - RAW"
}