{
  "collections": [
    "ChaosMen"
  ],
  "description": "Clearly both Chaz and Solomon have amazing bodies, so I thought I would do a little body worship on the massage table with them. Chaz is definitely more experienced and easily took the lead by giving a very sensual massage to Solomon... right down to his prostate!\nSolomon is looking extra furry, and one of my favorite moments is when Chaz climbs up on top of Solomon and they joust with their dicks. Two hot bodies with cocks rubbing! I love seeing Chaz's cock wake-up just from rubbing his uncut dick against Solomon's.\nWe knew Solomon was going to be bottoming, and we have learned that if we keep a butt plug in Solomon, he can stay stretched out and take a pretty good pounding. He pretty much does most of his bottoming scenes all \"plugged-up\" between 'takes'.\nOnce plugged, Chaz gets a very good blow job from Solomon. Solomon couldn't quite contain his need to give/receive pain, and put some crazy scratches all up and down Chaz's body. Chaz didn't yell, \"Pineapple\" so I guess he was into it!\nIt did put Chaz in the mind for revenge, and I think after the scratching incident he was not going to show Solomon any mercy when it came to fucking him. The dude has got some skills!\nSolomon loves/hates the pain of being fucked. He seems to like to be rough and then be roughed up, going back-and-forth from submissive to dominant in a matter of seconds.\nChaz gives Solomon's hole a major workout then he dumps his load inside, fingering all the jizz to soften the blow.\nOnce again, we are faced with Solomon's extreme body tensing cumshot. Every muscle is locked in its maxed-out state. I don't know how he nuts with girls? But it works for him.\nAnyway, a very hot pairing with two beautiful dudes!",
  "models": [
    {
      "name": "Chaz Riley",
      "person_id": 3485
    },
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2012-06-29",
  "scene_id": 1688,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Sex Act - Massage Table"
  ],
  "title": "Chaz Riley & Solomon Aspen - RAW"
}