{
  "collections": [
    "ChaosMen"
  ],
  "description": "Olaf has got giant blue eyes, and you can tell not only by his stage name, but his looks are definitely Norwegian or Scandinavian decent. He spends a lot of time in the gym working out, and I think was ready to show-off his body.\nWhich is not his normal attitude.\nHe is a very quiet and shy type of guy. Not good in big crowds and just likes to stay home with his wife. But when approached to do a solo, it intrigued him enough to want to know more. His wife is a stripper, and he is keen on him taking on the...uh sexually-oriented work rather than her.\nHe surprised me because he was so shy and but enjoyed showing off, but mostly I was surprised because he said he came pretty quickly. But that we should be ok, because he jerked-off a couple hours before arriving.\nBasically he is a cum machine!\nOlaf had to catch himself a couple times while we did photos. He has got a hair trigger on that piece of meat!\nAnd sure enough, he nuts right in the middle of the solo. He told me could nut again if he accidentally shot too soon, and I kinda said, \"OK, but they usually aren't as good, so make sure you give me some warning!\" Olaf said no problem that he would just need 3-4 minutes to reset.\nWe also discovered he got hard faster standing, a clear sign that he grew-up jerking-off in the shower.\nSo we start him getting hard that way, and he was doing great. I went down on the ground to get some undershot footage, and he plays to the camera a bit. He lost some of his wood, so you can see him look for a bit at the porn to get himself back to full mass.\nAnd that little bit of extra effort made him nut! I just tell him to go for it, pretty sure I had my cameras aimed appropriately. You can hear the cum hitting the carpet, and me. This seems to be a trend in videos these days, and in that particular spot of that room!\nI told him before the shoot that if he just nuts to just show-off his ass so he could have some time to reset. I was totally loving his blond-haired hole!\nEventually he gets to laying down, and I move in close to do a POV shot of his dick...and he starts to cum again! That makes three cum shots in a couple hours! 2 within 5 minutes of each other!\nI did have to scramble to get the shot covered, but both cum shots looked great!\nOlaf was a little disoriented after the second nut, and I think he was worried he might have to nut a fourth time, but I let him off the hook, knowing full-well the two cum shots will make viewers happy.\nIf I get him to do an oral video, I think I will need someone with a light touch who can really \"listen\" to his cock. Hmmmm...might have to do it myself!",
  "models": [
    {
      "name": "Olaf",
      "person_id": 3494
    }
  ],
  "release_date": "2012-06-04",
  "scene_id": 1690,
  "tags": [
    "Theme - Solo",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Video - HD - High Def"
  ],
  "title": "Olaf - Solo"
}