{
  "collections": [
    "ChaosMen"
  ],
  "description": "As I mentioned at the end of the summary of Olaf's solo, I was keen on doing the Serviced video. Not just because he is a cute blond, hot bodied, and a backdoor that begs to be rimmed, but also because his dick has got a hair-trigger fire on it.\nNow normally, I would think it would be great having one of the less experienced \"servicers\" doing it. It would be easy on them to make him nut. But I was more worried they wouldn't pay attention and ease up quick enough and he would unload after 2-3 minutes. Hey, it has happened to me a couple times and I now 'listen' to not only their breathing, but to their cock.\nRansom could have done a great job on this video, he has is down to a science too. But the two of them work out together, and they both thought it might make it awkward. Ransom did do a little camera work, so there is some funny zoom action as he tries to work the cameras.\nAs for Olaf, he said he had never cum from a blow job, which confused me because he was nutting so quickly and easily during his solo. You'd think that he would be the ultimate \"quickie\" blow-job. He also never had his ass rimmed before. So I think we got some genuine 'first time' moments for him.\nOnly once did I get him close too soon and he let me know si we didn't have a misfire. I also love it when the guys flip-over doggy-style and their dick, while not soft, begins to grow super hard from the ass licking. Not sure what clicks in these guy's brains, but a switch has been thrown!\nGetting him to nut was pretty easy, and I used my mouth and a double-handed twisty action to make him get over the top. I don't know why I situated myself at the edge of the bed, but I was precariously balanced this entire shoot, and I was straining and shaking by the end. It's one of those \"Continually Shot\" vids so no break, and I kind of had to hold that position the entire time.\nOlaf is as sweet as can be, and his cum is just as sweet. I think we got him thinking he can do more than oral, so we shall see if he comes back for even more!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Olaf",
      "person_id": 3494
    }
  ],
  "release_date": "2012-07-04",
  "scene_id": 1691,
  "tags": [
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Bryan & Olaf - Serviced"
}