{
  "collections": [
    "ChaosMen"
  ],
  "description": "My main goal with Carter is to push his limits on what he can sit on - we can consider them pushed in this video! But also since his cock is not ginormous, he can take \"first-timers\" through their paces.\nI always dread saying a sexual activity is someone's first time, but it happens. Jacek had been putting-off getting fucked for several videos, despite how much girth he has on his own cock. I promised him I would find a guy that wouldn't split him in two. And after all, if other guys can take his giant uncut Polish cock, then surely he can uh...turn the other cheek.\nCarter did get nervous when he started seeing Jacek's cock grow in his mouth. Realizing that he was going to be sitting on it soon. But first, we needed to pop Jacek's cherry!\nI will be damned if he handled the cock just fine. We started him in doggy-style, and his cock seemed to stay hard, whereas most guys tend to wilt.\nThen it was Carter J's turn to sit on Jacek's tool, and he just kind of sighs and slowly goes down on it. The dude can handle it. All those tatts, surely a little pain is nothing for him. Once again I was surprised that as I panned around from the back to the front view, Carter's cock was standing at attention! Jacek was even playing with it!\nI do try to get the guys to cum from being fucked, and I usually have pretty good luck when they are on their back. We got Jacek on his back, and his dick doesn't even wilt. I thought for sure he would be able to bust and experience the extra of intensity of cumming while being cock prodded.\nBut it turns out Carter was ready to bust first, and he lets lose a nice hefty load.\nThen it was Jacek's turn to cum, and come to find out, he isn't very good cumming on his back. So we just dissolve into his trying to juice Carter's hole, but only a drop or two of jizz comes out. I asked him when the last time he came was, and he said the night before. Really? I'm surprised.\nDespite Jacek's less than stellar cumshot, we did get him fucked finally, and Carter continues to 'expand' his bottoming skills!",
  "models": [
    {
      "name": "Jacek",
      "person_id": 3473
    },
    {
      "name": "Carter Jacobs",
      "person_id": 3476
    }
  ],
  "release_date": "2012-12-27",
  "scene_id": 1693,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Carter Jacobs & Jacek - RAW"
}