{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bentley's cock rivals Vander's in girth and size, so I knew I had to find someone who would enjoy a big 'ole dick up his butt. Darius was of course my first choice. He is always good with first timers and ever eager to have his ass stuffed.\nBentley races dirt bikes, and took a spill 3 weeks before the shoot. So he has some obvious battle wounds, including a busted collar bone. I always get deflated when the model shows up at the airport with their arm in a sling, but he assured me would be fine- just needed to keep the motion to a minimum and that he was jerking-off fine.\nSo we kind of kept him stationary for the first part of the video. He didn't think he could suck cock this time out, mostly due to the injury, but likely he just wasn't ready. He did manage to jerk Darius off and keep him hard when he was having his dick sucked. Or maybe Darius just enjoyed having a ginormous cock in his mouth. Dang it gets big!\nDarius finally rides that big boy, and every time Bentley gets a little wobbly, Darius would hop off and suck it until it was hard again. Ass to Mouth fans will love it!\nIf I remember correctly, Bentley spent his teenage years jerking-off in the shower, so standing is his best position for getting and staying hard, which is perfect for porn.\nSo once we got him upright and fucking Darius doggy-style on his back, his dick didn't need an occasional oral pep talk. Darius was in bottom Heaven of course!\nBentley fucks the cum out of Darius and then does an awesome job ramping up to unload, squirts once, then unloads deep inside Darius. Great breeding action for his first time! We even get a little cum play as Darius tries to push out Bentley's load!",
  "models": [
    {
      "name": "Bentley",
      "person_id": 3486
    },
    {
      "name": "Darius",
      "person_id": 3435
    }
  ],
  "release_date": "2012-08-03",
  "scene_id": 1694,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Bentley & Darius - RAW"
}