{
  "collections": [
    "ChaosMen"
  ],
  "description": "I certainly wanted to put these two muscle dudes together!\nBoth guys are versatile, so I knew I would have some flip-flop action. Solomon's dick was in working order (no accidental bending/bruising) and he Tops Booker like a pro.\nEven Booker, who does prefer to bottom, was on Top of his Game! Both of them have a little bisexual attitude growing in them, and I think the mutual muscle admiration was keeping them charged up rather than the pussy flick playing for them.\nSolomon still looks like he's in pain through most of it, but like I keep saying, that is a GOOD thing for him! Whereas Booker likes a gentle approach that makes him nut.\nThe only snafu we ran into was we discovered Booker can't cum while standing. We were all setup for him to Juice Solomon, and we tried and tried and tried, but alas, Booker needed the cum fucked out of him! So we did a quick change about and sure enough he was busting BIG TIME. Booker even shot himself in the face.\nI think we also got Solomon better at ramping-up, and he added his own load to the one already on Booker's face. Nice facial action and Booker even kept his mouth open for it.\nLots of progress for these \"amateur\" guys and I think everyone will be genuinely happy with their performance!",
  "models": [
    {
      "name": "Booker",
      "person_id": 3482
    },
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2012-08-17",
  "scene_id": 1695,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Booker & Solomon Aspen - RAW"
}