{
  "collections": [
    "ChaosMen"
  ],
  "description": "Hayden has been doing a fine job at working the massage table. Tatum certainly was a prime candidate. This is actually a video that I made that I can jerk-off too. Mainly because I just let Hayden do his thing, and Tatum was just told to let Hayden suck him off. No direction!\nSo all the intimate touching that Tatum does is real and he was pretty set on not doing anything but get head. He seems turned on from the ass massage, and his dick is up and ready to go easily. There is a little bit of Fleshjack play (There would be more if I was directing it!) but Hayden didn't seem to like using it, perhaps preferring to use his own mouth instead. Just another indicator I let them do what they wanted.\nHayden also really focused on Tatum's pleasure, to the point where he wasn't really getting hard himself. Finally Tatum reaches out and strokes him as he sucks, and he starts to wake-up.\nThe ending is really cool too. I don't know how Hayden keeps timing these cum shots, but he jerks and mouths Tatum's spurting cock and unloads himself. To be honest, I had no idea Hayden was even hard, let alone close! He was jerking Tatum so furiously! Had I known, I would have had all the cams aimed better.\nAs it is, Tatum is nutting, and I realize out of the corner of my eye that Hayden is shooting right along with Tatum. I quickly slide the close-up shot to catch his nut shot too. It's a little jerky, but you get the idea!\nI think he did the same thing with Carmine (but twice), so maybe the taste of cum in his mouth puts him over the top easily!\nAs for Tatum, he loved the experience! I think he wants to come back and do more and seems open to trying just about anything! Sweet!",
  "models": [
    {
      "name": "Tatum Parks",
      "person_id": 3496
    },
    {
      "name": "Hayden",
      "person_id": 3330
    }
  ],
  "release_date": "2012-07-11",
  "scene_id": 1699,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table"
  ],
  "title": "Hayden & Tatum Parks - Serviced"
}