{
  "collections": [
    "ChaosMen"
  ],
  "description": "I feel like I keep patting myself on the back with pairings lately. When Glenn walked in the door, I immediately wanted to put him with Teo. Teo has a ton of energy, while Glenn is a quiet type, but for some reason I thought they would fit nicely.\nThen after Glenn started bottoming, I knew I could get a nice flip-flop scene out him and Teo. Usually opting to bottom because he is not confident he can stay hard, the last couple scenes Teo has been a walking boner.\nI keep stepping up the cock-size on Glenn too. I think eventually he will be able to handle Vander. It still surprises me he stays hard while being fucked and has trouble NOT cumming while being fucked. Especially given how reticent he was initially to do more than just receive head.\nClearly Glenn is down for just about anything now. He sucks cock greedily and I am pretty sure Teo had to have him slow down because he was about to cum when they were 69ing. When Glenn worked with Jet, well, Jet is always about to cum, but Teo has foreskin and Glenn just doesn't have hours of cock sucking practice. But he sure keeps the guys edging with his mouth!\nI love Glenn's ass, and to see him slide right down on Teo's hard cock just makes me happy. He has come so far! And then he slides right off and fucks Teo all \"push-up style\" He has low hangers and they kept getting in the way, so eventually he is fucking a bit off to the side. Glenn, sounding like his balls have always been a nuisance, suggested I just duct tape them up. Nawww...I would rather see them slapping against a guy's ass!\nNot sure if Glenn has been Juiced before, but I know it has been a while for Teo to do the honors. Glenn takes it like a man, while Teo jams his spent cock in his hole.\nAfter all this time, Teo is now fine with cum on his face and mouth, and suggested a facial. Glenn delivers a pretty massive load, coating his face. Teo show boats and sucks the cum from Glenn's country boy dick!",
  "models": [
    {
      "name": "Teo",
      "person_id": 3261
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2012-11-22",
  "scene_id": 1701,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Glenn & Teo - RAW"
}