{
  "collections": [
    "ChaosMen"
  ],
  "description": "Add one dominant Top, to one eager twink with a Daddy fixation, and you get an amazing video with two guys having hot steamy, all-over-the-place sex!\nLet's see, I knocked over tripods, which tore up a wall, Carmine and Vander both conked their heads on the overhead mics, tables tipped, lube everywhere - Basically these two went at it like wild animals, and I chased them around the room the best I could.\nMuch like Vander did with Allen, the two guys are truly into each other. No halfheartedness is this video! Carmine did his best to take Vander's giant cock. He can suck a bottle cap of a beer bottle, but bottoming for big dicks is really not something he is used to...but I keep tossing bigger ones at him. Poor 'lil guy!\nFor the initial insert, they tried some doggy-style in the chair, then they tried Carmine sitting on it facing Vander- neither didn't quite work. Amazingly, reverse cowboy worked and you can tell Carmine's cock really liked that position!\nClearly they both love to suck on each other's dicks, and any time someone wilted, a little ass-to-mouth action happened. I love the shot of Vander laying on the floor playing with his giant cock while sucking Carmine's cock and eating out his hole! Very hot!\nVander gets Carmine down on the ground doggy-style and fucks the heck out of him. Some crazy fucking action as Vander works up a sweat fucking Carmine till he wilts and needs to recharge. It is like a Work Out!\nEventually he gets Carmine up on the bed and fucks him properly. They take a break and Carmine sucks on Vander's ass-soaked cock while Vander talks dirty in Carmine's ear.\nDirty talking seems to be the only way to get Carmine off, and Vander says just the right thing, so Carmine flings himself back for Vander to fuck him, but he pretty much starts cumming. Vander gets it in and fucks him as he is shooting.\nVander then ramps up, squirts once on his hole, then pumps the rest deep inside Carmine, for all you Internal cum shot fans! He plays with Carmine's hole, and a little jizz spurts out.\nVander climbs on top of Carmine, who like a good, boy, cleans his Daddy's cock!",
  "models": [
    {
      "name": "Carmine",
      "person_id": 3483
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2012-09-19",
  "scene_id": 1702,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Carmine & Vander - RAW"
}