{
  "collections": [
    "ChaosMen"
  ],
  "description": "If you have been following this site for a while then you know I find sexy in all kinds of guys. Not too many bald guys on the site, but Tatum oozes sexiness. I asked him to grow his hair out, and boy did he! He is a Beast!\nHis body hair comes and goes. I have seen photos of him with and without. He constantly battles his arm and back hair, but I had him promise to at least leave some of the chest hair, and of course the pubes stay. Hair or not, the guy has that certain 'something'.\nTatum is way into fitness and diet, and he has the muscles to show for it. He actually said he has been slacking-off, and I showed him a picture of a model he may one day work with, and he looked like he was planning a new workout routine right then and there to get extra-ripped. I don't know if there is some Bi in him, but he sure got motivated. And as he is now, WOW, I love his body, his face, and that dick!\nHe admits to being passive in bed, likes when the girls boss him around. He has messed around with one guy \"once or twice\" but it didn't sound too involved. So I know he is very open-minded, and doing an oral video is a for sure thing. I can think of a few dudes that would love to boss him around too!\nI know I pretty much ask the same questions, and many viewers kind of skip over the interview, but I enjoyed his interview as much as the solo. He has such a sweet demeanor, and then pow, he gets all sexual for us!\nHis cum shot is a workout, so he works up a total sweat. I love how he slows it down right at the last second, and then a huge glop of jizz flies out!\nStay-tuned next week for an amazing massage video, and from what I can tell, I think he wants to do more than oral in the future!",
  "models": [
    {
      "name": "Tatum Parks",
      "person_id": 3496
    }
  ],
  "release_date": "2012-07-02",
  "scene_id": 1703,
  "tags": [
    "Theme - Solo",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Tatum Parks - Solo"
}