{
  "collections": [
    "ChaosMen"
  ],
  "description": "I think it was time for Troy to work with a Pro, and Chaz was just the guy for him. Troy has got that whole bi thing going for him, and truly likes to bottom. The two were set to flip-flop, but Troy was enjoying getting fucked so much that he didn't want to break the rhythm of the shoot...in other words, \"Don't stop fucking me!\" :-)\nI agreed with him. Chaz went at him like an animal, and I know he has done straight porn and has sex with women but I haven't seen it. He must fuck the heck out of them! He has got style and sure knows how to showcase for the camera.\nI like how every time his dick gets wobbly he just makes Troy suck it until it is hard. So Ass to Mouth lovers will enjoy that! I know Chaz has done a lot of video work, but I never have seen but one (I think he was a Pizza boy?) It surprises me how hard his cock gets being sucked, but also how hard he gets just sucking cock. I think it is something that he really likes, on or off the set.\nAnd Troy, well, he IS a bottom. No way around it. His dick is happiest when there is cock down there.\nI got a great undershot of Troy as he is cumming while Chaz is ramming his cock into him. It is a hard shot to do with multiple cameras, but I got everything aimed juuust about right. You will feel like Troy is cumming on you, and actually I think every last drop landed on my arm. I know I should have showed that, but it was body-temperature warm that I didn't realize just how much he jizzed all over me until it cooled down.\nChaz's cumshot is a little off to the side, but starts raking in his load with his cock, juicing Troy really nicely.\nTwo VERY hot guys going at it with all their energy, complete with some scissor fucking...like I said, it is nice having a pro who knows how to fuck in some non-standard positions!",
  "models": [
    {
      "name": "Troy",
      "person_id": 3479
    },
    {
      "name": "Chaz Riley",
      "person_id": 3485
    }
  ],
  "release_date": "2012-08-10",
  "scene_id": 1704,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Chaz Riley & Troy - RAW"
}