{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have worked with Brooks for many months now. He has been doing an awesome job servicing the models. When he first got started, his boyfriend at the time said he could do porn, but stick to oral.\nWell, that boyfriend is gone, and Brooks was ready to hop on a cock! He had indicated he really enjoyed bottoming, but after talking to him some more, it turns out he has only had a couple boyfriends and really has only bottomed for them. I guess with his crazy good oral skills I was expecting an eager bottom.\nOh he is eager enough, but once again, I kind of misjudged how much of Foster's cock someone can take.\nThey both go at the oral with gusto, and it still astounds me how happy Foster looks sucking dick, yet can't get him to kiss a dude. ~sigh~\nBrooks was happy to suck on a big 'ole dick, but for taking it the bum, we went with him easy down on it. He yelled \"Pinepple\" more than a couple times, but he barely wilts as that cock splits his lean build in two. He even deftly handles a \"reverse cowboy\" position, and I get some great angles of that. His cock is literally dripping cum in this position.\nDoggy style was the hardest for Brooks, as Foster could go deep and he couldn't move away.\nBut on his back he was solid, and Foster just toys with him with is cock. You can see Brooks stop and hold his cock up and away, trying to avoid cumming.\nFinally Foster ramps up and Brooks has an intense orgasm as Foster fucks the cum out of him.\nFoster is back to his laser beam cumshots, but this time he only fires off one shot and firmly plants the rest of his load inside Brooks, who is reeling from the sudden impact! (Hand pushing him back!)\nBut Foster keeps it there, cock throbbing as he dumps his load. He pulls out a little bit and Brooks takes his finger to play with his cummy load (or to check for damage!)\nNot a pairing I would have made for visual impact, but the two have undeniable sexual energy for each other!",
  "models": [
    {
      "name": "Foster",
      "person_id": 3438
    },
    {
      "name": "Brooks",
      "person_id": 3457
    }
  ],
  "release_date": "2012-09-07",
  "scene_id": 1705,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Brooks & Foster - RAW"
}