{
  "collections": [
    "ChaosMen"
  ],
  "description": "Stone is BACK!\nHe has been working out really hard, got some sun on his Pacific Northwest skin, and ~sniff~ shaved-off the chest hair. I know, fans of hirsute men will shed a tear, but for me, it is like getting a new model! He looks SO different! And he looks awesome!\nBoth Stone and Jet have been working out like fiends. With the economy so bad, models are realizing they need to be on top of their game. Lots of guys turning to porn to help stay afloat, so competition to stay working is high.\nI think Stone revamping himself was half porn-motivated, but also, I think he just got in a good routine and has been focusing on himself.\nI was super eager to put these two together. Their personalities are a great match, and there was an immediate \"Bromance\" going on between them. I think after the shoot they headed out to pick-up girls together, but as Stone always says, \"Let's not make it weird.\" I guess by telling potential girls why they were in town. Or maybe share a girl? Regardless, I need to catch Stone saying \"Don't make it weird.\" on camera once. It's has become his catch-phrase.\nSpeaking of weird. We got him to eat some ass. Ok, so he is not piggy-diving-in, but that and some finger play really got Jet in the zone to be fucked.\nI think because they clicked on and off set, Stone was more willing to try things, and his dick has never been more solid. He just had an easy time, and maaaaybe he liked working with Jet. And Jet, as usual, doesn't seem to get fully aroused until he is getting fucked. It's official! He is a bottom!\nHe does a great job riding Stone's cock cowboy and reverse-cowboy and his quad workouts really show. That is a dang hard position to maintain- precariously balanced on a bed, trying to keep a cock in your ass. Jet just..um..soars at this stuff!\nI never have stress about them cumming either. Jet is always eager to nut with something in his ass, and with Stone rock hard, he came pretty quick.\nStone also amps up his \"delivery\" by doing the one squirt out, and internal dump the rest. All the while his cock is throbbing during the unload.\nThis is one hot video with two Elite performers!",
  "models": [
    {
      "name": "Stone",
      "person_id": 3398
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2012-10-05",
  "scene_id": 1711,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Jet & Stone - RAW"
}