{
  "collections": [
    "ChaosMen"
  ],
  "description": "Thought I would start Gavin Sevin off doing something a bit different.\nI wanted to put him with Ransom because I wanted his first interactive video to be fun and easy, and the two of them clicked easily together. Both were turned on by each other's bodies, and relaxed enough to let the pee fly, one after the other.\nGavin said that his dick usually goes down during the oral, so warned me we might have to stop and recharge with some video. I told him I had Ransom trained up pretty good, and with the partition there, he might find it easy.\nLet's just say we didn't have to stop once! Ransom kept him going, and he impressed with his oral skills.\nI watched Gavin trying to suck on Ransom's cock, and he looked a bit amateur at it. I know he has done work before, so I think I am going to give him a cock sucking 301 class. He isn't in a newbie, and he does step up his game as the cock sucking goes on, but I think there are few tricks we can teach him, to not just make the guys stay hard, but to make them nut.\nRansom does some awesome ass eating, and Gavin stays hard, and in fact really enjoyed it. I got some fun undershot action.\nGavin knew he was going to need to take control of his dick, and he give Ransom an amazing facial. I know Ransom well enough that I knew once Gavin blew his load, he was not going to be far behind. Sure enough, I pan down just after Gavin cums, and Ransom lets his own load go.\nA bit of cum/cock sucking to finish it off.\nI think Gavin found the shoot very easy, and signed up to do more films right after the shoot. Very pleased to have this hot guy working for Team Chaos!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    }
  ],
  "release_date": "2012-07-25",
  "scene_id": 1712,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - G:hOle",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Piss"
  ],
  "title": "Gavin Sevin & Ransom - G:hOle Oral"
}