{
  "collections": [
    "ChaosMen"
  ],
  "description": "I don't know who was more eager about doing this shoot, me or Delaney?\nHe is sex-on-a-red stick and was so into the Edge video, I knew he would be back as soon as he could. He wanted to come back and try to do a lot more. Delaney is debating his sexuality, but I think he is just omni-sexual. He seem to like everything. But this is giving him a chance to explore \"dudes.\"\nGlenn is coming along too, and I think I am playing this video out of sequence for him. His bottoming has really come a long ways from his last-aired video with Jet.\nBefore the shoot, the two were talking about ass fucking. Delaney was confused that Glenn didn't actually find pleasure from the ass play. Glenn was emphatic that he just basically \"takes it\" and just works through it. I think that's when Delaney decided he might at least be Bisexual, because he was looking forward to having a dick inside him again.\nI thought he was enthusiastic working with Ransom, but once Glenn's cock was hard, Delaney attacked it like he was starving for it. He does all kinds of sucking methods to not only please Glenn, but to just take-in the smell, taste, and sight of the fat cock in front of him. He is no longer 'on set', but in his own little world. You can tell he has checked-out and is in cock-sucking Nirvana.\nGlenn's gives some false delivery/acting, but at one point Delaney is really using all his sucking skills, and Glenn does have to make him stop for fear of cumming. That was real. Glenn is one of models who is usually on the verge of nutting the entire video. Well, as Glenn said, except for when he is getting fucked.\nI know I am jumping ahead, and I should leave the cameras on, but Glenn had an epiphany on that point. After Delaney was fucking him, between takes, he totally admitted he could cum that way. It was the first time it was feeling really good. Delaney, a bit embarrassed, self-deprecated, and said it was because his dick was small. Glenn said it was perfect and he really wanted to try cumming that way and asked if we could end that way.\nI had a different ending in mind, and I figured we could tackle Glenn cumming from being fucked at a later date, but today I wanted to see Delaney's dick squirt from Glenn's rather thick dick inside of him, then cum oozing out his little hole.\nOk, so back to the oral. Glenn returns the favor, and Delaney looks pretty happy having a hot guy suck him off. He does wilt a bit at the end as Glenn is still learning his oral skills, so they go to a 69-position. Glenn's dick needed just a bit of Delaney's sucking action to wake-back-up.\nDelaney's cock was staying soft, so I motioned for Glenn to insert a finger. Sure enough, Delaney started moaning and his dick got hard again. Phew!\nAnd then they move to a position where Glenn lays on his back and Delaney can try sitting/squatting down on his dick, controlling the insert.\nCut!\nWe tried like eight times!\nI even had Delaney on the floor on his back and I was pushing toys in his hole and he seriously has the teeniest butt hole I have ever seen!\nAfter getting a toy back up there, and two more failed attempts of Delaney trying to sit on Glenn's cock, we just went back to the 69 oral position, and this time Glenn does the insert with Delaney on his back. Ahhhh..the magic of editing.\nEven still, you can see Glenn is having to go nice and slow as he works his cock in. Delaney was surprised he was having so much trouble taking it. He really wanted it!\nClearly this isn't Delaney's first time with a dick in his ass. But Ransom is a bit smaller, and actually pretty good at finding the hole, and inserting smoothly. He did all the work in the Edge video. Glenn is still a newbie and his cock is a step or two up in girth. Glenn really takes it easy on him, and you can see how much Delaney is focusing to open up for him.\nHe finally was able speed up a bit, just enough so he can keep the pleasure going for himself to stay hard. And then, ta-da! Delaney's dick stands up again! Is he gonna be a bottom?\nGlenn was ready to flip-flop and they exchange positions, and I deliberately put Glenn on his back, trying to see if he might find that position pleasurable. He did, and like I mentioned, he wanted to cum right then and there to see what it was going to feel like.\nWe also pre-insert a butt plug inside of Delaney, just to make sure his hole stayed open, but also, I thought it would keep him hard to top. Worked pretty good too!\nI know other sites have the guys doing all kinds of acrobatic sex positions, but honestly, I am trying to get newbies to really like fucking and getting fucked, so we stick to the Tried and True positions, and ones where I can get the best view of the cum shots.\nI rarely do this, but after 30 minutes of trying to get even the smallest butt plug in Delaney, and he was so happy on his back getting plowed by Glenn, that we just went back to that position for the end.\nAnd it is official, Delaney IS a bottom!\nHis dick perks right up and his cum shot is massive as Glenn tries really hard to rub his hard cock on his prostate. It worked! Crazy amounts of cum fountain out of Delaney's cock!\nI thought for sure Delaney would go into a post-cum-coma, but Glenn ramped up and Delaney was alert and egging him to shoot inside him. Almost in wonder, he kept saying how warm it felt. I think he he liked it...a lot!\nAnyway, a lot of you have been emailing me saying you really liked Delaney and hoped he was coming back for more. Well he is.\nI only have one summer to work with him, before school and sports fill-up his schedule. I am gonna try to cram in 4-5 films this Summer. I fast tracked this video, and I will try get his vids out to you as fast as we can make them. ..the boy with the glowing red pubes.\nAnd Glenn is really coming into his own too, so there will be more of the boy with glowing blue eyes!",
  "models": [
    {
      "name": "Delaney",
      "person_id": 3492
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2012-07-27",
  "scene_id": 1714,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Red",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Delaney & Glenn - RAW"
}