{
  "collections": [
    "ChaosMen"
  ],
  "description": "I am gonna admit something. I am trying to do another G:hOle (Glory Hole) DVD, and realized that a lot of the ones I had done were already on other DVD compilations.\nSo I have been focusing on getting guys in there, so it may seem like the bathroom has been used a lot lately. I only need about 3-4 more films to complete it.\nI thought Booker and Glenn might look out of place at the location, but it turns out they were excited to be somewhere else, and doing something different. Not really a lot of acting going on, but it is a lot more than a bedroom scene. They had a lot of fun, and I think they are both keen on pushing their limits even more.\nBooker can't decide if he is Bi or just a voracious exhibitionist. We both agree it is likely he loves showing-off as he really focuses on the straight porn to get-off, and doesn't ever jerk-off thinking of guys.\nGlenn isn't much of a show-off. He tended to smile incredulously through his first couple videos, but now he seems to really get in the moment. I also think he responds better with guys with muscular builds, so I am not sure what it all means, but he definitely is enjoying the shoots a lot more.\nDid some fancy editing on this to make the video more interesting as you get to see both players in action at the same time.\nBoth guys have really honed their oral skills, and truly enjoyed sucking cock through the hole. As I said, it seemed and felt natural for them to do this video in a public space, so I don't know what that says about their extra curricular activities or fantasies.\nBooker eventually rides Glenn's cock while he is on the toilet. It is a tough position to work, but he does an admirable job. They finally move to the floor and we get some great penetration shots.\nBooker likes to cum on this back while being fucked, and Glenn fucks the cum out of him.\nGlenn busts his load, the first shot flying way over the mark, right into Booker's eye! Why does that always happen! LOL! Poor guy had red, achy eye for about 4 hours. It was a massive load!\nGlenn recovers quickly and keeps pushing Booker down, so he can juice his ass.\nThis is a very fun video, with two guys who really enjoyed working the G:hOle!!\nEnjoy!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Booker",
      "person_id": 3482
    }
  ],
  "release_date": "2012-09-26",
  "scene_id": 1718,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Booker & Glenn - G:hOle RAW"
}