{
  "collections": [
    "ChaosMen"
  ],
  "description": "Director's Cut with all the action!\nWe have been following closely Vander and Taylor as they put their dirty minds to best use- making steaming hot raw sex! But not with each other.\nThey start off kissing, then Vander eagerly sucks Taylor's cock. Then it was Taylor's turn and he is COMPLETELY fascinated with how huge Vander's dick is. I wouldn't say he was obsessed with it, but he certainly had a little envy (this coming from a guy with a really big tool) But mostly, I believe, he really wanted to not only suck it, but deep throat it. He loved Vander's cock!\nTaylor fucks Vander for a while then pulls out and gets very naughty all over Vander's hard cock. Vander uses the liquid to jack his ever-hardening cock.\nTaylor keeps shoving his cock in, pulling out and of Vander's hole. It's not for everyone, but I think even the most prim and proper gay guy will get off to this lite fetish play and dominance.\nIt was finally Vander's turn to nut, and I left in that he was struggling to get over the top. Taylor, ever so helpful, decides that all Vander needed was to some piss, and sure enough, that made Vander blow his load.\nTaylor then breeds Vander, fucks him with his cum, then cleans off all the DNA he left behind.\nI think a re-match might be in the future, but nothing has been planned other than they both agree reversing rolls would be super hot!\nI agree!",
  "models": [
    {
      "name": "Taylor",
      "person_id": 3343
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2010-12-31",
  "scene_id": 1721,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Sex Act - Piss",
    "Theme - Director's Cut",
    "X-Tras - Piercings"
  ],
  "title": "Taylor & Vander - RAW DC"
}