{
  "collections": [
    "ChaosMen"
  ],
  "description": "Director's Cut with all the action!\nIsaiah is back after some shoulder surgery. Yep, it no longer just falls out of it's socket at any given moment! Probably not an appetizing way to announce a porn video release, but his last video, the trooper performed basically one armed and banged-up after crashing his mountain bike...on the road. Yes, his friends tease him about it too.\nSo he is back in the gym and running a bit. I thought a nice locker room/bathroom scene might be appropriate, forgetting that it is a dang hard to have sex on a floor, or toilet.\nBut he and Tyler pull it off. As usual, Isaiah is pleased as punch to have his cock sucked, and Tyler really tackles his dick with gusto. Is it it me or has Isaiah's cock got bigger? I told Tyler before the shoot that Isaiah's unit wasn't going to be a challenge, but it just kept getting bigger. Tyler is about as lean as they get, so seeing that cock in scale to his body, you'd think it would split him in two.\nBut Tyler takes his cock with ease. I find Tyler's 'tramp stamp' confusing as he pretty much says he is a Top, but that tattoo screams otherwise. Regardless of the mixed-message, it is loud and clear that Tyler does in fact like to bottom, and really worked some difficult positions AND allowed me to get some great insert shots.\nSome very cool angles in this video, which has given me some ideas for furthering this theme. Isaiah gets his ass rimmed for the first time, to which I think he giggle his way through.\nAfter working the toilet front and back, they move to the floor for some doggy-style action. This allows Isaiah to really get some thrust, and as per his always excellent performance, fucks Tyler till he cums. Unloading all over and juicing him a bit.\nWe switch gears and Tyler, falling back on his Top attitude, just wanted to look at Isaiah's ass in order to nut. I also want to slowly get Isaiah used to cum on him and pushing his ass in the air and having some attention paid to it. I don't know if it will lead to him bottoming, but maybe these baby steps will lead somewhere.\nMaybe I shouldn't push it. The dude IS an amazing Top!\nA very hot video and excellent addition the G:hOle serires!",
  "models": [
    {
      "name": "Isaiah",
      "person_id": 3397
    },
    {
      "name": "Tyler Shields",
      "person_id": 3460
    }
  ],
  "release_date": "2012-03-02",
  "scene_id": 1723,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Sex Act - Piss",
    "Theme - Director's Cut"
  ],
  "title": "Isaiah & Tyler Shields - G:hOle RAW DC"
}