{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kirk is clearly ex-military. He just has that soldier look and vibe. He is a smart guy who has been around the world and tried just about everything.\nHe discovered he loves dominant women who take strap-ons and fuck the heck out him! He has had his dick sucked by a dude, but apparently no real cock in his ass. Plenty of toys though! He wants to have a girl make him do it with a real cock, but that situation has not come up.\nI think for the money, he is pretty sure he can do it without the female dominatrix. I think I can be bossy enough too!\nFor this video, based on the photos we had shot earlier, I figured that Kirk was going to need some toys to keep him Up and Aroused. He starts with a small plug that makes his dick spring to life.\nHe loves showing you how he is banging himself, and clearly he is in Bottom-boy Nirvana. He moves on to a larger toy, and you can tell he is a pro at taking toys to his ass. No fumbling around for him!\nKirk goes doggy-style with it, sliding it in and out while stroking his long dick. He also gets up on his knees and gyrates around on it. It is buried deep!\nFor the ending, I knew our trusty vibrating plug would hit his prostate just right, and he is soon shooting a load out both his holes. Yes, he has a Prince Albert that we left out of this video. Double squirt action!\nHe is ready for guy-on-guy action, and really seems excited about experimenting. I don't think we will have a reluctant performer!\nI have an idea for his Serviced video, and I am pretty sure we can get some double-ended dildo action out of him! Stay tuned!",
  "models": [
    {
      "name": "Kirk",
      "person_id": 3501
    }
  ],
  "release_date": "2012-07-30",
  "scene_id": 1726,
  "tags": [
    "Theme - Solo",
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Kirk - Solo"
}