{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kirk was very clear that he was not going to be a shrinking violet when it came to playing with a guy. Though he says he has not done much with a guy, he didn't think he would have too many limits, especially if someone was playing with his ass.\nBrooks is more of a bottom like Kirk is, but he has some pretty amazing oral skills. He has that whole 'deep-throat and swallow' action that seems to massage the guy's cock with just his throat.\nKirk was hard from the moment Brooks took his cock out. I like how Brooks kept edging closer and closer in for a kiss, while Kirk was clearly ready to do some making out. Kirk's body language is saying, \"Kiss me already!\"\nAfter sucking on Kirk's cock expertly, he tries to slide in a double-ended dildo. It's slippery and floppy, so Kirk takes over getting the insert in. Once it is in, Kirk's switch is thrown, and Brooks is kissing him hard, then sucks his dick. Kirk is on Bottom-Boy Cloud Nine.\nBrooks climbs up and feeds him his cock, while sliding the dildo up into him. It is an awesome sight seeing this guy get Serviced from every angle.\nThey give the toy a break by 69ing some mouth-action on each other, then it was back to the toy, this time Brooks joins him as they both gyrate and jerk-off with the dildo inside of them. Brooks is struggling to not bust!\nKirk actually thought he would cum easier if Brooks nutted in his mouth first, and suggested we use the vibrating butt plug again. Well alright!\nKirk switches out the toy, while Brook quickly ramps up to shoot a load right in his mouth. One squirt flies wild, while the rest basically ends up down the back of Kirk's throat. I think he swallows every drop. Brooks gives him a cummy kiss, and then they swap places so Kirk can cum in Brooks' mouth.\nYou have to watch this verrrry carefully. It is hard to see Kirk cumming as he made sure every last drop was in Brooks' mouth, and while you are watching that, you can see Brooks bust a second smaller load while his mouth is filled.\nThey both turned to me and smiled and acted like, \"what next Bryan?\" I yelled \"Cut!\" and wasn't sure if Kirk had come. It was strange because I had basically just let them do their thing, and suddenly they were looking to me for Direction.\nSo in the final edit, I take that out, and you are kind of left wondering if Kirk actually came.\nSo I put an OutTake at the end, where you hear me asking Kirk if he came, and if Brooks still had his load in his mouth. It is funny, yet hot, to see him smile, nod, and gurgle while saying, \"Uh huh!\" so I have them go back to what they were doing, but showcasing all the cum that is sitting in the back of his mouth by spitting it out his left side.\nI think it is hot to see the guy swallow it, but when the guy unloading really dumps his load RIGHT in the mouth to the point you can't see it, I think spitting it out is required, as um...evidence!\nThis is a very fun and intense Serviced video, with toy play, double facials, multiple cumshots, and of course some cum kissing!",
  "models": [
    {
      "name": "Brooks",
      "person_id": 3457
    },
    {
      "name": "Kirk",
      "person_id": 3501
    }
  ],
  "release_date": "2012-08-08",
  "scene_id": 1729,
  "tags": [
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Video - OutTake",
    "Sex Act - Kissing",
    "Sex Act - Oral"
  ],
  "title": "Brooks & Kirk - Serviced"
}