{
  "collections": [
    "ChaosMen"
  ],
  "description": "One of the thing that bothers me about Glory Hole vids, is the action is always split into two areas. I have been working hard to show all the action on both sides as it happens in real time.\nSo this video has some more fancy editing- split screens and picture in picture. It might be distracting to some, but I think overall it is nice to see both sides of the action. I kept it to the oral portion, where Bishop & Jet are on opposites sides of the the divider, but once they are in one stall fucking, it is back to normal camera angles. Well, normal for G:hOle video!\nI wanted to keep them in the stall the entire time, which presented a few challenges. Only so much you can do in the limited space, and as always, interesting to see how to get the best camera angles.\nLots of great rimming in this video, as Bishop loves to eat ass, and Jet loves the anal attention.\nBishop and Jet are both into the whole scene. Jet loves to be fucked, but I think Bishop's cock was a bit bigger than he was used to. Bishop fucks him on the toilet and goes deep on him all fast and furious. I think it was more than he could take, plus Bishop was struggling to stay hard in such a low position. We pretty quickly switch to Bishop sitting on Jet's cock to give both guys a break.\nBishop rides Jet's cock like a pro, and his dick wakes back up. Jet also had time to regain his ability to bottom, and sitting on it reverse-cowboy really allowed him to monitor the depth. He bounces around on it until he nuts!\nBishop then unloads on Jet's hole, but loses his boner before juicing him. He of course made up for it by eating out his cum-soaked hole!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Bishop",
      "person_id": 3493
    }
  ],
  "release_date": "2012-10-24",
  "scene_id": 1731,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Bishop & Jet - G:hOle RAW"
}