{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought Solomon and Tatum would be perfect for a Bossy video. Solomon is versatile when it comes to being Bossy. He likes both the active and passive roles.\nTatum said he generally like the girl to take control, and although he wanted to Top his first time out, I wanted someone who could take control of him, and make him do all kinds of naughty things.\nThey both smile a bit as they get into Solomon making Tatum strip and then stroke for him. They both quickly get into it, with Solomon making Tatum suck on his hard cock.\nSolomon then has a lot of fun pushing a butt plug up Tatum's ass, then going through all the vibrating cycles. He then sucks Tatum's cock, making him hard and totally in bliss as his ass and cock get the royal treatment.\nNext, Solomon gets up on the chair and makes Tatum clean his ass and then crawl under to suck his cock. Totally Bossy!\nThey swap places at the bed where Tatum takes Solomon's cock with total pleasure. The dude may have wanted to start-off by Topping, but his cock and brain sure liked getting fucked!\nTatum even knew he would be able to cum from being fucked, so Solomon drills him until cum starts oozing out his hole.\nSolomon then shoots and breeds Tatum, ending with a rather sweet kiss!",
  "models": [
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    },
    {
      "name": "Tatum Parks",
      "person_id": 3496
    }
  ],
  "release_date": "2012-10-12",
  "scene_id": 1732,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Theme - Bossy"
  ],
  "title": "Solomon Aspen & Tatum Parks - Bossy"
}