{
  "collections": [
    "ChaosMen"
  ],
  "description": "If you pay attention to production dates at the beginning, you might notice that this video was shot several months after Ross did his solo. He really debated a long time about doing the oral. It wasn't that he didn't think he could get hard or cum, just more worried what everyone else would think.\nHe finally decided people were gonna like him or not like him no matter what he did in life, so he kind of had an epiphany of sorts that broadened his range. So he texted me up saying that he was eager to get back in, ASAP as these things go, and I knew his Solo was going to be airing very soon and always like to bookend the solo with the oral video the following Wednesday.\nI booked him in very quickly, which I don't do often because of the cost, and thought I would do the oral video since it was very last minute. He was comfortable with me, and actually thought it might be fun, but I was looking at the release schedule, and really wanted to mix things up. I just couldn't think of who I had local that could be on call so quickly.\nA couple days before shooting with Ross, I was actually delivery to Carmine some of the used furniture that was piling up. He got himself a new apartment, and literally all he had was a suitcase of clothing and nothing more. Extra furniture goes to models or to one of the local charities, so this time it was Carmine's turn to score bedroom and living room furniture. He was so happy his apartment was not so sad looking.\nAnyway, while moving stuff in, I realized that Carmine could easily pop in and do Ross's oral. The guy has got some amazing oral skills, and I figured he could make Ross nut pretty easily.\nRoss arrived and was eager and all set to do the video. Despite being eager to get head, Ross's eyes were glued to the TV. After editing the video, I kinda felt like he didn't really need to watch it so much- Carmine was working his big tool like a pro!\nAt one point, Ross had to have Carmine stop because he was going to bust. After making sure he wasn't gonna squirt, Carmine flipped him over and rimmed his ass. He REALLY buries his face in there, and then strokes Ross's cock so it is standing at full attention.\nAfter the ass eating, Carmine went to work on making Ross cum. Sure enough Carmine hit the right motion very quickly and had Ross popping in no time! He does a great job showing Ross ejaculating while sucking down some jizz for a protein snack!",
  "models": [
    {
      "name": "Ross",
      "person_id": 3495
    },
    {
      "name": "Carmine",
      "person_id": 3483
    }
  ],
  "release_date": "2012-07-18",
  "scene_id": 1738,
  "tags": [
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating",
    "Ethnicity - Mixed Heritage"
  ],
  "title": "Carmine & Ross - Serviced"
}