{
  "collections": [
    "ChaosMen"
  ],
  "description": "This was such a fun video to do...and to watch!\nVander can be such a power bottom when a big muscly guy comes along, especially one that can get \"Bossy!\"\nGavin Sevin sits in his chair telling Vander to start stripping for him. Vander's cock is clearly waking up just from being ordered around. Pretty sure Gavin was enjoying it to, as his cock looked pretty hard in his shorts as well.\nGavin has him strip, show him his cock and ass, then makes him suck his cock. It's a lot more fun being bossy when you know your new plaything has a toy in his ass, so he sticks a wild looking butt plug up his ass, making him suck his cock and eat his ass with a toy crammed inside Vander's hole\nGavin gets in some of his own cock sucking, and does a fine job on Vander's ginormous unit. It's rather a mouthful!\nVander gets up on the chair and Gavin pulls out the toy, replacing it with his own cock. I love seeing Vander power fucked! His cock loves it too, and he clearly is eager to be pounded. Gavin appears to be a pretty aggressive Top, or least he really let lose as Vander encouraged him to really fuck him hard.\nThey switch it up a bit with Gavin sitting on the edge of the chair arm and Vander bouncing up and down on his cock. It's a pretty challenging position, but geeez, they fuck like wild monkeys! I think Gavin was just in awe of how voracious Vander was!\nAfter that, it was time to get more comfortable. They make their way over to the bed where Gavin can really get some good penetration and rhythm going. It took no time at all for him to fuck a load out of Vander.\nI believe this is Gavin's first RAW video, and he was enjoying himself immensely. He ramps-up to cum, unloads one squirt on Vander's hole, and buries the rest deep inside of him. Just like a pro!\nCum starts oozing out of Vander's hole while Gavin uses his cock to shove it back in!\nNeither one of these guys will disappoint, making this one of the hottest pairings ever!",
  "models": [
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2012-08-24",
  "scene_id": 1739,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Theme - Bossy",
    "X-Tras - Piercings"
  ],
  "title": "Gavin Sevin & Vander - RAW"
}