{
  "collections": [
    "ChaosMen"
  ],
  "description": "Glenn sure has a come a long way from his first sex shoot where he could only touch the other guy's cock.\nAllen, as always, throws all his sexual energy into these shoots, but it is nice to see Glenn stepping up too. He now sucks cock and looks like he is not only trying to please the other guy, but is turned on himself. His dick sure seemed to like it!\nI also think Glenn kinda watched what Allen was doing when he was getting blown. He took what he saw, and bounced it right back on Allen.\nBut the best part of this video is Allen spinning around while Glenn sits on the edge of the bed, slowly guiding Glenn's fat cock into his eager ass. Allen then basically milks Glenn's cock with his hole, gyrating and bouncing up and down on it like a pro.\nEventually Allen's legs gave out, so he switched to riding cowboy-style on Glenn's dick. These two were in sync and if I didn't know better, I think Glenn was likely going to cum from all the bouncing Allen was doing on his cock.\nI had a different ending planned for this shoot. In previous shoots, Glenn had suggested that he could cum from being fucked. That it was now actually feeling good. And again, his cock sure seemed to like the anal penetration. Allen is a pro at bottoming, but his skills at topping are equal. I figured he could nail Glenn in all the right spots.\nSure enough Allen fucks him till the whitest creamiest load flies out of Glenn's knob. Allen just about loses his wood, but he squeezes it tight, fucking his prostate to maximize his pleasure.\nIt takes Allen a bit to ramp up to nut, but he nails Glenn's hole with a couple squirts, then breeds him internally. Glenn was amazed at how warm and good it felt!\nAn awesome pairing with two guy who really had some great chemistry with each other!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Allen",
      "person_id": 3477
    }
  ],
  "release_date": "2012-10-26",
  "scene_id": 1741,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Allen & Glenn - RAW"
}