{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Jet did some topping with Bishop, he was eager to get totally fucked by an aggressive top. I love a dude who is so turned on by getting fucked that his dick is hard and dripping. Jet's cock loves the anal play, and once again we stopped 3-4 times because he was going to nut.\nI knew Gavin could really hammer a guy after he went-off on Vander. I figured he might have to go slow on Jet as he has tended to yell, \"Pineapple\" if they go too deep, but Gavin went full-tilt on him and Jet was in piggy-bottom -heaven.\nAnd does Gavin ever fuck him hard! There is some great rapid-fire fucking as Gavin works-up a sweat, pounding Jet's ass at full-speed. I thought for sure Jet would jump off, but his dick would just get harder.\nPretty sure Gavin was enjoying it too. He seems to have let go of his worries about hurting the other guy. This was one of those videos we shot pretty much in real-time as his cock was finding Jet's hole a nice place to park. I think the only time we stopped was because Jet was going to cum. I love it when I have real chemistry going on!\nOnce we had Jet on his back, he kept \"suggesting\" that he was ready to cum, but I had to tell him to wait. Gavin continued to dive in and out of his hole, and I finally took mercy on him and let him nut. It is just amazing to see Gavin's cock slide in and out of Jet as globs of cum spill out of his cock.\nGavin is also trying to get the breeding thing just right. He ramps up, spills a little seed on the hole, then pumps the rest inside of Jet. His cock spasms with each squirt of cum.\nGavin has got a rather long dick and he unloaded deep inside Jet, or maybe Jet's eager hole ate it up, but try as he could, we couldn't get the load to spill out (We tried!)\nBut if you like a total internal breeding ending, this one may not have a lot of juicy cum play, but Jet walked out of that room with an ass full of jizz!",
  "models": [
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2012-11-23",
  "scene_id": 1746,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Gavin Sevin & Jet - RAW"
}