{
  "collections": [
    "ChaosMen"
  ],
  "description": "These two really connected! Tatum was eager to Top and as usual, Eli is just a dirty boy!\nThey really liked making-out and sucking each other's cocks. Eventually Eli lays on top of Tatum, and Tatum rapid-fire face-fucks his mouth. It's very hot seeing his balls jump up and down and Eli gets his face pummeled by Tatum's cock.\nBoth of them are way into ass eating, so we get some awesome rimming.\nEli ends up riding Tatum's cock, and there is some pretty fast fucking going on. No tentative fucking here! Eli's cock really wakes up as he rides Tatum's cock balls deep. He flips around and does some reverse cowboy action. Tatum is enjoying watching his cock slide in and out of his ass.\nTatum gets Eli doggy-style, and really fucks him hard. He gets close to cumming, and has to stop, and you can see how close he was...his dick starts twitching! This was good sign that he could do an internal cumshot. I was hoping to get Tatum to fuck Eli tell he cums, but after the close call, Tatum knew he was going to have to be fucked in order to cum. He kind of half-nutted and needed some anal stimulation to bust again fully.\nSo they flip-flop last minute, and Eli expertly fucks Tatum. Eli is such a pro he reaches down and literally jerks Tatum's cock till he is nutting, all the while pounding him with his cock. Tatum was one happy camper and I was pleased too as I rarely get this kind of cum shot.\nThere is another rarity on the ending. Eli knew he could just fuck till he came. No ramping-up with his hand needed. He fucks Tatum till he is busting out a major load. He pulls out a little, squirting juice on his hole, then dumps the rest inside of Tatum. Twitch, twitch, twitch!\nBoth guys look VERY satisfied with ending on this video, and I am pretty sure you will like it too!",
  "models": [
    {
      "name": "Tatum Parks",
      "person_id": 3496
    },
    {
      "name": "Eli Hunter",
      "person_id": 3340
    }
  ],
  "release_date": "2012-11-02",
  "scene_id": 1749,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Eli Hunter & Tatum Parks - RAW"
}