{
  "collections": [
    "ChaosMen"
  ],
  "description": "Delaney has a tough schedule to work around. He has college and soccer that have him traveling around most of the time. I really only had a couple months window to get him in for scenes. Hopefully I can get him in over the Holidays as well.\nHe sure wants to come in a do porn, but the guy is seriously over-committed!\nDelaney liked the idea of working with two guys and after his first time with Glenn, he thought maybe it might be a good idea to do a TagTeam video. That way if he was having problems bottoming, someone else could bend over for a while. But he really wants to bottom!\nI thought for sure he might struggle with Solomon's long cock, but he bought himself a few toys and has been doing homework. Both Teo and Solomon prepped to bottom, but once Delaney had his cherry popped he was eager to be the bottom boy the entire video. We kept to his favorite position, and I suspect in the future he will be able to try some different positions.\nThe guys start the scene by taking turns blowing Solomon. He always seems at peace and happy laying there getting his dick serviced. Even having someone shove a cock in his mouth while getting sucked makes him happy.\nDelaney also seems in bliss when he has a cock in his mouth, and even more happy with TWO cocks in his mouth.\nDelaney's cock is barometer for how turned-on he is. His cock only seems to get hard until someone is fucking him. He doesn't even have to stroke himself. We get some fun angles as Teo mouth fucks Delaney while Solomon gets him from behind.\nAnd for a pint-size guy, Delaney seems to cum a quart or two!\nBoth Solomon and Teo breed Delaney, who left the scene with semen oozing from ass!",
  "models": [
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2012-09-21",
  "scene_id": 1751,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Red",
    "Pubic Hair - Trimmed",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Delaney & Solomon Aspen & Teo - TagTeam RAW"
}