{
  "collections": [
    "ChaosMen"
  ],
  "description": "I must have a mission to split Brooks in two! Here he is starting out fucking on video and I keep sticking him with horse-hung guys. Between Foster and Bentley, Brooks must think I have it out for him!\nRegardless, Brooks is really into Bentley's giant cock. I love watching him suck it. He can really deep throat that sucker, and I think even Bentley was surprised at his cock-sucking skills.\nBentley is still being one-sided with his interaction, but we pushed him a little with some cock jousting, and I think he liked seeing the two cocks rubbing together (Well, 'like' might be a strong word...at least he didn't wilt!) Brooks is no slouch in the cock-size department either so seeing those two jumbo cocks grinding is extra hot!\nThen it came time for Brooks to sit on Bentley's cock, and just like with Foster, Brooks took his time trying to get that big bad boy up his hole. Seriously, it DOES look like it is gonna split him in two.\nHe finally gets adjusted to it, and I will be damned in Bentley doesn't start rapid-fire fucking him! Bentley was amazed too, as he rarely gets to go crazy like that with girls. Plenty of girls can't take it at slow speed, much less with a machine gun delivery!\nWe get some spooning fucking in, which is usually best with an over-sized cock. It is a challenging position so they quickly go to one where Bentley can do push-ups down into his eager hole. Again, it just astounds me he is taking it!\nBrooks is not only taking it, but enjoying it. His cock is up and ready to shoot, and Bentley fucks a giant load out of him. Brooks got a lot of height and distance on that shot!\nBentley ramps up, coating Brooks' hole with his seed and using it as lube to shove his big knob back in!",
  "models": [
    {
      "name": "Brooks",
      "person_id": 3457
    },
    {
      "name": "Bentley",
      "person_id": 3486
    }
  ],
  "release_date": "2012-09-28",
  "scene_id": 1752,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Bentley & Brooks - RAW"
}