{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sanitized version for viewers who may not like fetish play.\nKirk swears this is his first time getting fucked by a guy, but I never know what to believe with these guys. I could tell Haigan was a polished performer, so knew he could take Kirk through his paces.\nSince Haigen has a bossy side, I figured he could boss around Kirk, who is naturally very passive. Haigan makes him strip down, suck his cock, and then shoves a rather large butt plug up his ass. Well, it seemed pretty large to Kirk, who then had to suck Haigan's big uncut meat with his ass stuffed.\nWe get a tiny bit of ass eating as Haigan preps Kirk's ass to be fucked.\nHaigan stays all cool and chill sitting in his chair, while Kirk uses his super long legs to straddle Haigan's cock. It is challenging position that the two completely get into! Kirk's cock clearly loves grinding around on Haigan's cock, and wow! Haigan sure knows how to fuck!\nHe gets him doggy style and really tears him up! Kirk is loving being dominated while Haigan fucks the heck out of him!\nWe do get some fetish play in the Director's Cut. Just a quick minute of footage as Haigan rinses-off Kirk's hole before stuffing his cock in.\nKirk was pretty eager to nut the entire time, and pretty sure having Haigan ramming him put him over the top very easy.\nHaigan breeds him after fucking the cum out of him, but what I like best is after juicing him, he slides on up and makes Haigan clean his cock off with his mouth! Ass to mouth lovers will love the ending on this video!",
  "models": [
    {
      "name": "Kirk",
      "person_id": 3501
    },
    {
      "name": "Haigan",
      "person_id": 3502
    }
  ],
  "release_date": "2012-09-14",
  "scene_id": 1756,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Theme - Bossy",
    "X-Tras - Piercings"
  ],
  "title": "Haigan & Kirk - Bossy"
}