{
  "collections": [
    "ChaosMen"
  ],
  "description": "Troy was eager to get fucked this day. He had been struggling to get his girlfriend to do some ass play, and I think that Troy is now leaning towards guys. They give him what a girl can't give him!\nI believe this is Cruz's first full-on sex film with a guy. He has fucked around with guys before, so he knows what to do, but you can tell he is not quite sure about where to be for the cameras, and just has that uncertain vibe. Putting the amateur in amateur porn!\nDespite that, his dick is solid and Troy leads the way as kind of a 'bossy bottom'.\nBoth guys eagerly suck each others cocks, and Cruz sure did like having his ass eaten. So much so he returned the favor, and made us both think that getting fucked would be something we should try soon.\nThis time out, Troy was keen on getting his ass fucked. He climbs on board Cruz and rides him like a pro. I know sexual positions look easy, but riding a cock all crab-legged AND leaning back so we get some nice penetration shots SHOULD be easy, but doing it for the camera can be challenging.\nIt is fun to see Troy ride Cruz's cock like an eager pro, basically working his cock AND getting a ton of anal stimulation as well. He truly loves it!\nWe get Troy on his back so Cruz can take charge, but somehow it feels like Cruz is working for Troy still!\nThe two end with Troy doggy style. I know from past experience that Troy can easily cum in this position, and I wanted to get a 'raining cum' shot. Cruz fucks Troy until his cock is literally pouring down jizz right onto the camera lens, practically blocking out the entire image! Splat!\nI of course have to clean the lens off while Cruz is ramping up to cum. I get back into position, and Cruz does this kind of cum inside shot where his cock finally pops out and a few globs of cum squirt out. Cruz then fingers his hole, spreading his DNA inside and out!\nA couple OutTakes at the end of this one, so stay-tuned after the credits!",
  "models": [
    {
      "name": "Cruz",
      "person_id": 3503
    },
    {
      "name": "Troy",
      "person_id": 3479
    }
  ],
  "release_date": "2012-10-19",
  "scene_id": 1759,
  "tags": [
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Video - OutTake"
  ],
  "title": "Cruz & Troy - RAW"
}