{
  "collections": [
    "ChaosMen"
  ],
  "description": "Stone was setup to fuck Delaney on this day. Delaney's schedule is very tight, so I was doing a marathon of shooting with him, something I rarely do. I so wanted to get some shoots in before he was deep in school and sports.\nStone was the first of several shoots. Delaney was due to arrive about 20 minutes before Stone's flight. We both sat and waited for him, but he was a no show. I finally called him and he was sitting at home, thinking the shoot was the following day. Grrrr...\nIt was already 5:30pm so no way to get him out that late in the day. I had a shoot the next day, so no wiggle room.\nBoth Delaney and I were bummed. I decided to take Delaney over to his hotel and we would just hope the rest of the week was going to pan out.\nOn the drive over, he suggested we do a video together and my first thought was that he can't be THAT desperate for money?! He actually isn't hard up for money, and is quite sexual. He said it would be fun. I am not overly keen on fucking the models so I thought an oral massage table video would be fine.\nDelaney was supposed to do an oral video with another model during this marathon, but the other model REALLY wanted to fuck around with Delaney, so we swapped things out. Oral with me, Sex with the other model...same pay all the way around.\nI was not really prepared to do a round with Delaney nor film us doing our thing, so I just set up the cameras and ran with it. It has that self-filmed feel to it, but not too bad.\nI have interacted with Delaney before. Mostly trying to open him up with a toy to be fucked, so we aren't too shy around each other. I of course try to keep my clothes on, but there was just no getting around a baggie shirt. It had to go. (Sorry!)\nI dunno, I think we both had a lot of fun. He sure is easy to please and make cum! He even thought a facial would be fine. Sadly, it is a closed mouth facial, but he is getting better at all things guy-on-guy.\nThe rest of the week went fine. You likely have already seen the other videos he shot that week, as I kind of held this video for a marathon week.\nYou can either view it as 'Turkey Day Leftovers' or a special tasty treat!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Delaney",
      "person_id": 3492
    }
  ],
  "release_date": "2012-11-20",
  "scene_id": 1761,
  "tags": [
    "Theme - Solo",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table"
  ],
  "title": "Bryan & Delaney - Serviced"
}