{
  "collections": [
    "ChaosMen"
  ],
  "description": "Two dirty boys who love cum play! A stellar Serviced video!\nSimon loves to be dominated, so Allen took control. I think both guys like anal stimulation, so it took them a bit to get things going without a cock inside them. But that is about the only drawback to this video.\nThey start off by taking turns blowing each other, but I think when they started 69ing it, their dicks really took off. Allen blows Simon until tears come dripping out of his eyes.\nAllen is ready for pay back and pulls Simon to the edge of the bed so he can fuck his face properly. Only once does Simon gag and have to pull away. Hot!\nSimon gets to show-off his flexibility while Allen rims his hungry hole upside down, making Simon suck on his own cock. Simon can do the splits upside down!\nThe ending is of course what makes or breaks a video. This video has gobs of cum play for the finale, and totally makes this video one of the best Serviced vids on the site.\nFirst Allen unloads in Simon's mouth, then sucks the cum out of his mouth. He then rolls Simon up so he can spit the jizz into his ass, then finger fucks him with his load.\nThat is enough to put Simon over the top, who jerks his own cock till he cums.\nAllen then bends over, lapping up his cum, then snowballing it into Simon's hungry mouth!\nA taste treat for everyone!",
  "models": [
    {
      "name": "Allen",
      "person_id": 3477
    },
    {
      "name": "Simon Gilmore",
      "person_id": 3512
    }
  ],
  "release_date": "2012-12-05",
  "scene_id": 1770,
  "tags": [
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating",
    "Ethnicity - Mixed Heritage"
  ],
  "title": "Allen & Simon Gilmore - Serviced"
}