{
  "collections": [
    "ChaosMen"
  ],
  "description": "Delaney was in for a marathon as most of the year he is busy with school and sports.\nThis video was actually going to just be an oral only video as I wanted to give Ryan a little more time in front of the camera before filming a sex film. I tend to like to get a solo and an oral video in before committing to a sex film.\nBut one of Delaney's sex films failed and he and I ended up doing an oral video. Ryan was all tested and ready to fuck, so we just kind of rotated things around.\nI was little concerned that Ryan's cock would be too big for Delaney. He did struggle with Glenn, who is nicely equipped, but I think he and Ryan might be evenly matched. But Delaney was feeling more confident, and with the trick we learned from Solomon (keep a bootie toy in his until it is time to fuck) it seems to keep him open and relaxed enough to take a larger cock.\nRyan was WAY into Delaney. You can just see it on his face. I know Delaney throws himself into the shoots, but geez, he sure seems way into his partner as well. He hungrily sucks cock and does his best to please Ryan.\nDelaney wanted to conquer riding a cock. He tried really hard with Glenn, but couldn't manage it. With Solomon it was more of a standing doggy-style position, so really didn't count.\nAfter a lot of amazing oral, he climbs on top, and I was expecting a nice cowboy style, but he climbs on top reverse-cowboy, a position that is pretty challenging.\nBut Delaney had it covered, and was riding Ryan's cock like a pro. I love watching his dick go from semi to full-on hard anytime something is inserted in his ass. It is like he has a button up in there that just inflates his cock.\nAs for Ryan, you can tell it was his first time fucking on film. Not fucking a dude though, he knows how to fuck. But as far being camera aware, showcasing, eyes checking in with me etc, it is clearly his first time.\nEven still he fucks him such enthusiasm, and I think Delaney's cherry is now officially popped enough that I am not gonna worry so much about ripping his teeny hole.\nDelaney was made for porn. You just say \"go\" and as long as someone is fucking him, he can pop within a minute. Clearly he just aching to nut the entire time he is being fucked.\nRyan really wanted to unload inside him, but needed to ramp things up. He bust his nut on Delaney's hole, and juices him with his fat uncut cock!",
  "models": [
    {
      "name": "Ryan Cruce",
      "person_id": 3509
    },
    {
      "name": "Delaney",
      "person_id": 3492
    }
  ],
  "release_date": "2012-10-17",
  "scene_id": 1771,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Delaney & Ryan Cruce - RAW"
}