{
  "collections": [
    "ChaosMen"
  ],
  "description": "When a model airs on the site, I will sometimes get viewers who send me a laundry list of pairings of who they think the model should be with. I really can't follow-up on these lists, but I understand the need to do them. I myself usually start forming a list of who a model should work with right away.\nWhen I look at Delaney's size and build, I knew Jamison would be an awesome match. They are the same height and both have a soccer or even Rugby type build to them. Delaney is still trying to ease into bottoming, so massive cocks were off the table. So putting Jamison with Delaney was at the top of my own pairings list.\nJamison has been training and I think he has never looked better. Add on to that his comfort with guys has broadened. I don't think he would put himself in the \"Bi\" category, but he at least is admitting some guys he finds hot.\nDelaney still confuses me as he is clearly always into his partner, and certainly fucking him is the quickest way to get him hard, but he still seems pretty interested in the ladies. Though I think after filming with several hot guys, he is coming around a bit to thinking about dudes off the set.\nI didn't know if Jamison could be Bossy for this video. He starts off pretty good, but with Delaney already someone who likes to Service his partner, I don't think Jamison had to boss him much.\nDelaney hungrily sucks his cock, while Jamison gets in some ass play and eating that brings Delaney's dick to full attention. A little toy in the ass also does the trick, and then he makes Delaney suck his cock.\nAs usual, Delaney is eager to get the real thing up inside him, and again, it is like pushing an \"On\" switch for his dick. It usually goes down when there is no ass attention, but you could set a timer to his cock and watch as it springs to life with little to no hand manipulation. He just bounces up and down on Jamison's cock, and up it goes!\nWe get some great undershots and you feel like you are laying on your back getting a front row seat of Jamison's cock sliding in and out of Delaney hot hole!\nJamison was on fire this video. He said he was super horny and eager to fuck a dude! His dick was ever hard and ready to bust the entire time. This of course made Delaney happy as he blisses out on the anal stimulation.\nJamison fucks the cum out Delaney, who literally coats his entire body with his own load. The kid is a cummer!\nMeanwhile, Jamison does a fine job juicing Delaney, despite having to fuck him in kind of an awkwardly low position. I really need to raise the bed!\nDelaney and Jamison have never looked better, and these two really connected!",
  "models": [
    {
      "name": "Jamison",
      "person_id": 3392
    },
    {
      "name": "Delaney",
      "person_id": 3492
    }
  ],
  "release_date": "2012-11-09",
  "scene_id": 1773,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Theme - Bossy"
  ],
  "title": "Delaney & Jamison - Bossy"
}