{
  "collections": [
    "ChaosMen"
  ],
  "description": "After working with Deryck ten minutes, Brooks said, \"He is the straightest guy I have worked with.\"\nDeryck thought Brooks said that because he was not staying hard enough, which was not the case. I think it has to do more with the way he carries himself. Big and beefy, kind of a country twang, and just generally acts like you would think a straight dude would act.\nHe is sweet as can be, and we started off his massage with some anal stimulation. When Brooks got him doggy-style and saw that Deryck's dick had got hard from the anal play, he was even more astonished. I think Deryck was too. Young guys!\nBrooks gives his back door a lot of attention, and by the time he flips Deryck over, both of them are ready for some head. Ironically, Deryck's dick gets a little wobbly. Not sure if it was because his ass was no longer being played with, but I suspect once he flipped over, he couldn't imagine a girl was playing with his ass.\nRegardless, he takes a few peeks at the porn we had going, and he was up and enjoying the sensations in no time.\nWe get him sitting upright for a minute or so. He is such a massive guy, that I just didn't think the audience could see that, so having him up next to Brooks gives you a sense of scale. Deryck loses his wood pretty quick, but I think it was worth it to see the big guy all upright and being jerked-off by his new buddy.\nDeryck was typical in saying that he couldn't cum from a blow job, even though he likes more mature girls with more experience. I told him not to worry about it. Let Brooks try a couple times, and if not, we can get him upright and he can jerk his cock into Brooks open mouth. I had faith that my gay guy could make him shoot.\nTurns out Brooks got him to nut on the first try. Brooks has got the whole \"stick with the motion that is working till your arm/mouth is aching\" thing. You really have to have stamina to make some guys nut, but I think overall Brooks made Deryck nut in under 2 minutes of putting hist mind and effort in to it.\nBrooks goobles up his jizz, sucking the last drop out of his fat cock.\nNot sure if Deryck will be back for more. He found the shoot pretty easy, so I am not certain, but he seemed like Oral was going to be his limit.\nIf you like massage videos and uber-straight guys being made to cum, you will love this Serviced video!",
  "models": [
    {
      "name": "Deryck Campbell",
      "person_id": 3510
    },
    {
      "name": "Brooks",
      "person_id": 3457
    }
  ],
  "release_date": "2012-08-29",
  "scene_id": 1774,
  "tags": [
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table"
  ],
  "title": "Brooks & Deryck Campbell - Serviced"
}