{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had a quite a few emails asking for more Conan. A lot of times I cannot accommodate requests, but Conan was very eager to come back and try bottoming again. He was practicing with a toy, and thought he could handle a bigger cock.\nThat was a good thing as I forget that Tatum has a fairly significant clock. He is always hard and ready to suck, fuck, get fucked. Truly he has some piggy in him. I knew if Conan was struggling for the initial insert, Tatum could keep it standing while he wedges it in.\nTatum is happy being aggressive or being dominated. This video he gets to take control, and mouth fucks Conan, who thankfully has lost his gag reflex. Tatum slides his cock in and out of Conan's mouth, eventually getting Conan's own cock standing at attention. Tatum does a great balancing act while he fucks Conan's face and sucks on Conan's cock.\nAfter the oral, Conan climbs on board, and thankfully, everything slides in real easy and it didn't take 3-4 tries. He grinds around on it like a pro, though I don't think he has found that inner-bottom-boy-bliss of getting hard or nutting from being fucked.\nTatum is always eager to top or bottom. He is better at cumming when he has some anal stimulation, so an ending where he Tops can be a challenge. He is very good at breeding his boy, so Conan takes a hefty load.\nConan gives us much more interactive ending, and Tatum has totally stepped up to the plate and gives us a nice open-mouthed facial. It kinda surprised me he took the load in his mouth. Videos seldom air in order that I shoot them, but this is the video when I realized Tatum could totally do the Servicing in an oral video and not be afraid of getting cum in his mouth.\nTwo very rough and rugged guys going at full-tilt, all with an amazing facial ending. HOT!",
  "models": [
    {
      "name": "Tatum Parks",
      "person_id": 3496
    },
    {
      "name": "Conan",
      "person_id": 3491
    }
  ],
  "release_date": "2012-11-30",
  "scene_id": 1786,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Conan & Tatum Parks - RAW"
}