{
  "collections": [
    "ChaosMen"
  ],
  "description": "I am pretty sure I am just going to keep having Haigan do these \"Bossy\" themed videos. He is a dominant Top, and truly gets turned-on by making anyone be his bitch.\nJet is actually quite perfect to be dominated. He had been asking for a bit more bondage in his shoots. I was a little worried because Haigan can get very aggressive and fuck extremely hard. Jet loves to get fucked, but there is a speed and depth that keeps him hard and shooting. A couple times on previous shoots we had to cut because he was getting fucked too hard.\nThis time out, we never had a problem. Haigan rides him HARD! Both of them clearly got-off on their roles. Jet seemed to handle the aggressive fucking without a problem, mainly because he was so turned on by the bondage and domination. I am pretty sure he even loved gagging on Haigan's cock until tears streamed down his face!\nHaigan gets a chest and bicep workout doing push-ups into Jet's ass. His body is looking amazing as he works up a sweat from the effort.\nHaigan's cock does go down from the strain, so he climbs on top of\nJet and makes him clean off his cock. That gets him recharged in no time, and he is back to drilling Jet's hole.\nNot only is there some power fucking, but we used a new toy called an Ass Tunnel. Haigan fucks Jet until he cums, then inserts the hollow butt plug. He ramps up and does his best to unload deep into Jet's hole. What hits the sides he scoops down the chute!\nWe did try to do a little pee play, which I think the ass tunnel is perfect for, but Haigan kept coming up dry.\nNext time for sure though!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Haigan",
      "person_id": 3502
    }
  ],
  "release_date": "2012-12-07",
  "scene_id": 1788,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Haigan & Jet - Bossy"
}