{
  "collections": [
    "ChaosMen"
  ],
  "description": "In keeping the Monster Cock week theme going, I knew I wanted to get Severino in so we could see his long boomerang get slurped on. Eli was on hand to do the honors and one thing I know about Eli, he is not afraid of cum in his mouth.\nFrankly, I think Eli kinda steals the show in this one. He has his own Monster Cock as evidenced by him appearing in another video this Friday, but he clearly is into trying to suck the cum out of Severino's cock.\nSeverino is typically nervous, and his cock goes up and down. He reaches in a couple times to show Eli the motion that works best, and Eli finally gets the technique down.\nSeverino was a little shy about showing his ass during his solo, so I took Eli aside before the shoot and told him to take extra care to showcase it. Not sure why Severino was concerned, his hole is so perfect that Eli was slobbering all over it.\nI wanted to get a cum eating ending and with Severino's curved cock, I knew his cock would act like a spigot to pour his juice into Eli's mouth. That leads me to Eli stealing the show.\nSure, Severino ramps up and delivers a mighty creamy load, but Eli is such a champ and showcasing the cumshot. He strokes his cock rapidly and with cum running into his nose, and the taste and smell of uncut cock, he busts his nut.\nNow for anyone who has been there before, having all that right there in your mouth and nose, it can quickly make you bust. I know most of you find the fact that most of these guys are straight dubious at best, but after years of working with Eli, I am pretty sure he plays for team hetero.\nThat's why I like the ending so much. I do believe all that jizz in his mouth and nose actually made him nut. Not sure what he was thinking of when he came, but it is hard to imagine it was pussy. The boy gets totally piggy on it, and I don't think this piggy was \"hamming\" it up!",
  "models": [
    {
      "name": "Severino",
      "person_id": 3518
    },
    {
      "name": "Eli Hunter",
      "person_id": 3340
    }
  ],
  "release_date": "2012-11-01",
  "scene_id": 1790,
  "tags": [
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Eli Hunter & Severino - Serviced"
}