{
  "collections": [
    "ChaosMen"
  ],
  "description": "Happy Halloween!\nFor Monster Cock Week, I saved the two biggest cocks I had on hand for a titanic match!\nBentley's cock is HUGE and I swore it was a dead ringer for Vander's cock, But I think Vander has some size on him. I don't know what Vander has been eating, but his dick seems even bigger these days. Mid-20's growth spurt? When I lined the two of their cocks together, I think for the first time for Bentley, his cock wasn't the biggest on set.\nNot that Vander minded. He gets all piggy bottom and seeing a cock nearly his dimension, he totally wanted to try it on for size!\nBut first, it was time to get Bentley to suck dick. Now I don't know what order his other videos are airing, and I aired this video out of order for the Marathon, but Bentley has yet to get a cock in his mouth.\nThis time out I was determined to get him to suck dick and even kiss! He gets right down to it, and I believe does a stellar job. Maybe he was imagining he could finally suck his own dick?\nVander was extra hard when he realized it was Bentley's first time with a cock in his mouth. And it is no quickie blow job either. Bentley suck on his fat nob a long time. I am sure his jaws were aching!\nI love that Vander's cock is a bit bigger and Bentley finally has to worship a cock bigger than his own.\nVander does return the favor and sure enough Bentley's cock reaches full mass, giving Vander a run for his money. The two end up on the floor sucking each other off, both looking like they have a baseball bat in their mouths.\nVander finally climbs on top of Bentley, slowly sliding his ginormous cock in his hole. It takes them a bit to find a rhythm but they get the hang of it.\nThen it is up to the bed, and we get to witness one of the best parts of Vander as bottom. His dick is just bone hard from the boning! No soft bottom boy here!\nSo it was easy for Bentley to fuck the cum out of Vander and his cock shoots a might big load. Bentley follows up, breeding Vander like a pro.\nBentley then straddles Vander's face and makes him clean up his cummy cock, while fingering his cummy hole!",
  "models": [
    {
      "name": "Bentley",
      "person_id": 3486
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2012-10-31",
  "scene_id": 1792,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Bentley & Vander - RAW"
}