{
  "collections": [
    "ChaosMen"
  ],
  "description": "Booker has officially decided he is a bottom boy. No more topping for him as he is really enjoying bottoming. He also gets a bit nervous when the pressure is on him to stay hard and top, plus he knows it is a sure-fire way to make him surely fire.\nWhich is kind of a shame in some ways, because Cruz has been hinting that he would like to bottom. When he has messed around with guys, he says he is usually fairly passive and likes getting fucked. So I am for sure having him bottom the next time out, but for this video, he is large and in charge.\nBooker clearly likes to suck cock, and Cruz likes to receive. But when the rolls are reversed, I think Cruz shines because his dick and his brain are both totally turned on by having Booker's cock in his mouth. It helped that he was giving head to Booker while he stood, which also gave him full-access to his own cock, stroking it every now and then to keep it aroused.\nBooker was in the mood to eat ass, and though he was bottoming, Cruz wasn't quite ready to take on rimming for this video. Booker tossed his salad like a hungry chef!\nCruz breaks Booker in by fucking him doggy-style, then they move to the foot of the bed to try some advanced fucking. Booker's quads get a work out as he squats on Cruz's long cock, gyrating and riding his dick cowboy and reverse cowboy style.\nAfter the balancing act, Booker was eager to get his ankles up in the air while Cruz goes to town on his hole. Booker has an intense orgasm, clenching his powerful legs which then pushed poor Cruz out and and way. Booker has an amazing orgasm, while Cruz lost his inertia. No way was he going ramp-up to cum, so we switched gears.\nBooker has done the ass in the air trick before and Cruz is good while cumming on his back, so we had him unload into Booker's hole all upside-down-like. He shot all over Booker's face too, almost blinding him!\nNice bit of cock and cum dipping at the end!",
  "models": [
    {
      "name": "Cruz",
      "person_id": 3503
    },
    {
      "name": "Booker",
      "person_id": 3482
    }
  ],
  "release_date": "2012-12-14",
  "scene_id": 1794,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Booker & Cruz - RAW"
}