{
  "collections": [
    "ChaosMen"
  ],
  "description": "Casey says his gf has a strap-on that she has been using on him, plus his experiences with dudes has mostly been bottoming. Despite Allen being an awesome bottom, it was time for him to take control.\nAllen is always great and he had a guy who could match his energy and enthusiasm. As I mentioned, Allen tends to like to bottom, but he continues to excel as a top. What I like best about this video is the ass eating. Clearly he is into it, and he so good at showing-off Casey's hole, fingering and licking it! Getting it all ready to fucked!\nCasey wanted to take it slow, so we had him sit on Allen's cock. He only had a bit of pain to start with, but in no time was encouraging Allen to fuck him. Allen's cock slides so nicely in and out of his hole, and Casey's ass is amazing!\nI noticed Casey was pretty flexible, so we had Allen fuck him on his side. This worked out awesome! The penetration shots are awesome, and Allen got pretty aggressive!\nMy trick of getting guys fucked on their back didn't work with Casey. I was gambling that he would be able to get hard and maybe ramp-up and cum. He said he liked it, but likely wasn't going to be able to cum. Allen, on the other hand, was struggling to NOT cum.\nCasey gets bred with cum oozing out of his hole.\nWe reset for Casey to give Allen a facial, something I am a lot more eager to do since Allen is not afraid of a little (or a lot!) of cum in his mouth. Casey dumps a big load in his mouth and on his face, followed up by some hot cum kissing!\nA sticky finale!",
  "models": [
    {
      "name": "Casey",
      "person_id": 3508
    },
    {
      "name": "Allen",
      "person_id": 3477
    }
  ],
  "release_date": "2012-11-14",
  "scene_id": 1795,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Allen & Casey - RAW"
}