{
  "collections": [
    "ChaosMen"
  ],
  "description": "Troy did a fine job during his last video of topping, but he made sure I knew he truly was looking forward to getting fucked. He is playing on the gay team now, fully embracing his bottom-boy status. Not only that, he was super excited to work with Glenn. Definitely his type of guy.\nSo Troy was feeling like it was his Lucky Day, and when he walked in and saw Glenn he was even more excited. Glenn had been beefing up, so he had put on a lot of mass, and then spent a month getting cut up. Troy is a total gym guy, and loves the field of body building. One look at Glenn and his mouth was open along with being ready to get his ass plowed by him.\nGlenn also seems to have let go of all his limits. Even though Troy likely didn't need much motivation to sit on his cock, I knew if I could get Glenn to eat his ass, he would be even more hungry for him to fuck him.\nAnd I was astonished at the energy he put into licking his ass! He face-planted himself in there, and there was no tentative tongue action. Dare I say he got piggy while doing it! I was down below filming it, and I realized he was eating ass just like he would a pussy, full-force licking!\nIt certainly didn't make his cock go down. Glenn gets Troy's hole sopping wet, stands up, and slides his cock easily into Troy's hungry ass. Troy's cock always gets bone hard when there is cock inside of him. Love a bottom who is totally into being fucked.\nThe two go at with true sexual tension. Glenn really got into Troy enjoying his cock inside him, and Troy was loving every minute of it Glenn's fat cock.\nTroy gets the cum fucked out of him, while Glenn does his trademark shoot once on the outside and cock twitch unload the rest on the inside, complete with some cummy ass play at the end!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Troy",
      "person_id": 3479
    }
  ],
  "release_date": "2012-12-19",
  "scene_id": 1796,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Glenn & Troy - RAW"
}