{
  "collections": [
    "ChaosMen"
  ],
  "description": "A few of you have been hinting around for me to perform in a full sex film. I kind of set my own boundary/limit on the amount of interaction I have with the guys. I have seen lots of comments about other porn producers in their videos, and the peanut gallery is not very kind. I am getting closer to 50 (and it shows) so I kind of wanted to do something while I am still within an acceptable weight parameter.\nYou can thank Ransom for this video. He kept at me about doing this video. I put it off a couple times, before I got the nerve up. I know I am not the youngest guy in the porn world, but I figure maybe my more mature audience members might like seeing the older dawg take on the younger pup.\nI think you can tell we had a lot of fun and we shot the thing straight trough. with only a couple pauses to move cameras around. It is always a challenge when playing with Ransom because he cums so quickly when being fucked. I finally gave up, not sure if we had enough time to make a standard video, but it turns out the timing was good. Besides, I love making Ransom bust.\nIf the reaction to this video is good, I may do 7 more so I can make a DVD or just a compilation. It surprises me that I have models suggest doing videos with me.\nI am not examining the model's motives too closely, because frankly, a hot dude wants to have sex with me....for a price of course! Thankfully, Ransom did this one for fun. We have been talking for over a year about sharing private time with you all.\nWe both had fun. We hope you do too!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2012-11-28",
  "scene_id": 1799,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Sex Act - ATM Ass To Mouth",
    "Theme - There"
  ],
  "title": "Bryan & Ransom - RAW"
}