{
  "collections": [
    "ChaosMen"
  ],
  "description": "Solomon has been with me over a year now and he has two favorite things he has done on set. First, he loved his scene with Vander. He has been out right telling me he wants a re-match, this time with Vander fucking him instead. It could happen, but I think his eyes are bigger than his hole.\nThe other scene he loved was the fantasy elements in his Edge video. The dude really likes to be dominated with a lot of ouchy pain involved.\nI have pretty much put Haigan in charge of the Bossy videos, and since he is naturally aggressive and dominant, it has been an awesome fit for him. Solomon has been pushing to amp up the bondage and discipline stuff and expressed very few limits, so I knew I had an amazing match set up.\nI like the Bossy theme because it isn't too far into the S&M Fetish- kind of bondage with training wheels. But I knew I needed something special for Solomon to be excited about, and this little bondage/shackle thing I had seen online would be perfect for him.\nI sent him some pics of the new \"furniture\" and he was over the top excited. Heck once he was actually in the room with it, then knelt to get in it, his cock got bone hard!\nHaigan is straight, but I don't think he cares who he abuses and makes take his cock. I think he might get-off more knowing it is a dude he is fucking and then making him clean his cock.\nSolomon also requested I get some candles, and he was thrilled to see how I had attached it to the cage. I am not a big fan of wax but Solomon was in pure ecstasy with it dripping all over him.\nThere are few over-the-top moments but it is safe to say that Solomon was having brain orgasms through-out the entire video. I am not going to go into much more detail, but if you don't like sex rough, you might want to skip this video.\nIt is definitely a bit different for the site but I think since it isn't \"too\" fetishy most viewer will really enjoy this Bossy video!",
  "models": [
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    },
    {
      "name": "Haigan",
      "person_id": 3502
    }
  ],
  "release_date": "2012-12-31",
  "scene_id": 1804,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Theme - Bossy",
    "X-tras - Leather"
  ],
  "title": "Haigan & Solomon Aspen - Bossy"
}