{
  "collections": [
    "ChaosMen"
  ],
  "description": "Casey volunteered to bottom again. He seems to have not much interest in topping, and I think he likes to be dominated. His dick doesn't seem to be as peppy as Darius, Vander and Jet when they get fucked. Their cocks get excruciatingly hard once they are all bent over and being banged.\nGavin has always been pretty gentle when he fucks. He has bottomed before and I think he worries about going too hard. I have been putting him with guys who love to bottom, and it is awesome to see him totally unleash on a dude. Gavin can fuck with amazing ferocity!\nIn this video I let Gavin lead the way in terms of what positions to do. I love this humping position that he does. I believe it is the lead title image of the video. It is not exactly a great angle to show penetration, but he clearly is fucking deep and hard and truly enjoying himself. Kind of a more natural position. Poor Casey can't even scoot away if he goes too deep!\nCasey is a champ! He never complains (yes some models complain) during the initial insert. He just bites down and pushes through the initial pain, and before we know it, he can pretty much take it. That is why I think he will be great for a Bossy type video. Naturally passive and can take a kicking and keep on licking!\nGavin breeds Casey at the end, and then Casey has to unload with cum dripping out of his ass. And geez! You can sure tell they both needed to nut!",
  "models": [
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    },
    {
      "name": "Casey",
      "person_id": 3508
    }
  ],
  "release_date": "2012-12-21",
  "scene_id": 1805,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Casey & Gavin Sevin - RAW"
}