{
  "collections": [
    "ChaosMen"
  ],
  "description": "If you are not fan of Sounding then don't worry, the site isn't turning into a crazy fetish site. But I do want to spice up some of the shoots, and since I have a few guys that like some fetish stuff, I thought I would give it a go. I always like to think of this stuff as \"fetish with training wheels\" as no one is really skilled or used to doing this stuff, and we don't delve too far into it.\nKirk has a deep submissive streak, and Vander likes anything out of the ordinary. He was a bit more tentative in this video, as it was both their first time using the sounds. Kirk was excited. He didn't think he would have any trouble since he has a rather large gauge PA piercing.\nThe both took is slow, but both were clearly turned on by the experimentation. Vander did try the extra large vibrating sound, but found it just wouldn't go in, everything but sound itself being too slippery.\nSo he moves into what he knows and that is sucking cock and making someone suck his fact dick. Kirk was loving every minute of it! He was even excited to see I had some \"humblers\" to lock him up into, while Vander was stoked to have a Boy to just fuck the heck out of.\nI know both guys love cum play, so Vander fills up Kirk's mouth, kissing him with his jizz. Kirk cums quickly after that, his cum oozing out of his cock. Vander licks it up then goes back to trade all that cum back and forth while kissing!",
  "models": [
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Kirk",
      "person_id": 3501
    }
  ],
  "release_date": "2013-02-15",
  "scene_id": 1818,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Theme - Bossy",
    "X-Tras - Piercings"
  ],
  "title": "Kirk & Vander - Bossy"
}