{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would put Jet and Tatum to work on the couch. Both guys love to fuck and get fucked, so I knew they would be properly motivated to work some fun butt-fucking positions.\nThey start off by blowing each other, but the fun begins when Tatum moves Jet upside down and on the side of the couch. He has excellent access to Jet's ass and rims his ass good. Jet was way into having his ass rimmed that way.\nTatum goes back-and-forth to rimming his hole and sucking his cock. He then squats down on his face and makes Jet eat his hot hairy hole. He flips around and goes back to rimming and they end up 69ing in this crazy upside down position.\nTatum uses that position to penetrate Jet's hole, and I thought for sure Jet would lose his boner. Instead we had to stop a couple times because it was going to make him nut. This gave me an idea for the ending.\nWe kind of had to give up on that position since Jet kept getting to close to coming, so he rode Tatum's cock next. Jet was like a kid in a candy store, but Tatum was struggling to stay hard in a passive position. So it was time to flip-flop, and bingo! Tatum's cock was bone hard from Jet fucking him!\nI think I ended up with two bottoms again!\nJet fucks the cum out of Tatum. We reset back to Jet's upside down position. Of course Tatum's dick was spent, so he uses a toy on Jet to make him cum. Again, I thought for sure we would be there awhile, what with Jet all upside-down and blood rushing to his noggin, but it turns out that position really gets Jet going.\nHe was busting on his chest face, and I believe even one glob goes into his mouth. Tatum wanted to make sure his load goes into his mouth, so he scoops it up the rest and feeds it to Jet!",
  "models": [
    {
      "name": "Tatum Parks",
      "person_id": 3496
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2013-01-04",
  "scene_id": 1819,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Jet & Tatum Parks - RAW"
}