{
  "collections": [
    "ChaosMen"
  ],
  "description": "Maxwell said he was down to top a guy, and I thought Glenn's personality and energy would be perfect with him. Glenn had been doing all the topping lately, and frankly I think he looks great with his ankles in the air. He also stays hard while getting fucked, despite him not really understanding why guys are into it. Hello! It makes you cum harder!\nBut first I wanted to make sure Maxwell didn't squeak by without sucking some dick for the first time. I know, first times are dubious at best, but I go with what they tell me. Maxwell seems like he wants to make a good impression, and though he likely won't be rimming anytime soon, he really puts his best effort into it.\nMaxwell and Glenn even go at 69ing hungrily, which kinda surprised me.\nGlenn wanted to start-off by sitting on Maxwell cock, but he is a tough guy and he was riding him like pro in not time. I think Maxwell was surprised at how easy he took it, imagining I suppose a lot of false starts, stops, and grimaces of pain. I like it when that happens, because it always make the top wonder what they might be missing.\nWe ended up taking it easy on Maxwell and gave him some easy positions to work. He even more surprised that Glenn was staying hard while he rammed his hole. What's more, he slowed down his pace just enough to hit Glenn's sweet spot and make him nut a nice thick load.\nMaxwell didn't quite have the \"squirt once on the hole and shove it in\" quite down. He does start to unload, then basically dumps the rest inside of Glenn. That is usually what Glenn is doing to other guys, so it is hot to see, but perhaps a little more spunk needs to hit the outside to lube up his hole.\nGot a little bit of kissing out them as I panned over Glenn's cummy hole!",
  "models": [
    {
      "name": "Maxwell",
      "person_id": 3520
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2013-01-11",
  "scene_id": 1820,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Glenn & Maxwell - RAW"
}