{
  "collections": [
    "ChaosMen"
  ],
  "description": "You can sure tell this is Sinclair's first time wokring full-on with a dude. He still has that kind of \"checked-out\" vibe. Barely looking at the other model. So if you love straight guys nervously trying to his best to perform, you will love this video.\nTroy is oblivious to the lack of eye contact and just goes on his merry way of getting him hard, sucking his long cock, and rimming his hole. He eventually climbs on top and rides Sinclair hard and fast.\nSinclair is doing his best to stay focused and hard. He does reach out and stroke Troy's cock while he is riding him. Sinclair did this on his own, so it makes me feel like he will continue to push his limits and try to make the video as entertaining as possible.\nLaying on their back and having someone ride them, seems to be the least popular position with guys. Most do better in active upright position when they can do all the trusting. Even still, Sinclair is working up a major sweat as he pummels Troy's hole. Troy's cock is ever so happy for the aggressive attention.\nTroy cums very easily while being fucked, and Sinclair does a fine job of coating Troy's entire ass with his load, even giving us a little bit of cum play.\nOverall the video is typical of a true first-timer. Lots of nervousness and tentativeness, but it is very hot to see Sinclair take up the challenge of pushing his sexual limits!",
  "models": [
    {
      "name": "Troy",
      "person_id": 3479
    },
    {
      "name": "Sinclair",
      "person_id": 3519
    }
  ],
  "release_date": "2013-01-18",
  "scene_id": 1822,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Sinclair & Troy - RAW"
}