{
  "collections": [
    "ChaosMen"
  ],
  "description": "With Cruz going strong as a power bottom, and obviously liking being paired with muscly guys, I knew I wanted him to work with Gavin Sevin. He definitely has a thing for hot guys and it shows in his performance.\nMeanwhile Gavin has been working out extra hard. Throwing himself into being the best at what he does. He likes topping, and this video he fucks with expertise. Pretty sure the next video I may have him flip-flop. He is fine with it, as long as the guy isn't hung like mule.\nBoth guys start off stroking their cocks through their underwear. I always worry that one of the guy's dicks will lag behind the other, but both dudes are clearly into watching each other stroke.\nI had actually thought that Cruz would get hard first and told him to go ahead and start sucking on Gavin to get him hard, but as it turned out, Gavin was ahead of him, so he went right to giving head to Cruz.\nNot wanting to left out, Cruz returns the favor, and the climbs on top of Gavin to suck his cock with hungry enthusiasm! It almost looks like he is challenging himself to take Gavin's cock all the way down his throat.\nAfter getting it bone hard, he spins around slowly slides it in. Gavin always seems a bit surprised when his scene partner inserts smoothly and seems to be enjoying it. I get the feeling when he has bottomed, he has just muscled his way through it instead of enjoying it.\nCruz enjoys it, that's for sure! After riding his cock, they adjourn over to the couch for some Planking action. I had wanted to do this with Jet and Tatum, but Tatum's cock points straight up, while Gavin's is hard, but can go pretty much any direction.\nGavin planks Cruz with such skill that clearly it isn't first time he has fucked in a challenging position. And Cruz's cock seems to be enjoying, despite the cramped neck action.\nFinally they got up on the bed in a more traditional position. Gavin fucks Cruz in just the right spot, and I think for the first time during the video he was worried he might cum. Finally I figured he had had enough, and let's the cum fly!\nGavin gets close and just as he is shooting his load, he shoves it in, his cock throbbing as he fill Cruz up. I think he is just frozen in ecstasy as he unloads!\nTwo hot guys, one very hot scene!",
  "models": [
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    },
    {
      "name": "Cruz",
      "person_id": 3503
    }
  ],
  "release_date": "2013-02-08",
  "scene_id": 1826,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Cruz & Gavin Sevin - RAW"
}