{
  "collections": [
    "ChaosMen"
  ],
  "description": "I couldn't believe Shea wanted to come back and do more video work. He seemed so checked-out during his massage/oral video that I thought for sure something more interactive would be beyond him.\nKelton was eager to take on a new guy, despite my warning that I thought it might be a One-Sided video. He didn't think it would bother him if his scene partner was not very sure about what he was doing. Kelton was ready to lead the way as a bossy Bottom!\nThis is one of those videos where the energy shifts about half-way through. Shea is definitely the nervous first-timer. Eyes looking down and not making any eye-contact. Kelton does blow him till he is nice and firm, and I think Shea was surprised his cock was standing attention. He even managed to reach out and stroke Kelton for a bit.\nShea stands up, then Kelton blows him till he is super hard for putting his cock inside. I have not worked with Kelton before, so wasn't sure he could take such a big cock. Shea does kind of shove it in fast, likely worried he was going to droop. Kelton was a trooper and took it with ease.\nAnd I love a Bottom who is hard! Shea starts to get into it, while Kelton's cock is ready to spurt from the fucking. Shea realized Kelton was into it, and his attitude changes from merely going through the motions, to trying to fuck the heck out of Kelton.\nIt is astounding to see how big Shea's cock gets as it slides in and out of Kelton's hungry hole. Kelton then climbs on top of Shea's monster dick, and rides until his own cock is up and ready to bust again. Kelton has got skills!\nShea is actually fairly tall at 6'2\", so we had to add a wedge so he could fuck Kelton on his back. Worked brilliantly. though I think Shea's calves were on fire by the end of the video. Perhaps a little too high!\nBut by this time, Shea is totally into the scene and is eagerly trying to fuck the cum out of Kelton. I think it is hot to watch him as he keeps a close eye on Kelton's dick as he is unloading.\nShea strokes his cock, shooting a long rope of cum onto Kelton, then firmly planting the rest inside of him. Pretty awesome for his first time! Can't wait to get both guys back for more!",
  "models": [
    {
      "name": "Kelton",
      "person_id": 3517
    },
    {
      "name": "Shea",
      "person_id": 3524
    }
  ],
  "release_date": "2013-02-01",
  "scene_id": 1827,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Kelton & Shea - RAW"
}