{
  "collections": [
    "ChaosMen"
  ],
  "description": "'Ace' and Vander had been seeing each other for many months. They have been doing the whole long-distance relationship thang. Not sure I would say \"boyfriends\" what with each of them living on opposite ends of the country, but you will quickly see that these two guys are totally enamored with each other.\nI basically let them do whatever they wanted and chased them around with a camera. A couple times I did have to remind them to \"let us in\" so we could see what was happening, but overall this is just one steaming hot sex scene where they get to finally have sex after not seeing each other for a couple months.\nThey start off in the shower with Ace obviously hungry to get Vander's cock down the back of his throat. Not sure I have seen anyone deep throat him so deftly! Ace has had some practice doing it with Vander before. Vander is hungry for Ace's hole, and eats him till he is begging to be fucked.\nIt still surprises me these guys can take Vander's monster cock, even for someone as experienced as Ace is. His cock sure liked all the attention, and before I knew it Vander had lifted Ace up off the tile and was fucking him up against the shower wall. I had a twinge or fear as I had visions of Vander's feet sliding out from under him, but before everyone went splat on the tile, they dismissed themselves for the comfort of the bed.\nAce climbs into bed, leaving Vander an amazing view of his perfect ass. Vander slides in then slides his cock back into Ace. After that it is just like watching two hungry dogs fight over a bone. They both take turns fucking each other, each getting harder with the other dude's cock inside them.\nAce kept halting because he was going to cum and I did finally have to direct them into a more \"cum shot friendly\" position. I was setting up my main camera when Ace started yelling he was cumming. I kind of missed getting a nice close-up shot of it, but thankfully the other cameras were set and ready to catch Ace's awesome nut shot.\nVander licks up his load, then starts fucking him some more. He loves to eat ass, so he starts licking his hole, which puts him over the top. He unloads over his hole, and jams the rest in.\nNot one to waste cum, he eats out Ace's cummy hole, then climbs on top to swap some cummy kisses!\nThis one scores mighty high on the satisfaction meter because these are two guys clearly have thing for each other!",
  "models": [
    {
      "name": "Ace Kidman",
      "person_id": 3527
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2013-01-25",
  "scene_id": 1829,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Ace Kidman & Vander - RAW"
}