{
  "collections": [
    "ChaosMen"
  ],
  "description": "This was an unexpected turn of events!\nSinclair 'limped' his way through his first sex film, but viewers were very excited by his solo and oral, so I wanted him to keep trying. By the end of his first time doing full-on sex, he was getting into it, so I knew there was hope.\nI called him back to give it another try, but worried about him having to stop and watch porn a lot. He also had a tendency to basically \"check-out\" as his mind wanders to another place. You can tell for sure he is a nervous straight guy dealing with getting it on with a guy.\nBut as usual, the second film the guys do, they usually expand their limits. I convinced him he to try sucking dick, and he said he would do his best. He does a dang good job, and Allen is smiling as he realizes it was indeed Sinclair's first time.\nAllen then blows Sinclair, who immediately goes into \"Checked-Out\" mode. Closing his eyes and trying to go somewhere else. Dang! I thought we had him on a roll. Allen blows him until he is hard, and then proceeds to eat his ass out. Sinclair seemed to return to the room and was getting into the rimming.\nAllen rolled Sinclair flat, then climbed aboard to sit on his cock, but it was way too wobbly. We took a break, but Sinclair just wasn't going to stay hard enough to top Allen. So it was either, Allen fucks him, or we just call off the shoot.\nSinclair thought he could take it. He wasn't eager, but figured he was tough enough to handle it. I know \"First Time\" videos are always questionable, so I left in some of the talking back and forth that Allen and Sinclair did. Again, Allen is smiling mischievously as he fucks his virgin ass.\nSinclair has plenty of tatts, which is proof he is a tough guy. He took Allen's substantial cock nicely. You can tell he is grimacing here and there, but he eventually even encourages Allen to go faster. His cock didn't get too hard and have an \"ah ha!\" moment where he thought it was amazing, but his cock also didn't shrink down to nothing.\nI did dread filming this video, thinking it would take hours to do, but with the last-minute role reversal, Allen was busting his nut inside Sinclair in no time, while Sinclair unleashed a massive load! Allen scoops it up and jerks-off Sincliar's cock to add a finishing touch.\nI know many viewers think taking it up the ass means a guy is gay gay gay, but many of these guys struggle to stay hard, and bottoming is often the easier choice. This video really showcases that, and frankly, Sinclair has an ass that needed to be fucked!",
  "models": [
    {
      "name": "Allen",
      "person_id": 3477
    },
    {
      "name": "Sinclair",
      "person_id": 3519
    }
  ],
  "release_date": "2013-02-22",
  "scene_id": 1830,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Allen & Sinclair - RAW"
}