{
  "collections": [
    "ChaosMen"
  ],
  "description": "It sounds like Enrique started exploring his sexuality later than most.\nHe grew up in a small town and in his mid-twenties he moved around and started having sex with girls about then. He also messed around with a few guys, but it sounds like he is fairly passive about it.\nHe didn't realize there was a whole other world to explore, and started dancing at parties and go-go dancing at gay night clubs. I suspect some of that experimenting with guys would be messing around with dudes from the club.\nEnrique has had a girlfriend for a couple years, and they seem to have an understanding about his \"work.\" His family is uptight about sexuality, so although he seems willing to play at home, doing it on camera is past his limits -for now!\nThis is one awesome solo filled with all kinds of fun things. Clearly he loves a little anal stimulation. He fingers his ass to get his cock hard and is not shy about showing-off his hole. He never shaves his pubes, but I guess his hole likes being shaved up. Makes ya wonder!\nHe gets a vibrator out and never gets really aggressive about shoving it in. The tip of the toy has the vibrating thingy in it, and he seems to just push it in and hit his prostate. I can't tell if he doesn't like big things up there, or if he didn't get too crazy because it was going to make him cum. It sure kept his interest!\nEnrique puts on an amazing show, even licking his own cock. When he cums he licks up his own jizz, giving himself a taste treat!",
  "models": [
    {
      "name": "Enrique",
      "person_id": 3528
    }
  ],
  "release_date": "2013-01-21",
  "scene_id": 1833,
  "tags": [
    "Theme - Solo",
    "Sex Act - Self Suck or Self Facial",
    "Sex Act - Toys",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Enrique - Solo"
}