{
  "collections": [
    "ChaosMen"
  ],
  "description": "It wasn't until about halfway though Shea's first sex video that he \"let go\" and got into doing his scene with Kelton. I figured he would struggle again at the beginning of this one, then he would ramp up as we went. It didn't take him nearly as long!\nI told him he was going to try sucking cock this video, and like Sinclair, he just sheepishly ran with it. He does a great job, and certainly Jet is enjoying it. I think Jet was getting-off to the idea of having Shea suck his dick.\nBefore the shoot, I had informed Jet that Shea had a pretty big dick. He was eager to blow Shea to see how big he could get it. Jet blows him and sure enough his jaw was stretched to the max as he tries to get it all of it into his mouth. Eventually the two do some 69ing and Jet seemed happy having a cock in his mouth while somebody sucks him off.\nWe did have to cut after Shea tried shoving his fat cock into Jet the first time. Not sure if it was because Shea's cock is the biggest thing Jet has sat on, or if it is because Jet is no longer dating a girl who uses her vibrators on him. But, he definitely felt \"out of practice.\"\nSo we started-off doggy-style to ease in Shea''s cock and give Jet's hole some time to expand. For the first time in a while, Jet's cock wilts for the first minute or so, but after a couple minutes it is back up and enjoying being fucked hard by one rather large cock.\nShea does like having a girl ride his cock, and I think Jet was ready to take control of the \"depth\" situation. It was easier for Jet to jerk his own cock, and truly enjoy the anal penetration as he rides Shea's dick like a pro.\nTypically, Jet is ready to bust the entire video, especially when he gets on his back. He wasn't sure he could cum with an over-sized cock slamming him, but true to his name, jets of cum were flying out of his cock.\nShea pulls out, climbs on top of Jet's face and unloads all over Jet's face and mouth. It is truly an awesome open-mouthed facial. Jet does his best to showcase the load, and if you are fan of sloppy facials and cum in the mouth, you will LOVE the ending on this. There is even a cute and quick outtake at the end!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Shea",
      "person_id": 3524
    }
  ],
  "release_date": "2013-02-27",
  "scene_id": 1834,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Chest - Smooth/Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Video - OutTake"
  ],
  "title": "Jet & Shea - RAW"
}