{
  "collections": [
    "ChaosMen"
  ],
  "description": "Darius has been focusing on school, so has not been available to do shoots. He also had a girlfriend who wasn't keen on him doing porn so it was just another reason he was MIA. Apparently that relationship is over and school was on break, so back in the saddle he climbed.\nHe was eager to get his ass fucked, and this is actually Aries first full-sex scene with ChaosMen. He has messed around with dudes on the side, but seems primarily interested in women. He also never fooled around with an uncut guy, so he was a little nervous about how to approach that.\nAries says he is very dominant in bed, so I figured a Bossy themed video would be to his liking. Nothing too crazy fetishy this week, just a Take Charge type of attitude. He has Darius strip for him then makes him get his cock hard. I think he was surprised at the energy that Darius threw into the cock-sucking, and I think he realized he was going to have to amp up his own energy to match his enthusiastic scene partner.\nDarius has had a fair number of newbies come his way, so I think he was pleased that Aries was not willing to be left behind and could keep up with his energy. Aries sucks his cock with skill. He does a great job, but as usual Darius needs some anal stimulation to get him fully in the game.\nAries shoves a dildo/plug into his hole and makes him suck his cock. After some oral attention, he teases Darius with the toy, making him beg for his cock. Aries pulls out the dildo and slides his cock easily into Darius eager hole.\nAfter some doggy-style fucking, Darius rides Aries' cock as he leans against the chair. I get some great undershot footage and you can tell Aries is astounded that Darius rides him like a pro.\nWe adjourn to the bed because I know the best way to make Darius cum is to fuck him on his back. Aries was happy to have a position he could really fuck with abandon, and he fucked the cum out of Darius in no time.\nAries first time creaming a dude's hole, and he does it like he has been doing it all his life. Two squirts ooze onto Darius's hole, then he firmly plants the rest inside of him. He then plays with his cummy hole, and boy did he ever unload big time!\nLooks like we have new Top joining Team Chaos!",
  "models": [
    {
      "name": "Aries",
      "person_id": 3526
    },
    {
      "name": "Darius",
      "person_id": 3435
    }
  ],
  "release_date": "2013-03-01",
  "scene_id": 1836,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Theme - Bossy",
    "Sex Act - Toys"
  ],
  "title": "Aries & Darius - Bossy"
}