{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have been tempted to call this video \"Straight Edge\" but I have never really marketed the site as \"Straight\" guys. I do refer/summarize the guys as straight if that is what they tell me what they identify as, but the \"straight\" I would be referring to would be that this Edge video plays straight though.\nOn occasion I have done Edge videos with no extra \"fantasy\" elements. Mostly because the guy is attracted to the idea of the blindfold, porn playing on the headphones, and I suppose even the binding of the hands allows them to give over responsibility for their actions. But they aren't down for anything more interactive.\nI created these videos as a way for them to do something \"guy on guy\" for a few moments, so they could see they wouldn't explode and or their body would still respond. That is why I so rarely do these vids. They have to be a bit more adventurous then the average Serviced participant.\nNow a couple times I have filmed an Edge video and during the edit process, the oral portion goes incredibly smoothly. I edit the fantasy elements then try to integrate them into the oral part. Many times the oral part stands well on it's own. I have considered releasing a Director's Cut or a \"Straight Edge\" video with just the sucking portion. It is often hot to just see someone take a dude from soft to cumming in under 12 minutes.\nThen I question how a Straight Edge video would be different than a Serviced video. There IS a difference of course, but to maybe the casual viewer, it is the same exact thing with a little extra cloth and rope. Connoisseurs of adult themes realize the simple bondage really does add a separate spicy element.\nI would love to say that Brant was willing to try the fantasy elements, but he really just thought the bondage part of the blow job would be easier. That isn't the only reason that this particular scene is a Straight Edge video.\nI figured we could try some easy fantasy things as we got going. Perhaps some light ass play, rimming, or kissing etc. Buuut we never got there.\nWhat I didn't count on was Brant being VERY turned on! Tatum has never done an Edge video, nor has he made anyone cum on his own. Apparently Tatum's skills are better than I expected.\nBrant almost cums once during this video, with Tatum's great hand/mouth work, as well as the use of a FleshJack.\nTatum moves off quickly, then Brant gives him the go ahead to try again. It doesn't take long before Brant is telling him to stop or he will bust.\nBrant screws up his face with effort to not cum, and his dick just floats alone in space as he rotates himself in the chair. After about 30 seconds, both Tatum and I figure his near miss with ejaculating is going to pass, but then his cock just starts spurting and dripping cum.\nTatum quickly grabs hold and jerks the rest of the cum out, tonguing his load to get every last drop.\nWell, after that, it was pretty much Game Over for Brant. I knew I didn't get a very good cumshot, so we did try to see if there was another load in there, (there wasn't). I figured I at least had all the cameras aimed at him when he shot his nut.\nSo this is Straight Edge video, complete with a hands-free cumshot!",
  "models": [
    {
      "name": "Brant",
      "person_id": 3529
    },
    {
      "name": "Tatum Parks",
      "person_id": 3496
    }
  ],
  "release_date": "2013-02-06",
  "scene_id": 1837,
  "tags": [
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Theme - Edge",
    "Hair - Red",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Brant & Tatum Parks - Edge"
}