{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sanitized version for viewers who may not like fetish play.\nAries seems to always have to pee like 3-4 times while filming, so I figured I may as well get him to do a Glory Hole video. He can let lose a stream or two while we watch.\nActually, Cruz is doing the watching while Aries unloads his bladder. Cruz strokes his cock then invites Aries to come get his cock cleaned. He sucks his cock like a hungry pro, keeping his own cock hard and ready for Aries to service.\nAfter trading oral, Cruz backs right up on to Aries stick cock, right through the G:hOle! I have never been a big fan of watching guys fuck through a glory hole. You can never see the action, and it looks a bit awkward, but I have to say we pulled this off spectacularly! Aries has such a long cock, and Cruz is bouncing back and forth on with long strokes that it is easy to get some great penetration shots.\nAries pulls out then sits on the toilet to have Cruz clean his cock some more, and get it nice and wet for him to sit on it. Cruz continues riding Aries, working his cock while they sit on the porcelain throne.\nThey move over to the trough and fuck on the mat. Aries gets a good angle, hitting Cruz's sweet spot until he nuts.\nAries unloads all over Cruz's hole, then juices him with his still stiff cock.",
  "models": [
    {
      "name": "Cruz",
      "person_id": 3503
    },
    {
      "name": "Aries",
      "person_id": 3526
    }
  ],
  "release_date": "2013-03-15",
  "scene_id": 1839,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Theme - G:hOle",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Sex Act - Piss"
  ],
  "title": "Aries & Cruz - G:hOle RAW"
}