{
  "collections": [
    "ChaosMen"
  ],
  "description": "I usually like to get a feel for a new model's energy, enthusiasm and skills before plunking them into a full-on sex scene. Trevor was in town to do a solo and an oral video, and despite him being down for some penetration, I kinda wanted to make sure everything would be going smoothly.\nAries is down to fuck also, and you will be seeing more of that in the coming weeks. He has actually been fairly busy as he is local, and has jumped into a couple films where one of the models has missed a flight or got sick (Flu Season! Hate it!) So if you like Aries, be prepared for a marathon of videos in the coming months. He really is an amazing performer!\nEvery model seems to have strengths and trading oral seems to be Aries favorite thing to do. Well, at least I am gauging his enjoyment by how hard his cock gets. It stands at attention while getting or giving head.\nTrevor so far seems to like both, but given the toy he used in his solo and his past work, my guess is he will be eager to start doing some fucking. He has an ass-splitting cock, but would love to see him get fucked.\nBoth guys are way into this oral video. We got some rimming in, and Aries, who seems to just giggle when his ass is rimmed, held his glee at bay.\nBoth guys nut within a minute of each other. This video is airing out of sequence, but Aries took on a new challenge and that was getting his first facial. Trevor cums like a fire hose, but plenty drops onto Aries' face and into his mouth to get a 'lil cum eating action. I have to give Aries props as he ramped up his own cock and shoots his load while his mouth, face and body is coated in Trevor's DNA!\nBlow Job Bliss!",
  "models": [
    {
      "name": "Trevor Laster",
      "person_id": 3532
    },
    {
      "name": "Aries",
      "person_id": 3526
    }
  ],
  "release_date": "2013-02-13",
  "scene_id": 1847,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Aries & Trevor Laster - Serviced"
}