{
  "collections": [
    "ChaosMen"
  ],
  "description": "Aries is turning out to be quite the skilled top! He was awesome with one of the best bottom's Darius, so I knew he would fly high with Jet!\nThe two exchanged workout tips and advice before the shoot, so they really hit off, having a bit of a bromance. They had a lot of energy and enthusiasm to start the shoot, so this one video where I didn't feel like they had to break the ice. They just dove right in.\nJet is an amazing bottom, and he rides Aries' cock like a pro. The reverse cowboy style he has down to a science and his cock gets so dang hard. Aries eventually starts thrusting into him, taking these really long strokes in and out of his hole. Jet has to let go of his cock or risk nutting.\nAries likes the ladies, and I was almost tempted to start shooting straight porn when I saw his ability to fuck! He can really thrust!\nJet spun around and road him face-forward, giving us a whole lot more in-and-out action. I would think that would be an easier position, but Jet was struggling to stay hard, so we went for an easier position of him on his back. Aries continued to pound his hole, making Jet's cock hard again.\nI really liked the ending Jet did with Haigan, but wanted to try doing it with an open hole, rather than using the ass tunnel. Jet props his ass up in the air while Aries does his best balancing act to fuck him while Jet's face is planted into the bed.\nJet's cock easily starts shooting his load while Aries penetrates his hole. It just amazes me how quickly the guy can bust!\nAries had to ramp up and in the interim Jet's hole closed up. His thighs shake as he nears ejaculation, and he spills his load just above Jet's hole. Not nearly the cum drop I was hoping for, so I really have to keep the ass tunnel on set. Even still, Aries scoops up his jizz and finger fucks him with his cum!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Aries",
      "person_id": 3526
    }
  ],
  "release_date": "2013-03-29",
  "scene_id": 1851,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Aries & Jet - RAW"
}