{
  "collections": [
    "ChaosMen"
  ],
  "description": "I felt like I was being so mean to Delaney when we first started shooting the fucking portion of this video.\nDelaney likely has the tiniest hole of all my guys, and Bentley is one of the most hung guys. When Delaney started sucking on Bentley's fat knob, a bead of sweat started forming on his forehead. Neither of us were sure the the pipe would fit in the plumbing!\nBut Delaney became fascinated by his big cock, and eager sucked it. He stopped a couple times visually admire it, and to whisper, \"that is a big cock.\"\nI think Bentley enjoys being Big Cock on Campus, and for someone I figured would be very skittish about sucking dick, he goes at it eagerly. They get some 69-action in, and Delaney has to stop sucking because Bentley is doing a major oral undertaking on him.\nWe did have to stop filming before the insert. I knew it was going to take like 5-6 tries. Bentley only stays hard if he can fuck rapid-fire, and Delaney likes a slow, smooth fuck. It took about 4 tries, and finally we had Delaney's hole opened-up.\nI appreciate some of you may like to see those things, but for me it spoils the fantasy. Even still, Delaney had to tell him to not go so deep, but regardless, the dude's cock always comes to attention when he is being fucked.\nDelaney wasn't too sure he could cum with a big cock inside him, but with a little bit of work, and a semi-soft Bentley, he was able to bust a clear load. I think Bentley loves to cum inside the guys, because he sure knows how to breed a hole properly!",
  "models": [
    {
      "name": "Delaney",
      "person_id": 3492
    },
    {
      "name": "Bentley",
      "person_id": 3486
    }
  ],
  "release_date": "2013-01-30",
  "scene_id": 1856,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Red",
    "Video - HD - High Def",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Bentley & Delaney - RAW"
}