{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a really hot pairing! I felt bad for splitting Delaney in two when I put him with Bentley. I knew Gavin would be able to fuck Delaney in such a way that his cock would be moments from cumming through out most of the video. The benefits of having a hard cock that can fuck in any direction!\nSince Delaney has a little Bi in him too, he was way into Gavin. He hungrily pulls his pants down, begins rubbing on Gavin's cock through his underwear, trying to guess as to what is behind the fabric. Only a few cursory strokes, and Gavin is Up and Delaney has his cock in his mouth.\nI just love the energy he puts into sucking dick. He truly looks like he is enjoying every minute of it. Gavin sucks him back, jerking his own stiff cock while he does. They use the new couch to it's full potential, by giving us some fun 69-action. Did I mention that Delaney can suck a cock? Upside down?\nDelaney goes to sit on it, but struggles to get the insert while facing Gavin. He quickly spins around and sits on it. I love watching his dick get hard just from getting fucked. He bounces around on Gavin's cock until his quads can't take much more.\nThey do some spooning on the couch. Normally this a challenging position, but Gavin watches himself on the monitor so he can see exactly what he is doing. He grinds his long cock into him over and over, watching it slide in and out.\nI learned during Gavin's shoot with Cruz that he could plank a dude, and the new couch really would allow for full-on flat plank. I thought for sure Delaney would lose his wood, being all upside down and blood rushing to his head, but he stayed in the moment.\nIt does surprise me that he can cum so quickly when he puts his mind to it. Gavin planks his ass good, forcing the cum out of Delaney's cock. A huge load spills out and drips onto his chest.\nGavin gets himself upright and ramps up to spill his load all over Delaney's hole. A ton comes out, hitting him mostly on the taint. Gavin scoops it up and shoves it into his hole, fucking him with his jizz!",
  "models": [
    {
      "name": "Delaney",
      "person_id": 3492
    },
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    }
  ],
  "release_date": "2013-04-05",
  "scene_id": 1858,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Delaney & Gavin Sevin - RAW"
}