{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would give Aries a chance to truly Service a guy. He has done great during full-on sex films, but as we all know by now, it is a lot harder to sustain keeping someone hard as well as making them nut over the long haul.\nAdd onto that Xavier was not really sure about doing the oral video. When I asked him if he was nervous he just said, \"I just want to get it over with.\" Not exactly enthusiasm.\nBoth do very well, but overall, I think I just got lucky that Xavier was easy to make nut. The first few minutes, Aries is struggling to keep Xavier at full mass, but once Xavier let him know what to do, he had Xavier almost cumming at least once. He quickly shoves Aries's hand away as he is about busts. A little later on, you can hear him saying, \"Shit...shit...shit\" and me verbally nudging Aries to ease up a bit.\nRimming is not something Aries has done before. Not gonna lie, but you can tell he is doing it only to please us. He can't be accused of being hungry for the hole! He certainly likes fucking them, but licking them, the jury is still out.\nI had thought we might need to have Xavier get upright and bust on Aries, but with him almost cumming a couple times, I figured we would give it a try with Aries doing all the work.\nAries gets the hand motion down, while Xavier tells him exactly what he wants. In under 2 minutes he was choking out a thick load. I kinda like the way Aries slows down at the very end of the cumshot so we can see the jizz just ooze out of his head. Most guys don't like this as they like a sustained jerk through out the cumshot.\nBut ironically this is pretty much what Xavier did during his solo, so I am pretty sure Xavier enjoyed cumming that way. Perhaps Aries has some Servicing Intuition!?\nIt's a rock solid Service video. Xaxier kept saying how far out of his limits this shoot was, so I am not optimistic that he will be back for more. So enjoy him while you can! He is adorable!",
  "models": [
    {
      "name": "Aries",
      "person_id": 3526
    },
    {
      "name": "Xavier",
      "person_id": 3536
    }
  ],
  "release_date": "2013-03-27",
  "scene_id": 1862,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Aries & Xavier - Serviced"
}