{
  "collections": [
    "ChaosMen"
  ],
  "description": "I did Serviced videos with both Maximilian & Stefan. Both were intrigued about doing more, but Stefan said his next step was to suck back. Normally the guy's next step is to fuck a dude and NOT put anything in their mouth, so I usually get lucky to have something more advanced.\nHaving the guys do basically the same thing twice is something I try to avoid, but with both guys tentative about doing more I thought it would be fun to see some newbies go at giving each oral.\nBoth are a bit shy and were nervous. I am not sure if it was about doing the blow jobs, or just being on camera in general. They start off by stroking their own cock, taking turns disrobing, and eventually do some dual stroking.\nBefore the shoot I told them whoever gets hard first \"wins\" and the other has to do the sucking. Stefan was up first, so Max got down on his knees and started to orally service Stefan.\nMax had to rely on the TV to get hard, but you can see Stefan is truly enjoying having his cock sucked. It IS his favorite thing to do with girls, so I am thinking maybe he feels the same way about having a guy blow him.\nNeither of the guys are giving particularly skilled blow jobs, but both are enthusiastic and interested in trying to please their partner. If the skill level bugs ya, well, you just have to remind yourself they are indeed newbies at it.\nI think since Stefan was more into being blown and getting off to it, he gets the lion share of the Servicing. Max really only maintained wood while he was sucking on Stefan and had access to his own cock.\nA full on facial would be a bit advanced for these two, so I had Max finish himself off. It took a few minutes for Stefan to play catchup and he spills his load all over Maximilian's chest.\nMax did manage to suck on Stefan's cummy cock, giving the ending a taste of things to cum?",
  "models": [
    {
      "name": "Stefan",
      "person_id": 3531
    },
    {
      "name": "Maximilian",
      "person_id": 3522
    }
  ],
  "release_date": "2013-03-13",
  "scene_id": 1865,
  "tags": [
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Cock - Uncut"
  ],
  "title": "Maximilian & Stefan - Serviced"
}