{
  "collections": [
    "ChaosMen"
  ],
  "description": "I got a glimpse of Trevor's ability to top and bottom during his Edge video with Glenn. I was eager to see him take on a dude in a setting where he could really maneuver and make things happen. Trevor prefers to top, but he also enjoys bottoming, so I knew he would enjoy a flip-flop video.\nI found out that Jet will actually jerk-off a couple times before doing a shoot. I knew he struggled to NOT cum while being fucked, but I had no idea he was resorting to ejaculating before each shoot.\nNot sure if he was extra extra horny the day we shot this, but we weren't a couple minutes into the oral and he was already telling Trevor to ease up. Team Gay does it best! Trevor decided it was too easy to make him cum so he had Jet Service his rather thick cock. Watch Trevor's face as Jet's teeth and goatee become an issue.\nThey both enjoy rimming, and the ass eating in this video is awesome. I love watching Jet stroke his cock while he happily tongues Trevor's hole. Turnabout is fair play, so Trevor lubes up Jet's hole with spit, making it nice and slippery to push his cock inside. He struggles a bit to find the proper angle, but once he is up and stabilized, he fucks Jet like the pro he is. He eventually pushes Jet flat, fucking him in a more \"at home\" style... a personal favorite of many a Top.\nThat was making Trevor close, so he flips Jet over and sits on his cock. There is a lot of it falling in and out as they try to find a rhythm, but eventually they hit their stride.\nJet's favorite position is on his back, and by now I should know that he then has access to his cock and keeps himself on the edge of busting the entire time.\nThis time out, he pushes it too far, and accidentally blows his load. Trevor is lost for a few moments, but quickly scoops up the cum, slicks up his cock with it, and proceeds to fuck him with his own jizz!\nI left this in the video as an \"outtake\" only because you see me drop my camera angle, walk calmly around the bed, and as I am stepping up on to the bed to get another angle. Jet, is shouting, \"I'm going to cum again!\" I quickly get my camera in place and catch his second misfire.\nYep, he cums twice in about 60 seconds!\nI get some more footage, and he is still trying to not bust. I finally took pity on him and I let Trevor totally fuck the cum out of him. Trevor pulls out and bust a massive load all over Jet's asshole.\nJet squeezes out the load and it is quite messy. Trevor shoves his cock back in to help tidy things up.\nJet cums three times in this video, but get this, after the shoot, he goes to shower up and yells out to me that he came again while douching his ass! I don't think I have ever met a performer who's prostate is such a hair-trigger button to make someone cum!\nSome credit has to go to Trevor. He is gay, and as a Top that likes to bottom, he seems to know how to fuck in just the right way. A method that the other guys that Jet has worked with have not learned!\nThis is a long video. 36 minutes but I didn't want to cut out all the cum shots, cock jousting, and ass eating. It all was just too delicious!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Trevor Laster",
      "person_id": 3532
    }
  ],
  "release_date": "2013-04-19",
  "scene_id": 1870,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Jet & Trevor Laster - RAW"
}