{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sanitized version for viewers who may not like fetish play.\nThis video requires a little back story. Solomon and Vander did a video together last year. It was kind of turning point for Solomon. If you have watched that video, the two go at it like enthusiastic animals...right down to some armpit eating.\nSolomon had been playing on Team Straight full time, but once he worked with Vander, he realized he might actually like dudes too. He had watched the final video and got turned on by it. Ever since filming with him, he had been asking for a re-match. The two developed a mutual crush on each other, and would ask about the other each time they came in.\nI was reluctant to put two of the same models together again, but Solomon now was a confident bottom, and the thought of Vander in his hole excited him. So at least for this video, they would be swapping positions. We had had a failed shoot where Solomon couldn't take Foster's cock, so I wanted to have a backup plan that didn't involve Solomon fucking Vander again.\nI just didn't think that would be enough for everyone to re-watch, so I figured adding one more guy into the mix would help spice things up. Aries is super bossy, loves to Top, and though Vander is versatile, he really does get rock hard when he is getting fucked. Aries could easily fuck the two boys the entire shoot if need be.\nI let them do their thing, and there is just an amazing amount of hot things going on in this video. The Director's Cut has an extra minute of \"fetish\" activity, so if you don't enjoy a showers, view the regular one.\nSolomon is center stage in this video, and I love watching him thrust his ass out like a cat in heat, eager to have the dudes suck, lick, and pound his hole. Vander finally gets his extra large cock buried deep in Solomon's hole, so I think he can just about take anything at this point. He was in big bottom heaven.\nNot going to go into too much detail. It is definitely a Must See video, complete with breeding, facial/cum-eating, and having the cum fucked out of Vander.\nAll I can say is, I will never get the lube off the walls in that room. Time to repaint!",
  "models": [
    {
      "name": "Aries",
      "person_id": 3526
    },
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2013-04-12",
  "scene_id": 1874,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Aries & Solomon Aspen & Vander - TagTeam RAW"
}