{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a video that was not scheduled to happen. Vander was in town to do his TagTeam with Aries and Solomon, but was also going to do a Serviced video with another new guy who, well, never showed up.\nVander is living off the grid, so it is challenging to get him here. He has a full day of travel, and his flights aren't cheap. He is always on top of his game, so I hate to send him home without using him to his fullest.\nGlenn was also eager to pick up some more work and was all set to do another video the following day. He is local and versatile, so he is on top of my list of Go To guys. I didn't think an 'oral only' video would work, given they have done so much, and both guys were actually relieved they wouldn't be having to make another guy cum. It is a lot of pressure!\nAfter watching this video, you will see that I could not have been luckier. These two had real chemistry and a genuine hunger for each other. Vander starts by massaging Glenn's feet, giving foot lovers a lovely show of his feet.\nHe moves around to his shoulders, brushing his hard cock close to Glenn's face..like any frisky massage therapist would. Glenn tentatively reaches out to rub Vander's cock through his underwear. Vander pulls down his shorts, releasing his growing cock. Glenn starts sucking on it immediately.\nGlenn sure seems to enjoy blowing Vander! They go at it for quite some time, before Vander starts to focus on Glenn's ass. He rims him until his cock is hard, then flips him on over to start servicing his dick.\nHe eventually climbs on top, sucking Glenn's hard cock with gusto. Vander basically ends up sitting on Glenn's face and it still surprises me that this very uptight straight guy is tonguing another dude's ass.\nVander spins around and sits on Glenn's cock. Despite his quads screaming he rides his cock with his own hard cock throbbing in his hand. Up and down he bounces on Glenn's cock, trying to milk the cum out of him.\nThey give Vander's legs a break by sitting face-to-face on the table, stroking each other's cocks while kissing each other passionately. Vander then lays back while Glenn slides his ample cock deep inside Vander.\nThere is some amazing angles as Glenn rocks back and forth, using the position to totally showcase his dick deep inside Vander. Vander is in piggy bottom heaven.\nThe two move to the end of the table, which turned out to be a great position for Vander to cum in. Glenn fucks him hard until Vander is unloading on the floor.\nGlenn should get an award for the most twitchy cock. He ramps up, squirts a little on the hole, then his cock jumps left and right as it spasms as load deep into Vander's ass!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2013-04-26",
  "scene_id": 1876,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Sex Act - Massage Table",
    "X-Tras - Piercings"
  ],
  "title": "Glenn & Vander - RAW"
}