{
  "collections": [
    "ChaosMen"
  ],
  "description": "I am always hesitant to say a particular sex act is a model's \"first time\". I shoot videos several months before a video actually airs, and who knows what a model may have been up to in the interim.\nAries had actually tried bottoming once before with a dude that he had messed around with. He said it hurt a lot and it didn't help that the guy had a huge cock. He pretty much swore off bottoming at that time.\nI think after seeing guys not only stay hard from being fucked, but also cumming, he was willing to give it a try. I may be jumping ahead of the summary, but sure enough, he had an epiphany that he could stay and actually enjoy being fucked. I loved panning the camera up and seeing that his dick was hard while Glenn ground his cock into his semi-virgin hole.\nBut I get ahead of myself. Aries was dubious about getting fucked after getting more than a mouthful of Glenn's rather thick cock. After they blew each other, he volunteered to get fucked first to \"get it over with.\" Glenn had licked his hole, trying to get him in the mindset. I think it worked.\nAries is a tough guy so Glenn got it inside him on the first pass. There are a few fun 'ouchy' faces though. He may not soon be unloading while getting fucked, but he no longer fears it, and my guess is, after a couple more attempts, he might actually be looking forward to it.\nGlenn fucks him good, but then climbs on top and gets his own ass rammed by Aries's cock. Glenn has become completely versatile, preferring to top, but you would never know given how hard his cock stayed while bouncing up and down on Aries's dick.\nGlenn shows what a superstar he is by allowing Aries to fuck him until he nuts. Aries goes slow and steady in order to pull the load out of Glenn. Aries breeds Glenn's boyhole, dumping his load deep inside!\nThere is a cute outtake at the end for fans of Behind The Scenes moments!",
  "models": [
    {
      "name": "Aries",
      "person_id": 3526
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2013-05-10",
  "scene_id": 1888,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Video - OutTake"
  ],
  "title": "Aries & Glenn - RAW"
}