{
  "collections": [
    "ChaosMen"
  ],
  "description": "Myles was not too sure about doing an oral video, in fact he didn't decide until after he finished his solo. Ransom was on hand so we set up the oral video the next day before he was to fly out. A very early morning shoot.\nI thought for sure he would just sit and stare at the porn playing for him, but he amps it up far better than I thought he would. I think once he found that his cock liked all the attention he realized he wasn't going to have to look at the porn the whole time.\nThere is some great body language in this video. He does look away as soon as Ransom is sucking him, then focuses a while on the porn, then he reaches his hand out a bit to encourage him.\nRansom is always fascinated by big cocks, and I think he was pleased to have a fat meaty one in front of him, and one that was very responsive to his mouth.\nHis ass got some oral treatment too, and as often happens on these videos, the guys are shocked that their cocks stay hard. Myles has an amazing butt hole, and I love watching Ransom play with it while he sucks Myles's cock backwards.\nWe also knew Myles was likely going to give Ransom a bicep workout for the cum shot. If you watched his solo last week, then you know Myles jacks-off at a very VERY rapid pace.\nWell, Ransom stayed with it, and made the dude cum, hitting himself in the mouth with his load.\nI like Myles a lot. He is a quiet guy and kinda shy, but then again, so was Glenn. I hope he comes back for more, but as of this writing, he has set oral as his limit.",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Myles",
      "person_id": 3542
    }
  ],
  "release_date": "2013-04-17",
  "scene_id": 1891,
  "tags": [
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Myles & Ransom - Serviced"
}