{
  "collections": [
    "ChaosMen"
  ],
  "description": "When we got Drew to do a peep video, I was not sure about his tattoos. But he had such great sensual energy, and clearly he loved showing-off. He was getting divorced and eager to get bills paid for, but also explore playing with another dude.\nKelton was needing some quick cash for an upcoming Spring Break, so I had the two jump in in and do an oral video together.\nWe know Kelton likes to bottom, and Drew actually seems to be interested in having his ass played with. Drew paid a lot of attention to Kelton when they were jerking off, but his dick got really hard when Kelton was blowing him. Drew also looks like he totally enjoys sucking on a dick!\nDrew thought a toy would be fine, and he picked a large one and a small one. I think his eyes were bigger than his hole though. They tried getting the bigger one in, but either it was too floppy/slippery or just too big to go in. They switch to a smaller, stiffer dildo, and that did the trick. Kelton sucks him off while sliding the toy in and out.\nHe then uses the toy on Kelton, and you can see he is very aggressive and skilled at sticking it into another person.\nThey finish with Kelton jerking-off in Drew's face. Props to Drew for doing a facial his first video. Drew starts jerking quickly and unloads first. Less than a minute later, Kelton busts his load on Drew's chin. Though, I think Drew would have been fine with cum in his mouth. Eventually Drew sucks out the last drops and there is a tiny bit of cum eating!\nI love Drew's energy. I think I will see if I can cock inside of him!",
  "models": [
    {
      "name": "Kelton",
      "person_id": 3517
    },
    {
      "name": "Drew Ortiz",
      "person_id": 3546
    }
  ],
  "release_date": "2013-05-01",
  "scene_id": 1903,
  "tags": [
    "Sex Act - Toys",
    "Ethnicity - Latin Guys",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Drew Ortiz & Kelton - Serviced"
}