{
  "collections": [
    "ChaosMen"
  ],
  "description": "I think this is the second time that a video is about one model, but instead I feel like Glenn is the one to watch.\nSure Lane is pushing his narrow limits and tries his best to \"deal\" with another dude, but Glenn keeps stealing the show. Well for me anyway. I think it is because I keep remembering him during his own Serviced video, all frozen and worried, and now he just flies through these shoots like an eager beaver.\nGlenn excels at the side-by-side jerk-off. I think he likes showing-off his cock to other guys, and it always gets big fast. If his partner's cock isn't standing up quick enough for him, he jumps in there to lend a helping hand... or mouth!\nLane is looking a little nervous in this video, but I see some potential there. Especially during the ass eating. That bubble-butt of his looks delicious!\nAs for Glenn, he volunteered to do a facial this time, complete with open mouth, and it truly is an amazing ending. Feel like I have been getting a lot of these facials lately, and it is about time.\nLane ramps up and does the cum dump right down his mouth. Glenn spits some up and there is cum oozing down his face. Now if you watch the first few minutes before Lane nuts, you will see Glenn just holding his cock up, with no stroking. Clearly ready to nut, waiting for the newbie to catch-up.\nGlenn showcases the load then turns on the energy on his own cock, getting it to spit a huge load, while Lane's cum glistens on his cheeks!",
  "models": [
    {
      "name": "Lane",
      "person_id": 3550
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2013-06-12",
  "scene_id": 1912,
  "tags": [
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Glenn & Lane - Serviced"
}