{
  "collections": [
    "ChaosMen"
  ],
  "description": "Theon was ready to try bottoming for an entire video, and Chaz is such an awesome Top I thought it would be a solid pairing. And it certainly is! Both guys are built awesome, and they had a some muscle worship going on that really made the chemistry amp up.\nTheon seems to have very few limits, and he sure looks happy sucking dick. He even was down for eating ass, and despite Chaz's giggle grimace, Theon went to town on his hole like a piggy Top.\nChaz is never one to be upstaged, and he blew and rimmed Theon till he was ready to get fucked.\nThey start of doggy-style, which seems to be Theon's favorite position. Someday I am going to see if we can make him cum that way. Theon's ass is just amazing and I love the way he shoves it up into the air, like it is begging to be fucked!\nAfter that, Theon sat on Chaz while he was on his back. Not one of Chaz's stronger positions as he tends to like to be upright and in a more aggressive dominant position. We quickly change from that position to Theon on his back, and I just can't get over how flexible he is. Guys that are as muscular as him usually aren't very bendable, but he is dang good at getting his ankles up to his ears!\nWe did have to move Theon to the edge of the bed in order to get him to cum from fucking. His legs were cramping from being all bent up. Also, I am not sure he is quite used to a big cock ramming him while he nuts, so it took him a bit to ramp up.\nAnd Chaz is ever the pro, winding-up his uncut cock and doing a cum dump on Theon's hungry hole!",
  "models": [
    {
      "name": "Chaz Riley",
      "person_id": 3485
    },
    {
      "name": "Theon",
      "person_id": 3535
    }
  ],
  "release_date": "2013-05-24",
  "scene_id": 1914,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Chaz Riley & Theon - RAW"
}