{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jordan is willing to do more with a guy, but not quite to the cock-sucking part. Ironically he thought pissing with a dude might be hot. And with Aries coming in to work with him, I knew we would be in the bathroom again.\nIt always a challenge to find ways to piss, show for the camera, and of course, waiting for the guys to pee on queue. But they both pretty much nailed it, despite their cocks both being pretty hard. I think Aries has no problems pissing hard.\nThe two share the mop bucket to unload their bladders in, and then Jordan departs to have his cock properly serviced through the glory hole. Aries' cock-sucking skills are improving as Jordan's big red stick had him gag only a couple time.\nJordan did pull and jerk-off Aries cock. Baby steps for him.\nI have decided that Aries IS a dirty dirty boy, and rimming and taking a load to the mouth/face are not beyond him, and it sure does seem to excite him to push his limits to the \"dark side\" He rims Jordan's hole like a hungry piggy.\nJordan grabs his cock and Aries opens his mouth wide. The bulk of his load falls short, but manages to get a fair amount on Aries's lips/face. Aries then goes into jerk-off mode, builds up a sweat and unloads on the floor.\nPretty sure Jordan wants to come back and use his fact cock to split a guy in two, so stay-tuned for more of this ginger with a fat cock!",
  "models": [
    {
      "name": "Aries",
      "person_id": 3526
    },
    {
      "name": "Jordan Cleary",
      "person_id": 3551
    }
  ],
  "release_date": "2013-06-19",
  "scene_id": 1919,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Hair - Brown/DK Blond",
    "Theme - G:hOle",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Aries & Jordan Cleary - G:hOle Oral"
}