{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a video that I have always wanted to do with Jet after I learned he can cum several times. Also, I have been wanting to pair two of my all time favorite performers.\nVander was hoping to bottom for a bit, but once we started making Jet cum, he completely switched gears and got into Top mode. We don't actually move around a lot in this video. Jet is on his back, and Vander just keeps fucking the cum out of him, slurping up his load, and cum-kissing Jet with his own loads.\nThey start by jerking off, and Vander quickly moves on to blowing Jet. Jet cums right away, and if you stay tuned till the end, you can see a fun replay of all his cum shots. His first instinct is to stop Vander from making him cum. He says, \"He is really good at that\" and we go back to Vander sucking him,. I give jet the green light to bush and he cums for the first time.\nI thought Jet would need time to reset, so they do some ass eating, but Jet just stays hard and is ready to get fucked.\nHe cums 5 more times while Vander fucks him. Only one time does it look like he shot a blank, but the following ejaculation, he gets some distance. He just keeps cumming!\nVander said he was so turned on by making Jet cum, then eating each load and cum-kissing with Jet that he could likely fuck him till he nuts. We both figured Jet was out of jizz, but Vander fucks him until they are both nutting.\nJet still sticks to the \"I am straight\" thang, but after that shoot he declared, \"That was hot!\" Both Vander and I exchanged raised eyebrows.\nThis video contains a total of 8 cumshots, and it is a bit different than other videos. I love that Vander made him nut over and over, and Jet was really pleased to be able to showcase just how often he can cum! Video evidence!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2013-06-14",
  "scene_id": 1921,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Jet & Vander - RAW"
}