{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sanitized version for viewers who may not like fetish play.\nThe Glory Hole seems to be getting a lot of action, and I think it is Aries' home away from home. With Drew's similar tatts, I thought I would put these two rough boys together to see just how dirty they could get.\nThey start by watching porn on their phones, jerking-off in side-by-side stalls. Aries starts filming Drew with his phone, and one thing leads to the other. They trade oral like pro, but the ass eating really is when the fun begins.\nThere is just something so hot about seeing Aries with his legs up in the air, sitting on the toilet, while Drew sucks his cock and eats his hole. He then climbs on board and rides Aries' stiff cock.\nThey need more room to fuck, so they move next door to the mat, where Aries piles drives into Drew's tender ass. Drew is definitely a bottom and totally was enjoying getting fucked with full-on force!\nAries gets Drew bent over the trash can, and fucks him until Drew busts his nut. Aries jerks his cock furiously, busting his load all over and in Drew wore out hole.\nIn the Director's version, Aries rinses it off, then Drew turns around any they are like two dueling fountains. It goes on and on and on, and you can hear Aries starting to laugh.\nCute OutTake at the end of the Director's Cut, so be sure to stay-tuned for that!",
  "models": [
    {
      "name": "Drew Ortiz",
      "person_id": 3546
    },
    {
      "name": "Aries",
      "person_id": 3526
    }
  ],
  "release_date": "2013-05-31",
  "scene_id": 1924,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Video - OutTake"
  ],
  "title": "Aries & Drew Ortiz - G:hOle RAW"
}