{
  "collections": [
    "ChaosMen"
  ],
  "description": "A little history about Pure videos.\nOver the last year or so, the guys have been watching a straight video with a similar theme. I really liked the idea of the room dropping away so that the focus was only on them. No, the next step isn't green screening them and floating them in space, but the room adds a sense of elegance, while the oil on their hot bodies adds a little zing to it.\nIn the past I have dabbled here and there with some hardcore fetish themes, so this one I am hoping would be a little bit more romantic or erotic.\nI thought the guys might feel weird about it, but the body worship part seems to have worked out, and if anything, the chemistry and energy seems ramped-up. These two guys both are into building their bodies and definitely got-off to rubbing oil all over each other's muscles.\nAs for this video, there are a few other \"firsts\". I know many viewers are dubious of 'first time' anecdotes, but Solomon and Theon both forged ahead.\nTheon was ready to Top full-time time while Solomon had a little surprise for himself, and me as well. At first I thought Theon was struggling to stay hard by fucking Solomon so tightly. But it turns out that is how he fucks girls. I need to teach him how to showcase his penetration shots!\nTurns out this is just what Solomon needed to bust. Being fucked HARD! If you have followed his antics, you know he usually jerks his cock fast and furiously, with legs outstretched and flexed, making it nearly impossible to fuck the cum out of him.\nTheon is fucking him on his back, when Solomon has an epiphany that he can actually cum from being fucked. Despite only being part way through the shoot, he just ran with it while it was happening. I wasn't exactly setup to catch it perfectly, but not too bad.\nHe was proud of himself and blown-away by how good it felt. It did leave Theon hanging. As reward/punishment, Solomon opted to do his first open mouth facial. He wasn't going to be a baby about it either, so he had his mouth wide open. Theon's first squirt goes wild, but the rest shoots and dribble right into Solomon's mouth.\nAnd a little bit of cum kissing to top of the chick feeding ending .\nAnyway, I will likely do an even number of these vids, maybe for a DVD or compilation series.\nHope you enjoy!",
  "models": [
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    },
    {
      "name": "Theon",
      "person_id": 3535
    }
  ],
  "release_date": "2013-06-21",
  "scene_id": 1930,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Theme - Pure"
  ],
  "title": "Solomon Aspen & Theon - Pure"
}