{
  "collections": [
    "ChaosMen"
  ],
  "description": "Both these guys wanted to try doing a Pure video. Tatum had been working out really hard, so wanted to do some showcasing, while Jordan liked the idea of being part of a new theme.\nI was worried Jordan might be a bit \"stiff\" when it came to oiling up another dude, but the week before he had done a scene with Theon, and based on his stellar performance, I knew he had natural instincts to get intimate with another dude.\nHe starts by oiling up Tatum, who quickly gets aroused from the sensual handling. Fans of cock showing through underwear will be really pleased.\nAfter jerking Tatum's cock, Tatum climbs on up and coats Jordan in oil, showcasing his hard cock and red pubes through his underwear. Not one to leave a hard cock on its own, Tatum quickly begins sucking on Jordan's knob.\nAs I mentioned in Jordan's video with Theon, he wasn't too sure about sucking a guy, but he clearly has gotten over it, though I did worry the oil might make it more of a challenge. So far I have not had a single complaint from the guys about the crazy amount of oil, and most have gotten turned-on by this simple addition.\n(Tatum did get some in one of his contact lens and performed a portion of the shoot blurry in one eye, but we stopped and cleaned it out.)\nTatum shows what an eager bottom he is just by how hard his cock stays while being fucked. Despite a few leg cramps from some squatting action, his cock stays upright as he bounces up and down on Jordan's fat dick.\nJordan fucks the cum out of Tatum, then spills his seed all over his hole, ramming it in for good measure!\nThese guys did a great job working the the oil, the couch, and each other!",
  "models": [
    {
      "name": "Tatum Parks",
      "person_id": 3496
    },
    {
      "name": "Jordan Cleary",
      "person_id": 3551
    }
  ],
  "release_date": "2013-07-12",
  "scene_id": 1947,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Theme - Pure"
  ],
  "title": "Jordan Cleary & Tatum Parks - Pure"
}