{
  "collections": [
    "ChaosMen"
  ],
  "description": "Cy gave bottoming a try for a short period during the Edge video I did with him. He was pretty sure he could do a whole scene. Right now he is in a \"Bi\" stage, but I think the idea of bottoming appeals to him more than topping.\nLane was down for topping a guy, though at the end of this video he did say he had bottomed once and stayed hard the entire time. I love it when they slip that bit of information in AFTER the shoot. Not sure what to make of that. I guess maybe he was surprised that Cy never really got hard when he was getting fucked and he thought he could.\nThere is not a lot of smooth experienced action. You have to be a fan of 'nervous first-timers' to appreciate this video. Both guys are into it, but like many first time fuck films it struggles with newbie action.\nCy certainly seems to be enjoying getting fucked, and Lane is a natural dominant Top, but they both seem a little unsure about what to do, hesitant to touch or make the first move.\nI know that isn't much of a selling point to get you guys to join, but I have had so many amazing energetic videos lately, that a 'newbie' video really shows the difference in experience.\nSo if you are fan of guys trying out things for the first time, this video is for you!",
  "models": [
    {
      "name": "Lane",
      "person_id": 3550
    },
    {
      "name": "Cy",
      "person_id": 3514
    }
  ],
  "release_date": "2013-07-05",
  "scene_id": 1948,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Cy & Lane - RAW"
}