{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sanitized version for viewers who may not like fetish play.\nThis is Bay's first full-sex film. He was very eager to dive right in and start with a group scene. He loves group sex, and if you have been watching his videos, clearly the boy has some awesome dirty boy energy going on.\nI had paired him up with Vander, because he seemed pretty eager to also try on an extra large cock. But after a little finagling, we got Aries and Glenn on board to fuck the heck out of Vander and Bay. Suddenly had a four-way that I was hoping would satisfy Bay...and you the viewer!\nI was eager to shoot this video. All these guys are in my Best Performer category. Some have worked together before, and that actually made the energy all the more real and intense. They just \"fit\" together nicely.\nThis video pretty much has everything. While the Director's Cut has a bit of piss play in it, there is tons to be had...from cocksucking, ass to mouth, rimming, and a triple creampie, topped off with Vander being made to cum from a dildo. This video should make a lot of viewers happy!\nIt is definitely the highlight video of the Summer! You gotta join and see it!",
  "models": [
    {
      "name": "Aries",
      "person_id": 3526
    },
    {
      "name": "Bay",
      "person_id": 3554
    },
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2013-07-26",
  "scene_id": 1964,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Theme - Pure",
    "X-Tras - Piercings"
  ],
  "title": "Aries & Bay & Glenn & Vander - Pure"
}