{
  "collections": [
    "ChaosMen"
  ],
  "description": "Toby was one of my most reluctant performers, and you sure can tell by his body language. Fans of the art of body language will love examining his every move.\nAiden wasn't real sure what to think about Toby. Like me, he was surprised he was not even bi, but thankfully, Toby picked a straight porn with a hot guy in it that Aiden could get into as they both watched. Aiden can easily watch straight porn, but I think it depends on the guy. Bi baby steps!\nIt was nice that I didn't need two flavors of porn going, and Aiden kept an eye on the video as well as checking out Toby's equipment. Toby would sneak a quick peek, then look right back to the straight porn.\nAs reluctant as Toby was to this idea, I kinda wanted to push his boundaries as much as I could. Pretty sure he wasn't going to be coming back for more.\nI asked Aiden that once he saw Toby's cock was up, to rotate around and put his legs over/under Toby's, and do a cock-to-cock jerk. If Toby's cock didn't wilt too much, to go ahead and joust or stroke the two cocks together.\nToby's dick stayed pretty much at attention, so Aiden began to suck on it. This is when Toby's body language is fun to watch. He keeps shifting his head to the left, then right, as if signaling a giant \"Noooooooo!\" Thankfully his cock had other ideas and was enjoying the oral attention.\nToby is very good upright, so Aiden did some cock sucking with him standing, but after a bit, Aiden plunked himself down in front of Toby and started stroking his own very hard cock, encouraging Toby to unload on his cock.\nWell, Toby's load falls a bit short (Grrrrr...Damn!) but it didn't seem to bother Aiden who nuts so forcefully he gets some major height on his squirts.\nNot sure if Toby will be back for more. This seems to be his limit, but I think Aiden has quickly got the hang of dealing with nervous straight guys, and will be happy to keep them...cumming.",
  "models": [
    {
      "name": "Aiden Pace",
      "person_id": 3561
    },
    {
      "name": "Toby",
      "person_id": 3563
    }
  ],
  "release_date": "2013-07-31",
  "scene_id": 1966,
  "tags": [
    "Ethnicity - Latin Guys",
    "Build - Hairy",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Build - Swimmer",
    "Cock - Uncut"
  ],
  "title": "Aiden Pace & Toby - Serviced"
}