{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is Spiro's second time having sex with a dude, and I really think he turned up the energy and pushed his limits.\nOf course it doesn't hurt that Theon is one sexy dude, and even for a straight guy like Spiro, he could clearly see Theon had an amazing body on him. I had asked what else he would be willing to try, and he took a quick glance at Theon and said he thought he would like to try rimming. Well OK! Theon's ass IS amazing, no matter what team you play for.\nBoth guys are eager cocksuckers, and I know Theon likes attention to his hole, so getting him rimmed always gets him more in the mood to be fucked. He sits right down on Spiro's face, who hungrily eats Theon's hole like it is a pussy.\nThat got Theon all revved up to sit on Spiro's cock, which didn't seem to wilt one bit while a dude sat on his face. Hmmmmm...\nI gotta give props to Theon, he can really ride a cock, and those quads of his sure get a workout as he road Spiro's rock hard dick both forwards and backwards. I remember \"back in the day\" when Tops used to get all the attention, but around ChaosMen, the bottoms often steal the show. Theon is no exception!\nI got some great undershot footage as Spiro rams him from behind. Theon's hard dick just barely moves from the pounding because he is so hard.\nMaking Theon cum on his back was super easy as Spiro truly knew how to fuck slow and steady and hit Theon's prostate. Spiro also quickly learned how to breed a boy, dumping his load in Theon's hungry hole!",
  "models": [
    {
      "name": "Spiro",
      "person_id": 3549
    },
    {
      "name": "Theon",
      "person_id": 3535
    }
  ],
  "release_date": "2013-08-02",
  "scene_id": 1970,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Spiro & Theon - RAW"
}