{
  "collections": [
    "ChaosMen"
  ],
  "description": "After tossing Bay into a 4-way TagTeam for his first film, I decided I had better downsize and make his next video a little more 'simple'. He had requested a group scene to start with, but it was a lot more getting fucked than I think he expected.\nI wanted to put him with a solid performer, a dude who loves to be serviced and his cock is always hard. Jordan's cock is always At the Ready, so I knew he would be perfect.\nBay is certainly turning into an Elite performer! You can tell he clearly loves to suck cock, get serviced, and get his ass fucked. I love watching him spider-crawl on top of Jordan as they 69!\nBoth guys were even down for some rimming, which always a plus!\nBay starts by sitting on Jordan's thick cock, and he was loving riding it. I tend to think of Jordan as a lazy top. He just seems to love chilling and having someone grind around on him.\nNot to say he is not aggressive when he gets upright. He pounds Bay's ass with skill and little mercy.\nThis was Bay's first time trying to cum while being fucked, and by his reaction, you can tell it was an orgasm 10 times as intense as his normal orgasm! Jordan fucks ropes of jizz out of Bay!\nHe also unloads onto Bay, giving him his first creampie/internal load!",
  "models": [
    {
      "name": "Jordan Cleary",
      "person_id": 3551
    },
    {
      "name": "Bay",
      "person_id": 3554
    }
  ],
  "release_date": "2013-08-30",
  "scene_id": 1981,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Bay & Jordan Cleary - RAW"
}