{
  "collections": [
    "ChaosMen"
  ],
  "description": "Glenn did such an amazing job with Vander when they worked the massage table together. I wanted to see what he was like \"giving\" the massage. Solomon did a massage video with Chaz, and the energy during that video was palpable! (though very aggressive!)\nIt kinda surprised me that I had not paired these two before. Their energy is vastly different. Solomon, with his Bad Boy attitude, and Glenn, with his wholesome but naughty vibe, turned out to be an amazing mix!\nWe tossed in some slight bondage, as Solomon loves to be tied up and to give up all his control. The dude clearly likes to be used and abused. So this video has the softer sensual side of a massage, with a touch of control loss and domination.\nGlenn starts off with a massage, focusing on Solomon;s ass. His cock is busting at the seams of his white gym pants. He rubs his hard cock on Solomon's arm, who eventually grabs it, then takes it out and starts sucking on it.\nGlenn begins to focus on Solomon's ass, taking a small toy to break him in, then graduating to a larger dildo. Solomon is in pig bottom heaven!\nMy favorite part is watching Glenn slowly insert his cock for the first time. He keeps checking Solomon's face to make sure he is doing good, but Solomon is loving having his ass filled all the way up! Almost like he is relieved to have a cock in him again!\nThis video has a ton of good chemistry. Solomon is digging the bondage, and I am pretty sure Glenn loved having a willing bottom he could pound!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2013-08-09",
  "scene_id": 1984,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Sex Act - Massage Table"
  ],
  "title": "Glenn & Solomon Aspen - RAW"
}