{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sinclair's last video he definitely had some performance issues. Three or four months went by, and he got in a better space and started emailing me that he was REALLY ready to jump into having sex with dudes.\nHe showed up with a lot more enthusiasm, and I will be danged if he is not turned on by Bay. Bay is always down to play with a dude, most especially if he is going to get his ass fucked.\nThe two start by stroking their own cocks, and as soon as Bay gets his fat cock and full attention, Sinclair quickly puts it in his mouth. Not to be outdone, Bay returns the favor.\nGiven Sinclair's previous videos, he usually struggled to keep up, but this time I think he got hardest when he and Bay were sucking each other off. Not sure if Sinclair knew what the shoot was about him fucking Bay, but he climbed right on top of Bay, to Bay's surprise, and slid his cock right into his hole!\nBay just ran with it. though about half-way through Sinclair inserted a small vibrating toy to keep Bay's prostate happy.\nAt this point, we just decided to run with Bay finally being a top. Both guys were hard and turned-on. Sinclair was close to cumming a couple times while being fucked, and even when Bay drilled him while he was on his stomach, his cock was leaking pre-cum.\nAnd this time out, Sinclair gets the cum fucked out of him! Wow! He shoots a huuuge load too! I think he must have been saving up all these months!\nBay gets a chance to breed a boy hole too, though it did take him a while. I think Bay is going to be a bottom, but he did a fine job showing that he can be a versatile guy.\nBoth guys do an amazing job in this video!",
  "models": [
    {
      "name": "Sinclair",
      "person_id": 3519
    },
    {
      "name": "Bay",
      "person_id": 3554
    }
  ],
  "release_date": "2013-08-16",
  "scene_id": 1988,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Bay & Sinclair - RAW"
}