{
  "collections": [
    "ChaosMen"
  ],
  "description": "Aron emailed me asking if he could do another scene. He really liked doing the peep video, and said after doing it he went over to check out ChaosMen. I remember he watched a straight video during his peep, so was surprised he was doing 'research.'\nHe said he really liked the site, and wanted to know if I was the guy who did the massage video with Delaney. That he would be down with that, and he thought it would be fun.\nHow could I say \"No\" to an uncut cock, but I wanted to make sure he knew to amp it up for the video.\nSince we had never met, when he arrived we sat and chatted for a bit before starting the video. I wanted to get a feel for how far he wanted to go, or even if he had had guy-guy experience before. He said he had a buddy that he was friends with, that they would fall asleep after partying, play footsie, and some how he would end up getting his cock sucked. He said this went on for a while, but they never talked about it. Sound familiar to anyone?\nHe was hard even before getting on the table. Truly excited for the experience. Most guys are nervous, but was ready to not only be Serviced, but he it seems he was wanting to watch it go down. He spent most of the movie watching us on the various monitors that I use to view the action.\nHe occasionally would reach out and grab my cock through my shorts, and his dick would get even harder. He has a HUGE uncut bone too. For a little guy it is really thick and was hard to get my hand around it.\nI tried to make the video as sensual and erotic as possible, and it did the trick for him. You can tell he is really a dominant type of guy, and if he were gay, my guess is he would be a Bossy Top.\nHe loved having his ass and cock worshiped, and I spent a good amount of time trying to make him nut. He finally reached out and really grabbed onto my cock. Very hard to maintain a boner while jerking him like a jack-hammer.\nFinally I got up on the table and thought we would race to nut together. He seemed more interested in me and watching the scene unfold on the monitors, and I think that is what put him over the top.\nActually, shoving his finger up my hole was really what did the trick! His hands went instinctively to my ass crack. I wonder if he imagined he was fucking while doing it? He busted while fingering me hard and deep, and I splooged on him a few seconds later.\nI got to hand it to Aron. For such a quiet peep video, he really got into the erotic massage!\nTop notch massage table video. Don't miss it!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Aron",
      "person_id": 3572
    }
  ],
  "release_date": "2013-09-04",
  "scene_id": 2003,
  "tags": [
    "Ethnicity - Latin Guys",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Massage Table"
  ],
  "title": "Aron & Bryan - Serviced"
}