{
  "collections": [
    "ChaosMen"
  ],
  "description": "Both Jordan and Vander are big beefy guys, really strong, so we pushed trying some different positions for Vander.\nLove seeing Vander with all his weight on top of Jordan as Jordan fucks upward into his hole. Vander was certain he wasn't going to be able to stay hard in that position, but the pro that he is, it turns out his cock was quite happy to be fucked that way. I think he was turned on by Jordan's fire pubes!\nJordan actually suggested that he should try bottoming before this shoot, and I told him he might want to start bottoming on a different video as Vander's cock would be deemed \"advanced\". As soon as he saw how big Vander got, his idea of bottoming quickly evaporated. But at least I know he is willing to try, so perhaps next round we will see him with ankles up up the air.\nNot that Jordan needs to bottom. With his perfectly straight cylinder of a cock that is always rock hard, he really is an amazing top.\nWith Jordan staying solid, Vander wanted to try the reversal of what he did with Jet. He gets himself upside down, with his main goal to have Jordan fuck the cum out of him and hopefully splat his load onto his face or even in his mouth. But between the neck braking angle, he fell a bit short, but Jordan saves the day by filling his hole with a hot creamy load!",
  "models": [
    {
      "name": "Jordan Cleary",
      "person_id": 3551
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2013-09-27",
  "scene_id": 2012,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Jordan Cleary & Vander - RAW"
}