{
  "collections": [
    "ChaosMen"
  ],
  "description": "Braxton had said he was down for doing guy-on-guy work, but the closer he got to doing the shoot, he started getting the flop-sweats. It was strange because it happened to several other models that week. Plus, Braxton is a very confident guy, so he didn't think he would have any issues.\nIt actually took a couple false starts on this video. Yeah, I could put in some outtakes, but I don't find it hot at all that he was that nervous. We were going to do a side-by-side jerk-off, but as soon as Glenn took his cock out, beads of sweat would form on Braxton's head and there was just no way he was going to even jerk next to Glenn.\nI was tempted to just do my standby Serviced format of \"lay riiiight there, don't move, pants the guy and start sucking.\" Long time viewers may think that is boring after seeing it so many times, but well, it works!\nBraxton was fine getting hard when we were standing around or waiting outside the room, so he knew he could do it, but I didn't think the interactivity was going to work. I told Glenn as soon as Braxton gets his cock out, just dive in and start sucking. It is really very abrupt in this version, but again, it worked!\nIt did the trick and after a few minutes, Braxton finally chilled and got a lot more into it. Phew! He turns out be quite a good performer!\nSo we kept it simple and kept Glenn's cock in his shorts. Braxton is pretty good sitting upright and was confident he could do a facial. Both Glenn and I warned him he had to aim for Glenn's open mouth and NOT THE EYES. Glenn has already had a few \"right in the eye\" facials, so he is very good about warning them AND keeping his mouth wide open as a perfect target.\nAnd of course Braxton gets practically his whole load in Glenn's right eye! Glenn kept his eye real tight and thankfully didn't have to go home to his girlfriend and explain one red eye to her...again.\nSurprisingly, given all the sweating and false-starts Braxton had, he actually turned to me after the shoot saying it was fun, and he was down for more. Really? How quickly they forget once they succeed.\nBraxton is a hot guy and has great energy, but fucking a dude seems like a major step. He says he can do it, so I am gonna give him a chance! Based on your reaction to his solo, I think most of you will want to see how he does too.\nFor now, this Serviced video will give you a great ride, from painfully nervous to confident in 13 minutes!",
  "models": [
    {
      "name": "Braxton",
      "person_id": 3576
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2013-10-02",
  "scene_id": 2014,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Braxton & Glenn - Serviced"
}