{
  "collections": [
    "ChaosMen"
  ],
  "description": "Aron and Merrill contacted me virtually at the same time about doing more work. Aron was waiting to start a new job, while Merrill and his wife were looking to get some extra funds- his wife willingly eager to pimp her hubby out. Merill had been accepting offers to work elsewhere as well.\nAron actually said he would be down for fucking a dude. He has before with his buddy, and he is clearly a dominant Top kinda guy. Merrill seems to like having his ass played with, but likely wasn't going to be able to handle Aron's rather thick uncut cock this go around.\nBoth guys said they were eager to not only get their dicks sucked, but to suck back. So it was off to the Glory Hole!\nI was so glad to hear they both wanted to suck each other. It was a welcome relief given two previous shoots that week. Aron and Merrill were not going to be fussy eaters!\nAron seems to really be exploring dudes, and Merrill is now dancing in clubs, so it would be challenging to call either completely straight, but I think you get a feel from both, particularly Aron, that this is still a new experience, and one that has them shivering with excitement. To them, it's all good, and why not try everything!?\nBoth guys dive in face first. I do have to admit that I am rather fond of Aron's amazing uncut cock. Even if you aren't a fan of foreskin, it is just flat-out an impressive cock. I think I felt a tinge of jealousy watching Merrill devour it. His eyes were weeping from the effort! Memories of the Serviced video with him...mmmmmm.\nAron does insert a butt plug in Merrill. Not a huge fuss or key part of the video, but we figured it might get him over the top easier, and clearly you can see that Aron is eager to stick more than a toy up a dude's ass!\nBoth guys said they could probably handle an open-mouthed facial, so each took turns unloading in and on the other guy's face/mouth.\nThere is a great moment that is easily missed. I didn't notice it until I edited the final video. Aron shoves his cum-covered cock into Merrill's cum-soaked face, making him lick out the remaining jizz. They go to stand-up and trade positions. Merrill wipes the cum off his face and uses it for lube! It is subtle, but I love that happened!\nMerrill unloads into Aron's mouth, then bends down and they share a hot and wet kiss!",
  "models": [
    {
      "name": "Merrill",
      "person_id": 3575
    },
    {
      "name": "Aron",
      "person_id": 3572
    }
  ],
  "release_date": "2013-09-19",
  "scene_id": 2017,
  "tags": [
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - G:hOle",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Aron & Merrill - G:hOle Oral"
}