{
  "collections": [
    "ChaosMen"
  ],
  "description": "I really like working with Wren. He seems like a really chill guy, and pretty much down for everything.\nHe looks pretty nervous at the beginning of this video. He strikes me as a \"mostly\" straight guy, who every now and then finds a guy hot and has the urge to be with them. He seems nervous in a shaky super turned-on way. He definitely thought Glenn was hot.\nGlenn is so smooth in these videos too. He just slides up beside him and helps his new buddy out by getting him hard. That did the trick, and Wren switched from being nervous to downright HUNGRY for Glenn. The guy really likes sucking dick, and we get a hint of his passive bottom-boy behavior.\nHe certainly thrusts his ass out for enough for Glenn to bury his face deeply in his ass. Can't wait to get him back in to see how much cock we can fit in there.\nGlenn had last done an oral video with Braxton, who filled his eye with cum during the facial. Wren was down for a open-mouthed facial, thinking that it might get him over the top himself. That's pretty advanced for some who just dabbles in gay sex, so either he is has more than he lets on, or he was truly ready to get piggy with it.\nGlenn was trying to be good about not getting cum in Wren's eye like Braxton did to him, and just like Braxton, the bulk of his cum splats him right in the eye!. A good amount gets in his mouth, forehead, neck, and even chest. He quickly realizes what he does and quickly scoops the cum out of his eye.\nHe is such a pro too. He can sense Wren is going to nut soon, so gets in there and massages his chest and helps him get over the top.\nWren did an amazing job, and I can't wait to get him back for more! I think I have another guy who can help out Servicing the new guys!",
  "models": [
    {
      "name": "Wren",
      "person_id": 3581
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2013-10-23",
  "scene_id": 2022,
  "tags": [
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Glenn & Wren - Serviced"
}