{
  "collections": [
    "ChaosMen"
  ],
  "description": "Another dream pairing! A Top that never stops, and a Bottom boy that loves nothing better than to be fucked. Though that might be a toss-up, as Bay also seems very eager to suck cock too. He always seems like he is in complete bliss if a cock is inside him...mouth or ass!\nBay seemed a bit nervous next to Gavin. Very rarely is he not totally confident in his looks. But he pines for the days when he could shave his body completely hairless, and seeing Gavin, who is naturally hairless, made him self-conscious about having his fur.\nThe dude has a lot of body hair, so it is a battle I think he should give-up on and embrace. I keep telling him to just go with it. It's not like I have a preference, hairy or smooth are fine with me, as long as it is naturally how they are. And based on the feedback from you all, his body hair is a major draw for most of the audience.\nSo we start with a simple-side by-side jerk-off to see if Bay would relax, and sure enough, as soon as he saw Gavin's hard cock, Bay was down on his knees trying to please his buddy.\nGavin sucks him back, but I think his true skills are in Topping a dude. Bay gets a little wobbly, so Gavin switches to having Bay sit on his face, priming his hole to be fucked.\nHe slides up between Bay's legs and has Bay sit right down on it. Bingo! Bay's cock is back up and in action! They both work each other over as Bay bounces up and down on Gavin's hard cock.\nFucking on the couch is always a unique challenge. Pretty sure Gavin's cock falls out when trying to fuck the cum out of Bay, but WOW, what a load Bay deposits on the couch!\nGavin definitely needed to get hard, but any porn producer would love working with Gavin. He is hard all the time, and it never takes him more than a minute to lay down a load of DNA. He is totally in the right business.\nA solid film with two super hot dudes. Something for everyone!",
  "models": [
    {
      "name": "Bay",
      "person_id": 3554
    },
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    }
  ],
  "release_date": "2013-10-11",
  "scene_id": 2026,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer"
  ],
  "title": "Bay & Gavin Sevin - RAW"
}