{
  "collections": [
    "ChaosMen"
  ],
  "description": "Like Braxton, I was really surprised when Kellan was driving back to the airport for his return trip home but all ready to sign up for more work. He too kind of had a meltdown during his Serviced video. He didn't break into a sweat like Braxton, but he clearly was having a tough time wrapping his brain around having a dude play with him.\nGlenn has been in the same shoes, so is always really good at drawing the guys out of their shell. His oral skills are much better these days, and I left Glenn getting Kellan hard from the blow job in \"real time\". He woke his cock up and had him hard in a decent amount of time.\nKellan was unlikely to suck back, but like Braxton, I made sure he at least gave his scene partner a reach around. His dick droops of course, but his head didn't explode nor his brain shut down.\nThis time he didn't giggle getting his ass rimmed either. Given the amount of shaving and maintenance he does to his hole, I would think he likes a lot of attention there, but perhaps he is just all about being hair-free all over. Certainly it has been a challenge to get him to not shave-off his blonde pubes.\nIt might take a bit of talking to get him to bottom, but with his fat cock, he is also a natural top. It did take a few tries to get his cock inside Glenn. A couple tries with him wilting, and then once he was hard, Glenn had to jump off of it. Likely one of the widest cocks he had up in him in a while, so he had to get in the groove.\nKellan did fine his first time out. He has that natural ability to want to show case what he is doing, and in no time at all he was fucking the cum out of Glenn. He even scored a great creampie that was high on the breeding meter!\nWill definitely have him back for more, so hope you enjoy his first time banging a dude!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Kellan Chestnut",
      "person_id": 3577
    }
  ],
  "release_date": "2013-10-18",
  "scene_id": 2032,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Chest - Hairy/Hair"
  ],
  "title": "Glenn & Kellan Chestnut - RAW"
}