{
  "collections": [
    "ChaosMen"
  ],
  "description": "I pretty much took Braxton through the same steps as Kellan last week. He too couldn't get a cock in his mouth, so I pushed him to at least to \"touch\" Jet's dick.\nI told Jet to just take charge, and he surprised me (and Braxton!) by diving in with a kiss. Jet is not fond of kissing, but I have found when a guy is hot to him, he will lip lock. So he dives in right away with a big 'ole kiss. It startled both of us.\nJet applies his oral skills and gets Braxton charged-up. Braxton returns the favor by stroking on his cock.\nI did want to get some ass eating, and it always seems backwards when the bottom does the rimming, but it was pretty hot seeing Braxton's ankles up to his ears.\nEven better, Jet's cock is riiiiiight in his face. Just inches, hovering there, while he gets his ass eaten and his cock sucked. So close, yet so far!\nWe'll get there!\nBraxton does a great job fucking, and this video was more about teaching him how to showcase what he is doing. I think Jet cums one time in the middle of the shoot. Becoming kind of a trademark for him to shoot multiple orgasms.\nJet busts another one as Braxton fucks the cum out of him, while Braxton does a perfect creampie his first time out.\nBraxton will be back for more, so it will be fun to watch him broaden his limits!",
  "models": [
    {
      "name": "Braxton",
      "person_id": 3576
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2013-10-25",
  "scene_id": 2041,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Braxton & Jet - RAW"
}