{
  "collections": [
    "ChaosMen"
  ],
  "description": "I was really impressed with Nick's peep video. He was totally sexy and natural, and definitely had what it takes do more video.\nHe has a huge sports interest, from wrestling, boxing, and MMA. So he kind of has a tough guy mentality, even though he is very calm and quiet.\nWhat I like about this video is just how surprised he was that his cock was hard and that about 3 times we had to stop or risk him nutting. He had just broke up with his girl and went on a sex spree with a bunch of girls, even having sex less than 12 hours earlier.\nI had assured him before the video, that for some reason the massage theme seems to be a natural. He had had massages by women before, and he often tried hard to keep his boner down, so he thought it was ironic, this time he needed to let it happen. Even more surprised at how quickly it went up, but also how quickly he was ready to bust.\nI left these moments in as I thought they were charming. Ironically when it came time to busting I had to really put a bit into it. Well, we do stop and take some photos, so it does kinda of break the guys from being in that zone.\nI tried really hard to keep his cock in my mouth for this one, but he was thrusting around and I had to chase it.\nI think he is 50/50 on coming back. He didnt seem like he would ever do more, but after seeing how easy it was, I think a seed was planted.\nThis dude is totally hot, and I hope a lot of the ChaosMen fans will enjoy him!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Nick Louis",
      "person_id": 3588
    }
  ],
  "release_date": "2013-11-14",
  "scene_id": 2043,
  "tags": [
    "Build - Mature",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Long",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table"
  ],
  "title": "Bryan & Nick Louis - Serviced"
}