{
  "collections": [
    "ChaosMen"
  ],
  "description": "What I took away from Joe is he seems to be a really responsible young man.\nHis mother has been sick many years, and he took over taking care of his siblings. One sister is about to go to college while his bother is in high school. To make ends meet during an emergency, he took out a high interest loan, which he has all but paid down.\nHe was just excited that he would not have that debt hanging over him anymore, and wanted to go to a cell phone store to get himself a flip phone that day. A FLIP PHONE! He had a rather nice smartphone, so I wondered why he would \"downgrade\" to a flip phone. Well, his phone is going away to college with his sister, where were she will get more use out of all its fancy features. He in meantime, could make do with a flip-phone. Nice kid!\nI don't know why I find this sexy. Maybe because so many of the models aren't making sound budgeting decisions, but here is a guy who really took on the role of taking care of the family, and that to me is kind of sexy.\nJoe has had the same girl for the last couple years. He likes anal, and she is down with it, and it sounds like they have a pretty solid thing going. Though I think he neglected to tell her about the naked part of his modeling gig.\nHe has a real slow stroking technique. Joe kind of just pulls down on his shaft to stretch the cock head. So not a fast jerker which means not a lot of motion blur like some of the hummingbird guys.\nAnyway, he is sweet guy, and at the end of the year, I like to thank the members for pulling out their wallets and paying for porn. Joe is a prime example of how doing a little bit of adult work, can make a financial difference in these guy's lives.",
  "models": [
    {
      "name": "Joe",
      "person_id": 3590
    }
  ],
  "release_date": "2013-11-26",
  "scene_id": 2046,
  "tags": [
    "Theme - Solo",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def"
  ],
  "title": "Joe - Solo"
}