{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jonas totally threw himself into this video! He really wants to do more video, so was not going to be shy about returning oral. He says it was his first time, and there is a bit of newbie-ness to his technique. But his skills ramp up and will make everyone wonder.\nHe does start-off pretty unsure as to what to do. He watches the porn playing, keeping his eyes glued to it. Jonas sneaks a peek occasionally at Glenn's cock. Takes him a little time to get hard, but once he was up, he was UP! Glenn reaches over and starts stroking him, while Jonas continues to watch the video playing. Still unsure what to do.\nGlenn will take care of you dude. Relax!\nJonas reaches over and takes hold of Glenn's cock, and he finally looses interest in the TV. The switch gets thrown, and he is way down for having his cock sucked.\nI think we have another amazing performer! Yeah!!!\nThey do some jousting, followed-up by Jonas taking a cock in his mouth for the first time. Yeah, I know \"First Time\" things are a little hard to believe, but some of these guys do try to prove they can push their limits to keep steady flow of work coming. Jonas is very eager to do this full-time.\nThey 69 for a while, followed by Jonas fucking Glenn's face. He climbs on top, and gets his ass rimmed. He writhes around like he is really into it, and I am sure I will get a few emails asking when is he going to bottom. Right now his limits are topping, but I agree, the guy seems like he will be as good a bottom as he would be a top.\nHis cum shot is less than stellar though. If you remember, he arrived really late for his solo, so I think only about 8 hours lapsed from his solo's cum shot, and he didn't really even get much sleep to properly reset. Oh, he busts, but it is not a lot, especially when compared to Glenn, who was shooting like a sprinkler head.\nYou would think Glenn had saved up for days, but had had sex the day before. Talk about throwing rope!\nThough a lot of jizz flies past Jonas's lips, enough hits his mouth to make some cum bubbling action!\nJonas is off to an amazing start!!!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Jonas",
      "person_id": 3589
    }
  ],
  "release_date": "2013-11-13",
  "scene_id": 2048,
  "tags": [
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Glenn & Jonas - Serviced"
}