{
  "collections": [
    "ChaosMen"
  ],
  "description": "I sometimes dread giving you the back-story on some of these videos. This video was supposed to be a flip-flop video with Jordan testing the waters bottoming for the first time.\nWell, that was not to be. Jordan tried and tried and tried but he just couldn't sit on Glenn's cock, which would droop after 90 seconds of fidgeting to get it in. I guess I could have left it in as an OutTake, but as usual, I feel like it spoils the flow, so putting this info in the Summary, doesn't ruin the flow of the actual video.\nThe guys jump right to it, 69ing and rimming each other's holes. Glenn sure can lick like a pro, while Jordan beat back the bush and had at Glenn's hole with his tongue.\nAfter 6-7 misfires with Jordan sitting on Glenn's cock, we reset and tried with Glenn sitting on Jordan's cock, and even then, Glenn took his time accommodating Jordan's thick stick.\nOnce in though, Glenn gives Jordan quite a ride while Jordan matches his pace and begins fucking him fast and hard. Jordan really is an amazing top, so I am not too sad to see he isn't versatile. Or maybe next time I will find a partner with a \"starter\" cock.\nThe two spoon, and I know I just said it, but Jordan is such a great top that he can work this position like no other. I love being able to see Glenn's hole get pounded while he strokes his hard cock.\nGlenn uses Jordan's cock to make himself cum. Jordan unloads all over Glenn's hole, marking him as his Boy for the day!",
  "models": [
    {
      "name": "Jordan Cleary",
      "person_id": 3551
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2013-11-27",
  "scene_id": 2049,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Red",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Glenn & Jordan Cleary - RAW"
}