{
  "collections": [
    "ChaosMen"
  ],
  "description": "When Cullen did his peep, I had no time to really talk with him to find out if he was down for more.\nI had a model not show up, so I texted Cullen to find out if he wanted to jump in and get his cock serviced. He has no wheels, but thought he could rent a car and make the 2-3 hour drive. I needed him here in the morning, but never heard back from him. At about noon the day of the shoot, he sent a text to me that he had secured the vehicle. By then I had already re-arranged the schedule, so he was going to show up and have no one to work with.\nThankfully, the massage table was there to save the day! I got him in to do some nicer photos then the \"selfies\" I had of him, and he was actually eager to get on the table and be serviced.\nWe really didn't talk much. He apologized for being late. Said he was up all night having sex with the car-rental lady, but that he got the car rental for a good price. I was thinking great about the car rental, but was he going to be able to perform?\nInstead, his cock LOVED being naked! Every time he was about to expose himself, his cock would spring to life before it had cleared his the elastic on his underwear. The photos were a breeze, and getting him on the table was no challenge. He never once looked over at the porn playing for him.\nThe video is rock solid, and I loved making him squirm around. He was very responsive to the little bit of ass play, and his cock was ready to the shoot the entire time. He squirts a whole bunch, even surprising me with once with a delayed but big squirt to my face!",
  "models": [
    {
      "name": "Cullen",
      "person_id": 3580
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2013-10-24",
  "scene_id": 2050,
  "tags": [
    "Build - Mature",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Long",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Chest - Hairy/Hair",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table"
  ],
  "title": "Bryan & Cullen - Serviced"
}