{
  "collections": [
    "ChaosMen"
  ],
  "description": "Not only is this a Monster Cock week marathon, but we seem to be having a Troi marathon as well!\nHaving a Monster Cock is great, but I did struggle to find the big guns that wanted to perform fully-interactive, let alone have bottoms that could handle them. Of course, Vander would be featured again during Monster Cock week, and once again, he is on the receiving end of a ginormous cock.\nThis is Troi's first full-fuck film. He has 'reluctantly' fucked guys before, but he admitted he never was with a dude that compared to Vander. A little switch gets thrown, and he was down for everything. Before meeting Vander he was saying, \"No kissing, and definitely no sucking!\"\nThe no kissing rule lasted all of 2 seconds. Just before I was to yell, \"Action!\", Troi turned to me to ask if it was OK to Kiss. YES! Apparently the car ride with Vander to the studio changed his mind!\nAs you all already know, Vander is powerfully sexy...on film and in person.\nThere is just something about Vander's cock that makes you want to put it in your mouth. It is the Mt. Everest of cocks! If you see it, you will want to climb it! Troi has sucked dick once before too, and it was not to his liking, but he totally throws himself into it, eyes watering while his mouth is dripping a ton of drool!\nVander sometimes will lose his wood, and our trick is to have him eat ass. He loves to rim a guy, and getting to go back and forth between Troi's tasty ass and uncut cock, had him hard and ready to sit on his massive cock.\nHe side saddles Troi's dick, and I am pretty sure Troi has never had anyone take his cock up their ass so eagerly and skillfully. I think having it buried deep in Vander's ass made him want to kiss him even more.\nVander really worked his magic on him, and it is safe to say it made Troi's first time a lot of fun and turned him on. He will be back for more in the coming months!\nEnjoy!",
  "models": [
    {
      "name": "Troi",
      "person_id": 3586
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2013-11-01",
  "scene_id": 2051,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "X-Tras - Piercings"
  ],
  "title": "Troi & Vander - RAW"
}