{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bentley was on Summer break from school and wanted to pick up a gig. After his great performance with Solomon, I knew he could take the lead and be a bit more bossy. I asked him if he wanted to try bottoming, but he declined. He is still not there.\nBay can handle a big gun, and he is no slouch in the size department himself. The two had pretty awesome chemistry, and hit-it-off on the car ride to the studio Bentley is usually a quiet dude, but he was a lot more talkative with Bay.\nI wanted Bentley to take charge from the start, and e is a little awkward, but as soon as he has a hole to play with and someone to suck his cock, he gets his groove on. I love the part when they get on the table and use a cock sleeve to joust with, along with some really erotic kissing.\nBay did have to have Bentley go slow when they started fucking. I think Bentley is the thickest cock he has had up in him, so he was forging new ground. Bay's cock does loose some of it's firmness as he tries to accommodate Bentley's big piece of meet, but by the end, his cock was screaming to cum.\nBentley sure knows how to work a dude's ass!! How'd that happen?! He has always been so reserved!\nBoth guys are amazing in this video, proving they have what it takes to be porn stars!",
  "models": [
    {
      "name": "Bentley",
      "person_id": 3486
    },
    {
      "name": "Bay",
      "person_id": 3554
    }
  ],
  "release_date": "2013-11-15",
  "scene_id": 2055,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Sex Act - Massage Table"
  ],
  "title": "Bay & Bentley - RAW"
}