{
  "collections": [
    "ChaosMen"
  ],
  "description": "Finishing up Monster Cock week with a rather thick piece of meat!\nApollo initially was very concerned about getting head from a guy. He debated doing the oral video, and only wanted to fly to Austin to do the solo. I already had a peep video of him, and even though we get a much clearer view of his jerk-off process with a studio solo, I wasn't sure it would be worth flying him out for 'just' another solo.\nSo we talked a bit, texted, emailed, and he finally came around to receiving head.\nHis solo, as you know from yesterday, went very well, and it gave him a lot of confidence to work with a dude. I had set the shoot up to be the standard \"lay on your back and watch your porn\" instead of a side-by-side, but when Apollo saw how I had the room configured, he thought it would be strange and he said he would likely be fine if Glenn took his cock out too. Just no sucking back! Props to him for pushing his limits given how sketched out he was in the first place.\nIt did take him a while to get hard (the magic of editing!) but once up he was up he stayed solid. He would look from the porn playing, to Glenn, to me/the cameras, and generally had a pretty easy time.\nHe enjoyed the ass eating a lot, mostly because he has a dominant streak in him and the licking felt good, but also he could relax and not worry about his dick staying hard.\nAfter that, the shoot got a lot easier for him. He \"let go\"a and really began to face-fuck Glenn. Glenn took it as a personal challenge to deep throat Apollo, plus they had time to chat before the shoot and they got along great.\nGlenn is a lot like Ransom now. He knows when a guy is good or promising, so he goes the extra mile to make the dude feel comfortable and kind of \"up sells\" doing the whole gay-for-pay thing. He truly enjoys working at ChaosMen, and when he sees potential, he wants them to come work here too.\nNot sure why Glenn is the dude who always gets cum in his eyes (well in this one he pretty much puts his eyes right in the line of fire) but he once again took a major facial that nailed his right eye. We sent him home once again with the Red Eye Badge of Honor.\nTook Glenn a little bit to nut. Very hard to focus with a burning eyeball, but he ramps up and Apollo even helps to encourage him.\nWhen I dropped Apollo at the airport, he seemed pretty certain he would be back to do more, so hopefully we will see his thick dick splitting a guy in two! But I am not holding my breath!",
  "models": [
    {
      "name": "Apollo",
      "person_id": 3583
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2013-11-03",
  "scene_id": 2057,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Apollo & Glenn - Serviced"
}