{
  "collections": [
    "ChaosMen"
  ],
  "description": "After getting Apollo's peep video sent to me, I knew I had to get him in for a proper solo. With Troi being prominently featured on the site 3 times during Monster Cock Week, I thought I would do the same with Apollo. Variety is great, but packing their videos in does give a sense of \"tune in each day\" type of feeling.\nApollo was pretty sketched-out about flying here to get his dick sucked. He was fine with the solo, but I did convince him to at least get head while here. So stay-tuned for that video tomorrow.\nToday though, we get a much clearer look at his really thick Greek cock. He is uncut, but his foreskin is minimal. He pretty much jerks off like a guy without foreskin, but occasionally he uses it as a cock sleeve.\nHis solo went really smoothly given how nervous he was before flying here. Once he got to the studios, he immediately relaxed, and was eager to show-off his thick dick. I had of course told him to grow out his pubes, and he considered what he had \"grown out\" ~sigh~ Ironically, the straight porn he was watching had several guys with full-on pubes and he finally \"got\" that the shaved up pube thing was \"out\" in straight films as well.\nHis cumshot is awesome. His cock gets about 30 percent bigger when he ramps up. He was basically ready to shoot the entire video and came within a minute or so of putting his mind to it. I wish all cum shots went so quickly. His cock gets so cum covered that you just wish you were there to lick it clean for him.\nThis dude really needs to be doing porn, and after his visit here, I think he may be down for doing more.\nIf you wanna see his Monster Cock down someone's throat, stay-tuned for tomorrow!",
  "models": [
    {
      "name": "Apollo",
      "person_id": 3583
    }
  ],
  "release_date": "2013-11-02",
  "scene_id": 2060,
  "tags": [
    "Theme - Solo",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Apollo - Solo"
}