{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is one of those videos with an outtake at the end that kinda shows why the video is somewhat shorter than others. It explains a lot, after the fact. Don't read on if you don't like spoilers.\nI had finally got Braxton talked into sucking cock, and just after about 3 minutes of him sucking on Wren's cock, he nuts in his mouth. No real warning, though I did think that Wren's foot was cramping, but instead Braxton is spitting jizz out of his mouth.\nNeedless to say, that created a little tension on the set. Wren was certain he could cum again, and actually stayed fairly hard, but Braxton's game was thrown for a bit. He of course was mad a dude shot in his mouth, and we had to take a few minutes to get some mouthwash in his mouth. He dives back in, but he might to be gun shy his next couple videos. (He wasn't!)\nI have never had this happen before. Guys usually can't cum from a blowjob, but Wren said he waited a whole week to not ejaculate. I asked Wren why he didn't stop him from sucking and he said he didn't want to ruin the video. Well, cumming in a dude's mouth by surprise, his first time no less, was definitely going to create more problems than simply yelling \"Stop!\" Newbies!\nSo Braxton's cock-sucking is pretty quick as Wren busted so soon, and Braxton was not eager to put the cock back in his mouth. Braxton is a little bit wobbly as he gets his own cock sucked. He still had the taste of cum in his mouth.\nBut after they start fucking, things smoothed out. Wren does like to bottom, so him staying hard while getting fucked was no problem. I don't know if it is because I saw the accidental cum in the mouth thing, but Braxton does have a bit of a shield up the rest of the video. He is so great in front of the cameras, a total natural, but he for sure had some residual animosity going on. Thankfully he turned that into a bit of an angry fuck, which still plays well.\nBraxton fucks the second load out of Wren, and then spins him down to the ground to do some pile driving fucking. I love it when I get guys whose cocks are hard at any angle. He ramps up and totally fills Wren up!\nAt least we have Braxton broke in on sucking cock, though he will likely a lot more hesitant about it in the future. (Again, he isn't!)",
  "models": [
    {
      "name": "Braxton",
      "person_id": 3576
    },
    {
      "name": "Wren",
      "person_id": 3581
    }
  ],
  "release_date": "2013-11-25",
  "scene_id": 2061,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Video - OutTake"
  ],
  "title": "Braxton & Wren - RAW"
}