{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jonas's first time up to bat with a dude and he does awesome! It helps that Theon is a polished performer and guides him through his first time on the massage table.\nWhat I have noticed about Jonas is that he seems to enjoy not only getting his cock sucked, but sucking it as well. For the porn he likes to watch to get in the mood, he sticks to girls sucking dick and getting a facial. I think it is apparent during the cock sucking that he is truly turned on by watching someone slide their mouth down his cock, and he is equally happy to service someone.\nTheon gives his fantastic ass some special attention, and don't worry, I have already planted the notion that he should try bottoming. Given that Theon could easily take his cock, Jonas doesn't seem as fearful that it is gonna hurt.\nTheon rides Jonas on the table while laying on his back, and Jonas seems a little wobbly in that passive position. But once Theon hovers so that Jonas could get some thrusting action, I knew we had a guy who likes to be in the active/dom position. Wow! That long dick of his travels the distance!\nJonas clearly likes to have people take his cock in any hole, and once he was upright, he was slinging his sword in and out of Theon with ball-slapping action. His cock truly looks like an upward tilted sword, and he thrusts like he is not taking any prisoners.\nThis is the first time I have seen Theon's cock not stay at a hundred percent while getting fucked. Theon really let Jonas have his way with him, mostly because the fast fucking was turning Jonas on so much. Theon likes a slow grind, especially to make him nut.\nAfter getting him on his back (and a note from me to try not go balls deep on poor Theon) his cock got to full-mast and was busting in no time.\nJonas tries to ramp up and shoot once on the hole, but it was his first time and basically unloads deep inside Theon. So for those of you who like the full breeding action her ya go!\nJonas had fun, and pretty sure he will keep coming back for more!",
  "models": [
    {
      "name": "Jonas",
      "person_id": 3589
    },
    {
      "name": "Theon",
      "person_id": 3535
    }
  ],
  "release_date": "2013-11-22",
  "scene_id": 2063,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding",
    "Sex Act - Massage Table"
  ],
  "title": "Jonas & Theon - RAW"
}