{
  "collections": [
    "ChaosMen"
  ],
  "description": "Cooper Reed asked if he could come in and do some videos with ChaosMen. He has a large body of work, but he is about as nice as can be, and he said he was down for whatever. He said he has mostly topped and that perhaps fans would like to see him bottom. (Again?)\nI had always heard great things about him, and in person he is even better. Sweet Southern drawl, polite, kind, and a joy to hang with. I am totally on the Cooper Reed bandwagon!\nI didn't really have anything setup that he could do as a duo, but I did want to get a TagTeam going for the Holiday Marathon. Gavin had been hitting the gym extra hard, and even though Cooper said he would bottom, I wanted Jet on hand to flip-flop just in case bottoming was more of a challenge for Cooper than he remembered.\nHe is a tough little guy, and not a complaint as he sat on Gavin's cock. Though, not much he could say with Jet's dick shoved down his throat. Jet also fucks Cooper, and I love seeing him laying on his back while being spit-roasted between Jet and Gavin.\nI knew Jet would love being fucked by both guys. Jet and Gavin already have worked together, so they know each other's moves. Gavin fucks the cum out of Jet (Huuuuge load!) then dumps his own load inside Jet.\nCooper, the pro that that he is, uses Gavin's cum to fuck and shoot in Jet's ass, combining both loads.\nAs usual, most TagTeams run long, so it is a bit of a download, and with the servers dishing out videos all week long for the Marathon, be patient as this one will take some time.\nBut of course, well worth it!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2013-12-27",
  "scene_id": 2069,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Cooper Reed & Gavin Sevin & Jet - TagTeam RAW"
}