{
  "collections": [
    "ChaosMen"
  ],
  "description": "Mark Stevens has a new baby, so was eager to make some money. He seems 'mostly straight' to me, but put a hot guy in front of him, and he goes full-on gay. Mark loves sucking dick, and apparently, he is great with getting fucked. Mostly, I think he likes to be dominated.\nWe both had some reservations about putting him with Troi for the first time getting fucked on film. Troi doesn't really have a \"starter\" cock. I explained to him that Troi is more long than wide, and longer ones are easy to deal with. As long as he could control the depth, he would be fine. There is just no escaping a wide cock, no matter how far you go in, or not go in, it is ALWAYS splitting you in two.\nTroi and Mark got a long great and they had instant chemistry. Troi seems to have a bossy side to him and I have figured out that he loves to just kick-back and let the other person do all the work on his amazing uncut knob. Mark was eager to please, and gets all piggy and subservient.\nI didn't want Troi to just sit back and be serviced, so Mark suggested he could handle some face fucking. And he sure did! Makes my eyes water watching it! Troi just keeps face fucking him, gagging him over and over.\nMark was a little worried about taking Troi's cock, so we start with him just sitting on it, controlling the depth. His biggest fear was Troi going balls deep on him. Well Mark just sits right down on it, and goes, well, balls deep! What happened to taking it slow?\nTroi is a little wobbly until he can start thrusting, and Mark gets ball-slapped like a pro.\nA couple times you hear Mark call him \"Sir\" so Mark naturally seems enjoy being a piggy passive bottom boy.\nIn the past, Mark had cum while riding a cock, grinding around on it till it hits his sweet spot, but I struggle with the \"believability\" of that angle. It always looks like they are grinding around on a soft cock, balls being smashed. between cheeks\nI told him on his back usually does the trick. He really didn't think it was going to happen, but I really had to move fast to catch his cum shot. Worked like a charm, and now he is even more eager to come back to get fucked.\nAnd isn't Troi turning out to be quite the amazing performer!?",
  "models": [
    {
      "name": "Mark Stevens",
      "person_id": 3573
    },
    {
      "name": "Troi",
      "person_id": 3586
    }
  ],
  "release_date": "2013-12-25",
  "scene_id": 2070,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Mark Stevens & Troi - RAW"
}