{
  "collections": [
    "ChaosMen"
  ],
  "description": "How about a Ginger to start off your week?\nStig is an energetic and amiable guy. Very easy to talk to and eager to give porn a try. He was a little skeptical at first, but once he realized it all was legit, he just ran with the whole process. Wasn't even shy about showing his ass off. Very different demeanor from talking with him on the phone beforehand.\nHe of course loves the ladies, and had lots of questions for me like, \"Why do you like guys?\" \"How can you not like girls?\" etc. Like I was kinda the first gay guy he talked to. So we had a little educational seminar on the drive to the studio.\nHe does personal training, but hasn't really figured out what it is that he wants to do in life. He didn't go to college, so he is still finding his way, and I get the feeling he needs to wander the world, if budget allowed, to get out of his small framed world and explore everything.\nHe works a lot, so seldom has time alone to jerk-off. Which also means he doesn't get to watch a lot of porn. In this day in age, I run into guys who have seen it all, and are used to clicking video after video on tubesites, finding the right girl to nut with. It can be challenging to find a video they like.\nNot Stig. I tossed on the first thing and his cock was hard before sliding his underwear off.\nDespite not watching a lot of porn, he performs like a pro, sliding his foreskin slowly then rapidly, giving us a nice show. And as I said, he is not shy about showing off his pink hole!\nAnd of course if you like the fire pubes, he was kind enough to grow them out for us.\nStay-tuned in two week for a little oral entertainment! Next week is the T-day marathon, and I couldn't \"stuff\" him in!",
  "models": [
    {
      "name": "Stig",
      "person_id": 3594
    }
  ],
  "release_date": "2013-11-18",
  "scene_id": 2072,
  "tags": [
    "Theme - Solo",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Red",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Stig - Solo"
}