{
  "collections": [
    "ChaosMen"
  ],
  "description": "Aron and Stig are quiet in this video. Aron is kind of a \"on the down low\" type of guy. His experiences with guys have always been a drunken or stealthy type of incident, and that vibe certainly is carried to this video.\nStig is just nervous being around another dude and his cock, but I did ask him if he was fine doing a side-by-side, or if he just wanted to lay there and be serviced. He didn't think it would be a problem, as long as he didn't have to suck back.\nAron was hard first, but Stig was right on his tail. His hands were a little shaky, and I got the feeling he was actually vibrating with sexual tension.\nNormally, the guys will wilt at some point during one of these videos. Either they stayed away from watching their porn too long, or they get a reminder a dude is sucking them off. But Stig was staying strong, so I figured we could push him a little.\nAfter Aron blows Stig, I set them up so they could push their cocks together and Aron could jerk their uncut cocks together. Stig actually takes over and jerks them, and I believe even jerks off Aron. Baby steps, but I was really pleased he took charge for a while.\nStig is a pro at cumming too. He just puts his mind to, ask where it needs be laid, and a minute later he is nutting. I did try to get the two to fire at the same time, and Aron was close, but Stig filled his mouth up with jizz and it did kinda throw Aron off his game.\nStig's loads turns clear in the time it took Aron to nut, but I gotta give props to Aron for taking another open-mouthed facial and still managing to nut with cum dripping down his cheeks. I really like Aron's vibe, and will likely get him in to do more stuff.\nAs for Stig. Who knows? He seemed down for more work, but we will have to wait and see what you all think!",
  "models": [
    {
      "name": "Stig",
      "person_id": 3594
    },
    {
      "name": "Aron",
      "person_id": 3572
    }
  ],
  "release_date": "2013-12-04",
  "scene_id": 2081,
  "tags": [
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Hair - Red",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Aron & Stig - Serviced"
}