{
  "collections": [
    "ChaosMen"
  ],
  "description": "A very straight-forward Edge video.\nCarlos was not really down for an oral video, but when he saw the Edge chair and asked about it, he decided he could do it. I didn't have the heart to tell him that normally we do some \"extras\" to spice the video up. Once he mentioned he could do it, I wasn't about to quibble to get him to do more.\nTied, blindfolded, and with hot girls getting banged on the headphones, that was enough to get him charged up. His cock springs to action with just a few gentle prods. Likely a mistake to have put him in such tiny briefs- not much room for him to hulk-out in, but I liked seeing him in that color and well, he looks pretty amazing in them.\nHe is fairly quiet until I bring out the Fleshjack. That got his attention, and true to an edging theme, I had to pull it off of him a couple times or risk a premature happy ending.\nI did get him out of the chair to showcase and rim his ass. He was very tight-assed about showcasing his hole, but I pushed through. He has strong butt cheek muscles! I also milk his cock from behind, just like..well... being milked!\nThe Fleshjack was doing really well, and I don't think I have ever used one to make a guy cum, so I decided to see if I could time it just right.\nIf you watch, he starts to unload, and I pull it off to finish him off, and give you some evidence! He must have shot a couple major squirts up into the toy, because it comes dripping out while I jerk the final half of his load out of his uncut cock.\nLike I said, a very straight forward and not very fancy Edge, but super pleased that he even did an oral themed video. I think you will be too!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Carlos Garcia",
      "person_id": 3597
    }
  ],
  "release_date": "2013-12-18",
  "scene_id": 2092,
  "tags": [
    "Build - Hairy",
    "Cock - Hung",
    "X-Tras - Tattoos",
    "Build - Mature",
    "Ethnicity - Latin Guys",
    "Sex Act - Toys",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Bryan & Carlos Garcia - Edge"
}