{
  "collections": [
    "ChaosMen"
  ],
  "description": "Braxton wanted to test out playing with his backdoor, but didn't want to commit to a full-sex scene. So I figured an Edge video might be a good way to test his ability to take a cock.\nHe was in town to do a scene, but his return flight was not till late the following day, so we tossed this together. Braxton has trouble staying hard in his previous videos, but the one he shot the day before, he was finally relaxed and confident and performed so much better. This video is another example of him just accepting it all, and his cock never stops wanting to be stroked.\nI did use a jack-off sleeve on him. You may notice the sound of splashing water as I reach for it. Here is an \"at home \"trick\" you can do do. I have found soaking the sleeve in scalding hot water for 10-15 minutes warms it up. I have tried warming t he lube as well, but gotta watch its not too hot (They need to make microwaveable lube with a heat indicator just like maple syrup)\nAnyway, starting with a warm wet sleeve really amps up the sensation of fucking a hot moist hole. Just be sure to do a finger test first to be sure it's not too hot. Generally speaking, super hot water from a faucet is fine.\nMost of the fantasy elements are me just trying to break into Braxton's backdoor. Trying ever larger toys, keeping him hard, and balancing the pain and pleasure thing.\nWhen it came time to fuck, he took it like a champ, so all the prep really paid off. I don't think he fears it nearly as much, and perhaps can become a more versatile player like Glenn.\nBraxton likes to jerk-off super fast in order to cum, so I worked up a sweat making him cum! Phew!",
  "models": [
    {
      "name": "Braxton",
      "person_id": 3576
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2014-01-08",
  "scene_id": 2098,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Pubic Hair - Trimmed",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding",
    "Theme - RAW"
  ],
  "title": "Braxton & Bryan - Edge"
}