{
  "collections": [
    "ChaosMen"
  ],
  "description": "Zarek did really good on his Solo, and was totally down for full-interaction with a dude. Topping or bottoming. As you all know, I try to take most guys go through an oral video to work out any issues we might have.\nZarek had emailed me a couple days before the shoot, letting me know he was very eager to make more money on his trip, and would do whatever. I let him know about checking out his energy and skills, and of course, the testing process, that I was glad he was eager, but likely would stick to the plan.\nAs it turns out, he did balk once he was put in the situation with another guy. Glenn's cock, as usual, springs to life easy. Meanwhile, Zarek has a look of panic when he realizes his cock is letting him down. Glenn just slides it next to him, sucking his cock for a bit, but Zarek still seemed nervous and wobbly.\nWe switch gears and Zarek blows Glenn, and he totally throws his mouth and hand into it. Not exactly skilled, but he was enthusiastic and had no problems keeping Glenn hard. He was proud of that after the shoot, and didn't have the heart to tell him that once Glenn is up, he is UP until he busts.\nRegardless, it seem to relax Zarek, and after getting his ass rimmed, he and his cock got a lot more confident.\nOf course the best part of any Serviced video is the cum shot, and Zarek did not disappoint on this count.\nBoth Glenn and I thought for sure we would be in it for a long haul, so I made sure Glenn was nice and comfy for a long wait. But about a minute after he put his mind to it, Zarek busts a MAJOR load all over Glenn's face and mouth.\nTook Glenn a bit by surprise, but pro that he is, a minute later busts his own copious nut. Not sure what that boy is eating, but his loads just get bigger and bigger.\nIf you love amazing facials, this one rocks!!!",
  "models": [
    {
      "name": "Zarek",
      "person_id": 3605
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2014-01-15",
  "scene_id": 2104,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Chest - Hairy/Hair"
  ],
  "title": "Glenn & Zarek - Serviced"
}