{
  "collections": [
    "ChaosMen"
  ],
  "description": "I love this video!\nNot only because I get to see Cooper Reed sit on Troi's giant raw cock, but because Troi finally bottomed!\nThe video was supposed to be a TagTeam 3-way, but the third guy was a No-Show. He was going to do a lot of the heavy lifting for the bottom position.\nCooper said he would be fine bottoming, but I told him Troi was rather endowed. He said he had taken big cocks before, so didn't think it would be a that challenging. Troi didn't exactly volunteer to bottom, but I kinda made him feel guilty for being so horse-hung, and that Cooper was exactly the guy he should try bottoming with for the first time.\nCooper is very confident and stays hard when topping. So he can do a nice slow insert, without rushing. Some times the top fears that he will lose his wood and rushes that first insert. So I wasn't blowing uhhh..smoke up Troi's ass. Cooper was truly a great pick for Troi to have his cherry popped with.\nBoth guys are uncut, and I think they did a great servicing each others cocks. Troi seemed to jerk and suck Cooper's cock with a lot more confidence. I think even Cooper enjoyed working with a cock that was more to familiar to him.\nCooper gets Troi doggy-style and licks his hole, getting it all nice and slippery wet. He manages to get a couple fingers in there in order to loosen him up. There is a little bit of 69-ing and another first for Troi, rimming Cooper's amazing back door!\nTroi had managed a VERY small toy before the shoot, but still didn't think he would be able to take Cooper's dick. But Cooper slowly gets it into him. You can even hear his skin stretch! (Oh wait, I think that is Troi fucking Cooper!) Troi is not terribly hard during his first fucking, but as Cooper builds up steam, his cock starts to enjoy the feeling and wakes up.\nEven better, Cooper fucks him then climbs on top of Troi and makes him suck/clean his cock. Ass to Mouth fans will love it!\nCooper then sits on Troi's cock, and he swears it is is the biggest cock he has sat on. Fans of Cooper Reed can likely debate it, complete with photo evidence, but for Cooper, it definitely seemed like the most ginormous cock he had ever taken!\nThe dude is such a champ and just slides up and down on it, working Troi's uncut cock way up into his gut!\nTroi creampies Cooper's hole, shoving his creamy load up inside of Cooper.\nCooper then give Troi his first facial. Not exactly an \"in the mouth\" type of facial, but he did have his mouth open, and the cummy kiss at the end had them mingling the load between the two of them!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Troi",
      "person_id": 3586
    }
  ],
  "release_date": "2014-01-24",
  "scene_id": 2106,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Cooper Reed & Troi - RAW"
}