{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had been wanting to get Tatum back in. Fans of hairy guys have been asking for him back, and he read on some message boards that he should grow a beard, so he showed up even furrier than before.\nTatum also had been training for a body building competition, while Gavin has been hitting the gym extra hard, so I figured I would put two muscular dudes, one hairy, the other smooth, in a scene together.\nBoth guys had not had sex in a long time. Gavin had been visiting with family, and Tatum has been out in the country. Both guys stopped the video a couple times because they were about to nut. Rarely do I have the problem when both guys are struggling to NOT cum.\nTatum has turned out to be an amazing bottom. He truly really likes to get fucked. Either riding, doggy-style, or on his back, Tatum's cock is loves having Gavin fuck his hole. A couple times he had to stop from being fucked or risk nutting.\nThis scene was literally a race to see if we could get enough footage before either accidentally ejaculated.\nSo I thought that I would try to get Gavin to fuck till he cums, a nice internal cumshot, and maybe if we were lucky, Tatum would nut at the same time. It is usually very hard to get this, so it is a bit like the unicorn of porn mythology. I have seen it in a couple videos of course, and got it myself, and the guys usually are just shocked or smiling unbelievably.\nI tried to edit the cums hot perfectly for you all, to get the full effect. The internal breeding, then Tatum nutting and his load raining down Gavin's cock and as he drains the rest of his cock into him.\nDefinitely and award winning finale!",
  "models": [
    {
      "name": "Tatum Parks",
      "person_id": 3496
    },
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    }
  ],
  "release_date": "2014-01-10",
  "scene_id": 2109,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Gavin Sevin & Tatum Parks - RAW"
}