{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would get my \"most tatted-up\" guys together. Both guys have an appreciation of tatts, Shiloh was down to play with Braxton, with or without tattoos.\nShiloh normally likes to Top, but Braxton was not quite ready to Bottom. I get Braxton over his reluctance to bottom during an Edge video, so if you want to see him get fucked for the first time, then keep a look out for that video later this month. Despite his Top Dog attitude, Shiloh didn't hesitate when asked to bottom for Braxton. I think it is safe to say that Braxton is totally his 'type' of guy.\nAnd with that, Shiloh hungrily and expertly sucks Braxton's cock. He is local, and I might have mentioned it before, but his skill level makes me want to get him on cock-sucking duty. He does struggle a bit to stay hard when Braxton sucked him. Not sure if it is because Braxton has zero cock sucking skills, (He has em! I know from first hand experience!) or if Shiloh was a bit nervous doing his first full-interactive video. I think it was the later.\nSo not a lot of cock-sucking in this video. It is mostly Shiloh riding Braxton's dick, or getting rammed by it.\nThe best of course is the cumshot. We didn't do the breeding thang, as I wanted to mix it up a bit. Braxton expertly aims his cock, and totally floods Shiloh's mouth with his load. It is PERFECT!\nShiloh swallows his load, then Braxton spins around and makes him eat his ass, encouraging Shiloh to bust his own nut.\nShiloh cums, and then Braxton feeds him his own load!",
  "models": [
    {
      "name": "Shiloh",
      "person_id": 3598
    },
    {
      "name": "Braxton",
      "person_id": 3576
    }
  ],
  "release_date": "2014-01-03",
  "scene_id": 2110,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Build - Swimmer",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Braxton & Shiloh - RAW"
}