{
  "collections": [
    "ChaosMen"
  ],
  "description": "A couple weeks ago I as commenting on how Tatum had turned into an amazing bottom, and I feel the same way about Wren.\nHe never seems to balk at any cock tossed at him, and Jordan's cock is actually quite thick and a challenge for most. Wren's cock seems to love being pounded by Jordan, who relentlessly drives his dick over and over into Wren's hole.\nEven being ridden flat on his stomach, Wren's cock lays backwards out behind him, his balls crushed. His cock never seems to wilt as Jordan pleasures his own dick, going in and out of his hole over and over again.\nThe dude really likes to get fucked, and Jordan, really likes to ram his cock inside him!\nWren does confuse me a little. He sounds pretty straight. Has a very deep voice, and sounds like a stoner dude when he talks. His primary interest is women, and often when he is around, he is texting or calling some girl, showing me a picture now and then of who he is trying to get busy with.\nAnd then to see him in this video, where he is clearly having a great time servicing Jordan's big knob, then being drilled with it. Just makes me wonder what side of the sexuality fence Wren will land on. Maybe he will sit right in the center.\nAnyway, this is a rather long video as Jordan really fucks him long and hard, and I just never could yell \"Cut!\" nor edit out any part of the video. Watching Jordan dive in and out of his hole relentlessly was just too amazing to trim down!\nEnjoy!",
  "models": [
    {
      "name": "Wren",
      "person_id": 3581
    },
    {
      "name": "Jordan Cleary",
      "person_id": 3551
    }
  ],
  "release_date": "2014-01-31",
  "scene_id": 2112,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Red",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Jordan Cleary & Wren - RAW"
}