{
  "collections": [
    "ChaosMen"
  ],
  "description": "So many things to love about this video!\nTwo hot bodies, evenly matched and both hungry for each other!\nThey start off kissing and jousting with their tongues and cocks. Cooper tosses Solomon on to his back and sucks his cock until he throws his legs up over his head and literally starts lapping up his butt hole. Some of the best rimming on the site!\nCooper then climbs on top and makes him suck his cock. Solomon loves being dominated, so eagerly tries to please him. Cooper then spins around, making him lick his ass, but treating Solomon to some more cock-sucking.\nWe had planned on Cooper topping Solomon this entire video, but Cooper spins on around and sits right on Solomon's cock.\nThis unexpected surprise made me really happy. I have to say, Cooper's ass is amazing and it looks awesome with Solomon's cock sliding in and out. Cooper works up a sweat, riding his cock in every angle.\nThen it was Solomon's turn, and Cooper takes no mercy on him. Doing push-ups deep into his ass. Solomon is on his game, cock throbbing the entire time.\nThis video has some crazy hot action between two elite dudes! You don't wanna miss it!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Solomon Aspen",
      "person_id": 3449
    }
  ],
  "release_date": "2014-02-07",
  "scene_id": 2122,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Cooper Reed & Solomon Aspen - RAW"
}