{
  "collections": [
    "ChaosMen"
  ],
  "description": "Colt has done video work before, but he is a Texas boy, and thought it would great to have someone more local jump in and do some hot scenes. He is looking very Ashton Kutcher right now, and I just love those full and natural pubes!\nHe used to do a lot of camming, but the burn out on that is usually a month or so. Jerking-off for hours and hours turns play time into tedious work. Might sound like fun to sit around and jerk-off all day, but it does make it a lot less fun doing it over and over.\nFor his solo I had him use a Fleshlight, seeing if we could mix-it-up a little. He was not used to having multiple cameras, and because he cams a lot, he is used to watching himself on his monitor to make sure he is in position. So I think he spends a fair amount of time looking at himself to make sure he is on mark.\nNot to say the video is not hot. He IS an entertainer, and clearly he loves fucking his toy.\nI got some great shots of him slamming into the toy while it is braced on the side of the bed. Gotta remember this trick! Looks awesome watching his cock slide in and out. I like these new smaller FleshJacks, but have to admit that they really need to make them clear so we see the dude's cock.\nI suggested he take the outer casing off and just use the fleshy part kind of as a giant foreskin, and he gets really jerking fast as his cock gets closer and closer to nutting.\nHis head pops out the top and starts spurting cum everywhere. Truly and amazing cum shot for a solo!\nI likely will get him in to do more. An oral next week, and I already see that he needs to push his energy when working with another dude, but I think, like Glenn, there is an energetic performer in there, and will see if we can push him to become the elite performer I know he is!",
  "models": [
    {
      "name": "Colt McGraw",
      "person_id": 3611
    }
  ],
  "release_date": "2014-02-10",
  "scene_id": 2124,
  "tags": [
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Video - HD - High Def",
    "Build - Swimmer"
  ],
  "title": "Colt McGraw - Solo"
}