{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sage is a young natural body builder. He is of mixed-heritage, Mexican, Spanish, Southern European. His hair color, while not technically a \"red-head\" is a bit more typical in places mentioned, as well as Argentina and Uraguay where Northern European genetics get into the genetic stew.\nBut I likely won't start an 'Auburn' hair color category, and for our purposes, he will be considered a red head, right down to his pubes. I am sure Ginger fans will beg to differ.\nSage is a super nice kid. Very polite and eager to please. He did drop a 90 pound dumbbell on his right shoulder a couple weeks before the shoot (sounds like he needs someone to spot him, any volunteers?) so I did a little makeup on the residual bruising. Hope it is not too distracting!\nHe is a brutally handsome guy, with a killer body, and thick, uncut cock. He has always wanted to do porn, and has a friend who has been doing gay porn as well, so he is not coming into this totally bewildered. He was eager to do more than just a solo and oral on his first visit out, but I of course wanted to see how he performs before pairing him.\nHe loves fucking a girl in the ass, so he thinks fucking a dude would be equally easy.\nI couldn't be more happy with the way this guy performs. You literally see his cock wake-up in real time in under a minute. He is a horny dude, and gives us a great show of playing with his ample cock. Super easy to nut, with a copious amount of cum.\nHis ass is equally amazing, and he is not shy about showing his ass off, or winking his butt-hole at us.\nThis dude has got some serious desire to be sexy and show-off. A true exhibitionist!\nHe will be back next week to have the jizzed pulled out of him!",
  "models": [
    {
      "name": "Sage",
      "person_id": 3610
    }
  ],
  "release_date": "2014-01-27",
  "scene_id": 2126,
  "tags": [
    "Theme - Solo",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Hair - Red",
    "Video - HD - High Def"
  ],
  "title": "Sage - Solo"
}