{
  "collections": [
    "ChaosMen"
  ],
  "description": "Since Mark does massage in his daily life, I thought we would start-off with a nice sensual bed massage. Gavin has been hitting the gym extra hard, and was complaining on the ride to the studio that he was sore from the intense work outs. Mark chimed right in that he could take care of his muscles.\nI hadn't planned on setting up the table, and I think Mark prefers to climb on top and really get at those tense muscles. I was a little worried Gavin might drift off to sleep. He had a 6am flight that morning, and I think he might have not even went to bed for fear of missing his flight.\nBut Mark kept him \"alert\" and up for more action. I love that Mark can get all piggy-like. He is primarily into women, but he sure does have a thing for eating ass and sucking cock! He readily admits to it! He doesn't seem too interested in himself getting off, so we have the makings of a truly passive facilitator.\nGavin has it easy as he gets totally serviced. Mark spins around and sucks his cock, while Gavin rims his hole, fingering it and getting it ready to be fucked. Mark slides down and sits on it, milking Gavin's cock with his ass.\nNot sure if Gavin has been not getting enough sex at home, but I think this is the third movie in a row where we have to stop a couple times because he gets too close to nutting. Either that or he is really beginning to like fucking dudes!\nGavin eventually get up off his back and takes a more active position, fucking Mark flat and doggy style. We get a little ass to mouth action too!\nHe eventually rolls him up and begins to fuck him super hard. We weren't quite ready for Gavin to cum, but that position finally did him in and he suddenly starts to fill Mark up. He pulls out to give us a show, but dives right back in. Mark's hole must feel amazing!\nWe had to reset, Gavin was exhausted, and I wanted to take advantage of Mark's love of rimming. He unloads all over Gavin's back and ass, spreading it all over his hole, the eating out of his ass! Oink!",
  "models": [
    {
      "name": "Gavin Sevin",
      "person_id": 3498
    },
    {
      "name": "Mark Stevens",
      "person_id": 3573
    }
  ],
  "release_date": "2014-02-14",
  "scene_id": 2127,
  "tags": [
    "Chest - Smooth/Natural",
    "Hair - Bald",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Creampie Breeding",
    "Sex Act - Massage Table"
  ],
  "title": "Gavin Sevin & Mark Stevens - RAW"
}