{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video pretty much started with out me. Before any 'interactive' video, I have to take some initial shots of everyone for the thumbnail for the site. This means everyone posing with shirts on, and shirts off.\nI got Jonatan and Skyler up on the bed, telling them to move \"closer...closer....closer\" I get one shot of them next to each other and they start exploring each other's bodies. Ok, I can work with that. Snap Snap.\nNext thing I know they are going at it like horn dawgs. Well, I guess I don't have to worry about chemistry! I quickly put my still camera down and got my video camera rolling as fast as I could. I ended up with one half way decent thumbnail image, but even then you can see Skyler is more interested in Jonatan then getting his picture taken.\nThe video pretty much shot itself. They had so much energy and were clearly way in to it that I just had to stay out of their way. I loved watching them fight for dominance. You can tell Skyler gets turned on by grinding his dick in to something, but he was great at bottoming for his very first time. I was pretty surprised to see them kissing on each other too.\nAs for Jonatan, he couldn't believe he was taking on virgin ass, and I love listening to him talk under his breath when he is admiring Skyler's ass. It's the real thing.\nFinally, I added just a few bonus clips after the movie. Let me know if you like the behind the scene shots. I think I put these movies together pretty well, and I make it look so easy, you might not believe it was Skyler's first time getting fucked. So you get to see some of the \"real\" process. If you don't like spoilers, then don't watch beyond the end graphic!",
  "models": [
    {
      "name": "Skyler",
      "person_id": 7242
    },
    {
      "name": "Jonatan",
      "person_id": 3122
    }
  ],
  "release_date": "2006-05-12",
  "scene_id": 349,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Jonatan & Skyler - Wrapped"
}