{
  "collections": [
    "ChaosMen"
  ],
  "description": "The third and final(?) installment of the \"Edge\" series is here!\nI am completely blown away by the response I get to these videos. Your emails are VERY appreciated, so keep them coming! Seriously, if I don't hear that you all like them, then I wouldn't make more. I would assume you all are staying quiet 'cuz you are being too polite to say I should stop.\nMy goal was to do something different from other sites, still taking a tried and true formula (dude gets serviced ) but editing it and. I dunno, just making something physically hot as well as psychologically hot.\nThe \"fantasy\" sequences are usually the topic of many emails. No, there isn't going to be more. No, I'm not going to play the \"whole movie\" These ARE the whole movies (grrr), and if I played more bits, it would lose its..uh..edge.\nAfter the success of the first one, I pretty much mapped out the things that could be done in this format, and realized that only about three things could be done, hence the trilogy, and this final installment.\nBut after the 2nd one aired, I put on my thinking cap, and tried to figure out how I could do more, but still keep each video \"edgier\" then the next. And hey, I get to suck some cock so it's not like I'm complaining!\nI've got a couple more planned, but nothing filmed and no commitments from models, but even though I say this is the last, chances are there will be more. Just don't expect it anytime soon.\nFinally, and I want to thank everyone who did write me about these. Usually I hear complaints all day (the guys are too skinny, too buff, too shaved, too hairy) so it was great to turn 41-years-old, and hear kind comments about me. Perhaps our culture isn't as youth oriented as I thought!\nAnyway, go and enjoy, and stay for the out take at the end!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Jarrod",
      "person_id": 3150
    }
  ],
  "release_date": "2006-07-28",
  "scene_id": 376,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Chest - Smooth/Shaved",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Video - Bryan Appearance",
    "Video - Standard Def"
  ],
  "title": "Bryan & Jarrod - Edge"
}