{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kobi is\nUlrich\n's 's roommate and probably his best friends.\nUlrich had a really good experience filming his solo, so when he went back he started referring me to all his hot friends, starting with Kobi.\nIt's always fascinated me when hot guys hang out together. Ulrich seems to have a core group of gorgeous guys that he parties with, and he has two other roommates that are also \"Top Shelf\" dudes.\nNaw, they're not gay, but when it happens, it makes ya wonder what positive and negative electrons are firing to pull all that beauty together. You'd think they would end up competing for the same girls, and there would be problems, but they all seem confident in their own ways.\nI think when a group of hot looking guys hang out, it's to their advantage. They're like a store front offering the best merchandise. Instead of competing against each other, I bet they get more window shoppers, and likely, more sales.\nAnnnnyway. Kobi is a runner, hence his lean build. Though he has played every sport, from basketball to boxing. He's got two pretty good scars on his eyebrows from bare fisted fighting (or maybe that was a bar brawl he told me about). I shudder when I think of those amazing cheekbones and unique face taking a beating.\nHe's tall, confident but not cocky, was voted \"Most Amazing Eyes\" in high school, and is pretty horse hung for such a lean guy.\nWe waited about 3 weeks for his pubic hair to come back, (Yes, I know you hate it shaved, but if I put them too far off waiting for it to grow back, they end up going to work elsewhere). I think he has a decent amount, a bit more would be nice, but it certainly fits his naturally hairy physique.\nThe video itself is more like a voyeuristic solo. He's pretty intent on watching his video, right through the cumshot, so I always feel like when that happens, it's like sneaking in their bedroom and watching what they might be doing when they are alone and horny. What he lacks in heavy breathing, he makes up for in amazing ass shots. Wow!\nSo, go enjoy. Kobi is one hot guy no matter how ya cut it.",
  "models": [
    {
      "name": "Kobi",
      "person_id": 3159
    }
  ],
  "release_date": "2006-10-24",
  "scene_id": 401,
  "tags": [
    "Theme - Solo",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Ethnicity - White Guys",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - Standard Def"
  ],
  "title": "Kobi - Solo"
}