{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video didn't go as planned.\nZeke said he was up for topping another dude and Blake was gonna step up to the plate as the bottom.\nBlake says he is more of a top, but when he saw Zeke's amazing bubble butt, he pretty much was focused on reversing the roles and getting some back door action.\nZeke was really nervous this time out and after a bit of playful wrestling, he quickly realized he was gonna be the bottom boy for this shoot. Oh well.\nBlake is 18 and still learning the ropes. He'd never ate ass, nor had Zeke ever had oral back there. There's a little clumsiness here and there, but make no bones about it, they both really got in to it, and Blake struggled not to pound Zeke too hard.\nWhat stands out most in this shoot is all the kissing. Normally it's pretty hard to get straight guys to kiss. Just too personal I guess. They launched right into kissing, and Zeke was incredibly responsive. I asked him what he thought, and he said, \"yeah, uh, it's weird, but he's a REALLY good kisser.\"\nI think Zeke would have kissed the entire video, but fortunately we finally got him to suck dick. Yep his first dick in the mouth. Pretty sure Blake got off on having a straight dude suck on him, not to mention being able to fuck later on.\nIt's a hot film, with two very hot guys.\nEnjoy!",
  "models": [
    {
      "name": "Zeke",
      "person_id": 3145
    },
    {
      "name": "Blake",
      "person_id": 3161
    }
  ],
  "release_date": "2006-08-25",
  "scene_id": 404,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Blake & Zeke - Wrapped"
}