{
  "collections": [
    "ChaosMen"
  ],
  "description": "Another video that veered off course.\nKurt and Jude get it on, with special guest appearance by me.\nJude loves to fuck but also loves getting it up the ass as well. I stepped in to help him keep a dildo up his ass while he fucked Kurt. Pretty much putting him over the top getting and giving at the same time.\nJude flipped Kurt on his back and really started to nail him. Kurt busted a nut almost immediately, which turned Jude on even more, and instead of slowing down, he picked up the pace, I suppose maybe trying to cum himself. Instead of Jude cumming, Kurt cums a second time. (though its hard to tell with all the cum every where)\nAfter that, Kurt was pretty much out of the game. Two quick succession orgasms wore him out. He tried to jerk Jude off, and shove a dildo up his ass, but you could tell he was just not in to it and just wanted to take a nap. Jude was getting a little frustrated with the lack of effort. \"Get Me Off!\"\nWe took a break, hoping Kurt would perk back up, but he was just Out to Lunch.\nJude turned to me and asked if I could do it. He didn't have to ask twice! I handed the camera to Kurt, and got down to the business of making Jude cum.\nJude loved it, he was completely floored by the blow job, begging me not to stop. It was crazy. I guess 25 years of sucking dick has paid off.\nJude finally busts, and I was a bit embarrassed afterwards when he kept saying how good the blow job was. I'm in the right business I guess.\nIt's a hot kinky video that veers off course, but I hope in a good way.\nEnjoy!",
  "models": [
    {
      "name": "Jude",
      "person_id": 7239
    },
    {
      "name": "Kurt Wild",
      "person_id": 3133
    }
  ],
  "release_date": "2006-11-24",
  "scene_id": 432,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Toys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - Bryan Cameo",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Jude & Kurt Wild - Wrapped"
}