{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bralin is back in action! You of course recently saw him win the 0-60-n-60 contest, but what you don't know, is that he was down and out for the count.\nAfter doing his last scene, he returned back home and promptly ran his car into a tree. He got banged up pretty good.\nHis forehead got bashed into the windshield. He ripped his mouth open, knocked out half his teeth, and the broken collar bone was due to his intimate contact with the steering wheel.\nThe night before, we were actually setting up this shoot with Mitch and he called me from the hospital the next day saying that there might be a small delay in doing more video work. He was doped up pretty good and the missing dental work made him sound alarmingly injured.\nFortunately he had great insurance, has got a new set of choppers (though he has over year of dental work to go) and was emailing me every week, bored out of his mind, and giving me updates on his health.\nI get protective over these guys, so I was pretty worried about him.\nAnyway, he recovered enough to do the contest and this shoot. He's got shorter hair now, and that big ole cock of his just never goes down. He's thinner than before, and hopefully he will be able to put some weight back on now that he's mobile.\nAs for Mitch, he's now resigned himself to bottoming, and frankly, I couldn't be happier as he has discovered he can bust a nut easily while getting pounded. We've been known to wait quite some time for him to get over the top, and with this new found trick, I am all about getting him fucked.\nThis is a hot video, with another well-timed cumshot. There are some spoilers at the end, so if you don't like those, turn the video off after the final title image!",
  "models": [
    {
      "name": "Mitch",
      "person_id": 7241
    },
    {
      "name": "Bralin",
      "person_id": 3166
    }
  ],
  "release_date": "2007-01-26",
  "scene_id": 477,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Bralin & Mitch - Wrapped"
}