{
  "collections": [
    "ChaosMen"
  ],
  "description": "Adam started of by telling me that his best bud had a kick ass body and that he was interested in doing vids. I asked him if he'd seen his bud naked, and he replied, \"All the time, we ran around naked when we were little, and have even had sex with the same girls at the same time.\"\nHe then proceeded to tell me all the crazy shit they did growin' up together.\nHe sent a picture of Race, and I have to admit I was disappointed that Race didn't look a whole bunch like Adam.\nThey do have the same build. It's so interesting to see the roll of the DNA dice and how some things are similar (their torso are clones of each other) and yet Adam has got a bigger floppy dick, while Race got a rock hard respectably sized piston.\nIf you haven't figured it out by now, Adam will pretty much try anything twice and loves a challenge. I asked him if he thought his bud and he could do a side-by-side jack off instead of a solo. Adam assured me that Race wouldn't mind and that we could push the boundries a bit..not TOO far, but far enough to have fun.\nRace is 30, married to a bisexual woman, and I think everyone around him has questioned if he was gay or not. He's a good 'ole Texas country boy, and has the charming quality that I think Adam has in spades.\nSo this is a fun video. Lots of out takes as I wanted it to be silly and not so dang serious (it gets serious though) with a touch of rivalry.\nOnce again, I think this is a totally memorable and collectible video, and even if you shudder at the thought of playing with your brobud, the vid is undeniably fun and hot.",
  "models": [
    {
      "name": "Adam",
      "person_id": 3179
    },
    {
      "name": "Race",
      "person_id": 7307
    }
  ],
  "release_date": "2007-05-04",
  "scene_id": 516,
  "tags": [
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Chest - Smooth/Trimmed",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Adam & Race - Serviced"
}