{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wayne lost his wallet with all the money he had made from his solo. So only a couple days later he was calling me for another gig, despite him being pretty uptight about doing guy on guy work.\nI struggle with me doing these oral vids. I think I am too old, and want to get some of the other guys to take on the duties. But most of the videos are VERY last minute and finding or even flying in a model to just suck cock is expensive and I'm not able to get them here quick enough. The guys seem comfortable with me, but I still want to mix it up so its not always me doing it. Adam is gonna be around a lot, so I think I might get him take on the duties.\nThat being said, there was no way in Hell I was missing the chance to suck Wayne off! He's about as crazy sexy hot as they come, and I didn't even try to find anyone else. Mine!\nBut it was pretty last minute, and I didn't even shave, so my whiskers were a bit troubling when I ate his ass out, but overall, he got way in to it, and ironically he assured me over and over and over that \"I can't cum from a blow job. You can't make me, you can't make me, you can't make me!\"\nI love a challenge and frankly he was the easiest and the quickest to make bust a nut.\nAs a side note, this is the 5th in the series, and I have one other that I want to film. That means I have enough for a DVD and I am even holding one back so that the DVD will have a \"bonus\" scene that won't be available on the site. How's that for a marketing teaser?!\nSo for those of you asking, The Serviced series will be the next video release. Possibly available in June 2007 (but don't be surprised if that changes!)",
  "models": [
    {
      "name": "Wayne",
      "person_id": 3196
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2007-05-25",
  "scene_id": 525,
  "tags": [
    "Build - Lean",
    "Cock - Hung",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - Standard Def"
  ],
  "title": "Bryan & Wayne - Serviced"
}