{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ok, so another Serviced video basically back-to-back with\nWayne\n's.\nLet me explain.\nWhen Zack got the\nFreshmen of the Year and cover\n, I did some last minute scrambling to rearrange the movie releases to get a Zack video online with the magazine. I normally try to balance the videos from solos, to sex, to oral only.\nSo rather than mix my releases up too much I am stickin' to the original plan, which means yet another video of me suckin' dick- just days after me complaining that it was getting to be a bit much. There would have been a couple weeks between the two.\nThere. That should explain it!\nI really hate to admit it, but Devon was likely the most uncomfortable guy who did one of these Serviced videos. Not saying he didn't enjoy it or get in to it, but he was more nervous than most.\nHe's also got a big floppy dick that never ever seems to get completely hard. I think even for his solo he was a little wobbly through out. I think he's one of those guys that ends up bustin a nut semi-hard. So there is a lot of me with my hand in there, and I fear its a bit frustrating as its hard to get a clear view as I ham fist him.\nThere is one cute part where he starts laughing. No, he's not laughing at me, but as you all know, the video and audio is playing on the porn he is watching. I never know what the heck is going on behind me, but apparently there was some pretty goofy things happening, and then the video kind of went in to an \"plot with acting\" scene, that is basically a boner buster for anyone. He really tries to not laugh, and its cute to see him try to stomp it down. I'm kind of glad it happened 'cuz he gave up on the movie and got in his own head space.\nAnd frankly he went from slightly groovin on it and wobbly, to hard and busting in under a minute. Before I know it he was poppin' a load!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Devon",
      "person_id": 3192
    }
  ],
  "release_date": "2007-05-29",
  "scene_id": 529,
  "tags": [
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - Standard Def"
  ],
  "title": "Bryan & Devon - Serviced"
}