{
  "collections": [
    "ChaosMen"
  ],
  "description": "After a guy does a solo, I can pretty much guess if the guy will be coming back to do more. Blair surprised me the first time by doing the Serviced video. And I would swear that he had hit his limit with the oral only thing.\nIf you saw his Serviced video, you will see how intense he came in it. I literally blew him away (pun intended). He went back and told his buddies about the blow job, and well, I ended up getting a couple hot model referrals from him. Ahem..I guess my reputation was proceeding me.\nSo Blair calls me a up a couple weeks later, saying he would top a dude, and uh...wanted to do it with me cuz he felt comfortable. That's a bit beyond my own limits, and honestly, I think he deserved someone more his age. Not sure it was a compliment, but I will take as one.\nNow Adam, he hurt his knee bad, and since his work requires heavy lifting, he is out of work. He's gonna be around on the site a lot more, as he shares the \"breaking in\" of the straight guys duties with me and Zack\nHe has also turned in to a quite a bottom.\nI was really surprised by Blair's intensity while fucking Adam. Even though Blair wasn't really reciprocating in other ways, there was some chemistry there and I think Blair loved the freedom of really pounding someone.\nAnd Adam stayed hard for most of the shoot, which is a bit tough to do, even for an accomplished bottom. And I think I know why.\nIn the video Adam is looking at the action in the mirror. No, he's not looking at himself, but totally getting in to watching himself get fucked. Blair is even checking out the action. They I think they both thought it was a hot scene.\nAnd ya give it up to them, this is another award winning cumshot!",
  "models": [
    {
      "name": "Adam",
      "person_id": 3179
    },
    {
      "name": "Blair",
      "person_id": 3189
    }
  ],
  "release_date": "2007-06-01",
  "scene_id": 530,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Adam & Blair - Wrapped"
}