{
  "collections": [
    "ChaosMen"
  ],
  "description": "I'm definitely trying to work the Rough Trade thing for this series.\nWhen I interviewed both Dakota and JB, they were both incredibly similar. They live in same smallish town (they were worried they might know each other) They both spend their days outside doing construction, and they both have that rugged skin and beat up hands from hard labor. The farmer's tans and sun burned necks/face give them that real life, uh...red neck thang. And both are admittedly country boys.\nThough JB is married with kids, he told me that he had had his dick sucked before in a video arcade, so was open to having his dick sucked, and he might even suck back.\nNow Dakota, he wants to do full on video and get fucked. BUT we had an issue.\nI know you guys tend to not believe these anecdotes, but I just don't have time to make this stuff up.\nDakota came in to do a scene with Blair. He was VERY nervous. Blair got his pants down, and he got too nervous and said he couldn't do it. Out the door he went.\nI pushed him a bit too fast cuz he was so dang eager to get fucked by a dude for the first time. I seriously didn't think he would be fleeing the set...Blair was always the nervous one and was in fact looking forward to fucking some ass.\nLesson learned.\nSo I had to find a project that he wouldn't be so nervous about.\nI called him up and told him about the glory hole I had found. He said he would be up for that, and as it wouldn't so intense.\nMy new goal was to step Dakota through all the stages we all know. Oral first then maybe more later. Ease him in to it. He's surprisingly as skittish as a John Deer in the headlights.\nWe got all setup for the video, ensuring we had privacy, and the boys went at it, swapping blow jobs. They were both WAY WAY into it.\nThe cumshots are a little awkward, especially Dakota's as he basically busted without giving me time to get completely in place. He just didn't know he was about to bust. ~sigh~\nAll in all a very hot video if you like a little on-the-sly public action.\nBTW, you can find JB as the bonus scene on the\nDVD compilation of the Serviced\nvids.",
  "models": [
    {
      "name": "Dakota",
      "person_id": 3199
    },
    {
      "name": "JB",
      "person_id": 3181
    }
  ],
  "release_date": "2007-08-10",
  "scene_id": 548,
  "tags": [
    "Sex Act - Oral Only",
    "Build - Lean",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Theme - G:hOle",
    "Video - Standard Def"
  ],
  "title": "Dakota & JB - G:hOle Oral"
}