{
  "collections": [
    "ChaosMen"
  ],
  "description": "This movie starts off with a super quick \"out take.\"\nIt's not a super noticeable one, but one that I think illustrates the intensity of these two.\nBasically we always start out doing some still images for the thumbnails on the site, and once again, Jonatan starts kissing on the other model. So I am like, \"Ok, I guess we are starting!\" Not even a chance for me to yell \"Action!\"\nThe opening is just me wandering around trying to get the cameras setup, and all the while Beau and Jonatan are just going at it as if they starving for sex action and I'm not even there.\nI knew this would happen. After seeing Beau take a major pounding from Bralin, I knew just who I should call who could fuck Beau as hard as he likes.\nNow Jonatan and I have something in common. Our love of rimming. If his dick wilts, all you have to do is sit on his face and he will be back in rock hard action. It's hard for me to get the straight guys to eat ass, and it's one of the main reasons I love working with Jonatan. It's also one of the reasons you see me doing it in practically all the Serviced videos.\nThe pace of this video is not standard. Half way through the movie, Beau climbs on top of Jonatan's cock and bounces up and down on it till he cums. Leaving Jonatan wanting to fuck some more. Poor Beau takes another pounding, just after he nutted (we all know that ain't exactly the best time to be fucked). It's kind of hot knowing he is suffering and being used.\nFinally Jonatan had enough of his....uh bitch and made Beau sit on his face while he shot loads of cum into his face.\nEven if your not into Latin flavor, or even fascinated with the straight guys, but you gotta give it up for these gay guys- they fuck like two greedy, dirty boys!",
  "models": [
    {
      "name": "Beau",
      "person_id": 3185
    },
    {
      "name": "Jonatan",
      "person_id": 3122
    }
  ],
  "release_date": "2007-08-31",
  "scene_id": 563,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Ass Eating Rimming",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Beau & Jonatan - Wrapped"
}