{
  "collections": [
    "ChaosMen"
  ],
  "description": "If you have been following along, then you know I have been stepping 'lil Dakota through the whole \"getting fucked\" process. He identifies as a straight guy, but he sure was interested in sucking cock and even getting fucked. He grew up putting stuff up his bootie, so he's pretty anally-oriented.\nSo I needed someone to \"Service\" him anally, instead of just a blow-job like Race did with Rocco. I wanted to introduce Dakota to bottoming by him being the focus and not worrying about the other dude getting off. So this video is all about Dakota while Race again does all the \"work.\"\nI decided to go with tradition and bring out the ubiquitous Massage Table. I hate doing what everyone else is doing, but I have to admit, it relaxes the guys and puts the models at just the right height.\nI picked Race cuz he does so well with new guys. Now Race, he showed up recovering from a major sunburn. He'd driven 4 hours, and Dakota needed to do the shoot to pay for rent. So forgive us the state of his back. He took his son fishing and apparently made sure his son was covered, but neglected to protect himself.\nI think this is a smokin' hot sensual video. CLEARLY both these guys were in to it, and I love seeing that big 'ole butt plug sticking out of Dakota's ass while he sucks on Race.\nThe funny part of this video might not be apparent. I told Dakota to give Race a good massage then slowly work his way down to his dick to get him hard. Dakota massages him (clearly he's not massaged anyone before) for about 10 seconds, pulls out Races hard dick, and before I know it, is sucking on it. It cracked me up when I was filming it 'cuz I was saying to myself, \"Well, so much for a relaxing massage!\"\nAnd watching Dakota bust while being fucked...you can't beat that!",
  "models": [
    {
      "name": "Race",
      "person_id": 7307
    },
    {
      "name": "Dakota",
      "person_id": 3199
    }
  ],
  "release_date": "2007-09-14",
  "scene_id": 581,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Toys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Sex Act - Massage Table",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Dakota & Race - Wrapped"
}