{
  "collections": [
    "ChaosMen"
  ],
  "description": "So this is the 4th in the Glory Hole series. I'm still struggling to make these videos come off without a hitch. I'm gonna give it a couple more go arounds, as I think I can solve some of the issues with getting the dang blasted cum shots right.\nAfter Bryson and Caden had giggled their way through their side-by side jack off, I thought that would be the end of it. Before they left that day, they both said they wanted to do more, and I told them flat out, they had to \"get over\" the goofiness. They needed to think about sucking and fucking...that they just couldn't jack off in movies.\nA couple hours later I get a call from Bryson saying they wanted to do the Glory Hole videos I had talked about. Now when I mentioned them, I was thinking maybe Bryson's dick would look good through the hole, not thinking they would work together.\nI was like, \"Uh, you DO know you have to suck each others' cocks, and at the very least blow your loads on each others' chests? You guys could barely look at each other and were afraid to get each others' spunk any where near each other during the last video!\"\nThey hadn't thought of that part. Click.\nThe next day Bryson calls me up and basically says, \"In for a penny, in for a pound.\"\nI gave them an out first, asking them each to do a Serviced video. Caden's aired last month, and Bryson's will air next week.\nI had reservations about shooting them this way. On one hand it would ease them in to it, and you all can clearly see that these are two straight buds who are really pushing their limits. (Watch Caden struggle with putting a cock in his mouth for the first time!)\nI just didn't want the goofiness that was really charming in their side-by-side jack-off. Plus these movies do require a teensy bit of acting. Not much, but still, they needed to pull it off.\nYeah, yeah, Caden is not in tip top shape and not overly endowed, but I am hoping that isn't too distracting as these two truly are testing the waters as real friends.\nAs I mentioned their cumshots are uh..unique, and there is even a replay of it as an outtake. Poor Bryson wasn't quite expecting that much to come out!",
  "models": [
    {
      "name": "Bryson",
      "person_id": 3211
    },
    {
      "name": "Caden",
      "person_id": 7308
    }
  ],
  "release_date": "2007-10-19",
  "scene_id": 598,
  "tags": [
    "Sex Act - Oral Only",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Theme - G:hOle",
    "Video - Standard Def"
  ],
  "title": "Bryson & Caden - G:hOle Oral"
}