{
  "collections": [
    "ChaosMen"
  ],
  "description": "SPOILER ALERT!\nDon't read this if ya \"Just Don't Wanna Know\"\nThis video is actually the second time I have blown Bryson.\nThe first time, well, he just looked mad. He was nervous, his buddy Caden was in the other room waiting for his blow job with Andrew, and he just didn't make a sound, watching the pussy flick way too much.\nAnd then he just...well..came. Next thing I know I've got cum going down the back of my throat. Nary a drop spilled out. Hot for me, but a little frustrating for you all, especially since you could barely tell that he nutted.\nI captured the video, and said to myself, \"This is terrible!\"\nThen I got a call from Bryson asking to do the Glory Hole video with his friend. I reluctantly said yes, worried he would again not look in to it.\nNow Bryson does have a serious demeanor, and that does come across on camera. But he assures me his having fun. He's eager to work.\nAfter we did the Glory Hole video, I told him about the Serviced video and how bad it turned out. I showed him the raw footage, and he was like, \"That's terrible, you can't even tell I came.\"\nYeeeeah..\nI asked him what he thought, and he suggested we do it again, assuring me that he was MUCH more comfortable (especially now that he'd had his buddy's cock in his mouth!). He wanted to do it again right then and there.\nI said, \"Whoa buddy, you just nutted.\"\nSo the next day, we setup shop for a second take. This time I used my HD cameras.\nAnd this time, WOW! He really got in to it, barely looking at the video. He really let go and sat back and enjoyed himself.\nAnd when he busted he gave me more warning this time, though I still got a tasty glob when he came!\nNext, I wanna see him stick his dick up a guy's ass! Stay Tuned!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Bryson",
      "person_id": 3211
    }
  ],
  "release_date": "2007-10-22",
  "scene_id": 602,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Bryson - Serviced"
}