{
  "collections": [
    "ChaosMen"
  ],
  "description": "I've got to hand it to Bryson. He's one uptight straight guy, but one that is willing to experiment (and get paid of course) to try anything. Well, most anything. Still working on him.\nLike Dakota, I am stepping him through everything. This is his first time ever fucking a dude, and I went with Adam, who is so awesome with the straight guys. He just makes them feel comfortable, since he is clearly another straight dude. It's like if they see him getting freaky, they figure they can too.\nThere's a cute moment at the beginning that I think is priceless, and pretty much sums up how a lot of the straight guys are about the gay sex.\nBryson IS nervous, and you can tell, he doesn't quite know how to \"let go\" and just go with it, nor where to put his hands. It's still all about him, and not too much about the other guy. I think its gonna take him about 3 films before he will get out of his own zone and try to help his buddy out.\nI also caught him sneaking peeks at Adam's cock...see if you can spot it. Not sure what it means, but some of the straight guys can't even look at the other model.\nAnd Bryson's dick is dang hard for these shoots, especially the oral part, as he loves having his cock sucked.\nIf you haven't noticed by now, I am kind of a big fan of the facial, and Adam actually thinks its pretty hot to be busted on. It's a sure fire way to make him bust.\nBryson gets him right in the eye, and it stung pretty bad, so we stopped for a few seconds while I cleaned his eye out-but left the rest. All the while Adam is beating his dick furiously, and in no time at all he was busting his nut.\nThere is a very quick outtake at the end too. So if you like those, watch to the end!",
  "models": [
    {
      "name": "Adam",
      "person_id": 3179
    },
    {
      "name": "Bryson",
      "person_id": 3211
    }
  ],
  "release_date": "2007-10-26",
  "scene_id": 605,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Long",
    "Video - HD - High Def",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Adam & Bryson - Wrapped"
}