{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video started out as a duo with just Beau and Zeph. I worked with Hudson the day before, and he was real keen on doing another scene so he could pay rent.\nNeither Beau or Zeph had any problems, so I tossed the 'lil guy in there to see how he did.\nNow we all know Beau can take it, and Zeph's cock is a classic porn dick, so I knew they would get along, but adding Hudson in without seeing him work before was risky.\nThankfully it paid off. The two guys worshiped Zeph's cock (as it should be!) and even keep each other going.\nIf there is a hole or a cock in this video, you best be sure it's active!\nI love watching Beau get pounded while having to suck cock, all the while Zeph is pushing Hudson's face on to Beau's big uncut dick.\nNear the end, Hudson fucks Beau, mainly cause Beau wanted to have Zeph's dick in his face while getting pounded.\nBeau has on occasion mentioned he wants to get gang fucked and have all the guys bust all over his face, but I have never been able to wrangle 5 guys to do it.\nFor the big finale, both guys bust almost simultaneously all over Beau's face and mouth, and it's literally bubbling out of his mouth! Within 30 seconds, Beau is busting right along side.\nPerhaps one of the most perfect endings for a film!\nSmall Out Take at the end too!",
  "models": [
    {
      "name": "Hudson",
      "person_id": 7311
    },
    {
      "name": "Zeph",
      "person_id": 3193
    },
    {
      "name": "Beau",
      "person_id": 3185
    }
  ],
  "release_date": "2007-11-09",
  "scene_id": 609,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Sex Act - Flip-Flop Fuck",
    "Theme - Wrapped"
  ],
  "title": "Beau & Hudson & Zeph - TagTeam"
}