{
  "collections": [
    "ChaosMen"
  ],
  "description": "I was super pleased to get Mattox back in for a dick sucking. His cocky attitude translates to a nice dominate streak on screen.\nI got Adam to come in and blow him. It rocks watching Mattox go from nervous, to totally lost in the moment, then finally basically making Adam his bitch.\nOne thing I realized after shooting these Serviced videos with the younger models, is that these straight guys will happily suck dick on film, but they've never really had to make a guy cum from a blow job.\nMost guys will announce that they can't cum from a blow job. I would say 8 out of 10 guys will say it is always a challenge under the best of circumstances. Heck, I even have a tough time.\nSo I have had these straight guys (like Andrew, Race and Adam) doing these Serviced videos, and they can sure pleasure the guys, but getting them over the top is just not in their acquired skill set.\nI've come to the conclusion it takes years of practice. You have to know that each guy has a different way. Usually when I am blowing them, I am monitoring which technique works the best. When I find it, I then switch back to teasing mode to drive 'em crazy, and for the cumshot I go back to what was hitting the right spot.\nIn this video, you do see me suck Mattox for a bit. Before we were about to do the bust shot, I thought I had better jump in and show Adam how to make him go over the top. So there is a nice long out take at the end of this video.\nMattox kept saying he was better \"upright\" for cumming, so we changed it around for the end, and we got a terrific cumshot facial out of him. Adam IS a big fan of cum eating! Thank goodness!\nLater as we were leaving, he kept talking about doing another blow job video, but asking if I would do it.\nI think I will ask him to do an Edge video, thereby pushing his boundaries by making him do some other naughty stuff.\nHe is REALLY on the fence about fucking a dude, but his dominate side is quite wide, and I know he will be a mean top! But the oral stuff might just be his limit.",
  "models": [
    {
      "name": "Adam",
      "person_id": 3179
    },
    {
      "name": "Mattox",
      "person_id": 3221
    }
  ],
  "release_date": "2007-11-13",
  "scene_id": 610,
  "tags": [
    "Sex Act - Oral Only",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Chest - Smooth/Trimmed",
    "Theme - Serviced",
    "Video - Bryan Cameo",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Adam & Mattox - Serviced"
}