{
  "collections": [
    "ChaosMen"
  ],
  "description": "This was kind of a challenge to shoot.\nI think for the first time ever, I had a guy that was TOO turned on!\nClint and I shot his solo the day before, and later that day as I was running him around town, we talked about projects he could do next. I talked about the variety of blow job videos he could try, but when I mentioned the Edge videos, he got really interested.\nHe thought the little bit of bondage would be fun.\nSo instead of sending him back home right away, we setup to do the video the very next day.\nBefore he even sat down in the chair he was laughing a bit to himself that he already had a hard on. That of course made me happy, as I wouldn't have to be tugging and yanking to wake his dick up. I always have a little fear that their dicks wont respond.\nBut boy, was it ever hard! I reached out the first time and he was bone hard.\nAnd that was challenge in this shoot. You will notice I am barely touching him through out the video. It rocks cuz you can really see his cock, as I toy with it - no constant attention to keep him going.\nHe was on the verge of busting 3-4 times. He just desperately wanted to nut.\nClint said he was a straight guy, but he sure was in to this, and the fantasy sequences turned him on even more.\nIn fact, there is an out take at the end showing how \"hard\" the shoot was.\nIt's a clip of me ramping up for the cum shot on him. Some of the straight guys are really icked out by a dude nutting on them, but he thought it was cool. The whole time I am ramping up, I'm just holding his dick, for balance (and to get me over the top).\nI can't tell if he's turned on by the upcoming cumshot on him, or the little bit of grasp I had, but it was enough to make him almost nut!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Clint",
      "person_id": 3219
    }
  ],
  "release_date": "2007-11-16",
  "scene_id": 611,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Clint - Edge"
}