{
  "collections": [
    "ChaosMen"
  ],
  "description": "Today I bring you Phenix. You've seen him on plenty of sites, and I think he has his own fan base. I personally think he has that suave sexy quality that makes him a hot property.\nHe and I have been clicking, and though he is still doing projects elsewhere, I am putting him in the mix with other models. So you will actually see more of Phenix in the coming months.\nNow about the video!\nIf you have been following along, my main goal for these Edge videos were to find something that uptight straight guys could get intro'd into the world of gay sex. The blindfold and audio emerses them and they sit back and get serviced.\nThe fantasy sequences sprinkled in also forces them to push their limits, and they realize that \"Hey, that wasnt so bad\" and then I can talk them in to doing even more.\nThen I ran in to some gay guys who wanted to do it, and I found those were a lot more fun for me, cuz I didn't feel like I was having to worry so much about \"how they were feeling or if they were freaked out\". Even some (ok, maybe 3 guys) of the straight models with bodies of work elsewhere were contacting me asking if they could do one. Apparently there is a bit of a buzz about them.\nSo I think I will mix it up. Work with the scaredy cats who need something to \"edge\" them into more work, and toss in a few experienced guys so that I won't have nagging worries while I film that the model may run from the studio.\nPhenix and I had talked about doing an Edge video back in 2006, just when I was getting started filming them, but he had a lot of limits back then, and despite his body of work, I just thought I couldn't get enough fantasy sequences to make it hot. Back then he was just basically getting his dick sucked and maybe fucking a dude.\nFast forward a year or so, and he's a lot more relaxed, and shock upon shock, he loves his job. Few hours, lots of money for girlfriends, and a bit of travel. His dick loves his job too!\nSo I made him push his limits. He's pretty much a top, and seldom sucks cock, and I am pretty sure he's not much of a kisser. Too intimate. I did get a pretty good kiss out him, and will try to push those last little hold outs in future projects.\nPhenix was hard from start to finish, and I struggled editing it, finding good spots to put the fantasy elements. Like Maverick's video, once I had him going, he was hard and ready to bust within 5-6 minutes, and the video without the splashes of fantasy is pretty dang hot.\nPhenix was hard as I took his pants off. The boy REALLY has a submissive streak, and he was somewhat eager to do the shoot. He likes to be tugged around by his piercing.\nMaybe someday I will re-release these vids without the fantasy splashes. Some people love the mystery of them, while other think they interrupt the flow. The video is a pretty dang good \"Serviced\" video otherwise.\nRegardless, this is a very hot video, with some interesting elements that I could only do with Phenix!\nTune in tomorrow for Race!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Phenix",
      "person_id": 3174
    }
  ],
  "release_date": "2007-10-13",
  "scene_id": 612,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Bryan & Phenix - Edge"
}