{
  "collections": [
    "ChaosMen"
  ],
  "description": "So I have been trying to get Rocco to come on in and fuck a dude with that big 'ole dick of his. I can't seem to get him to do that.\nI thought an Edge video would help him along. Easing the guys into the whole gay sex thing was my main reason I thought up the Edge videos. They get a little taste of playing around with a dude, realize it's not too bad, and hopefully realize they could do a full scene.\nPlus, well, I REALLY wanted to suck his dick. I admit it! (Ok, and maybe I wanted to eat his ass too!)\nNow a little inside scoop and insight in my filming process.\nI've got a really bad habit of trying to turn off the cameras as soon as we are done shooting. Filming with three cameras in HiDef, I'm constantly trying to conserve on video time. A typical video can take up to 30GB. That might not mean much to you all, but it adds up fast, and I'm constantly running out of storage.\nAnyway, I shut the cameras off too soon. Rocco just sat in that chair at the end. Complete and utter disbelief at how amazing it was. He wouldn't get up for 3-4 minutes. I had to help him out of the chair! SERIOUSLY!\nYou can tell he really blows his nut in the video, but it's like he had a seizure and was going on and on about how it was the best nut ever. WHY WHY WHY did I turn the cameras off?\nOk, so it would have stroked my ego to have it on film, but not only would it have been awesome to have it as an outtake for you all, you would know how surprised I am, that given his over the top reaction to the blow job...I still haven't gotten him to come back!\nI will keep chipping away him. He's one smokin hot dude!\nEnjoy!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Rocco",
      "person_id": 3215
    }
  ],
  "release_date": "2007-11-30",
  "scene_id": 624,
  "tags": [
    "Build - Mature",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Rocco - Edge"
}