{
  "collections": [
    "ChaosMen"
  ],
  "description": "I think I mentioned that I'm pretty sure that Leo likes boys, but he's not really figured it out. More telling, the first time doing a full on interactive, he wanted to try bottoming.\nNot only is he bottoming, but he also sucks dick for the first time. You guys may not believe it when I tell you these things, but you have to admit after watching him, that he really is just not sure how to do it. Truly a novice.\nPhenix sucked dick in this video, which is not something he likes to do. I've been pressuring him to let go and have fun with the scenes. He's a porn star for goodness sake. He should suck dick! I was surprised at how much enthusiasm he had for it too!\nNow the fucking. We tried starting off with Leo sitting on his dick. It is a very short sequence. He jumped off it after a minute and we decided to switch gears to a doggy style. But it was hot watching Phenix break his cherry, so I kept it in even though its very quick. This is reality here.\nLeo's got a hairy ass and butthole, and I think it threw Phenix a bit. He is a straight guy, and I dont think he's ever worked wih a dude with so much hair. I hate to admit it, but he was struggling to stay hard.\nWe finally found a position that he liked, and geeeeeeeeeez he really let Leo have it! At one point I think Leo almost starts crying.\nIf you like a little ass rape, you will love this video.\nFor the first time in a long time, the guys needed to both lay down and get their nut on. Leo busts almost instantly, and Phenix surprisingly is watching the whole thing with a lot of interest. He finally nuts all over Leo, and it's gotta be his most prolific cumshot ever.\nIf you like a guys \"First Time\" this vid with charm you!",
  "models": [
    {
      "name": "Leo",
      "person_id": 3225
    },
    {
      "name": "Phenix",
      "person_id": 3174
    }
  ],
  "release_date": "2007-12-14",
  "scene_id": 628,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Theme - Wrapped",
    "Chest - Hairy/Hair"
  ],
  "title": "Leo & Phenix - Wrapped"
}