{
  "collections": [
    "ChaosMen"
  ],
  "description": "So I thought I would give the Glory Hole a couple more tries, this time with me doing the oral.\nI'm beginning to make peace with doing oral duties on the site (Obviously!), as I am hoping most people will focus on the other guy anyway. I think this is a pretty solid G:hOle video too. Some pretty good angles (and some awesome shots of my elbow..sorry!) and Corbin was really turned on. Ok, me too.\nA little history on Corbin.\nCorbin is a straight guy. We did a solo about a month before. He had lots of piercings, shaved bare pubes, armpits and chest. He needed the money right away, so we shot the video despite him looking all shaved up. He had fun, but I kind of thought I might not ever use his solo, given how much shaved bare pubes bothers the bulk of viewers.\nHe called me a month later, and said he had grown out his hair, hit the gym hard (he's a personal trainer), leaned up a bit, and said he wanted to do the Glory Hole video I had told him about.\nI was reluctant to work with him again, but I thought I would give it another shot. He showed up looking rested, full on pubes, super hot and very HORNY! The only thing off was a pretty good cut on his finger, but I figured I would be doing most of the man handling.\nI had told him that part of the G:Hole setup was exchanging oral. He didn't think he could do that, but it wouldn't bother him if I jacked off while sucking him. I nutted right after he did, and I have to admit it was pretty close to reality, and was uh..pretty easy to play catchup with him with spunk all over my face.\nAfter the shoot, he said he thought he could have sucked my dick, and that he thought it was hot that I was turned on by him. He tells me this AFTER the shoot! Grrrrrr!\nThere is a cute out take at the end too.\nCorbin came back a couple days later, and we re-shot his solo. Stay tuned in a couple weeks to meet him properly, but I thought it would be hot to see him this way the first time out.",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Corbin",
      "person_id": 3218
    }
  ],
  "release_date": "2007-12-18",
  "scene_id": 629,
  "tags": [
    "Sex Act - Oral Only",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Video - Bryan Appearance",
    "Theme - G:hOle",
    "Chest - Hairy/Hair"
  ],
  "title": "Bryan & Corbin - G:hOle Oral"
}