{
  "collections": [
    "ChaosMen"
  ],
  "description": "Yow! This is a long movie and a big file! Sorry in advance for the file size!\nAt first I couldn't figure out how the movie got so dang long, and then I realized that the movie was chock full of hot sex!\nOk, so I might need to add the word \"amateur\" in between hot and sex.\nYou've met Silas and Jayce already. They both seem like full on straight guys, but they both say they have \"kind of\" played around with a dude before. Their personalities were very similar, and I thought they both would click, given they both had the same amount of experience.\nJayce and Silas both said they would top, bottom, and suck dick. Silas thought ass eating would be fine, while Jayce didn't think he would mind if Silas busted on his face. As with most of these quasi-straight guys, kissing seems too intimate for them.\nSo the video length grew by leaps and bounds covering the cocksucking, flip-flop ass fucking, even Jayce nutting with Silas's rock hard cock up inside of him.\nNow having said all that, after watching the final video, you might feel that these guys have the enthusiasm, but I will be danged if they really don't know what the heck they are doing. As it should be!\nIf you like your guys practically virgins, you gotta admit, these two are still learning the ropes!\nI'm pretty sure both guys will be back, so I am excited to watch these guys grow and experiment for all of us to see.",
  "models": [
    {
      "name": "Jayce",
      "person_id": 3226
    },
    {
      "name": "Silas",
      "person_id": 3229
    }
  ],
  "release_date": "2007-12-28",
  "scene_id": 634,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Flip-Flop Fuck",
    "Theme - Wrapped"
  ],
  "title": "Jayce & Silas - Wrapped"
}