{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ahhh Mattox. So we've already seen him get Serviced by Adam, and I was hoping and begging for him to come back and stick that horse dick of his up a dude's ass, but no go.\nWe had talked about the Edge video, and given his dominate side, he thought it would be hot. I discussed the fantasy stuff, and he thought he could do it for a \"little while\" just not a whole video.\nThe best part of this video is the part I think most guys skip over. I take his pants down, and its the best snake charming you will ever see. His dick springs to life in less than a minute.\nHis dick is HUGE too. Not only is long, but it's thick! I would choke down on it, and he would get that smirk on his face (the one where he plays with his tongue piercing)....oh so proud that his dick is chokin someone.\nThis is another video where I think the core blowjob would stand on its own. I'm actually thinking of releasing some of these vids without the flashes....its kind of hot to see them go from nervous to busting in 8-9 minutes.\nAnyway, the fantasy stuff might not be as nutty as the rest (remember, these straight guys have pretty narrow limits) but the video is solid edition to the series.\nSPOILER: I actually DID nut in this video. After eating his ass and a little bit of fucking around, I moved the cameras around and re-settled. I had Mattox sit on my face and I basically busted on my own. Mattox actually jumped in, egging me on, and just getting way in to it. I thought his dick would get soft waiting for me to bust, the domination of having someone eat his ass turned him on. He slid back a bit, and whopped my face with his hard dick, then squeezed out a huge glob of precum (his trademark apparently). It hit my lips, and I nutted just like that.\nI get up and look up at the cameras. NOT ON. Mother Fuck!\nYeah. And there is no Take Two on a shot like that. So you all will just have to imagine that bust shot, and I will save the scenario for the next Edge.\nJust remember the most important part, is Mattox's impressive cumshot!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Mattox",
      "person_id": 3221
    }
  ],
  "release_date": "2008-01-04",
  "scene_id": 637,
  "tags": [
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Edge",
    "Chest - Smooth/Trimmed",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Bryan & Mattox - Edge"
}