{
  "collections": [
    "ChaosMen"
  ],
  "description": "Geeeez, it seems like I am just inching Maverick closer and closer to a full-on sex scene. It's like pulling teeth!\nAs you know, I have had him do two solos, and the Serviced video.\nWhat you don't know is I also had him come in and do a Glory Hole scene with me. It's actually VERY hot. The guy cums like a fountain, and he was very in to it. He had just gotten this new haircut, and his body looked amazing.\nAfter the shoot, I told him there wasn't much else he could do. Two videos where he is getting blown is about all most viewers will want to see. I figure most of us want him to move on to \"more.\" I told him the only option I had would be a massage table scene, but he didn't like that he would actually see the dude. (He was blindfolded in the first and G:hOle video you can't see the guy either.)\nI finally said, \"Stop being a pussy!\" He laughed and said he would think about. Well, he thought about a month or so and said he would do it, and asked that I do it. Now as much I wanted to blow him again, I knew I now had two vids of me sucking him off.\nSo I got Adam to come to do it. Maverick was nervous, and could not believe how professional and relaxed Adam was. You may think Adam is gay, but when you talk to him about what's going on in his world, clearly he is a straight guy. And that made Maverick feel more comfortable.\nI told him he was going to have is ass eaten out, and he was saying a big \"No\" to that. So I had Adam try to show it off. He sure is uptight for a guy getting paid a lot to sit back and get blown.\nYou can tell in this video that Maverick is having a tough time looking at himself getting sucked off by a dude. Finally at the end when he realized that Adam didn't mind being cock choked, he amped it up a bit.\nNow Maverick LOVES it when his cum trickles down the back of a girl's throat, he says that is his favorite, and his last girl would never miss a drop. Some how hearing Adam choke on his dick threw a switch on for him, and it got him pretty close to nutting.\nI'm still on the fence on airing the G:hOle video, but I get such positive feedback on Maverick, that I am sure in the next month or so I will get it online for ya.\nAs he was leaving after the shoot, he almost had that \"Ah Ha\" moment where he realized it wasn't that bad, so I'm still not counting him out for more involved work. But I'm not holding my breath!",
  "models": [
    {
      "name": "Adam",
      "person_id": 3179
    },
    {
      "name": "Maverick",
      "person_id": 3207
    }
  ],
  "release_date": "2008-01-18",
  "scene_id": 643,
  "tags": [
    "Sex Act - Oral Only",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Massage Table",
    "Theme - Serviced"
  ],
  "title": "Adam & Maverick - Serviced"
}