{
  "collections": [
    "ChaosMen"
  ],
  "description": "Earlier this week you saw Corbin and I get a little out of control.\nSo I thought I would air this video next where he jumps in to some full on fucking action.\nWhat's a bit different about this video is Corbin and Saber know each other in the \"Real World\". Once Saber knew I was working with Corbin, he wanted to get banged by him. I was hesitant at first, but cleared it with Corbin first. Saber also knows Corbin's girlfriend, so it might have created issues all the way around.\nThey actually drove out to the shoot together, so I knew Corbin would be chill.\nI think the most unusual thing about this video is that after fucking Saber for a minute or two, I panned around to the backdoor action. and there is gobs and gobs of cum leaking all over Saber's balls and ass.\nNow Saber has been known to nut early, but thankfully he's a cum machine and will just nut again (and again!) So I thought Saber had nutted. After all, Corbin had a condom on.\nWell, it turns out Corbin did nut, and I guess the cum oozed out the bottom of the condom. So much for using the condom! If you like cream pie videos, this one kind of has one! We probably should have abandoned the condoms, but it was Corbin's girlfriend who made the stipulation so we kept using em.\nThankfully, Corbin can shoot multiples too. We chilled for a bit to get Corbin back in the game, and this time Corbin didn't want to nut so quickly and could give Saber a proper pounding and still delivered a nice facial!\nThere is a quick outtake at the end as I play the game \"Who Accidentally Nutted?\" It's cute watching Corbin admit to it.",
  "models": [
    {
      "name": "Corbin",
      "person_id": 3218
    },
    {
      "name": "Saber",
      "person_id": 3203
    }
  ],
  "release_date": "2008-01-25",
  "scene_id": 648,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Chest - Smooth/Trimmed",
    "Video - HD - High Def",
    "Theme - Wrapped",
    "Chest - Hairy/Hair"
  ],
  "title": "Corbin & Saber - Wrapped"
}