{
  "collections": [
    "ChaosMen"
  ],
  "description": "GIANT FILE ALERT!\nThis video climbed up to 23 minutes and the file sizes are pretty large. Be patient, cuz its worth it!\nSo this was Topher's first time with a straight guy. Now Silas, he's open minded, messed around a little with a dude here and there, but when he's at home beatin' off, he's watching girl on girl porn.\nTopher went full tilt, and you can tell Silas is like \"Whoa, wait up for me!\"\nTopher was also a bit uh...bitey. I didnt notice he was chomping down on Silas, until one pan across his body and there are welts all over him! I was a bit shocked, because, well, we didn't discuss leaving welts!\nWe did stop and I asked if that wasnt hurting and sure enough Silas was in pain, but didnt say anything. Going back and editing the video, I can see the poor guy wincing. But, well, if you are in to it, it's pretty hot to watch as he deals with the onslaught.\nAnd yep, this is a condom free video. It just kinda happened.\nTopher is an aggressive top, and this video is so long cuz he is pushing and pulling Silas all over the place.\nNow the cumshot, its a bit awkward. Topher's nut is amazing as ropes of cum shoot and coat Silas's back. Silas, meanwhile, was in his favorite \"Face down fucking a girl\" position, and basically ended up doing a cumming run to Topher. Its not exactly \"pro\" but this is amateur porn.\nI've gotta say this is one the hottest vids on the site. Two beautiful hot muscular and masculine dudes fucking like rabbits.\nEnjoy this one!",
  "models": [
    {
      "name": "Topher",
      "person_id": 3228
    },
    {
      "name": "Silas",
      "person_id": 3229
    }
  ],
  "release_date": "2008-01-11",
  "scene_id": 657,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW"
  ],
  "title": "Silas & Topher - RAW"
}