{
  "collections": [
    "ChaosMen"
  ],
  "description": "Whether you call it a cream pie or breeding, this is the first video with the action on the site!\nHere's the story. While Jarrett was here doing his solo, he asked me if I thought his partner would be hot enough to do a video with. Jarrett CLEARLY is in love with the boy. He showed me some pics of an incredibly adorable Italian dude, and I was like, \"Get him in!\"\nGabe and Jarrett are both former servicemen guys, who actually met out on a ship. They've been together over a year now, and they both seem gaga for each other.\nI wanted to get another video for my \"Intimate Couples\" series, and since Gabe normally drops his load inside Jarrett, I was eager to get that on film. It's pretty dang hot, and you even see that as soon as Gabe fills him up, Jarrett starts to cum! I really scrambled to get both cumshots since they busted simultaneously.\nThe video is long therefore the file sizes are big. These guys are making love, and take turns fucking each other. So be prepared for long download times.\nI actually had 45 minutes of video, and it took a lot of editing to slice this down to 23 minutes. In fact I even had a cute but not overly sexual shower scene where they scrub up afterwards, but had to cut it out to keep the file size below 300megs.\nPerhaps it can be added to a Director's Cut later or even maybe as a hidden gem that I could provide in\nwindows media\nor\nquicktime\n.",
  "models": [
    {
      "name": "Gabe",
      "person_id": 7315
    },
    {
      "name": "Jarrett",
      "person_id": 3223
    }
  ],
  "release_date": "2008-02-15",
  "scene_id": 658,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Creampie Breeding"
  ],
  "title": "Gabe & Jarrett - RAW"
}