{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a Serviced video I debated airing also, it has a little blooper action in it.\nPerry is a cute guy, but there are parts of the video that made me and my friends giggle when I showed them the first cut of it.\nThe video has all the hallmarks of a good Serviced video. Uptight straight guy that is clearly nervous, watching his porn, but slowly ignoring it and enjoying the sensation whole-heartedly. Perry's facial expressions are all over the map, and sometimes they are kind of funny, but they get serious. He especially got into the ass eating.\nBut the part that had me and my friends smirking was more at my behavior.\nLike most of the straight guys, they usually confess that they have trouble cumming from blow jobs. I usually put their mind at ease by saying that that isn't a problem. If worse comes to worse, he can take over and get himself close, but to try and let me take over at the last minute.\nNot something I've have had to resort to too often. Most of the guys I can make bust, and Perry wasn't going to have any troubles cumming. He looked like he was holding back through most of the video.\nSo that little bit of advice must have confused him. Perry must have thought that I had told him to take over when he was about to cum, and just as he was about to bust he goes to grab his dick. I shove his hand away, not even sure why he is trying to take his dick away from me. Mine!\nIn the original cut of the video, where I replay the cum shot from different angles several times, I had the hand shove in the replay, and it just looked hysterical three times in a row. And my friends were gleefully laughing at me when I showed it to them. Somehow I didn't think you all would find it as amusing. It's still kinda funny.\nSo I reworked it so it's only in there once, and it's a lot less comical. And underneath all that is an amazing mouth dripping cum shot, complete with a glop hitting him in the chin!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Perry",
      "person_id": 3224
    }
  ],
  "release_date": "2007-12-29",
  "scene_id": 677,
  "tags": [
    "Sex Act - Oral Only",
    "Chest - Smooth/Natural",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Theme - Serviced",
    "Video - Bryan Appearance"
  ],
  "title": "Bryan & Perry - Serviced"
}