{
  "collections": [
    "ChaosMen"
  ],
  "description": "I heard word from Dakota that he and longtime roommate of 5 years were looking to move into a new place and make some rent money. Dakota explained that the two of them had done some nude photos and that they thought they could actually fuck.\nLevi arrived with Dakota and the two of them showed up with their cowboy shirts untucked and unbuttoned, big 'ole saucer-sized belt buckles, and in their jacked up 4x4. The epitome of good 'ole boy redneck!\nNow Levi was completely cold to this so it's the first time he'd ever been on video. You can tell. So he didn't have any time to adjust to all this newness. Dakota, he was pretty eager to get fucked. He's says he is straight, but he sure likes it up the ass.\nYou might notice that Levi's dick gets a bit wobbly during the middle of the shoot. During the first round of fucking, as they change positions, you can see Levi pull out fully hard, but little did I know, he had busted up inside Dakota seconds before they changed position.\nDAMN! No reaction, and I didn't catch any creampie action! Dakota and I were both pretty surprised.\nSo we took a break, and waited a while to see if Levi could get hard again. They really wanted to get paid, and I really wanted to get these two cowboys on the site for you to enjoy.\nThere's some wobbly action going on (though Dakota is pistol hard and gleefully bouncing up and down on his buddy's dick), and in the final position Levi's dick comes back to life long enough to make Dakota cum. Levi swore he could nut again, and sure enough he nutted all over Dakota's chest. Gotta love 18 year olds!\nThey've recently contacted me about Levi getting fucked by Dakota...so what do you guys think? More Bareback Mountain? (Sorry, it was too easy to not go there!)",
  "models": [
    {
      "name": "Dakota",
      "person_id": 3199
    }
  ],
  "release_date": "2008-03-07",
  "scene_id": 678,
  "tags": [
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW"
  ],
  "title": "Dakota & Levi 1 - RAW"
}