{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Decker's solo where he practically choked his dick to death to make it squirt, I knew Camden was gonna have his work cut out for him. I suspected I was gonna have to Stand at the Ready to help out.\nThere are a lot of Firsts for Decker. He's had a male-female couple suck his dick, but he's never sucked dick. He didn't think he could kiss, but sucking a dick would be ok.\nSo this video was kind of a Serviced video, but with a dude who would Service back.\nAfter about 10 minutes of edited video, I realized the video was getting long. There was actually about 45 minutes of the two of them trading blow jobs. Even though I can tell that Camden sucks dick good (Hmmm..I should ask him to try his technique on me!) I could tell he was gonna have a challenge making Decker pop. So I gave it the 'ole college try.\nIn fact, I figured I wouldn't be able to make him bust either, but the energy changed, and Decker was digging be Serviced by me AND having Camden hold him down.\nAnd Camden was persistent, he kept getting closer and closer to Decker's mouth, and I was surprised to see them kissing. It was getting hot. I even fed Decker's dick to Camden. HOT!\nAfter 3-4 failed attempts to make him nut, I handed it over for Decker to finish off. As he is cumming I'm shaking my head in in wonder, thinking to myself, there was no way anyone could have made him nut.\nNot a bad 'little video considering it's pretty much Oral only. Kind of a TagTeam Serviced vid!",
  "models": [
    {
      "name": "Decker",
      "person_id": 3238
    },
    {
      "name": "Camden",
      "person_id": 3231
    }
  ],
  "release_date": "2008-02-29",
  "scene_id": 681,
  "tags": [
    "Sex Act - Oral Only",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Hair - Brown/DK Blond",
    "Theme - Tag Team",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Theme - Serviced"
  ],
  "title": "Camden & Decker - Serviced"
}