{
  "collections": [
    "ChaosMen"
  ],
  "description": "It's been a while since you last saw Ajax on the site. His first time out he made an appearance during the Member Appreciation week in Dec. 2007, doing a self-suck facial kinda thang.\nHe was very nervous and it was one of the few times I had to setup the cameras and just leave him be.\nWell, a couple days later, he was calling back asking to do more work. I honestly couldn't think how a guy that nervous would want to come back so soon.\nIt turns out he was turned on by the whole process. He said he would do an oral video, and maybe even \"more\". Frankly I didn't want to bring someone in to do an oral video if he was gonna bolt from the studio. So I got out my trusty knee pads.\nHe showed up sporting a newly shaved head (me too!) and was very eager to get started. Turns out, he loves having his dick sucked....a lot!\nHe spent very little time watching the pussy flick, and was much more interested in watching himself get sucked off. I normally don't pay attention to what the guys are doing, but he is clearly watching himself. I did warn him to not put his knee up and block the shot, and I think he realized he could see himself on the cameras and was fascinated. You might not like him breaking the 4th wall, but I like the way the video turned out.\nWe stopped a couple times 'cuz he got too close, mostly when I was eating his ass out, which from his solo, I knew he would dig.\nI think Ajax is looking great, and hopefully he is over his camera shyness. I definitely need to put him with a gay guy who would be way into this beefy football player.",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Ajax",
      "person_id": 3243
    }
  ],
  "release_date": "2008-04-23",
  "scene_id": 688,
  "tags": [
    "Sex Act - Oral Only",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Ajax & Bryan - Serviced"
}