{
  "collections": [
    "ChaosMen"
  ],
  "description": "I didn't think this day would ever come. Maverick fucking a dude!\nIf you've been following along, I have been stepping Maverick through more than a couple oral videos. Each time he was getting more ambitious with each shoot. But still he'd never actually been in a room with another naked guy.\nHe called me a couple times to ask if I thought he could actually get through a fuck scene. To be honest, I just didn't know, but he thought about it over many weeks, and he finally said he was in.\nSilas was given this giant task of playing with not only an uptight straight guy, but one with a very large dick. You really can see the scale of just how fat and long Maverick's cock is when Silas puts it in his mouth or ass. Silas actually enjoyed it, and I'm wondering if I've got a size queen on my hands!\nI told Silas the goal for the shoot was just to focus on Maverick, that I didn't care if he stayed hard or even nutted, as I wasn't sure how Maverick would react to having another penis sooooo close to him.\nMaverick did great! He's definitely still avoiding looking at his partner, but then if he was making sweet passionate love, you wouldn't believe he was really a straight guy. Baby steps with this one!\nAs always, Maverick nutted gobs and gobs of spunk all over the place, and he even didn't mind giving Silas some support for his cumshot. I just love working with Silas. He is a such a great guy.\nI'm hoping Maverick will keep coming back and after this shoot, I'm guessing he can \"let go\" and really go full force. Who knows, maybe he will actually TOUCH another dick!",
  "models": [
    {
      "name": "Maverick",
      "person_id": 3207
    },
    {
      "name": "Silas",
      "person_id": 3229
    }
  ],
  "release_date": "2008-03-21",
  "scene_id": 689,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Maverick & Silas - Wrapped"
}