{
  "collections": [
    "ChaosMen"
  ],
  "description": "This was the first time working with Shawn, other than solo and Serviced video. He said he had topped another dude in a video, and that he would be down with that and maybe more.\nLeo was eager to not be the new kid on the block, and was real good at trying to relax Shawn but of course, keep him excited.\nLeo apparently gives great head, and kept Shawn wiggling around. After we switched gears, it took Shawn a bit to get in the groove. OK, so he is a bit wobbly to start off with.\nI know you guys never think these guys are straight, well, Shawn is, so he did find fucking a dude a lot different, despite doing it before.\nHe was worried his dick wouldn't stay hard, so he quickly put it in, sending Leo shooting across the bed in pain. It wasn't even a cute out take. So they had a rocky start, and Leo was sore from the get go. Bless his heart.\nI keep seeing people say that Leo is gay. I admit, he sure does confuse me. But I sit and watch him get warmed up and erect looking at the box covers of pussy porn--so if he's gay, he sure is confused! Frankly, if I had 3000 watts of lights, cameras, and a pervy videographer hanging out waiting for me to get hard, I would be looking at porn that excites me, and the female porn sure works on him.\nHe likes to bottom, mainly because I think he thinks he doesn't have a porn cock. I really want to see him top a dude, but I have so many straight guys that won't bottom, he's gonna be on bottom duty.\nThe cumshot is pretty good, though Shawn does one of those soft dick cumshots that even I notice if I am taking decongestants. But a lot sure cums out!\nAnyway, I hope you enjoy these two really hot dudes!",
  "models": [
    {
      "name": "Leo",
      "person_id": 3225
    },
    {
      "name": "Shawn",
      "person_id": 3234
    }
  ],
  "release_date": "2008-03-14",
  "scene_id": 698,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Leo & Shawn - Wrapped"
}