{
  "collections": [
    "ChaosMen"
  ],
  "description": "As soon as Skyler was done with his last shoot with RC he was asking to come back and do more. Despite it being his first time with a dude, if you watch his last video, you could tell he jumped in to the new situation eagerly and smoothly. He's been hitting the gym, got a little color, and is growing his curly mop out a bit. His goal is to be the Best at what he does- an admirable goal!\nYou can usually talk the guys in to topping a dude to start off with, but Skyler said he would be willing to try it all, but yeah, he would start off by topping.\nNow Kurt prefers to bottom, mostly because the pressure is not on him to stay hard the entire time. This was his first time doing full on sex for my site, and he came to me with a few preconceived notions as to how his body would perform. He certainly is very enthusiastic about guy sex, but could only be fucked one way, and he wouldn't get a hard on, and this won't work, and the laundry list of \"can'ts\" went on and on.\nThen he met Skyler who was patient and was really keen on making sure Kurt had a good time. Something definitely clicked between the two of them. I talked to Kurt about what would work for him, and what we could do to make the experience not only enjoyable but hot.\nSkyler took his time grinding his dick on Kurt's body, getting themselves charged up. Then I had Skyler start by fucking him doggy style, a position Kurt said wouldn't work for him, but I wanted Kurt to have control of the depth and speed. In no time at all, Skyler had him rock hard and we had to stop and try another position, because Kurt said he was going to cum. Shocking!\nSkyler quickly flipped him on his back and Kurt still couldn't get over how good it felt, but he was now focused on how good it felt doggy style.\nNormally ya try to cover at least three positions in a film, but Kurt wanted to go back to the doggy style, \"Uh Bryan, that felt good, can we do that again?\"\nSkyler obliged, fucking him for just a minute, then blammo, Kurt accidentally busted. He was literally astounded that he came while being fucked. He was all apologetic, but once again, I had the cumshot covered, so we scored all the shots. Skyler quickly played hot dog in the bun and busted a nut while Kurt caught his breath.\nThe best part of this shoot, is not only did Kurt realize bottoming actually felt great, but Skyler saw Kurt's 180 turnabout and said, \"Alright, hook me up to bottom. I wanna try that!\"\nSweet!",
  "models": [
    {
      "name": "Kurt Wild",
      "person_id": 3133
    },
    {
      "name": "Skyler",
      "person_id": 7242
    }
  ],
  "release_date": "2006-03-31",
  "scene_id": 70,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Theme - Wrapped",
    "Video - Standard Def"
  ],
  "title": "Kurt Wild & Skyler - Wrapped"
}