{
  "collections": [
    "ChaosMen"
  ],
  "description": "At 6'6\", Tobias was a hardcore basketball player till injuries took him out of the game.\nHe's super duper shy and quiet. He's of mixed heritage - half-black and half white.\nGiven the number of videos that I suck guys off, you'd think it was happening all the time. Well, it's not, and if it does, it's usually planned out.\nTobias is not into jacking off. As soon as it was time to do the hard-on shots for the photos, he was asking me to wake his dick up. Like I would say no.\nIt was a little worrisome, cuz in the back of my head I was thinking, \"How in the heck is he gonna get his dick hard for the solo we had planned?\"\nEvery time he needed to be charged up, I was down there suckin' on him.\nAs you can tell by the video, I gave it my best to film this as a solo. Personally, I love solos. I love watching straight guys beat off. I think because growing up, I didn't think straight guys did it.\nFinally, I just gave up on him and propped the camera up on a tripod and went to town.\nSo this video is half solo, half Serviced. He clearly wanted me to make him nut, which was a bit of challenge, I'm sweating up a storm.\nAt one point, he lost his hard on. I knew he was enjoying his ass played with, so I snuck down and rimmed him and he got hard again without even touching his dick.\nI like this video. The angles are different, and though he is quiet, you can tell he was way in to it.\nI suspect he will be back for more, given how relaxed he was. Now I just got to find someone who matches his height!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Tobias",
      "person_id": 3252
    }
  ],
  "release_date": "2008-06-25",
  "scene_id": 711,
  "tags": [
    "Theme - Solo",
    "Ethnicity - Mixed Heritage",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Tobias - Serviced"
}