{
  "collections": [
    "ChaosMen"
  ],
  "description": "I found out that Jayce likes the other dude to take control, so I put Shawn in the driver's seat. Jayce seems to respond naturally to mature guys also, so I new some real live chemistry could happen.\nEvery time I see Shawn I hear more of his sexual exploits with dudes, so this time I was like, \"Dude, your sucking his cock.\" to which he responded, \"No problem.\"\nI noticed when I suck dick, I might get hard for a bit, but overall, I lose it. If I'm not paying attention to it, it goes away. I think most guys are that way, and typically in a scene, if all a guy is focused on blowing someone, they tend to go soft.\nWe didn't bother trying to get the guys worked up before the shoot. Something I often try to do. Remembering that every second is precious, and the longer it takes to get to the action, the longer the download time of the video will be. I try to keep the vids at about 15 minutes, cuz when they creep up to 20 its a mega download. Starting with a hard-on saves you all download time.\nThe point I'm trying to make, is that this time out I let Shawn get Jayce hard from point zero, and it's cool to see him get hard before our eyes. But I also scored a bonus when Shawn removes his pants (and I left some awkward camera maneuvering to get into place). Wonders of wonders, he was bone hard without even touching himself!\nI asked Shawn about it after the scene, and he said it was cool to make a dude get hard like that. It turned him on.\nThe oral thang was working and they both got off on it, but we soon turned to fucking.\nNow Jayce, he likes getting fucked on his back. It makes him cum. So I saved that for last. Shawn likes to nut upright. For one position he fucks Jayce as he is laying face flat (and his dick never wilts - mine would!). Shawn kept getting close and he asked me if he could nut then.\nThis put me in a quandary, cuz I know the best way to make Jayce cum is to put a dick up is rear. But I told him to go for it since he was so close. Shawn promised he would get hard again to fuck him at the end.\nNormally, the Top nuts last. Not this time.\nWe got rid of the condom and he ramped up in minutes, all the while eyeing Jayce's amazing bubble butt.\nAnd sure enough after a 15 minute reset, Shawn had his dick hard and up Jayce's ass again. I told Jayce he should nut quickly if he can, cuz there was no telling how long Shawn was gonna stay hard after just cumming. Jayce replied, \"Uh, no problem.\"\nIn a minute, a giant perfectly straight and white strand of DNA was on his tummy, and while Shawn had lost some of his volume, he was still buried in Jayce's ass.\nVery hot video and for two \"straight\" guys, they seemed to be genuinely into it!",
  "models": [
    {
      "name": "Jayce",
      "person_id": 3226
    },
    {
      "name": "Shawn",
      "person_id": 3234
    }
  ],
  "release_date": "2008-05-16",
  "scene_id": 713,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Jayce & Shawn - Wrapped"
}