{
  "collections": [
    "ChaosMen"
  ],
  "description": "I know many of you are skeptical about a model's \"first time\" but Alec's first time getting fucked by Jonas really surprised him. I think if you are not fond of bottoming, then you can't see how someone could take to it so quickly. Perhaps bottoms are less skeptical?\nBut Alec sure did take to it fast. He says it does hurt a bit at first, but his cock loves it and it makes him want to cum faster. Getting fucked by Troi is his second time, and I guess I just figured he could take Troi's large cock given how easily it was to get him fucked by Jonas.\nThere is an OutTake at the end to show the skeptics that it is not all, \"Yeah! Put it in and fuck me hard!\" from the get go. I know some love to see the multiple attempts at taking a cock, but it kinda ruins it for me. I guess I want to know the guys are enjoying it. The OutTake gives you a glimpse at what can happen when a cock is a bit too big for the hole.\nBut accommodating Troi's fat dick, his second time getting fucked was perhaps biting-off more than he could chew. After that first 'ouchie' penetration, he was immediately in the Zone and Troi does enjoy making guys squirm around on his cock.\nWe also wanted to train Alec on cock-sucking. He teethed Jonas pretty bad on his first attempt, which you can see on Jonas' face several times. I had warned Troi, but he gave Alec a big thumbs up for the blow job. Troi's continues to drool like a St. Bernard when he gives head. Something I wish I could do as I constantly reach for some lubrication to avoid desert mouth. He puts his spit to good use, slobbering all over Alec's rather large cock..and his hole!\nWe used a chair to give us some cooler angles, so hope you enjoy that.\nMaking Alec cum is super easy. Just fuck him and he will bust in under 60 seconds. Like Jet, he seems to have to hold back from cumming the entire video. I do wish he would get rid of his new kitty, and the cat scratched hands are a bit frustrating. Of course it would be his jerk-off hand. ~sigh~\nTroi has got the cum pump down to a science! He fills his boy up nicely!",
  "models": [
    {
      "name": "Alec",
      "person_id": 3600
    },
    {
      "name": "Troi",
      "person_id": 3586
    }
  ],
  "release_date": "2014-05-09",
  "scene_id": 7135,
  "tags": [
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Video - OutTake"
  ],
  "title": "Alec & Troi - RAW"
}