{
  "collections": [
    "ChaosMen"
  ],
  "description": "As I mentioned in Neil's solo summary, he had previously had his dick sucked by a guy, so he wasn't extremely nervous about this scene.\nHe did seem to cum fairly quickly during his solo, and Glenn and I have been practicing some sucking and hand job techniques. I told Glenn that I thought he might be able to make him cum since he seems to easily nut from a blow job. Most guys cant.\nWe used the couch to do the oral, and with Neil's downward curve it worked out great, though Glenn did have to do a bit of a balancing act!\nThat didn't stop him from throwing his all into it. He was determined to make a guy nut this time out. You can really see his skills have improved, and clearly Neil is enjoying it.\nNeil also liked the ass play, and though I don't know if he will come back, my guess is he might try bottoming before topping.\nThe highlight is Glenn making a guy nut. My memory is failing, but I don't think he has yet to really make a guy cum. He is great at taking a nice open-mouthed facial, complete with cum-bubbles. Some see this as him not being good at his job, but to be honest, not many guys like cum in their mouth and I see it as one of his strengths that we usually get a sloppy facial on him. It adds variety to the other cum shots Ransom and I do.\nThis time out, he jerk's Neil's cock till he shoots a giant load into the air. I think Glenn felt happy he could make someone nut, and maybe a little pleased to not have to go home with the Red Eye of Shame from guys busting in his eyes!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Neil",
      "person_id": 7230
    }
  ],
  "release_date": "2014-04-16",
  "scene_id": 7244,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Glenn & Neil - Serviced"
}