{
  "collections": [
    "ChaosMen"
  ],
  "description": "Gennaro hit me up to do more work after having been away about 4 years. He is a very reluctant performer, still just wanting to be serviced orally, but I basically told him he needed to step up to the plate, after thinking about doing 'more' for years. It was time to just dive in all the way!\nI knew he would be nervous, and after Ethan was super quiet during his solo, I called Shiloh up last-minute and asked if he could come in and help 'facilitate' two newbies to porn. I told him he didn't need to cum, just make things happen!\nGennaro did great, and Ethan was finally in his element getting bossed around by Gennaro and Shiloh. They both eagerly suck on Gennaro's cock, who you can tell likes to be serviced and in charge.\nThe two rotate Gennaro around, taking turns sucking his cock and eating his hole. Ethan latches onto Gennaro's cock with his mouth while Shiloh crawls to the floor to get Ethan's cock hard with his mouth.\nThey eventually move over to the bed, where Ethan continues to suck on Gennaro's cock, while Shiloh, top that he is, is eagerly rimming Ethan's backdoor.\nShiloh stands on up and has Gennaro suck on his cock, while his own cock is being expertly serviced by Ethan. I do believe this is the first time he has officially sucked cock, but he isn't being shy about it. At last! He finally commits!\nRunning with the success of Gennaro finally breaking the oral barrier, it was Ethan's turn to get sucked by Gennaro. Shiloh continues to go after Ethan's hole. After that, I coaxed Gennaro into sucking both their cocks.\nEthan and Shiloh were loving having a straight guy suck on their cocks, and the two break out into some very hot and intense kissing. There was definitely some chemistry going on between these two!\nEthan lays down for some face-fucking and a facial. Gennaro ramps up and busts in his mouth. Ethan takes a bit longer, and given that he had cum about 12 hours earlier, not a huge amount come out. Shiloh does give cumming a try, but after cumming earlier that day, I knew it was going to be a long-haul.\nBut Siloh's mission was fully-accomplished, having gotten these two nervous newbies to get in the Zone!",
  "models": [
    {
      "name": "Ethan",
      "person_id": 7245
    },
    {
      "name": "Gennaro",
      "person_id": 3368
    },
    {
      "name": "Shiloh",
      "person_id": 3598
    }
  ],
  "release_date": "2014-04-30",
  "scene_id": 7249,
  "tags": [
    "Build - Swimmer",
    "Build - Hairy",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Ethan & Gennaro & Shiloh - Serviced"
}