{
  "collections": [
    "ChaosMen"
  ],
  "description": "I love the body language in this video.\nIt's pretty tough watching yourself do these things on video, so I tend to look at them more analytical and distant. That carries over to any porn I watch. I think a lot of you analyze the videos too, based on the feedback I get in email.\nI like Reece's body language at the beginning. The guys have three options of where they can look during one of these. They can either watch the porn, close their eyes, or watch the blow job. The choice is theirs. Though I think Ajax opted to watch himself getting sucked off the camera's screen.\nReece didn't seem to want to watch the video. He opted to close his eyes, but is constantly taking peeks of the blow job.\nBut the body language I am most interested in is just before I get down to taking off his jeans. Reece throws his hands up over his eyes sereveral times. It's very telling as he tries to \"block\" what is about to happen. He eventually drops his hands and surrenders.\nObviously I let the guys watch some porn on their own first, just so I don't have to jump start their dick from zero every single video. This also trims down the file size - though I recognize the value of making a guy hard and include that in vidoes as well, but usually I'm trying to keep the pace going.\nAnyway, he didn't need anytime at all. I told him to sit down and maybe stroke his dick through his jeans. He unbuttoned the top, unzipped, and his dick was hard. I was like! \"Well Ok! You're ready to go now, button up and let's get started!\" Just like in the solo video, he was a bit embarrassed that he was turned on.\nThe ass eating is pretty good too. You can tell I'm tickling him, but his dick didn't wilt a bit, and I think I have a straight dude that might be curious about some back door action.\nI flip him on his back, and his body language changes. He is is open and ready..dare I say eager, to get a mouth back on his dick?\nYou can't ask for a better cumshot. Dynamic tension, great body expression! You can just see the explosion about to build, and totally one of the best cumshots on the site hands down.\nI dunno if you guys get tired of me blowing the dudes, but this one stands out in my mind. It's a good one!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Reece",
      "person_id": 3257
    }
  ],
  "release_date": "2008-06-11",
  "scene_id": 725,
  "tags": [
    "Build - Mature",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Reece - Serviced"
}