{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video is the 316th video I have filmed for the site, and its basically the first time you will see my name in a movie (other than my solo I made a bazillion years ago).\nI'm probably the most reluctant performer out there in the porn-o-sphere- no big banners with my name on them, heck, its not even part of the site name like most.\nNo sense denying it though, I do love Servicing all these hot guys, and watching them \"Wake-up\" to gay sex. So yeah, a TON of vids of that.\nWell, a couple weeks before the 'Solo' experience with Tobias, he was back wanting do more. After the shoot, we exchanged a couple text messages, and he sure was flirty (so was I). He was curious about doing more.\nThen one day he put it out there that he wanted to do more with me and said we could film it. (which of course meant he got paid...I have no illusions here!)\nI'm never keen on shooting self-videos that aren't in a more confined space. You may notice that the Serviced/Edge/G:hOle vids I pretty much keep the guys in one place so I don't have to worry too much about moving cameras around and interrupt the deed.\nI thought I could move the cameras around so it wouldn't be an annoying vid where you can't see the action.\nWhat I didn't count on was how into it Tobias was. We basically just went for it. I would look up occasionally to check to make sure we were still rolling.\nLots of oral in this one, and we both came as close to fucking each other as you can (lots of knockin' at the door!)\nI discovered Tobias loved dirty talk, and it was cool to play with his ass and say some nasty things, puttin him over the top...which is exactly what happened.\nThis was a tough video to edit. Anytime I am in one, its painful. My friends Bill and Ben looked at the raw footage and said to go for it.\nI clearly had some Winter weight (and parlour!), it was hard to compare me to this hot young guy with perfect caramel skin. He is 6'6\" and he is huge compared to me, it's kind of funny. Hopefully you guys will be more forgiving than myself!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Tobias",
      "person_id": 3252
    }
  ],
  "release_date": "2008-12-31",
  "scene_id": 730,
  "tags": [
    "Ethnicity - Mixed Heritage",
    "Build - Lean",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Tobias - Serviced"
}