{
  "collections": [
    "ChaosMen"
  ],
  "description": "There is just no guessing what these guys will be down for their first time filming.\nBased on Alec's solo, I thought for sure he would bottom. Then his Serviced video happened, and he talked more about topping and a little fearful of any ass play. So when he said he was down for more, and that he would try bottoming to start, I was actually surprised.\nA few of you wrote in that you were eager to see his massive cock in a dude's ass, and I am sure that will happen soon. Alec was just not sure he could stay hard long enough to top.\nI asked him if his girl plays with his ass, and he said \"No\" quite emphatically. Other than his own finger, that was about it. I got online, found the vibrating butt-plugs I like, sent a couple toys to him to test out. He said that they fit fine, didn't hurt, he stayed hard, and they made him cum!\nSo we were off to a good start!\nAs for Jonas, he is now in the game fully, except bottoming. But rimming, fucking, sucking cock. He now acts like a pro and can take charge with a newbie.\nI start them off simple with the side-by-side jack-off, and Jonas looks eager to suck on Alec's fat dick. He gets his cock fully hard, and I do believe Alec was impressed.\nOn the other hand, I don't think Jonas was impressed with Alec's oral skills. Truly a first timer, and Jonas a couple times looks as if he is trying to scoot away from the tooth scrape. It certainly is a believable \"first time!\"\nNow when it comes to the bottoming, that seems a little more unbelievable.\nWow! Alec really handles Jonas's cock like a pro. It helped that Jonas rimmed him, getting him in the mood to have something inserted. Usually we have a few false starts, but in it went, a little anguish on Alec's face, and boom, he was in the zone getting pounded for 10 minutes straight.\nHis cock stays hard the entire time! The dude REALLY liked getting fucked! I think this turned Jonas on too. Having someone so aroused from his cock made him all the more diligent in pleasing his partner.\nAlec cums from Jonas fucking him. Nooooo problem! Jonas has the juicing down to a science. Not a lot of intimacy in this one. That's a harder one for the guys to tackle, but its a solid first time video, with a bottom boy being born.\nExcept now Alec is a lot more confident and wants to top his next video. But I am pretty sure he will bottom the next one as he has a large cock and I will have to find the right guy.\nAs for Jonas, gonna put him in PURE video to see if we can work on the sensual energy and intimacy. It's in him. We just have to draw it out of him.\nThis is a great video with two really hot guys!",
  "models": [
    {
      "name": "Alec",
      "person_id": 3600
    },
    {
      "name": "Jonas",
      "person_id": 3589
    }
  ],
  "release_date": "2014-03-07",
  "scene_id": 7356,
  "tags": [
    "Build - Swimmer",
    "Build - Twink",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alec & Jonas - RAW"
}