{
  "collections": [
    "ChaosMen"
  ],
  "description": "I love it when two guys connect that I didn't think would have much in common! Tatum always has a fascination for built guys, so I knew that would be fine. Cooper actually doesn't seem real impressed with other muscular guys. His primary interest is women, so I think 'squishy' is more to his taste. And I certainly thought the body hair would throw him a bit.\nBut the two clicked on the car ride to the studio. Exchanging work out stories, girlfriend pics, and even a bit about movies they liked in common. Sometimes it is hard for the guys to find common ground, but these two talked my ears off on the drive!\nWhich turned out to be awesome. I didn't really count the minutes, but these two definitely liked kissing each other, and it feels like the most \"kissy\" movie I have on the site. Or maybe it is the most \"rimmy\"as both guy's took turns eating out each other's holes.\nTatum has topped infrequently, mainly cuz he gets so hard from being fucked. The last couple videos, he was struggling to not bust while getting fucked. That pattern still holds as his cock looks ready to pop the entire time he is riding Cooper's cock. Cooper and Gavin have similar sized and shaped cocks, and I think Tatum has found the Goldilocks size that hits all his right spots.\nTatum informed me that it was going to be so easy to bust, that he thought for sure he could get fucked upside down and give himself a facial. We have tried this technique before, and it is a challenge. But sure enough with just a little bit of jack-hammering from Cooper, Tatum spills his load all down his front side.\nCooper unloads all over Tatum's ass, then starts to eat it out of his hole!\nAll I can end with is that these two REALLY liked each other!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Tatum Parks",
      "person_id": 3496
    }
  ],
  "release_date": "2014-03-14",
  "scene_id": 7357,
  "tags": [
    "Build - Muscular",
    "Build - Hairy",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Chest - Hairy/Hair"
  ],
  "title": "Cooper Reed & Tatum Parks - RAW"
}