{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have mentioned before that Jonas loves watching videos of girls sucking on cocks. It is pretty much all he watches while trying to get hard for shoots. So he loves having a guy suck on him, and he is always determined to do a good a job when it is his turn.\nSo I thought having him do a Serviced video, where he is doing all the sucking, would be a good challenge for him. He does throw a lot of energy into it, and for sure keeps Owen hard, but you can tell, he IS a straight guy sucking cock. There is always a charm to that, but like Glenn, there are some skills that will need to be learned.\nWhen I shot this video, I thought Owen was staring at the TV the entire time, so I was surprised that he did sit back, close his eyes, and even watch Jonas suck his dick.\nThankfully Jonas doesn't mind rimming, and after the shoot, he was actually pleased with his ass eating experience. I think maybe because Owen has so little ass hair. It doesn't look to me like he shaves it, well at least no red bumps, but ass hair usually throws the straight guy when attempting this act. I was even more happy to see him keeping Owen hard while he played with and licked his hole. He definitely knew to keep paying attention to Owen's cock to keep him in the moment.\nI was pretty sure that Jonas didn't have the skills to make Owen cum. The advantage to that, like Glenn's Serviced vids, is we get a nice open-mouthed facial. Whereas when you make a guy nut, you may have to resort to just jerking him, and not even hit your mouth, no matter how close your hover your mouth over the cock. It is trade-off that I do try to balance in these vids.\nThere is a bit of a hard cut at the end as it took Owen about 10 minutes to get over the top, but his aim was true, especially since his cock was so hard, he could barely aim it down.\nAnd that Jonas, he knows how to blow cum bubbles!",
  "models": [
    {
      "name": "Jonas",
      "person_id": 3589
    },
    {
      "name": "Owen Michaels",
      "person_id": 3614
    }
  ],
  "release_date": "2014-03-12",
  "scene_id": 7359,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jonas & Owen Michaels - Serviced"
}