{
  "collections": [
    "ChaosMen"
  ],
  "description": "Aron had been requesting that he do a top video. He always seems so dominant during the couple serviced videos, I figured he would be a take charge kind of guy.\nHe hand-picked Jet off the site, and I do believe he got a little shy once he met Jet in person. For the first time he was nervous during a shoot, and Jet does take charge at the beginning, guiding Aron to take the lead.\nJet sucks Aron's cock until it is standing at attention. Aron sucks on Jet's cock, but he is more interested in his ass, often forgoing sucking or jerking Jet's cock, in order to finger and play with his hole.\nJet, not finding it hard to guess what Aron was most interested in, has Aron lay back, and then promptly sits down on his face. Aron tongues his hole while stroking his fat, uncut cock.\nJet spins around and devours Aron's cock, giving his hole totally over to Aron to rim and finger. Aron gets Jet lubed up so he can spin around again and sit on his cock.\nAron did struggle being in this passive position, but once we hot him up, he was fucking like no one else was in the room. Which is kind of a problem for filming a porn, but I let him have at Jet until he got his confidence up, and finally got him to showcase his action.\nJet is only too happy to have a cock inside of him, especially a big one that hits all the right spots. Aron makes Jet cum from fucking him on his back, and Jet got some distance on that shot, as rope of cum spreads across his entire chest.\nAron's first time doing a creampie on a guy was a total success, blasting a bit on his hole, then ramming his cock deep inside to empty the rest in!",
  "models": [
    {
      "name": "Aron",
      "person_id": 3572
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2014-03-28",
  "scene_id": 7360,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "X-Tras - Tattoos"
  ],
  "title": "Aron & Jet - RAW"
}