{
  "collections": [
    "ChaosMen"
  ],
  "description": "I believe it has been about 3 years (and 45 pounds more of muscle) since Prentice did his solo. He was a very popular model that never could get his head wrapped around working with a dude. Mostly it was about not wanting his friends to give him a hard time, but as one gets older, it usually becomes less important.\nAnd the holidays were coming around. He has kids and though he has a great personal training business, everyone needs some extra money around the holidays.\nLast week, if you tuned into Armani's solo, you saw that we had a bit of a blooper on that. In order to get a solid solo on him, everything shifted a day, and we weren't able to get his oral video done. Shiloh was set to do that oral, and I felt bad leaving him without his own holiday money, when Ransom texted me that Prentice was ready to go full-tilt with guy on guy work. I sent Shiloh some recent pics and he was more than eager to Service Prentice. We had a last minute replacement!\nI had no idea he had put on so much mass, and had forgotten just how big he is. I wanted to capture that by doing his Serviced video standing. Believe it or not, standing is a skill that most amateur guys do not have. Most guys are used to laying down, sitting or even kneeling. I shifted the cameras vertical to capture his mass!\nPrentice actually had problems getting hard for the opening photos where he was alone, doing the \"invitation\" photos \"Come suck my dick!\" So we were all worried he wasn't going to get his head wrapped around it.\nI don't know for sure, but to hear Prentice talk, I think he gets lots of offers to have sex, and likely hasn't had to spend a lot of time jerking-off. He has a hot girl to do the work for him. Once Shiloh took charge, his cock got super hard through this sweats, and popped out all engorged.\nI just have to give props to Shiloh who took on this massive dude whole-heatedly! He gets all piggy with him. Normally we stop filming to take some action shots but I just pulled out the flashes and took the photos as Shiloh kept him charged up. I cut that out of course, but the point is we shot this pretty much straight through, and poor Shiloh's jaws and knees were aching by the end.\nI especially like the ass-eating in this one. Shiloh is aggressive, and knows how to juggle the rimming while keeping Prentice hard and charged-up. I am certain he had a blast doing this video. Prentice even face fucks him with his head trapped against the bed. No escaping that cock!\nAnd there was no escaping his load either. Prentice shoves his cock deep down Shiloh's throat, unloading his seed into his tonsils. I don't know how Shiloh didn't gag, but he does a great job of showcasing the load, though I am sure he was not too happy not being able to swallow every drop. He starts scooping it back into his mouth, licking it off his fingers.\nThis is definitely a powerful serviced video with a hot muscle dude making the little guy his bitch!\nMy thanks to Shiloh, who fucking nails this video!",
  "models": [
    {
      "name": "Prentice",
      "person_id": 3367
    },
    {
      "name": "Shiloh",
      "person_id": 3598
    }
  ],
  "release_date": "2014-02-12",
  "scene_id": 7361,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Prentice & Shiloh - Serviced"
}