{
  "collections": [
    "ChaosMen"
  ],
  "description": "I mentioned in last week's summary about Baker that he and Glenn were both working their Winter beards. Glenn grew his out for 'No Shave November' and then his girlfriend really liked it, and it such a different look for him, that we have kind of kept it. I am sure it will go away soon if you aren't digging it. Facial hair is something these guys all seem to like to play around with.\nHe has stopped shaving his chest, and over the last two years, our little twink has turned into a hairy beast. When he started working for me, I don't think even need to shave his face or chest!\nI did have them both scale back/trim their beards as they were getting a little too \"hermit in the cabin\" for my tastes. But overall, I think it is great to see some fur flying on the site.\nBoth guys have beat-up knuckles. Glenn works construction and landscaping, as well as constantly tinkering with his ginormous lifted pick-up truck, so his hands usually are in bad shape, but the two of them were looking like they got into a fist fight before this shoot. Boys!\nHaving said all that, the two of them really get into each other. Baker loves having his ass played with while Glenn sucks on his cock.\nThe cumshot on this one is premium. Baker makes himself nut, mouth-wide open, and it takes Glenn abut 90 seconds to unload all over and riiiiight into Baker's mouth.\nBaker gurgles it around a bit, and I will be danged if the guy doesn't swallow the load! You can hear him gulp it down!\nGreat energy and a great ending on this one!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Baker",
      "person_id": 3615
    }
  ],
  "release_date": "2014-03-19",
  "scene_id": 7363,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Baker & Glenn - Serviced"
}