{
  "collections": [
    "ChaosMen"
  ],
  "description": "Yeah! Bentley was on Holiday Break and I got him to come in and stick his big 'ole cock inside a boy!\nI get Bentley on holidays and sometimes over a Summer, though I think one Summer he had a great Summer job so could only get him out once. I like that he makes \"guest appearances\" now and again, and we contribute to his engineering education.\nSo I am always stoked when he has time to fly out and do a scene. What is even better is he seems so much more relaxed and down for more. Ass eating and cock-sucking actually like fun for him, and I do believe he looks forward to his scenes. Maybe there is some Bi in him after all.\nWren is turning out to really like guys with big cocks. Hmmm..Size queen in the making, but still seems to play fully on Team Straight when at home. He loves to suck a big dick and Bentley gives him plenty of it. Bentley's hole gets a proper licking, and every time I see how excited he is by it, makes me want to get him to bottom.\nStill a \"No Go!\" on that front, but with his cock, I am not going to push it. He is a great Top!\nHe sucks Wren's cock with enthusiasm, and I really liked the way he plays with both their cocks, and then sucks on Wren's cock.\nUsing that upside down position Wren is already in, Bentley slides his cock right inside Wren's hungry hole. It just looks massive as it goes into super lean Wren!\nBentley even stops to lick Wren's hole and gets it all slicked up for more fucking.\nFrom that point forward, Wren is Bentley's bitch. He fucks the cum out of Wren, then juices his hole with his load!\nGreat match-up and yes, I will work on getting Bentley's ass fucked. It is time!",
  "models": [
    {
      "name": "Wren",
      "person_id": 3581
    },
    {
      "name": "Bentley",
      "person_id": 3486
    }
  ],
  "release_date": "2014-04-11",
  "scene_id": 7366,
  "tags": [
    "Build - Muscular",
    "Build - Twink",
    "Build - Lean",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Bentley & Wren - RAW"
}