{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jet had two tasks assigned for him in this video. While this is Owen's 'first time' with a dude, Jet kinda steals the show.\nJet's first goal, to conquer cock-sucking! Ok so he has done his fair share of Edge and Serviced videos, but he hasn't gotten very piggy with it. Jet tends to just suck on the knob, and he actually wanted to try some deep-throating. It will bring a tear to your eye when you see him succeed, and actually if you look closely, it does bring a tear to his eye as well!\nHe was really proud, and with this being Owen's first time, we knew he would struggle to suck cock back. I had them do some jousting, and Owen just took charge, and for someone reluctant to suck back, he sure is looking intensely as he strokes their cocks together!\nAs heatedly as he looks at Jet's dick, it was not enough to convince Owen to get wrap his lips around it. He does love being a bossy top, as well as being a good buddy by keeping Jet hard and turned-on while being Serviced. It is not as one-sided as I thought it would be.\nOwen does have some great skills at fucking, and Jet practically was cumming hands-free the entire video. Once I saw that Jet was in the zone to cum multiple times, and yelling \"Cut!\" because he was going to cum, I figured we would turn his multi-orgasms into a something a bit different.\nAnd that was Jet's second task. To see if he could pull-off a hands-free cum shot.\nIt was a total success! It is really hard to not grab your cock while you are cumming, and he has to reach down and jerk his cock here and there, but sure enough, Owen's ramming action makes Jet's cock splat out some majorly thick jizz!\nI do believe after almost 1400 videos this is my first hands-free cum shot from being fucked. I know, took a while, but had to wait for someone as gifted as Jet!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Owen Michaels",
      "person_id": 3614
    }
  ],
  "release_date": "2014-04-18",
  "scene_id": 7370,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jet & Owen Michaels - RAW"
}