{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sage was actually very excited to return and do more. I kept getting the feeling he might be more into guys then he let on, but never could get him to come out and say it. Mostly I think he doesn't like where he is living, really loved Austin, and was also eager to make some money. But there a few moments where I was thinking he might really be into it.\nAfter watching this video, you will see he wasn't quite there. He does seem to like to have his body worshiped, and LOVES having his cock sucked. The first 15 minutes of this video fly by. Vander is loving having some armpits to lick.\nBut the fucking was a challenge. He tends to fuck like jack-hammer, which while is a nice change, it does make it hard for us to get in there and see what is happening. He was struggling to stay hard. The actual fucking a dude part threw him. A couple times he is pushing rope.\nWe finally stopped for an hour. He was cold and took a hot shower and we picked up where we left off. He cleared his head and focused, and you can really tell the difference midway through the fucking portion of this video.\nVander as usual, is a joy to work with and actually stops a couple times to suck his cock back to life. Sage does actually fuck the cum out of him, leaving Vander quite happy.\nSage has such a domineering \"Suck my cock and eat my load\" vibe about him, that we opted for a facial. After all the work it took to get him in the zone to fuck, he literally shoots his load in under a minute. We when setup to shoot that part, we all thought we were in for a long haul for the ramp-up, but I do believe making Vander eat his load put him over the top super fast.\nVander tongues and then swallows the entire load. GULP!",
  "models": [
    {
      "name": "Sage",
      "person_id": 3610
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2014-04-04",
  "scene_id": 7371,
  "tags": [
    "Build - Muscular",
    "Build - Hairy",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings"
  ],
  "title": "Sage & Vander - RAW"
}