{
  "collections": [
    "ChaosMen"
  ],
  "description": "Braxton just keeps pushing his limits. He had seen Vander on the website and knew he was in for a mouthful. I made sure to tell him to do some jaw-stretching exercises before the shoot!\nAnd he was definitely into Vander's cock once he sees it. Fascinated! Braxton got pretty piggy with it. So different then his tentative first time with Wren.\nThere were four of us on the set, me, Vander, and Ransom, and the three of us agreed that Braxton must be an amazing guy to have sex with in bed. Just kind of watch how attentive he is to his partner. Reaching down to stroke his cock, give him a kiss at the right time. It is not even a subtle thing, it is just flat out obvious he is trying to please his partner.\nHe is also a lot better at getting his ass rimmed. Vander did some 'hotdog in a bun' on him and we were soooo close to having it go in! Frustrating I am sure, but I think he might have been mad if we pushed in too far. But he sure looks like he wanted it!!!\nBraxton does prefer to top, and he is a great at it. He was always keeping Vander hard, reaching back and stroking his cock at just the right time.\nThis was Vander's second day in a row filming. He is in school and now I only have holidays to work with him so we pack a lot into a couple days. But he was ready to go, and I do believe he got a crush on Braxton. He is totally crushable. A super nice guy, up-beat personality, and just a joy to be around.\nDespite getting fucked unmercifully for hours the day before, he busted his nut quickly while looking up at Braxton's amazing face as he slid his cock deep into him.\nAs for Braxton, he now gives Glenn a run for the money in the Spasming Cock showcase. He busts one nut on his hole, then pushes his cock in a bit, then you see his cock spasm and jerk as he fills Vander, pumping his load into him!\nFucking amazing!",
  "models": [
    {
      "name": "Braxton",
      "person_id": 3576
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2014-05-02",
  "scene_id": 7372,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "X-Tras - Piercings"
  ],
  "title": "Braxton & Vander - RAW"
}