{
  "collections": [
    "ChaosMen"
  ],
  "description": "As it turns out, Graham was hoping to do a massage table video...with me.\nHe confesses this halfway though filming this video that was what he was hoping for. As always we had porn playing, and I don't have a lot of gay porn on my streaming server. I have about 300 videos of the straight porn . Gay stuff numbers around 50, and mostly it is pretty hardcore stuff that Vander likes to watch.\nGraham requested a couple of ChaosMen Serviced videos to be playing in the background. Alec Serviced was his new favorite, but he liked Cullen and Troi also. I am embarrassed to say that I don't actually have any ChaosMen vids on the studio server. Like I said, most of the guys are straight, and Vander can see the ChaosMen vids anytime he wants.\nBut I fired up the NEW site and streamed some videos for him. Not a hitch or buffer problem. Even online movie and TV show streaming services I get hiccups, and don't get me started on failed downloads from the iStore. I really impressed with the new server setup ChaosMen has!\nOk, so back to the video. He was keen on getting serviced by little 'ole me, but of course I had Ransom up to bat to play with him. He dove in fine, but like a lot of gay guys, just kinda struggled as filming porn was not quite what he had imagined.\nSo we pulled out some Serviced vids to get him in the mood, and he also suggested some toy play. Now that REALLY made me happy as I don't get that too often. His cock loved it too!\nGraham busts his nut while Ransom slides a dildo in and out, spilling it all down the side of the couch and floor. Ransom stands on up, and shoots his load all over the dildo that is still sticking out of his ass, leaving two huge piles of jizz!\nGraham wants to come back and do a massage themed video, and I will have the table all setup for him!",
  "models": [
    {
      "name": "Graham",
      "person_id": 3628
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2014-04-23",
  "scene_id": 7376,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Graham & Ransom - Serviced"
}