{
  "collections": [
    "ChaosMen"
  ],
  "description": "Adler is a tall, lean, Russian-esque type of guy.\nI started asking guys to tell me their cock size and he said he thought it was 6 or 7 inches. As soon as we started shooting photos of him hard, I just put my camera down and grabbed a tape measure.\nI had him get his cock very hard, and sure enough, he was somewhere between 8.5 and 9 inches. He sheepishly said, \"I guess I grew some.\"\nHe was feeling relaxed, but was a little picky about the porn. He says he watches hours and hours each day (all free stuff of course) and has the habit of flipping through girls at a rapid pace. Well, this is a habit a lot of guys have these days, and it makes for sitting down to ONE video a problem.\nIt took us a while to get the perfect girl and that did the trick for him while filming most of the solo.\nThen it was time to cum. He tried and tried to nut. We stopped for a bit, ate a snack, then he went back at it. Two hours later he finally gave up. We had tried practically every video I had (even offered gay ones) and he really just couldn't get hard or stay hard. He was sure his cock was broke.\nI told him it was a long shot, but let me try to see if I can at least wake-it-up enough to hand-off to him at the last second, and just get the dang cum shot done.\nI lubed up his cock and in only 2 minutes I had him hard and quickly did the hand-off to him so he could cum on his own.\nAaaaand he loses it again.\nThat's it! I am just gonna make him cum. I left all of this in in the video, and you see in real time me getting him hard (again!) and him busting in about 2 minutes. Why didn't I offer this sooner?!?\nI can't figure out how someone can't make themselves bust. Most of us are pretty good at that, and having a dude do it for you, while a big ego boost for me, just seems backwards to me.\nThough, his reaction is priceless. He is staring at the porn playing for him, and you may have to turn the audio up, but you can hear his breathing and making teeny tiny gasping sounds which I reply back to with my own \"uh huh\" with my mouth full of uncut cock. We definitely are communicating with each other right up till he busts.\nThe orgasm continues to spread from his cock to his entire body. His body motion, which I basically miss 'cuz I was grabbing a camera, is awesome to behold! Glad all the cameras were running. I loved editing this part of the video! That orgasm must have felt fantastic after trying so long!\nHis cock was too tired the next day for a traditional Serviced vid, and he thought it would be a good long time before he jerked-off again. So this video will have to stand as both his Solo and Serviced scenes!\nOh, and there is a fun Out Take at the end!",
  "models": [
    {
      "name": "Adler",
      "person_id": 7381
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2014-04-28",
  "scene_id": 7383,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Oral",
    "Theme - Solo",
    "Video - Bryan Appearance",
    "Video - OutTake"
  ],
  "title": "Adler - Solo"
}