{
  "collections": [
    "ChaosMen"
  ],
  "description": "For Teo's Servicing, he was not nervous in the slightest. Ironically would only get quiet when he would get too close. There is a good out take at the end of this with his reaction 1-2 minutes into the video. On top of that, I just love it when he talks, he is such a \"dude.\"\nUncut guys are tougher for me to blow. Their heads are usually more sensitive so my man handling and squeezing a guy's head just doesn't work. Usually I just try to duplicate the foreskin slide motion they tend to do when they jack off. I tickle him a couple times for sure.\nHe smiles while getting his ass eaten, mainly cuz my whiskers tickle him, but as soon as I got him used to the sensation. he was locking his legs practically behind his head. A position perfect for fucking him in (still workin on it!)\nAnyway, this one turned out great and is a solid part of the collection. His body language is great as he lures me in to suck his cock, is not at all to afraid to touch me, and I don't think he looked once a the porn we had playing. The hand lock at the end is brief but significant.\nI am all about \"Themes and Rituals\" on this site. I develop the formula and I rarely move away from it. It frustrates some members who write me and say \"You always ask the same questions, say the same thing, etc.\" I am conscious of this and it will be apparent when you watch all these videos viewed at once.\nSo please, forgive me my rituals. I want the Themed videos to all have a certain rhythm, so that they are all completely recognizable on their own, or as a giant cock sucking compilation en masse!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2008-05-07",
  "scene_id": 739,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Long",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Cock - Uncut"
  ],
  "title": "Bryan & Teo - Serviced"
}