{
  "collections": [
    "ChaosMen"
  ],
  "description": "Welcome to the 500th video on the site. Ok, so there might not be quite yet 500 on the site, as I don't release videos in the order I shoot them, but it was the 500th video I shot.\nTo celebrate this momentous occasion, I thought a 5-Way gang bang would be appropriate!\nEnter Will, who told me he loves guys with big cocks (the bigger the better) and his fantasy of being fucked by a bunch of them.\nSo I knew I had to find 4 other well-hung boys to treat Will right.\nRiley is definitely packing some meat, and he thought, \"The more the merrier!\" and agreed to be versatile for the shoot. They were set to be my core team.\nRiley and Will had instant chemistry, and like two dancers, stayed on stage the entire time. I dont think Riley's cock drooped once, and you can tell he is enjoying every moment with Will, as well as seeing genuine straight boys entering to get their dicks sucked and to do some ass fucking.\nFor this shoot, I told the guys that to stay on set, they had to have a hard dick. I hate group videos with a bunch of soft cocks. I set up 3 TVs in separate rooms so they could watch their pussy flick, get hard, come in, and stick their dick anywhere. Exit when they get soft.\n'Lil Ceasar was on set the most, followed by Barrett. Nathaniel was a last minute replacement, and bless his heart, it was his first time fucking a dude. Talk about trial by fire. He had the most trouble staying hard, but I can hardly fault him. After the shoot, he did say he wanted to come back and do some one-on-one.\nLike I said, it was a bit like a dance, with partners coming and going, with a couple occasions having 5 guys on the set at once. A crescendo of man sex!\nHaving five guys nut is always a challenge, so I just asked them to get themselves close, then just come in and nut. Very few false alarms, and both Barrett and Nathaniel nut fairly close together.\nWith little time lapsing between their nut shots, Ceasar climbs on top and shoots all over Riley. Thankfully, I had another camera running the wide shots, because Will literally starts to nut at the same time. Riley, who has his dick inside Will, quickly yanks it out and plays catch-up with his partners.\nThe room smelled of sex and sperm, and I have to say, it is an amazing ending to the 500th video!",
  "models": [
    {
      "name": "Barrett",
      "person_id": 3302
    },
    {
      "name": "Ceasar",
      "person_id": 3623
    },
    {
      "name": "Nathaniel",
      "person_id": 3258
    },
    {
      "name": "Will",
      "person_id": 3309
    }
  ],
  "release_date": "2009-05-01",
  "scene_id": 7394,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "5-Way 500 - Wrapped"
}