{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bay is such an amazing bottom. Clearly he loves to get fucked in each scene. He has only occasionally topped, which I believe we have had to resort to some sort of anal stimulation while he was topping.\nBut lately he has been feeling really bossy, and when he saw he was going to work with Alec, he got all \"bossy daddy\" on me, and said he we would love to fuck the shit out of him.\nThen on the other hand, Alec has been eager to top, so I figured we would have a great flip-flop video. But much like Bay his first few times attempting to top, Alec's cock would wilt almost immediately. Something to do with a hairy hole and the sudden pressure to perform. I think Bay has gotten over those issues, but Alec will need to work on it.\nAlec only tried twice and he said, \"Just fuck me the whole video. It feels best anyway.\" Never even made for a fun out take to include in the video.\nThat encouraged Bay even more to be a dominant top. We try to do some face-fucking on Alec, but he still struggles with his gag reflex. Didn't seem to bother Bay that someone was choking on his cock. I would say he rather liked it!\nSince Bay was so turned-on, we tried some different positions, and there is a great moment where he is planking Alec and just looks devilishly at the camera as if to say, \"Don't you wish you were here?\" Cheeky bastard!\nBay makes Alec cum upside down, and he spills a giant load. Not sure how much actually hit his face for the facial-action, but he did splatter a little. Bay bred his new boy, struggling to get his cock in at the crazy angle, but one thing is for sure, Bay is now a confident top!",
  "models": [
    {
      "name": "Bay",
      "person_id": 3554
    },
    {
      "name": "Alec",
      "person_id": 3600
    }
  ],
  "release_date": "2014-06-06",
  "scene_id": 7396,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alec & Bay - RAW"
}