{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kellan had a great time doing the Pure video, but he did find it a challenge to stay hard during his shoot. He sure had amazing energy, but we did a lot of starting and stopping during the fucking portion.\nI told him, while he has an amazing cock, hot body, he might do better to try bottoming. He took a couple months to think about it, had his girl play with his ass some, and he said he would try to come back and make it happen. Just as long as the dude wasn't too horse hung.\nCooper Reed has a nice long \"lean\" cock which is perfect for first-timers. I don't think I have ever seen him go limp while slowly and tentatively trying to ease a newbie into the ass fucking.\nKellan also is way into fitness training and I think the magic he felt with Solomon during the Pure video was in part that he was with a dude with an amazing body. Cooper is right up there in the ripped category, and though Kellan towers over him, that same energy is in this video. Quite a bit of body worship going on in this video.\nBoth guys throw themselves into this video. LOTS of kissing!\nKellan had no problems taking a cock, and even found he was hard at times while getting fucked, and I do believe we got him to cum from being fucked on his first try!\nHe seemed cool after the shoot and ready to do more, but Kellan has his little business where he is offshore for long periods of time, so I think he just will be like Bentley and just pop in now and then to boost his income for some toys.\nPretty sure he will be back for more, but might be a little wait between times when he hits land!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Kellan Chestnut",
      "person_id": 3577
    }
  ],
  "release_date": "2014-05-23",
  "scene_id": 7398,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Cooper Reed & Kellan Chestnut - RAW"
}