{
  "collections": [
    "ChaosMen"
  ],
  "description": "At 6'3\", Roby is a very tall guy!\nHe has a military vibe about him, though no shaved hair cut, but his tatt and overall look seems military to me. He is a quiet guy, so hard to tell much about him. Stoic and serious.\nHe has never messed around with guys, and was not really sure about even being able to do a solo with another guy in the room. At least that is what I thought his reservations were about doing video work.\nWell, it turns out that cool, calm and collected Roby is a quick shooter. His cock springs to life with just a thought of attention to it. But not only that, he cums super fast. He had no idea how he was going to make it through the photos, much less a 12-14 minute solo jerk-off. Getting a blow job, from a guy? That might be enough to slow him down.\nSure enough his cock pops out of his underwear hard. \"I wanna play!\" it was saying. But like a kid who gets in too deep too fast, just a few strokes and he was ready to nut. I worried if we were going to ever make it to the solo.\nHe used to struggle with girls, often jerking-off just before a date or starting sex, so he could last longer. So at least I knew he could cum multiple times if he accidentally busted.\nSo no porn for him for the photos we took. He would just pause the player and look a bit at the girl getting banged.\nWe got all the photos done, then it was time for the solo. I told him the guy's usually lose their wood when they see all the cameras aimed at him, and I think Roby was actually relieved to see it NOT spring to life. More time to fill before he would cum.\nWatching his solo, you can just tell he is barely playing with his cock. He spends a lot of time playing with his balls or taint, avoiding his cock head as if it will bust just by brushing it. It is like torture watching him try to not bust! Good torture of course!\nHe thought standing up would be a the best way for him to cum, and I asked him if he was much of a shooter. He said he was sorry to disappoint, but he normally cums in a couple minutes, and barely clears his belly button.\nSo I thought I would rotate one of the cameras and get a different \"standing\" shot, thinking his load would just kinda dribble out, dropping down.\nInstead he shoots nearly 5-6 feet like a fire hose! I got the distance on one camera, but the vertical camera. Arrrgghh! Wrong call on that one!\nIt is TOTALLY EXPLOSIVE and he just keeps nutting and nutting as if his balls were packed with a month's worth of DNA.\nHe couldn't believe it either! Roby swore he had never cum like that before, as he never had hold out longer than 5 minutes at a time. 45 minutes was a new record. Well he set his own personal distance record as well!\nNext week he does his oral, and he is on the edge of nutting the entire time, trying desperately to not cum too quickly. It is evil and delightful!",
  "models": [
    {
      "name": "Roby",
      "person_id": 7404
    }
  ],
  "release_date": "2014-05-05",
  "scene_id": 7406,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Pubic Hair - Intact",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Roby - Solo"
}