{
  "collections": [
    "ChaosMen"
  ],
  "description": "With Roby always being on the verge of cumming, at first I thought to do an Edge video. But he is very quiet, and worried between the blindfold and the headphones with porn playing in his ears, me might not make it more than a minute.\nSo we went with implied bondage. I did want Ransom to keep in on the Edge of cumming, but I wanted Roby to use his words, and not his hands, to get Ransom to keep him at the edge, and then eventually, hopefully, begging to be allowed to cum.\nSure didn't take long before he was asking Ransom to stop. I had warned Ransom that he really had to let go quick, and he a bit of confusion crosses his face when the first time Roby stops him. As if thinking, \"Really? So soon? This is going to be too easy or too hard!\"\nWell it was easy. Ransom bats his cock around like a cat a with a toy, while Roby continually warns him that he is about bust. Ransom does misdirect to his ass, but even upside down and feeling a little foolish with his ankles to his ears, Roby was still super close.\nHe finally ask Ransom if he can cum, but Ransom is still not quite ready. We stop to take some pictures, and there is a little OutTake at the end of us talking about where best to to unload.\nThis video is pretty much shot in real time. I think we were out of there in about 25 minutes.\nRansom FINALLY puts some pressure on his cock head and with only about 5-6 strokes he is unloading into Ransom's mouth.\nI just love watching it finally happen. Roby gets stoic, but you can tell he is so relieved to finally have the nut let out of him!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Roby",
      "person_id": 7404
    }
  ],
  "release_date": "2014-05-14",
  "scene_id": 7408,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Video - OutTake",
    "X-Tras - Tattoos"
  ],
  "title": "Ransom & Roby - Serviced"
}