{
  "collections": [
    "ChaosMen"
  ],
  "description": "Spiro is back! He is now married and I guess confessed his porn past to her. Seems not only was she fine with it, but she said he may as well come in to make some extra money!\nWho else to put with our hot daddy, but a submissive bottom boy? Wren! There is an obvious height difference between the two, so I made sure Spiro was in the Top position for the kissing and oral.\nAfter getting his cock serviced, Spiro just took charge and kept his boy happy. Rimming and playing with his hole while holding his ankles over his head. Getting full access to the hole he is about stick his cock into.\nSpiro is clearly mature enough to know what he wants, and getting married and all, he hardly strikes me as the 'confused' type, but I swear he sure likes sucking dick and making a guy take his cock!\nWren is on top of his game too. I think he does better with the mature guys. Oh hell, he just likes anyone to be bossy with him. From young Jock to Daddy-type, I think Wren just loves to be dominated and penetrated.\nWren nuts super easy on his back, but I have noticed he pretty much is trying to NOT cum throughout his videos. So we had him ride Spiro's cock until he cums, and I think this worked out beautifully.\nThey even did an amazing job with Spiro ramping-up to cum while Wren sits down to milk his load. I find this one of the hardest positions to get a nice creampie, but clearly Wren wanted that load in him!",
  "models": [
    {
      "name": "Wren",
      "person_id": 3581
    },
    {
      "name": "Spiro",
      "person_id": 3549
    }
  ],
  "release_date": "2014-05-30",
  "scene_id": 7410,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Mature",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Spiro & Wren - RAW"
}