{
  "collections": [
    "ChaosMen"
  ],
  "description": "I sure underestimated Corban's cock size when pairng him with Jonas. I knew Jonas was going to be in town to do a full-scene, and he is such an eager cocksucker, I figured he could come in a day early and spend some quality oral time with a buddy. I didn't count on Corban being so donkey-dicked.\nAfter shooting Corban's solo, I texted Jonas that the scene went well, and that he had a really 'enviable' cock to look forward to the next day. Jonas wasn't too sure what I meant, but the minute Jonas saw it, he totally got what I was saying.\n\"Wow, I just wish my cock looked like that!\" Jonas said in a very impressed and slightly envious tone. I think Jonas might have a little length on Corban, but it is Corban's super-straight girth that make it look like an 'ideal' cock.\nJonas de I am sure I will have a few emails saying what a missed opportunity it was to not have someone super skilled in sucking, but Jonas LOVES to suck cock. His eagerness is really apparent, but he just doesn't have the finesse down. Jonas has likely only sucked 6 cocks in his life, and even the best of us would find Corban's thick rod a challenge. So cut him some slack, cuz he sure gave it the old college dorm try!\nDespite Jonas's lack of cock-sucking experience, he keeps Corban hard the entire time. This was one of those \"shoot the entire way through\" vids, with only one stop to take some pics.\nDuring the break to take photos we realized Jonas was not going to make him cum, but the great thing about Jonas is he is not afraid to get cum in his mouth or swallowing a cummy cock to suck the last bit of jizz out of it. Which is exactly what we did.\nNot sure if Corban will be back. He had fun, but even the blow job pushed him past his Down Low gut-reaction. I have asked him a couple times, but I think he is not ready to do more on camera. I told him of course to keep my number on speed dial if he changes his mind!",
  "models": [
    {
      "name": "Corban",
      "person_id": 7414
    },
    {
      "name": "Jonas",
      "person_id": 3589
    }
  ],
  "release_date": "2014-05-28",
  "scene_id": 7423,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Corban & Jonas - Serviced"
}