{
  "collections": [
    "ChaosMen"
  ],
  "description": "Byron said he was down to try doing a full scene. His wife is fine with him making some extra money, and with her VERY pregnant right now, he is also extra horny.\nMany of have been waiting for Glenn to get back into full-action while he went to cock-sucking school, so it is good to see him with his ankles in the air, and his big cock jammed into a dude's hairy hole.\nWe push Byron's limits right away by getting him to suck cock. He does a really good job of getting Glenn hard and standing at full-attention. Byron actually looks a bit more uncertain as he gets his own cock sucked. At first glance it may be Glenn's cock-sucking ability, but I think it has more to do with Byron liking to be passive...the one who does all the 'work'.\nByron of course wanted to start by topping, but he did confess his girl uses a good size toy on him, and it makes him hard and makes him cum super fast, and that bottoming likely wouldn't be a problem. He is little wobbly as he fucks Glenn, and again there is some uncertainty there that just doesn't make sense until you see Glenn take over the fucking.\nBryon is clearly a bottom!\nByron climbs on top of Glenn, easily slides his hard cock in, and SPROING, Byron's cock lights up! Glenn loves it when a dude is grinding around on him. He is on his best when the guy is digging it. Byron was definitely enjoying his cock going in and out!\nBoth guys have completely natural pubes and when you see Byron on his back getting fucked by Glenn, bush lovers will rejoice. There is just something about seeing those two hairy crotches so close together. Looks natural to me!\nByron attempts to do a hands-free cumshot. He said he had been close the entire time, and that usually his wife can make him nut easily with a toy, but he wasn't sure he could restrain himself from jerking his cock.\nGot to give him props for trying. Glenn keeps pounding out the squirts while Byron tries desperately to let his prostate help push out his load. He has to jerk it to keep it going, so not sure it counts as 'hands-free' but it is close enough for me.\nAnd for those of you missing seeing Glenn's snake writhe around while he dumps his load deep inside, you wont be disappointed as his cock looks like it is skipping rope as it dumps...well...ropes of cum inside of Byron!\nHis cock truly is a fire hose blasting out liquid!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Byron",
      "person_id": 3625
    }
  ],
  "release_date": "2014-06-25",
  "scene_id": 7428,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Byron & Glenn - RAW"
}