{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ethan did such a great job in his TagTeam oral, that I knew he would love having two hung dudes to service fully by getting all his holes filled!\nTroi and Sage both have significantly large uncut cocks, so we spend a fair amount of time getting Ethan in the zone, eager and begging to have his ass penetrated.\nEthan starts-off sucking both guys cocks, and even Troi and Sage get into some cock-sucking. I believe this is the first time Sage has actually sucked a cock. He stays hard while doing it, and to be honest, anytime the dude droops, he just needs a mouth on his cock. He seems to be very orally-oriented.\nThe two guys lay down, and Ethan goes back and forth sucking both guy's cocks. He eventually manages to get both dicks in his mouth, and both Sage and Troi were impressed! That is a lot of meat in one mouth!\nEthan climbs on top to suck only on Sages cock, giving his ass to Troi to finger and lubricate with his tongue.\nAfter being rimmed, Ethan eagerly spins around and sits down on Troi's cock while sucking on Sage. Sage shares his cock with Troi also, and I will be danged if Troi looks happy being face-fucked while fucking a dude.\nIt was time for Sage to get some ass, and his cock slides easily into Ethan's abused hole. Troi makes sure everyone gets a chance to clean his cock with their mouths.\nPretty sure Ethan's favorite part of the videos was getting fucked on his back by Troi, while Sage sat on his face. He loves to rim, and occasionally Sage would make him suck his cock then go back to eating his hole, all the while being bounded relentlessly with Troi's dick.\nI knew both Sage and Troi are best cumming standing, so they both take turns dumping their load inside of Ethan. Troi does not quite nail the cum shot perfect, fully dumping his load deep into Ethan. Internal breeding is hot, but I am sure the 'evidence police' will be think it is suspect. But sometimes when you got 8-9 inches of cock, it simply just get buried deep up inside of you.\nSage then has at Ethan's hole, giving him a second creamy load!",
  "models": [
    {
      "name": "Ethan",
      "person_id": 7245
    },
    {
      "name": "Sage",
      "person_id": 3610
    },
    {
      "name": "Troi",
      "person_id": 3586
    }
  ],
  "release_date": "2014-06-20",
  "scene_id": 7431,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Ethan & Sage & Troi - TagTeam RAW"
}