{
  "collections": [
    "ChaosMen"
  ],
  "description": "Armani did a fantastic job during his first Edge video with Bay. He said he would totally be down for bottoming, as long as the guy was not as hung as Bay. I promised him a cock that would have less girth, but made no mention of length!\nJonas was the perfect candidate for taking Armani's ass virginity. He stays confidently hard, doesn't have to go balls deep to stay hard, and can monitor his depth. He is really patient at breaking in a new guy.\nArmani has had toys inside of him, and they work, but I did worry that he might have bit-off more than he could accommodate.\nJonas takes off Armani's sneakers, give them a quick sniff, and then eagerly gets to his favorite part- sucking a cock! When it came time for Armani to suck Jonas, I think Armani was relieved to see he wasn't going to be sitting on a beer can, and that amp'd up his eagerness to do the scene. He was a bit nervous.\nActually, I think Jonas has got rimming down now, and he knows how to tease a guy with his tongue, making them want \"more\" to go inside. The ass eating alone got Armani in the 'zone'.\nArmani does have \"bottom\" written all over him, and true to his nature, he took to it like a fish to water. His cock loved all the anal stimulation!\nOn his very first fuck scene, Armani bust his nut from being fucked! It impressed Jonas, who still seems very reluctant to try bottoming. Armani told him it felt great, but Jonas had a look of disbelief on his face.\nDuring Jonas's creampie, Armani does encourage Jonas to put his cum inside of him, which totally floored me. The dude is an amazing bottom! Can't wait to get him back for more!",
  "models": [
    {
      "name": "Armani",
      "person_id": 3609
    },
    {
      "name": "Jonas",
      "person_id": 3589
    }
  ],
  "release_date": "2014-06-27",
  "scene_id": 7433,
  "tags": [
    "Build - Hairy",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Armani & Jonas - RAW"
}