{
  "collections": [
    "ChaosMen"
  ],
  "description": "With his high-n-tight haircut and aggressive tattoo action, Palmer gets asked all the time if he is a Marine or military. Instead, he is bright and social type of guy, who is super easy talk with. He is a guy who seems like has plan for life and is goal-oriented. Despite his aggressive looks, pretty sure there is not a mean bone in his body...besides his super thick mean bone!\nBefitting his amazing body, he is a personal trainer, and clearly spends a lot of time working on his own physique. He finds a lot of satisfaction in helping others to train and eat properly. He looks like he has never eaten a potato chip in his life as his body fat must be about 3%! Very enviable!\nHe has a girlfriend that seems like a keeper. She sounds equally secure, and gave a big thumbs-up to him coming to do guy-on-guy work. Seems like it a new relationship, but you can always tell by talking to these guys they are in for the long-haul with their sweethearts.\nI did book Palmer pretty quickly, so we didn't have much time to wait for his pubes to grow out. He was shaved bald, so we did manage to to get a little pube action. I did tell him to stop shaving his pits too. Not sure why some guys do that, but I am sure there are a lot more lovers of musky pits, then the shaved and soapy smelling kind! We can all watch it grow back together!\nHis solo is amazing! Totally into showing-off in a confident, yet not too cocky way. Palmer is not shy about showing-off his ass, and over all, he seems down for doing full-interactive.\nHe will be back next week for a massage, and he is already on the schedule to fuck a guy at the time of writing this summary.\nFor today though, enjoy this awesome jerk-off session!",
  "models": [
    {
      "name": "Palmer",
      "person_id": 7427
    }
  ],
  "release_date": "2014-06-02",
  "scene_id": 7436,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Palmer - Solo"
}