{
  "collections": [
    "ChaosMen"
  ],
  "description": "Palmer didn't seem too nervous about getting his cock sucked. As I mentioned during his solo appearance, he seems to be down to fully working through his limits. Though a bit before the actual shoot he did worry if he wouldn't get hard, much less have someone else make him nut.\nHe did say that a few girls have made him cum, but it was a lot of work and he felt bad at how tired they got. I assured him that a guy is a bit different, and Ransom is certainly strong and has the stamina to pull it out of him. He, like me, is very motivated to make the dude cum. We have reputation to maintain!\nI love my new overhead camera because it shows his cock peeking out behind him. Palmer's worries of not getting hard evaporated with just a little attention to his ass, and a few swipes of his cock head! Sproing!\nHe seemed to really like being rimmed, so Ransom knew he was in for an easy shoot.\nRansom flips him on over and goes for his cock, keeping his boner at full attention.\nI decided I wanted to do another Fleshjack video, and once again I heated the toy first. This time I wrapped it in muscle heating pad and also warmed the lube up. If you have one of these toys and hate sticking your cock into a cold slimy hole, plan ahead a bit, it is well worth it!\nA couple times Ransom had to slow down or risk Palmer nutting. He does decide to use some fist-action instead to make him nut, and it is so awesome watching Palmer writhe around as Ransom coaxes the load out of him!",
  "models": [
    {
      "name": "Palmer",
      "person_id": 7427
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2014-06-11",
  "scene_id": 7437,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Toys",
    "Theme - Serviced",
    "X-Tras - Tattoos"
  ],
  "title": "Palmer & Ransom - Serviced"
}