{
  "collections": [
    "ChaosMen"
  ],
  "description": "Byron had a great time on his first video with Glenn. They flip-flopped, but Byron seemed to be more of an eager bottom. He did get some more confidence topping, so he mentioned he was still interested in flip-flopping. He just seems to like it all, but bottom heavy!\nWith Bay being a more aggressive top these days, and also quite good at working the massage table, I knew these two would click instantly. Bay has a \"take charge\" attitude, while Byron seems to be a willing play thing.\nByron seems real passive, and having him on the table having his feet massaged (with Bay's cock!) and his ass rubbed and rimmed totally got him in the zone for getting his ass fucked.\nNot without some throat fucking first. Bay toys with Byron as he slowly rubs his cock head around Byron's lips before sliding his cock into Byron's mouth. He can't seem to get a good angle so flips him over on to his back, eventually losing the pillow in order to properly throat fuck Byron's face. I love watching his hands caress his neck as he attempts to slide his dick all the way down his throat.\nBay is good at keeping his buddy turned-on, so he climbs on top and true to his spider web tattoo, spiders his way on top of Byron to suck on his cock while getting his own knob serviced.\nBay flips him on over and licks his hole some more, getting it nice and slicked up.\nHe rotates around and rubs his hard cock all over Byron's hole, and then slowly power slides it into him, drilling Byron to the table. A very dominant position, and at first I thought Byron would be uncomfortable, but he inches his body up and his cock is hard and clearly he is very aroused. Very few guys can truly work the massage table, and Bay is a master at it.\nAfter fucking Byron a bit, Bay flips him on over and starts sucking on his cock again. He gets it totally hard, then climbs on top and sits on it. Bay loves to 'Get' as well as 'Give', so he is super turned-on, while Byron still seems a bit unsure about fucking a guy. Oh, he stays hard, but still looks a little lost as Bay bounces up and down on his cock!\nBay then gets Byron's legs up in the air and his big cock slides into his hole with ease. Byron's cock is dripping pre-cum everywhere as Bay dives in and out of his ass. Bay was in a great position to not only power fuck him, but also play with Byron's cock. Byron had to warn him from stroking him too much or he was gonna bust.\nI took that as a sign that Bay could fuck and jerk him to the point of cumming while he fucked him. I don't actually get this maneuver that often. I tend to like to top myself, and my all-time favorite thing is to fuck a guy while stroking him till he cums. See me and Ransom! It is kind of a power trip!\nWell, Byron was the lucky dude this day, and he seems dazed after it happens.\nBay was really close to cumming himself, so he busts his load all over and in Byron's hole. You have to look closely, but Byron cums a second time as Bay is busting his load. At first I thought he was just finishing his orgasm, but he said he came again!",
  "models": [
    {
      "name": "Byron",
      "person_id": 3625
    },
    {
      "name": "Bay",
      "person_id": 3554
    }
  ],
  "release_date": "2014-07-11",
  "scene_id": 7439,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bay & Byron - RAW"
}