{
  "collections": [
    "ChaosMen"
  ],
  "description": "After watching Armani perform in his very first full-interactive video, I knew he had the natural sensual vibe that I look for when doing a Pure video.\nCooper Reed always brings his 'A' game to these, and I just knew the video would be Pure magic, and it is!\nI think Armani has a little bi in him. Despite having several girlfriends between shoots, he still seems so incredibly responsive to Cooper. It just leaves you wondering what team he plays for. Granted, I think Cooper is so incredibly hot that you would have to be in a coma not to respond to him, no matter what your sexuality. It is safe to say that Armani was more than responsive to the attention Cooper gives him!\nThere is some bi in Cooper too. You would think he would steer toward guys that look like him, but after working with a lot of hot guys, he seems more interested in personality and stability, then physique in the guys that he is sometimes drawn to. Armani has an amazing personality on him, and actually is built quite nicely, so Cooper was easily totally drawn to Armani and his good-natured vibe.\nI let Cooper take charge in this video, and he gets Armani all slicked-up and turned-on very easily, paying extra attention to Armani's back door. There is a moment when Cooper takes his underwear off, and Armani says what a nice cock he has, he almost sounds mesmerized.\nCooper oils up both their cocks and does some jousting, but I think Armani was eager to suck his first uncut cock. Armani is equally mesmerized with Cooper's amazing body, truly enjoying running his hands up and down his chest and abs.\nCooper loves to rim and rolls Armani up to really dive in deep into Armani's hole. He eventually rolls him even higher and fucks him practically upside down, drilling his cock down into his hole. It is safe to say Armani is a bottom. His brain and cock seem to love being fucked in even craziest position.\nI will leave you to explore the rest of the video, but once again, Armani gets the cum fucked out of him. Cooper then uses his cum to fuck him some more.\nCooper does bust all over Armani while upside down, but cum flew all over. Cooper scoops it into his hole and eats the load out of his ass, then shares it with Armani for a nice cummy kiss!\nOh, there is a small out take at the end showing just how graceful I am!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Armani",
      "person_id": 3609
    }
  ],
  "release_date": "2014-07-18",
  "scene_id": 7440,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Pure",
    "Video - OutTake",
    "X-Tras - Tattoos"
  ],
  "title": "Armani & Cooper Reed - Pure"
}