{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video was actually filmed before Greyson did his solo.\nShiloh is into photography as well as a very creative dude. So I thought maybe he could do an interesting peep video. He thought about it for a couple days, and asked if he could have a buddy join in or help him. I told him it was alright, but he had to stay out of the camera, or I needed to get paperwork and the legal mumbo jumbo out of the way.\nShiloh sent me pics of one of his buddies that he hooks up with on occasion and said he was game. I thought he was totally a guy-next-door type. Kind of the baseball player that you always hoped would want to play ball with you! No sense keeping him BEHIND the camera!\nI set him up to do a solo, but Shiloh had already planned a trip to a little private cave he knew about, and out they went a week or so before me even getting him in the door. I told them to just do whatever they wanted, totally include Greyson, as I really wanted him to be part of the team.\nThis is not your average peep video, but more like a Serviced video. The two clearly have a thing going on, and it is fun watching them trade oral. The cave was not really good for fucking. Greyson's knees were taking a beating, so they stuck to staying upright, swallowing each others cocks.\nShiloh busts a major load all over Greyson's chest, while Greyson busts his own load. Shiloh, ever the showman, licks up his load, kisses him, even licks some of his own copious jizz.\nThere is a little pee break at the end. Nothing fancy!\nHope you enjoy the fun outdoors with Greyson and Shiloh!",
  "models": [
    {
      "name": "Greyson",
      "person_id": 7449
    },
    {
      "name": "Shiloh",
      "person_id": 3598
    }
  ],
  "release_date": "2014-07-02",
  "scene_id": 7445,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Piss",
    "Theme - Peep",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Greyson & Shiloh - Peep Serviced"
}