{
  "collections": [
    "ChaosMen"
  ],
  "description": "When I asked Elias if he wanted to do an oral, I suggested a couple models. His eyes really lit-up when I mentioned Shiloh would easily be available.\nImmediately after the shoot, I called Shiloh and asked if he wanted to come in for a blow job with a new guy and asked what days he was off from work. Both guys had the same day off, so it all worked out and it was squared away. I did send a few pics, but I think Elias was more familiar with Shiloh from his videos on the site.\nLater that evening, the two of them ran into each other at an event. I think Shiloh was taken a bit by surprise when Elias told him they were doing a scene together soon. I don't think he knew Elias lived in the same area, and based on my quick call and photo I sent to Shiloh, he was surprised this guy came up to him and knew who he was.\nIt was a pretty big coincidence, but Shiloh recovered quickly and they hit-it-off. They actually had some chemistry, exchanged numbers, then texted back-and-forth for a week or so until their filming day. I was worried they would hook-up before the shoot, but instead, they built up some real chemistry, chatting and flirting while waiting for their scene together.\nWhen the two arrived, they both clammed up, suddenly nervous to finally be back in the same room. Uh oh!\nBut bam! I put them in the bathroom and the sparks flew! Elias, who is naturally bossy, was eager to get a blow job. Both guys love rimming, as you can tell by the way they voraciously eat each other's holes!\nShiloh gives Elias all his cock sucking energy too! Elias strokes his cock, shooting his load, in his mouth and face. Shiloh laps it up, hungry for his cum!\nI think these facials are becoming a trademark for Shiloh!\nThere was some pent-up energy exploding on this day!",
  "models": [
    {
      "name": "Elias",
      "person_id": 7417
    },
    {
      "name": "Shiloh",
      "person_id": 3598
    }
  ],
  "release_date": "2014-06-18",
  "scene_id": 7447,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - G:hOle",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Elias & Shiloh - G:hOle"
}