{
  "collections": [
    "ChaosMen"
  ],
  "description": "I seriously over-estimated Thomas's sexual skills. Based on his great solo, and our chatting about the kind of guys he tends to go for, I figured he would be fairly experienced. But after watching this video, I think we can all agree he must be the one who sits back and enjoys the servicing from a dude.\nTroi tries to draw him out with some verbal suggestions. Thomas does try to give head first, but his foray into sucking cock truly looks like it IS indeed his first time! Troi tries his best to stay hard, but there was totally no sucking action going on. I think Troi was as surprised as I was. The guy seemed Bi, at the very least.\nTroi has become such a pro that not much phases him. He just takes charge and pushes Thomas onto his back and starts giving him proper head. Proper for Troi, which leans heavily to the sloppy wet kind!\nWe pretty much shift gears back to a standard Serviced video that we would do with a nervous first-timer. Troi handles the cock-sucking and rimming rimming duties in this one, drawing Thomas out some more.\nI love working with Troi. He is a great top, but not sure he can suck the cum out of a guy yet. He is very optimistic and eager to please. So we setup for a facial and both guys actually rely on some straight porn to get over the top.\nIf you like nervous first-timers, you will love this video!",
  "models": [
    {
      "name": "Thomas",
      "person_id": 7442
    },
    {
      "name": "Troi",
      "person_id": 3586
    }
  ],
  "release_date": "2014-06-30",
  "scene_id": 7453,
  "tags": [
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Thomas & Troi - Serviced"
}