{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sinclair has had a long-term girlfriend that has been on and off for many years. They have been 'on' for the last year. She seems to be the one in charge, and allowing him to do more porn was not going to happen.\nBut, now it sounds like it off for good, and as soon as it ended, I got an email from him, wanting come in and play.\nSinclair really does like coming out to do the video work. I don't think he is even Bi, but he loves traveling, getting away from home, and making extra money on one of his days off from work. He struggles to stay hard through the beginning of his videos, but put a cock in him and it perks right up! Truly a submissive bottom.\nHis latest passion is Parkour or free-running as it is more known in America. I am sure some of it is crazy urban style stunts, but based on the short videos he sent me, it is more of a holistic training, with wall climbing, obstacle courses, swinging, jumping, while generally keeping your momentum going.\nSinclair has really leaned up, not wanting to lift any extra weight. He has been doing some mid-level competition and it is always great to hear someone talk about something with so much passion. I don't know much about free-running, but the dude looks like a superhero flying over obstacles.\nSince the girlfriend is out of the picture, he no longer has to shave his pubes, so I do believe this is the first time he has shown up with completely natural pubes. Even his tummy hair is super sexy!\nWith his tighter lean looks I knew that he and Jonas would looks smashing together. Sinclair seems very passive, so bottoming suits him. Jonas, while I would not say is a bossy top, is happiest watching his cock slide in and out of someone's mouth or hole. Excellent chemistry!\nAnyway, I just thought I would make this Summary more of an update on what is has been going on in Sinclair's life!",
  "models": [
    {
      "name": "Jonas",
      "person_id": 3589
    },
    {
      "name": "Sinclair",
      "person_id": 3519
    }
  ],
  "release_date": "2014-07-25",
  "scene_id": 7455,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jonas & Sinclair - RAW"
}