{
  "collections": [
    "ChaosMen"
  ],
  "description": "I dropped Palmer at the airport after his solo/oral videos, and by the time he got settled through security, he texted me he was ready to come back for more! He was definitely going to throw himself into doing 'more' with very little hesitation.\nHe of course wanted to start by topping, but was down for sucking cock, though he said he likely wouldn't be very good at it. I told him that if he was too good at it, it likely wasn't going to be too believable anyway as his first attempt. He LOL'd back on that, and we setup a quick return date.\nSilas, who is now officially 30-years-old, has been maintaining his body with total diligence and I think he still looks amazing. Hard to believe he made his first appearance back in 2007! He seems more comfortable with being Bi these days, though women seem to still to be his primary interest. He is a tough one to figure out, but at least he seems really secure with the how he approaches life and sexuality.\nI had no idea how aggressive Palmer would want to fuck. He has a tough-guy vibe to him, and I know Silas can take a pounding. Turns out Palmer is a quite a pro, and once his cock his was up, it was up, and he can fuck in basically any style, but doggy was getting him to cum a little too soon.\nSilas does some shoe and foot play. He actually has a bit of that fetish is the 'real world'. It does take him some time to work Palmer's cock with his mouth to full-attention, but like I said, once he got it up, Palmer was a cockstar and totally got into it.\nI think the only time he wilts in this whole video is when he is sucking dick for the first time. He is gagging a little, and focusing on pleasuring Silas, so not really paying attention to his own cock. Palmer will get it down, and he certainly stays boned when they are 69ing it! How he managed that with Silas balls deep down his throat amazed me!\nThe dude was made for porn!\nThere is a great little out take at the end as Palmer almost cums too soon, and though his first creampie he struggles to let go of his cock to showcase, Silas makes up for it by unloading on his feet and licking the cum off his feet. So a little taste-treat at the end for foot lovers and cum eating!",
  "models": [
    {
      "name": "Palmer",
      "person_id": 7427
    },
    {
      "name": "Silas",
      "person_id": 3229
    }
  ],
  "release_date": "2014-07-04",
  "scene_id": 7459,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "Video - OutTake",
    "X-Tras - Tattoos"
  ],
  "title": "Palmer & Silas - RAW"
}