{
  "collections": [
    "ChaosMen"
  ],
  "description": "I asked both Gennaro and Griffin if they had used Fleshjacks before, and neither had. They are kind of expensive, so it is not surprising that most guys have not spent a good chunk of change on one for personal use.\nGriffin is a very sexual guy, and Gennaro was eager to get a nut off. Both guys are hard and ready to go even before we started. Griffin, though it is his first film, is clearly the more experienced, and the aggressor. They both REALLY enjoyed the Fleshjacks, and they take turns kicking-back and letting the other guy do the stroking.\nGriffin's biggest turn-on is sucking a guy's cock, deep throating, and making him nut. He of course likes having his own cock sucked, but as he mentioned in his solo, they really have to have skills. Griffin attacks Gennaro's cock with his mouth with expertise and enthusiasm! I think we have a new guy to work in the Serviced videos!\nThey both lay back, watching each other stroke their own cocks. There are few quick moments that I think you should look for. Griffin uses his foot to rub against Gennaro's shoulder, who doesn't seem to mind the foot attention. Gennaro also rubs and caresses Griffin's body while stroking his own cock. Some sly body-contact.\nGennaro gets up and does some cock-jousting as well as sucking on Griffin's cock. His skill level is not high, but Griffin loved having a straight guy service him. A great trade-off for Griffin who has high oral standards!\nGennaro busts his load all over Griffin's cock. Griffin scoops up the cum, uses it as lube, and a minute later is adding his own jizz to the pile! This dude has got a natural vibe that is going to work really well at ChaosMen!",
  "models": [
    {
      "name": "Gennaro",
      "person_id": 3368
    },
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    }
  ],
  "release_date": "2014-07-23",
  "scene_id": 7470,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Trimmed",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Gennaro & Griffin Barrows - Serviced"
}