{
  "collections": [
    "ChaosMen"
  ],
  "description": "Tatum and Troi are definitely an odd visual pairing.\nTatum, with his hairy, stocky and beefy build is at odds with Troi's lean and hairless body. But one thing they do have in common is Tatum loves guys with big dicks that can make his cock super hard from ass ramming while Troi loves when someone can take his entire cock balls-deep!\nTatum voraciously goes after Troi's big uncut cock, and their energy together is magical. Not sure when Tatum turned into such an aggressive bottom, but my favorite moment is watching Tatum flip Troi upside-down to devour Troi's hairy hole with his tongue. There is a moment of surprise on Troi's face as he his is man-handled into that position. Usually he is the aggressive one and finding himself upside down getting rimmed did take him totally by surprise!\nTroi also enjoys the fact that some of these guys can easily take his big cock at full-fucking-speed, when most girls have to take it slow-and-easy when he fucks their pussies.\nTatum does pull a groin muscle halfway through bouncing up-and-down on Troi's cock. Surprisingly it was while riding his cock facing him, and not in the reverse-cowboy position, that gives even the most quadriceps-endowed muscle-dude a work out. There was an audible \"pop\" sound as something got strained, and puts Tatum off his game for a bit.\nSo we actually have Tatum twice on his back in order to give his muscles a break. It allowed Troi to fuck the cum out of him though. Tatum limped around a couple days after this shoot, not really sure what muscle got pulled. He must have not been hurting too bad, because later that night he met a hot girl, and they ended up hooking-up. These boys are always horny!\nAs for Troi's cumshot, I wanted to capitalize on Tatum's cum-hungry attitude and total lack of fear of having a dude unload in his mouth. Troi drops his load into his mouth, then follows it up with some hot cum-soaked kissing!",
  "models": [
    {
      "name": "Tatum Parks",
      "person_id": 3496
    },
    {
      "name": "Troi",
      "person_id": 3586
    }
  ],
  "release_date": "2014-08-15",
  "scene_id": 7477,
  "tags": [
    "Build - Hairy",
    "Build - Swimmer",
    "Build - Muscular",
    "Build - Stocky",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Bald",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Tatum & Troi Parks - RAW"
}