{
  "collections": [
    "ChaosMen"
  ],
  "description": "Shad is an interesting guy. Lots of great stories, and you just can't pin him down to one over-riding personality type.\nHe's not very tall, has some oversized facial features (them ears!), and well, he looks kind of Elven to me. Put it all together, and it all works.\nHe normally wears a baseball cap that is kind of his trademark look. For the photos, I had him remove all his accessories (I like to do the nude photos totally nekkid..uh..the model..not me). I think not having the hat made him feel uncomfortable, so the next video we shot, I said keep the hat on. I am sure there are baseball cap fetishes out there! (Check back next week to see him in action!)\nHis body is completely natural. No gym, no shaving.\nShad has a large group of friends that he hangs out with. Sounds like a party gets started a couple evenings a week, and before you know it, Shad and his buddies are running around naked and drunk. Shad says he is usually the first to whip his clothes off. The Instigator.\nAnd you can see why in this video. Shad, for all his diminutive size, is not only a show'er but a grow'er.\nShad says he has done everything with a guy..once. But after I grilled him about it, turns out he received a blow job while hitchhiking. And to him, that was \"everything\" you can do with a guy. What else is there? So I'm gonna see if I can broaden his concept of \"everything\".\nHe also shoots like no body else I have seen. His load is not super white, but more clear, and gushes out like a fire hose with a leak.\nYou can even hear it hit the pillow by his head! SPLAT!",
  "models": [
    {
      "name": "Shad",
      "person_id": 3131
    }
  ],
  "release_date": "2006-03-01",
  "scene_id": 75,
  "tags": [
    "Theme - Solo",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Shaved",
    "Video - Standard Def"
  ],
  "title": "Shad - Solo"
}