{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sterling wants to do more video work, and with only one really brief encounter as a boy, he still wanted to work slowly through his limits. He wasn't even sure he could give head back, but I told him if it felt right, to go for it.\nJet and Sterling start by jerking-off side-by-side, watching a video. Jet is of course hard from the start, but Sterling gets a little shy. He follows Jet's lead jerking and stripping off his shorts, but it takes Jet's mouth to wake his cock up.\nJet seems real happy sucking cock now that he has got deep throating down. He can certainly take a cock of just about any size in his ass, but sucking a cock was something he needed to work on. It is safe to say he has got some skills now!\nThe two joust with their cocks, and I really do think Sterling got even more aroused once he started sucking Jet's cock. Sterling was hard without even touching his cock.\nThey end up 69ing, followed by Jet rimming Sterling's hairy hole.\nJet lays back for a facial, and Sterling really ramps-up some sweat in order to cum. Jet is edging himself, but the sweat was dripping off of Sterling and it made Jet cum first. Seriously, that is what he said! Jet was trying to time his load for when Sterling busted in his mouth. But instead he busts first and seeing Jet cum actually is what made Sterling nut!\nSterling unloads into Jet's mouth, filling it with his jizz. The timing is a little backwards on this, but I gotta say I think it worked out the way it needed to!\nSeeing Jet's cock spurting put Sterling over the top and I think that is a great sign the Sterling will like playing with guys.\nI am going to get Sterling back for more. He is a great guy and eager to please!",
  "models": [
    {
      "name": "Sterling",
      "person_id": 7484
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2014-08-13",
  "scene_id": 7500,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Jet & Sterling - Serviced"
}