{
  "collections": [
    "ChaosMen"
  ],
  "description": "Before Drew came to my studio I had a few sneak peek shots of him busting a nut. He was clearly at ease cumming in a variety of locations and positions. So I knew I could challenge this model right from the get go.\nYes, I understand, Solos are pretty routine, and with thousands of people uploading their own self-made cam shows, some of you are valuing them even less.\nI still love them, and enjoy it most when they totally get lost in the moment. But in an effort to add a little variety, I thought I would try to do a shower solo.\nAnyone who has been a fan of my stuff, might know that I'm not a great fan of shower scenes for web production. The encoding process just makes the audio sound terrible, and the noise is more than a little irritating.\nSo I tasked Drew with shooting in a very small space, staying wet and chilly, and spilling his load onto the tile floor. He is hard from start to finish and was way into it.\nThe lighting is great, something I have struggled with in the G:hOle series. I moderated the shower sound and turned it off eventually so the focus would be on Drew, and his amazing dick and cumshot.\nDrew is not a military guy, though he sure looks like it. He is a straight guy who is way into martial arts. He is a semi-pro fighter and I was actually lucky to get him without some of his standard bruises. You can't help but notice that his thumb had taken a recent beating. Sorry if its a bit distracting.\nHe has a tough guy demeanor but is about as friendly and gregarious as they come. Totally at odds with his serious photo set.\nI'm thinking I might be able to talk him into an oral scene, mainly because he was not bothered in the slightest with me in the shower with him and in such close proximity",
  "models": [
    {
      "name": "Drew Freeman",
      "person_id": 3264
    }
  ],
  "release_date": "2008-07-14",
  "scene_id": 751,
  "tags": [
    "Theme - Solo",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Video - HD - High Def"
  ],
  "title": "Drew Freeman - Solo"
}