{
  "collections": [
    "ChaosMen"
  ],
  "description": "Cooper came in to do a full-sex video, but his flight the following day didn't head out until 7pm.\nThis had happened to us before where he basically had nothing to do after a shoot. Most guys shoot their video and our early the next morning. I usually pick him up from the hotel and take him over to the gym to workout with me, a late lunch, then a drop off at the airport. This time we planned ahead so that we could also do some nice photos and maybe even a solo peep video.\nWhen Cooper first came to do videos for us, he already had a body of work out there, so we skipped the traditional solo/oral I do with most guys. We did get some nice studio photos, but no solo. Since I have been working with him he actually has sent me several self-filmed videos, but they were not in HD, so I couldn't share with you.\nSo we got up early and headed out to a friend's farm. He has a lot little buildings and some private space, so we got to take some pretty photos outdoors. It's been a while for me, and Cooper said it was the first time he had ever really done \"artsy yet porny\" type of photos, and since planned on doing this shoot, he worked on getting extra shredded for them. He loved being able to show off his hard work!\nHis body does look fantastic, but his blue eyes really stand out in many of these photos!\nAs for the video, it's pretty much a quickie jerk-off in the woods scenario. Lots of ants, gnats and mosquitos, one of the many reasons I don't shoot outdoors in this part of Texas. Cooper is a trooper and the dude is always ready to go even with lots of distractions.\nCooper and I have a very light crush going on each other. He has a fantastic personality, smart, stable, and incredibly easy to be around. Because of his flight times, we do get to spend more time together then most other models.\nHe is mostly straight, and can get into muscle worship with the other models on set, but overall, I think he finds 'mature' guys the most attractive. He has an identical twin brother (yes, every studio has asked if they will perform together..no they wont) and basically he isn't looking for someone like himself to have sex with. The few guys he has found attractive in the \"real world\" look nothing himself.\nWith his military background, I suspect some of what he likes in guys is stability, maturity, and the guy's body doesn't have to be perfectly muscled. He may work on hard on his own body, but he isn't attracted to guys that look like his own physique.\nIf you are viewer who might think you might not stand a chance to be with him because he would only be interested in other guys built like him, you would be wrong. The girls he tends to like are much like the guys he likes- thicker with a little extra padding. I think that adds a certain extra quality to Cooper Reed. He isn't some un-obtainable guy, just because he an elite physique.\nIt is likely I will do a video with him because there is a lot of natural chemistry between us, so stay-tuned for that in the future!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    }
  ],
  "release_date": "2014-06-12",
  "scene_id": 7511,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Theme - Peep",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Cooper Reed - Peep"
}