{
  "collections": [
    "ChaosMen"
  ],
  "description": "I am going to have to stage more \"no shows\" if it means working with Cooper Reed!\nI have mentioned in the past that Cooper and I have some chemistry off set. Not sure why he is into me. He has his longtime girlfriend, is super stable financially, and could have his pick of any number of guys in his age bracket if he was feeling in the mood for meat, but I think when he is genuinely interested in guys, they tend to be more mature, stable, dare I say, daddy type!? A former Marine, maybe he has a thing for the drill sergeant type, but I am hardly shouting out directions. Mostly I think he likes guys who have their shit together.\nI like him a lot too. He is very relaxed, professional, and is well-past being interested in partying and doing the dumb things that we all do when we are younger.\nLike Bay, we have always talked about doing something together, on or off film, but I figured we could save it for a Rainy Day when a shoot falls apart. Well, it did this day.\nWe stood together at the airport waiting for the other model, watching all the people on the model's flight pick up their bags. A sense of dread washed over me when I realized the guy was not going to show up. Was this the wrong flight we were waiting by? Why isn't he texting or emailing? Is he still in the air? Did he miss his layover?\nNothing. In fact, as of this writing, still not sure where the guy is! Ahhh, the life of running an adult site!\nI jokingly told Cooper I would call Ransom and have him start preparing himself for a fuck scene. Cooper reminded me that he would be more than willing to do a scene with me. I wasn't really ready to go right then and there, but with Cooper being into me, it should go smooth.\nRansom was there to help film a bit, and my main goal was to shoot this video like the one I did with Ransom. More slow, romantic, and intense. So there is no wild crazy jack hammer porn fucking. In fact, you might find the style of fucking boring.\nBut I had a mission. Sure we have seen Cooper Reed get fucked, but I don't know how often he stays hard from it. He can make himself cum while being fucked, but overall, I would put him in the Top category. So my goal was to get him to actually enjoy getting fucked. I am not diving in deep, but trying to work his prostate, keeping his cock on the edge of cumming.\nYou will see Cooper knock my hand away from his cock a couple times when he is on his back getting fucked. A very good sign that I was going to make him nut.\nIt made me happy because, and I might be wrong, I don't know if anyone has ever made Cooper cum. Sure, he jerks his own cock for a cumshot, but from what Cooper remembers, he doesn't think anyone has ever made him cum, from being fucked, let alone a simple blow job. So I was super happy to see he was close and making him nut for the first time by someone else's hand was now my official mission!\nAnd the mission is nicely accomplished too!\nOk, so it is no fun editing oneself if these types of videos, so I doubt I will get much sympathy. But I have to say, this video simmers with heat and passion, while trying to pleasure someone to the point their cock explodes!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Cooper Reed",
      "person_id": 3592
    }
  ],
  "release_date": "2014-10-03",
  "scene_id": 7513,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - RAW",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bryan & Cooper Reed - RAW"
}