{
  "collections": [
    "ChaosMen"
  ],
  "description": "When I had corresponded with Brenner about doing video work, he was super eager to get in and start sucking and fucking ASAP. He loves big uncut cocks and the sooner he could get one in him, the better!\nI am used to going slowly with the guys, and though Brenner was claiming to be mostly straight, by the time he came in, he saying he was most interested in guys. Yeah, no surprise there! If you love being face and ass rammed by the biggest cocks you can find, you are probably more into dudes!\nHe also loves the idea of having complete control of a guy. Edging him, making him cum, milking his cock with his ass! I have been giving Troi the occasional blow job video, but I figured this one was going to turn into full-on fucking.\nTroi has already been the recipient of one blow job, so doing another Serviced video seemed redundant. Brenner thought that having Troi in the chair and at his mercy would be really hot, and if things got a little out of control, his ass would not complain.\nAnd wow! Can Brenner ever suck cock! I do believe he is one of the best cock suckers I have ever seen! He is not just hungry for cock, he is STARVING for it! He goes crazy over Troi's foreskin, swirling his tongue around the head and skin, sniffing in his cock head aroma. Brenner loves pushing it down his throat all the way, gagging on it till his eyes water! Brenner is totally COCK WORSHIPPING!\nAnd he can take a cock in the ass too! Total bottom boy! And fans of Ass to Mouth action will love how often he jumps off Troi's dick, cleans and re-lubes it with his mouth, then back into his ass! Did I mention he looks starved while he I doing it?!\nI tend to not like to give away too much of the fantasy elements in these videos, but suffice it to say, a lot of fucking goes down and you might need to bring extra cum towels!\nLook for more Brenner soon as you will clearly see that his skills are top notch!",
  "models": [
    {
      "name": "Brenner",
      "person_id": 7517
    },
    {
      "name": "Troi",
      "person_id": 3586
    }
  ],
  "release_date": "2014-09-03",
  "scene_id": 7518,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Edge",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Sex Act - ATM Ass To Mouth"
  ],
  "title": "Brenner & Troi - Edge RAW"
}