{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sanitized version for viewers who may not like fetish play!\nI knew that Armani was easy to make piss, and Griffin said he would be down for some water play as well, so the two mixing it up at the g:hOle was going to be a soaking good time!\nGriffin loves sucking dick and I think Armani has upped his oral game as well. They both hungrily swap blow jobs between the glory hole, eventually Griffin goes over to Armani's stall to eat some ass, but also to ride Armani's cock. I do believe this is the first time Armani has topped!\nThey clear out of the stall, and if you are watching the Director's Cut, that's when things get moist! And if you're watching the standard version, there is a little bit more cock sucking before Griffin fucks Armani doggy-style. Armani's ass was made to be penetrated!\nI think both guys like to bottom, but I know Armani can cum super easy with a cock in his ass. Griffin fucks the cum out of him, then laps up all of Aramani's jizz! Love watching Griffin slurp down all that DNA!\nGriffin has Armani rolled up with his foot braced in the glory hole, giving him the perfect shot at his hole, dumping his load then plunging his cock in. Griffin doesn't stop there! He slides down and licks the cum out of Armani's hole! Griffin must have been thirsty AND hungry that day!",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    },
    {
      "name": "Armani",
      "person_id": 3609
    }
  ],
  "release_date": "2014-09-12",
  "scene_id": 7520,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - G:hOle",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Armani & Griffin Barrows - G:hOle RAW"
}