{
  "collections": [
    "ChaosMen"
  ],
  "description": "Zarek has turned into an awesome submissive Bottom Boy!\nDespite that he is really quite hung and would make a great Top, he tends to like to have the other guy in control. He is no longer just 'taking' a cock, but is enjoying having it hit is prostate.\nTo start this video out, Zarek does a lot of cock worshiping, but Jonas is equally pleased to be sucking Zarek's fat cock.\nIt is hot to see Zarek's ginormous cock getting properly appreciated. Jonas, ever the eager cock sucker, seems to have turned into a bit of size-queen when it comes to sucking. With Jonas sucking on Zarek, you really get to see how big Zarek's cock is.\nJonas seems to enjoy most having a dude ride his cock. Zarek starts by sitting on it. We get some cool under shot footage as Zarek rides his cock. They eventually get up on the bed proper, and Zarek milks Jonas's cock with his ass some more.\nThis makes me smile, because sometimes I think of Jonas as a lazy Top, just kicking back to watch as a dude rides up and down on his long curved shaft.\nZarek's first video was getting fucked by Jet, and Zarek didn't think he could cum from getting fucked. But this time out, Jonas was hitting all the right spots, and sure enough, Jonas fucks the cum out of him. A Bottom is born!\nJonas also really nails breeding Zarek's hole properly. He gets his cock cumming then puts the cock head in, then we get to see his cock spasm as it unloads into Zarek's ass!",
  "models": [
    {
      "name": "Jonas",
      "person_id": 3589
    },
    {
      "name": "Zarek",
      "person_id": 3605
    }
  ],
  "release_date": "2014-09-19",
  "scene_id": 7524,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jonas & Zarek - RAW"
}