{
  "collections": [
    "ChaosMen"
  ],
  "description": "Vander was on Summer break from school, so I was having him come in to do several shoots on each visit.\nHe was all set to work with another gay guy who was eager to swap head with our monster cocked Vander, but he had a last minute change of plans. So I did some of my own last minute arranging, and moved Peyton up to arrive a little bit earlier than planned. I was hoping to put an experienced cock-sucker with Vander, but I knew that Peyton was 'fine' with sucking back. I really didn't want to waste a chance to have Vander get his own ample cock in action, by putting him with a guy who wouldn't return the favor.\nThe only drawback being that for Peyton's first time sucking dick, he was biting off a lot more than even an experienced cock sucker can handle! But Peyton seemed down to roll with anything!\nI just had them start by doing a side-by-side jerk-off. I was hoping Peyton's cock would spring to life, but he was too nervous. Vander knew he was going to be a little uptight, so he just got down there and got busy on Peyton's uncut cock. Vander worked his magic and got him fired up in no time. Peyton sneaked a few glances at the video playing, but soon was more interested in Vander's cock.\nHe starts by stroking it, and eventually Vander climbs up and feeds his cock to him. Vander's cock looks huge in Peyton's mouth, and with no disrespect to Peyton, he is a massive guy himself, so you KNOW Vander's cock is large. It barely fit in his mouth! If you are looking for a first timer trying to handle a big cock, then look no further!\nBut Peyton takes it like a man, and anytime his cock would wilt, Vander would go back to his sucking action. After laying there trying to get his cock down his throat, Vander gets him doggy style so he can more easily suck on his cock. Vander gets interested in Peyton's back door, and starts rimming his hole.\nPeyton looks uncomfortable with the anal attention, so Vander climbs underneath him and sucks his cock back to life. After being in a passive position getting his cock sucked, Peyton totally becomes aggressive and starts face fucking Vander. He totally got into having a bossy vibe, and Vander loved having his mouth drilled!\nPeyton spins around and sucks on Vander's cock while continuing to face fuck him, but also getting his ass eaten. Vander loves to have ass in his face!\nPeyton stands up and unloads into Vander's mouth, and while gulping down his jizz, Vander shoots one giant long rope of cum that covers the length of his body! Thank goodness for multiple cameras, as I didn't know which camera to aim while both guys were shooting their loads at the same time!",
  "models": [
    {
      "name": "Peyton",
      "person_id": 7535
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2014-09-17",
  "scene_id": 7532,
  "tags": [
    "Build - Hairy",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Peyton & Vander - Serviced"
}