{
  "collections": [
    "ChaosMen"
  ],
  "description": "You can sure tell by Trian's photos that he is funny guy. He is relaxed and comfortable being naked. Clearly he was having a fun time doing photos and giving us some playful and lively images.\nTrian is single dad, former military, and just looking at ways he can bring in some extra money with his extra big cock. It ranges from 7.5-8\" but it has that amazing girth to it that makes it even more ginormous. Not only is he happy with his cock, but he knows that guys like his ass also. Definitely not shy about showing it off, or letting a dude put his cock there!\nHe does identify as straight, but he seems to be one of those guys that likes attention from anyone. He has messed around with guys while in the Service, and it sounds like he occasionally still will hook-up with a guy, but based on his porn viewing habits this day, he is quite obsessed with big-assed brunette women with blue eyes that can take a big cock in their ass. A very specific tastte, and it was the only part of this shoot that was challenging- finding juuusst the right girl for him to stroke to.\nHis photos were fun and easy to take, but I think once the cameras started rolling, his cock never quite gets the full mass that it did for the photos. He is still being playful and enjoying himself, but you can tell he thought he was going to knock the video out of the park. Trian gets a little quiet while he focuses on the video.\nThankfully, that was just a momentary lapse. He recovers quickly and hits a home run with that giant bat of his!",
  "models": [
    {
      "name": "Trian",
      "person_id": 7525
    }
  ],
  "release_date": "2014-09-01",
  "scene_id": 7536,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Toys",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Trian - Solo"
}