{
  "collections": [
    "ChaosMen"
  ],
  "description": "Rutger got real nervous about doing this shoot. He was pretty calm about the solo, a little suspicious, but still seemed at ease. On the way to the studio he really was thinking it was gonna be too hard.\nBut he met Griffin and figured he may as well give it a try. Griffin has an easy amiable way about him, and the took talked easily.\nSure enough, he got real nervous after the initial photos we took. If you like your straight guys looking like they don't believe what is happening, then this video is for you.\nGriffin does his best to keep him up and charged, but he wobbles here and there. Rutger gives him tips on keeping him hard, and I feel sorry for his girlfriends who have to put so much strength into jerking and sucking him.\nGriffin finally just flips him over and does some rimming. Rutger is totally not digging it, but keeps a smile on his face throughout. He tries real hard to get into it, but clearly he is out of his element.\nNow like a good gay4pay video, there is moment where he does have an epiphany! Wait for it!\nOnce he is upright and throat fucking Griffin, WOW! He really amps it up! He is no longer looking at the video, staying solid, and just going to town on Griffin's face.\nGriffin loved every minute of it! I seem to be on a roll with guys who can handle this kind of thing, so I am gonna get more of it. It looks awesome and the guys love thrusting their cocks into a hot throat!\nDoesn't take Rutger very long to jerk his cock and dump every last drop into Griffin's mouth! Griffin swallows the entire thing! Gulp!\nA very challenging video, where the lead goes from totally hesitant to totally in the zone!",
  "models": [
    {
      "name": "Rutger",
      "person_id": 7546
    },
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    }
  ],
  "release_date": "2014-10-01",
  "scene_id": 7550,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Stocky",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Griffin Barrows & Rutger - Serviced"
}