{
  "collections": [
    "ChaosMen"
  ],
  "description": "Both Dusty and Sterling wanted to get started right away doing full-interactive, but I was not sure how each would do without seeing each one perform with a pro first. I felt Bay would look good with both guys and having a 'ringer' in there would help things move along smoothly.\nSterling does get fucked in this video, while Dusty was doing really good topping. Bay tends to be the bottom boy in this one, which suited him fine. He pretty much lays back and lets them have their way with him.\nSterling sits on Bay's cock, and I have to give him credit for taking such a big dick his first time out. Probably should have had him sit on Dusty's cock to break him in. Oh well, Go Big or Go Home! Sterling even manages to suck on Dusty's cock while riding Bay's dick!\nThere are cocks everywhere, and both Dusty and Sterling had very few limits. Both took on sucking dick right away, though neither was ready to start kissing or rimming. Both acts take most guys many videos before they get that intimate.\nThere is much to recount in this video, but of course the cum shots are the best part. Bay truly does get TagTeamed as Dusty bust his load all over Bay's hole, giving him a great creampie. Dusty nuts very quickly and expertly juices Bay's hole. Dusty moves quickly out of the way after creaming Bay's ass, letting Sterling fuck his creamy hole.\nSterling's cock gets extra hard as he uses Dusty's load as lubricant. It starts to froth up, as Bay sucks clean Dusty's dirty cock that had just filled him up. Bay starts jerking his own cock furiously until has a super intense orgasm. I love watching Sterling's cum-coated and frothy cock sliding in and out of Bay's hole as Bay unleashes his load!\nSterling cums last, and just like Dusty, he nails the creampie perfectly. He adds his load to Dusty's, leaving Bay, full and spent!",
  "models": [
    {
      "name": "Bay",
      "person_id": 3554
    },
    {
      "name": "Dusty",
      "person_id": 7496
    },
    {
      "name": "Sterling",
      "person_id": 7484
    }
  ],
  "release_date": "2014-09-26",
  "scene_id": 7553,
  "tags": [
    "Build - Hairy",
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos",
    "Build - Stocky",
    "Sex Act - ATM Ass To Mouth"
  ],
  "title": "Bay & Dusty & Sterling - TagTeam RAW"
}