{
  "collections": [
    "ChaosMen"
  ],
  "description": "A lot of \"firsts\" in this video.\nAll the guys are super easy going with their limits. Both Vander and Zarek bottom in this video, leaving Palmer Top Dog. He might not have made too much of a fuss, but after seeing both Vander and Zarek's cocks, he was just fine topping the entire video. He stays rock hard the entire video, so he performs awesome.\nWhat I like is all the guys were down to kiss, suck, rim, share cocks back-and-forth and just really just got piggy with it. Zarek is still very passive, and both Palmer and Vander liked using all his holes.\nSome of the highlights are watching Vander and Palmer share sucking Zarek's cocks and hole, then kissing each other.\nI do believe some of the \"firsts\" would be some actual Double Penetration of Vander, as well as some nice daisy chain fucking, although Vander's balls tend to block the view of his cock firmly embedded in Zarek's hole. Vander is also real good at cleaning Palmer's cock after it has been inside Zarek, so Ass to Mouth fans should be real happy. I tried to chase the camera and not cut away, as for some reason the audience is so suspicious of camera trickery.\nFor the ending I wanted to make sure all the bases were covered. Palmer fucks Vander till he nuts, then Zarek gives Vander an open-mouthed facial. Palmer has struggled to always nail his creampie, so we just let him fuck Vander until he cums. If you love internal cum shots, you will really like this one! He has his cock buried deep, and pulls out with cum spilling out of Vander's hole, and a few last squirts of Palmer's cock!\nLot's of amazing energy and talking on this super long video, so you don't want to miss this one!",
  "models": [
    {
      "name": "Zarek",
      "person_id": 3605
    },
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Palmer",
      "person_id": 7427
    }
  ],
  "release_date": "2014-10-31",
  "scene_id": 7555,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Double Penetration"
  ],
  "title": "Palmer & Vander & Zarek - TagTeam RAW"
}