{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a whopper of a movie. It was 42 minutes long after the final edit, and I knew I had to trim it down. I shaved off about 3 minutes. A lot at the beginning where they were undressing, so it does start a little abruptly. Some of the other transitions are a little awkward as I cut here and there. Maybe someday a Director's Cut will come out, but honestly I don't think I trimmed anything anyone is going to miss.\nI also feel a bit bad about Augustus. This was his very first full-sex video, and according to him, his first time doing anything with a guy. I believe it. His Serviced video, he was pretty much frozen, and in this video, Brenner and Cooper are working circles around him. He isn't frozen, but you can sure tell he is not sure what to do.\nHaving said all that, he tackled a lot of limits. Augustus sucked cocks, kissed, and even got his cherry popped. His fat dick hangs downward and is so thick that it is difficult to tell if he is hard, but for the most part he was actually into it. He was eager after the shoot to setup another scene, and not because he needed the money. I think we flipped a switch on him. He still loves girls, but after meeting Ransom and Cooper who are indeed Bi ( and not 'confused') I think he gets he can play on both teams whatever his mood.\nAs for the video itself, Cooper and Brenner move things along. Cooper is such a sweet and nice guy, but he actually really likes piggy type of stuff. Brenner loves nasty play and I lost count of how many times he got Ass To Mouth (ATM) from Augustus and Brenner.\nThere is one part where Brenner is on his back with the Cooper fucking Augustus ass. Brenner is below deck with a full view in his face. Cooper pulls out several times, makes Cooper clean it and slick it up and fucks Augustus some more. Brenner also sucked on Augustus cock while he was getting fucked. Having his hole penetrated and his cock sucked, Augustus thought he was going to accidentally cum. Another fat-dicked boy that appears to be a bottom!\nWe finished the video doing a bouncy ball position. I knew Cooper's cock can go in any direction, so he rolls his legs up, points his cock up 'backward' so that Brenner can bounce on his cock while sucking Augustus cock.\nCooper knew he couldn't do it very long as that angle was making his cock want to cum, and Brenner of course was getting a quad workout. Brenner was getting close and I just let him nut like that, bouncing up and down on Cooper. Brenner shoots a huge load then eats it from the floor.\nThey reconfigure so Augustus can juice Brenner's hole. He ramps up and unloads a giant load, and just as the last drop of spooge comes out, Cooper adds his own load. Brenner's ass is literally coated in jizz!\nCooper scoops it into his hole, then starts feeding it to Brenner. Augustus's cock went down fast, but Cooper was still going strong, so he fucks him some more with the frothy mess.\nWe get one last cock cleaning as Brenner eats their loads off of Cooper's cock!\nI nominate this video as \"Best of the Year!\"",
  "models": [
    {
      "name": "Augustus",
      "person_id": 7507
    },
    {
      "name": "Brenner",
      "person_id": 7517
    },
    {
      "name": "Cooper Reed",
      "person_id": 3592
    }
  ],
  "release_date": "2014-11-28",
  "scene_id": 7557,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Augustus & Brenner & Cooper - TagTeam RAW"
}