{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jonas seems to smile his way through this video. While filming I realized he was grinning, so I asked him if perhaps Griffin's beard was tickling him, or if something was \"wrong\" because Jonas is usually so serious during his videos. Was there some inside joke going on that I was not obvious to me?\nIt turns out Jonas was just super happy to be working with a gay guy, and not just any gay guy, but one who REALLY liked sucking dick. Every time his cock would disappear down Griffin's throat another wide smile would appear on his face. No one has ever worked his cock like Griffin.\nIf you have been following the Jonas summaries, then you know he is fascinated with porn videos of girls giving head. He likes it so much that he himself wants to do a good job when giving head, but after working with Griffin, he realized he was going to have to up his game. Homework!\nHe and his girlfriend of 3 years finally broke-up, and I think it has got him thinking about messing around with dudes. Griffin being his first Out gay guy, he seemed to click with him and given that his life around home is all straight people, there was a glimmer of \"forget the girl drama, I might want to join the other team.\"\nHe said that to Griffin, who of course has his boyfriend finding issues, and told him it is all the same. No matter what team you are playing for, drama ensues.\nSo this video is extra fun to watch as Jonas is shocked he is having fun, enjoying kissing Griffin, and fucking him too. Likely one of the easiest videos I shot with him. I just chased them around and when Griffin was ready to nut, he busted quickly followed-up with Jonas breeding his hole.\nI wouldn't say there was chemistry between the two, I think this video is more about Jonas realizing dudes can be a lot more fun and the videos wont seem to be as much 'work' to him. It's magical to see him truly enjoying himself!",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    },
    {
      "name": "Jonas",
      "person_id": 3589
    }
  ],
  "release_date": "2014-11-21",
  "scene_id": 7560,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Griffin Barrows & Jonas - RAW"
}