{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jet is an incredible bottom. If you have seen his video with Vander, you know he came 7 times during that video.\nJet looked at his reviews, and said the comment sections had people not believing he came 7 times (well 8 if you count the final one he did in the shower after the shoot). I know a lot of adult sites tend to exaggerate things, but I usually am pretty forthcoming about the info I write in these summaries.\nIf you have seen other videos by Jet, you know he cums 2-4 times in many videos, and we are most certainly not filming over a day or two. A typical shoot takes 2 hours, and that includes prep, showering, photos etc. When videos take longer than 3 hours to get 20-30 minutes of video, well, we give up! We try to shoot as continuously as possible.\nSo no camera trickier or time warps. Jet literally can bust a nut about every 4-5 minutes. Most especially if he is getting fucked!\nBut the last video we shot, he topped, and said he would likely be able to cum multiple times while doing the fucking, because after all, he can do it with the girls he is with.\nJet was actually really discouraged to read the comment sections. He is quite proud of the fact he can cum over and over, and it is something I think that is unique to him in a rather large field of adult performers. To have people say that we are faking it, kind of stole his applause. He no longer reads comments because the tone is not very nice.\nBut we still wanted to see how well he could while topping. Our goal this time out was to see how many times he can cum without anal stimulation. I knew I needed a voracious bottom, one who wouldn't get tired from getting fucked, but also cum hungry.\nBrenner!\nSo have a watch. He cums 4 times and I tried real hard to keep one camera going during the cum shots as well as for the ass to mouth. Some viewers seem to think we fake that too. There is a ton of ATM in this video, and Brenner's cum shot is also awesome as Brenner gets the load fucked out of him.\nJet fills all of Brenner's hole with his creamy Jet fuel!",
  "models": [
    {
      "name": "Brenner Bolton",
      "person_id": 7517
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2014-10-24",
  "scene_id": 7562,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Bossy",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Brenner Bolton & Jet - RAW"
}