{
  "collections": [
    "ChaosMen"
  ],
  "description": "You may remember Roby is a quick shooter and we struggled during his solo and oral to not have him bust too soon.\nLike Jet, he thought he could just cum multiple times, but unlike Jet, he was not so sure how quickly he could recover.\nRansom, who did his Serviced video, is very skilled at giving head, while Sterling has only sucked dick once before, so I figured Roby would not be so quick to shoot. Wrong!\nRoby gets hard very quickly, so Sterling jumps right in to start sucking. While Sterling is not a pro, he still had Roby on the verge of nutting quickly. We re-direct him to sucking on Sterling, but clearly it is the first time Roby has sucked dick. He makes the best of it, but he doesn't seem super happy to have a cock in his mouth.\nWe go back to Sterling sucking on Roby. Again Roby goes from soft to hard then about to cum in no time.\nWe switch gears again to Roby fucking. You can see him trying to hold back from cumming.\nAfter a couple minutes, he just ups and busts his nut, breeding Sterling. Thankfully, cameras were in place and we caught it.\nSterling finally got in the zone to fuck, giving Roby a chance to recover. Roby sits on a cock, which I believe was the first time, but who knows with these guys. We warned him that the extra prostate action would likely make him bust.\nI think we got about 2 or 3 minutes of him riding Sterling's cock then boom, he busts his load, virtually hands free. It was a really big load too! Only one camera got it as I was behind him filming Sterling's cock sliding in and out of him.\nRoby slides off a Sterling, who ramps up and shoots his load. Roby get his third and final load out of his cock, adding his jizz to Sterling's pile of cum.\nSo this is a pretty quick video, with 4 cum shots!",
  "models": [
    {
      "name": "Roby",
      "person_id": 7404
    },
    {
      "name": "Sterling",
      "person_id": 7484
    }
  ],
  "release_date": "2014-11-26",
  "scene_id": 7565,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Roby & Sterling - RAW"
}