{
  "collections": [
    "ChaosMen"
  ],
  "description": "After several delayed flights, I was worried this shoot was not going to happen. Vander has a very narrow window to shoot in while in grad school, and his summer months tend to be very active playing catch-up. For a very chill dude, he keeps his schedule tight.\nDusty missed his morning flight, then the connecting flights were delayed 4-5 hours, making this a very late evening shoot. He was a little tired after traveling all day, but thankfully the two guys clicked immediately so there was chemistry in the bathroom!\nI think Dusty has a rough trade vibe that goes well with Vander. And given the volume of videos that Vander has, it is no surprise that he seems to get along great with everyone. Both guys are very easy going, so I knew if I could just get them in the same room, magic would happen.\nThey both know how to work the bathroom space, using the trash can and urinal to full advantage. No pissing in this one though, sorry! They just got down to some serious cock sucking and Vander was super ready to be fucked after not only holding out all day to cum, but also the day before. His balls were bursting!\nIt still surprises me what an eager bottom he is, and how quickly he can nut from getting fucked!\nDusty is just as good at shooting his load on and inside of Vander's hole, leaving him there to play with Dusty's jizz leaking out his hole!",
  "models": [
    {
      "name": "Dusty",
      "person_id": 7496
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2014-11-24",
  "scene_id": 7566,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral Only",
    "Theme - G:hOle",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Dusty & Vander - G:hOle RAW"
}