{
  "collections": [
    "ChaosMen"
  ],
  "description": "Glenn started a new job, and it has him working 6-7 days a week. He also got a new girlfriend, so he was taking a little break from shooting video. I think he is avoiding doing full-on sex scenes, but is down with an occasional oral. His job is seasonal, so I think we will have some guest appearances.\nHe had a couple days off, so I got him in to do a few Serviced videos. I actually had not seen him about 3-4 months, and he showed up with a big 'ole goatee. He sure has become a man in front of our eyes! He is now 21!\nHis scruff looks great with Noah's and Noah was super pleased to be working with Glenn. Noah is no stranger to giving head, and like Shiloh and Griffin, I think we have another guy who can professionally blow guys.\nNoah is about as relaxed as Glenn in terms of sex. They both suck and rim each other, but you can tell Noah likely would have sat on Glenn's cock. His moans are extra loud as Glenn teases his hole with his tongue; despite have a mouthful of cock!\nI love seeing Glenn fuck Noah's throat. Noah tips his head off the bed, and you can see it slowly sliding down his throat.\nGlenn ramps up and overshoots his first squirt, hitting Noah's shoulder, but then quickly corrects to dump the rest in his mouth. Gulp!\nGlenn gives him a cummy kiss, and Noah then ramps up and quickly shoots his load right into Glenn's mouth. You can tell he is kinda gagging on the fact another dude is unloading right in his mouth, and it spills down and gets all caught in his beard.\nGlenn is indeed straight and he pushes his limits to keep you all entertained, but I think he may lose the beard or scale it back, because the cummy mess stuck in his goatee was a bit much for him.\nBut totally hot for us!!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Noah Riley",
      "person_id": 7572
    }
  ],
  "release_date": "2014-10-22",
  "scene_id": 7581,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Glenn & Noah Riley - Serviced"
}