{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had a shoot setup between Bay and Brenner, but Broderick was staying to pick up a film a couple days later. So I thought why not let him jump in and add another set of hot abs to the mix!\nBrenner is always cock hungry and both he and Broderick start by servicing Bay's cock. They share it back and forth until Bay gets Brenner on his back for some throat fucking. Broderick sets to work on Brenner's dick, keeping him hard while Bay aggressively fucks his face.\nBay then sits on Brenner's face to make him lick his hole, while Broderick sucks on his cock, giving him oral from stem to stern. Bay then returns the favor to Brenner, getting his hole all wet and slick so he can push his cock into his eager hole.\nBrenner is in pig bottom nirvana as Bay grinds his cock into his ass, while Broderick feeds him his cock to suck on. After spit-roasting Brenner, Bay takes a stab at Broderick's butt hole. Broderick has bottomed before, but Bay's cock was a challenge to wedge into his tight hole. Brenner straddles Broderick, letting Bay suck his cock while he fucks poor Broderick.\nBroderick couldn't take much more, so he got a break while Brenner got fucked on his back. After a little recovery time, Broderick lays down beside Brenner, ankles in the air, and lets Bay fuck him too. Bay goes back and forth, fucking his boys, while the two bottom boys share a kiss or two.\nI was thinking maybe Bay could fuck the cum out of Broderick, but he was barely able to take Bay's cock. So while Bay fucks Brenner, Broderick straddles Brenner and cums all over Brenner's face, chest, and cock. Bay scoops it all up and uses it as lube to fuck Brenner with it.\nBeing fucked by another dude's cum, totally put Brenner over the top and he spills his load everywhere!\nBay unloads, filling Brenner up, then making him clean his double cum-coated cock!",
  "models": [
    {
      "name": "Broderick",
      "person_id": 7586
    },
    {
      "name": "Brenner",
      "person_id": 7517
    },
    {
      "name": "Bay",
      "person_id": 3554
    }
  ],
  "release_date": "2014-12-26",
  "scene_id": 7591,
  "tags": [
    "Build - Swimmer",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bay & Brenner & Broderick - TagTeam RAW"
}