{
  "collections": [
    "ChaosMen"
  ],
  "description": "So we know that Maverick is a bit of a scaredy cat when it comes to reciprocating back with another dude. I had a heck of a time getting him in the same room with another dude's cock out. He has fucked two dudes, but he still struggles.\nI was surprised when Reece did his video with Slade. He could barely bring himself to touch Slade's dick. I was surprised because he is always really eager to do a shoot and his dick is always hard from start to finish, as if his dick knows what it wants, even if his brain doesn't.\nI thought I would take these two guys and do a dangling carrot video.\nIt's very common to see these on amateur sites where you hear the cameraman tell the model they will get more money if they do this, and then the model (sounding quite rehearsed) will debate it and then do it. Most of the time it's not very believable as half the guys sound gay to start with.\nI knew I had problem areas with both guys. They could receive head and fuck a dude, but they never really even touched a dude.\nBefore I got started we set the base pay for the scene. Both guys have good jobs so the lure of more money really isn't a huge motivation. They both love the extra money because it allows them to play and pay for gadgets and vacations.\nSo we worked the base of the scene as just a side-by-side jack-off. If they grabbed their buddy's cock, pay went up. If they kissed, pay went up, if they did oral, the pay went up. They both agreeed that kissing was not gonna happen. ~sigh~\nBefore the shoot, Reece was even talking about getting fucked as he is trying to pay off his car, so I thought for sure Reece would be upping the deeds the entire time.\nBut ironically Reece struggled while Maverick got paid more. He just barely blew Reece for just about 30 seconds (don't blink!). It's not for very long, but you can see him struggle with it, and I am pretty proud that he tried. It was a big step for him.\nOverall, I think the video is a bit boring as they really focus on the TV and not each other. But forgive them, this video is ground breaking for them, and I think in the future their performance will be less passive and perhaps more assertive.\nHaving said that, the cumshot is REALLY cool, and when it comes down to it, that's what it is all about for many viewers.\nThe two fire their dicks off simultaneously, something you rarely see, and it is awesome to see their bodies move in symmetry as they both jerk and heave.\nSo if watching two nervous straight guys take tentative steps to man sex bores you, skip to the end, it has a great ending!\nIf you like to see your straight guys almost forced together, you will love this one!",
  "models": [
    {
      "name": "Maverick",
      "person_id": 3207
    },
    {
      "name": "Reece",
      "person_id": 3257
    }
  ],
  "release_date": "2008-08-01",
  "scene_id": 761,
  "tags": [
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def"
  ],
  "title": "Maverick & Reece - Side-By-Side"
}