{
  "collections": [
    "ChaosMen"
  ],
  "description": "As mentioned last week, Pax has had sex with one guy over a longer period of time. It really sounded lopsided, with Pax getting head and fucking the dude, without reciprocating. Doesn't sound like a lot of intimacy happened. Not even sure he jerked his buddy off. He would put himself in the 90 percent straight category.\nOf course, I never know if I get the total story from these guys. But based on the setup and his reaction in this shoot, I think it is fairly believable. You can tell he is used to sitting back and being serviced.\nGriffin started-off knowing this information, so he began sucking a little more confident than he should have. Pax was hard, but quickly lost his bone. I think Pax likes his guys feminine, or as close to girls as possible, and with Griffin's beard, it kind of threw him a little.\nSo Griffin had to switch to hand-job mode to get him back to be solid. I left that part in. I know it will drag for some of you, but I thought it was cool to watch Griffin save the day.\nBut once he got him back to being hard, Griffin got all monster cock all the way down his throat. Pax hardly looked at the porn once Griffin had his technique figured out.\nPax was uncomfortable with the ass show casing, but I think Griffin, who normally is not into rimming, finally discovered the joys of having access to dude's perfect hole. I think this is the first time I have seen him go totally piggy with playing with a guy's back door.\nGriffin crawls under him, and Pax fucks his face. He is not super hard, but I think given the angle, a bone-hard cock would have been a problem.\nGriffin gets him on his back again, and even though it stretches the video to about 20 minutes, I left the complete scene in as Griffin jerks Pax to completion.\nIf you loved Serviced videos, you will LOVE watching Pax have his orgasm! It is perfect the way he writhes around in ecstasy!\nMy hat is off to Griffin for making Pax spill his load!",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    },
    {
      "name": "Pax",
      "person_id": 7615
    }
  ],
  "release_date": "2014-11-05",
  "scene_id": 7616,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Griffin Barrows & Pax - Serviced"
}