{
  "collections": [
    "ChaosMen"
  ],
  "description": "Despite Shay having some hand jobs and blow jobs from an occasional hook-up, he actually seemed really impressed with the massage. We queued up a porn for him, but he wanted to sit and watch it a while before starting. I told him it was likely he wouldn't need it if he had no problems having a guy play with him out in the real world, and handed him his towel.\nShay starts-off fully soft, and that had him worried. After years of doing this, as well as seeing his cock stroking technique during his solo, I knew he would be hard in no time.\nHe is very easy going, so he shrugged and hopped on the table. Like many of the guy, once you get down to the ass area, their cock wakes up fast. His hole and his cock are both absolutely perfect, and seeing his ass propped up in the air might make any Bottom yearn to be a Top, or at the very least, flip-flop fuck him.\nHis facial expressions are priceless, and his under-the-breath talking will have your own boner as hard as he was. I love when I can just toy with a guy's cock, trying different techniques, that makes them raise their eyebrows in wonder, but also want to come back for more.\nShay's cum shot is super intense as I fast-jerk his load out of him. He literally writhes around like he is being electrocuted, all the while cum is spilling out and shooting into my mouth and hitting my face!\nHe says he is down for more. With his cock he seems like he would be a natural Top, but he has not ruled out getting fucked. Perhaps he will be a versatile kind of guy!",
  "models": [
    {
      "name": "Shay",
      "person_id": 7605
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2014-12-28",
  "scene_id": 7619,
  "tags": [
    "Build - Average",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Shay - Serviced"
}