{
  "collections": [
    "ChaosMen"
  ],
  "description": "I started working with Griffin and Augustus about the same time, and I immediately thought they could be kissing cousins, so I knew I wanted to pair them up. Griffin loves the big cocks, but I was not sure about Augustus skills yet. Based on his first film, I figured Augustus was more of a bottom.\nAlec wanted to jump in also, and before I knew it, I had three 'mostly' bottom guys in one scene. Griffin can certainly top, but Alec has always wilted when going up to bat. I figured it would be recipe for disaster, but I could not have been more wrong in my estimation. All three guys step up to the plate in this one, and all three take each other's cocks!\nGriffin kept everything moving, and he encouraged both guys in everything they did. Alec even tops in this video, and I think without Griffin in charge, Alec likely would have bottomed the entire time. It wasn't that Griffin was being bossy, more like Alec just felt like he had permission to be dominant when it came time. Alec even spanks Griffin so hard that there is a hand print on his ass throughout most of the video.\nAugustus ramps-up his gametoo! He had already done one TagTeam, and though he did great, he was a little reserved with the two pros he was with. This time out he also 'let go' and got a lot more into it.\nI was shocked to see Griffin and Augustus making out while Alec fucked each of their asses. I had to add some PIP action to that so you can see Alec fucking them while they make-out.\nGriffin keeps it piggy, giving us some great Ass To Mouth, cleaning Alec's cock between pull out of Augustus's ass! Augustus silently cums while fucking Alec, so I didn't make much a show of it. Alec fucks the cum out of Griffin., then breeds Griffin. He then makes Griffin clean both cummy cocks!",
  "models": [
    {
      "name": "Alec",
      "person_id": 3600
    },
    {
      "name": "Augustus",
      "person_id": 7507
    },
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    }
  ],
  "release_date": "2014-12-31",
  "scene_id": 7623,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alec & Augustus & Griffin Barrows - TagTeam RAW"
}