{
  "collections": [
    "ChaosMen"
  ],
  "description": "Charlie seemed eager to suck dick instead of having his own cock Serviced. With Glenn in the room, who could blame him!?\nI thought I would take advantage of Charlie's diminutive size and get Glenn high enough so his cock was right at face level. Worked out perfectly! Charlie was able to stand and service Glenn's big 'ole cock!\nThey start-off in sweat pants and Charlie sets to work getting Glenn fully charged up. He puts his head down and really focuses on pleasing Glenn. Charlie's own cock wakes up, and you really see how big his cock is in scale to Glenn's cock.\nCharlie is a bottom, but he really likes servicing his top by rimming his hole. He gives Full Service! Charlie really face plants himself into Glenn's copious ass, and he pretty much disappears into his cheeks. Where are you Charlie?!\nCharlie then sits down so Glenn could start to work on his cock. I don't know when it happened, but Glenn has gotten really good at sucking dick. He now has a few different techniques to try on the guys, giving Charlie a few surprises.\nBest moment is watching Glenn rim Charlie's hot hole! He fingers it while sucking his cock, and you can tell by Charlie's reaction he was loving it.\nGlenn then gives Charlie one of the best facials on the site! His first squirt falls a little short, but like a pro, he makes sure the rest goes right into Charlie's mouth. There is cum everywhere as it spills out of his mouth, and Glenn continues to coat Charlie's face.\nGlenn sits down and Charlie ramps up to bust his nut on Glenn's cock. Only a little bit flies out, so I know now to have him only bust one nut in a 24 hour period.",
  "models": [
    {
      "name": "Charlie",
      "person_id": 7620
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2014-11-12",
  "scene_id": 7625,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Charlie & Glenn - Serviced"
}