{
  "collections": [
    "ChaosMen"
  ],
  "description": "I really love having Brenner on hand to take on the extra big cocks!\nHe loves sucking (and sitting!) on them, and Trian loved having his cock worshiped!\nEven better, Trian seems to really like doing everything with a guy! Right out of the gate he is making-out with Brenner! No half-ass kissing either. Full-on tongue dueling!\nThe two surprised me by starting the video kissing. Brenner gets down to his knees and plays with Trian's cock through his pants. His fat dick beautifully shows through the thin fabric, driving Brenner crazy with anticipation.\nHe finally takes it out and unleashes his mighty sucking skills! Trian is impressed and amazed at his skills! Not sure Trian has had his cock deep-throated before, but it is astounding to see it just disappear down Brenner's throat.\nTrian looks amazed and has a little smile on his face as Brenner greedily gulps it down. Brenner pushes him doggy-style onto the bed to get at his ass, and I swear Trian is smiling the whole time. He crouches like a boy who not only needs his hole licked, but a bit like one who is going to get fucked. A taste of things to come? With Trian's big 'ole cock, is he a big 'ole bottom too?\nBrenner flips Trian onto his back and can really get a great angle of attack at Trian's cock. Brenner even lays beside Trian and gets his cock sucked, though you can tell Brenner is really all about going after Trian's hefty dick.\nI am sure Brenner could have sucked the cum out of Trian's dick, but Trian needed to rub one out on his own, and actually having Brenner jerking his cock in his face helped him bust faster. He nuts, and I can't really tell who's cum shot is making the other nut. They cum pretty much at the same time!\nBrenner, like a good cum whore, licks up all of Trian's load, then cleans up the mess he made on Trian's chest. Trian asks him if it tastes good, and to demonstrate how good it tasted, Brenner kisses him, swapping their mingled load!\nMagic!",
  "models": [
    {
      "name": "Trian",
      "person_id": 7525
    },
    {
      "name": "Brenner",
      "person_id": 7517
    }
  ],
  "release_date": "2014-09-10",
  "scene_id": 7636,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Brenner & Trian - Serviced"
}