{
  "collections": [
    "ChaosMen"
  ],
  "description": "When Griffin first came in, we spent a lot of time texting about him working steady and taking on some of the oral videos. Palmer had also came in about that same time, so I sent him a few images saying he had just joined the team too, and that it was likely he would work with him soon.\nGriffin was really pleased that he would probably being servicing Palmer, but I told him it was more likely they would be fucking and not just sucking! I had Palmer set to work with a couple other guys, so Griffin was biding his time, waiting to work with the muscle dude. \"When do I get to work with Palmer?\" Griffin would ask.\nSo I dangled Griffin a little too long, but I am sure he was quite happy with scenes while waiting. But suffice it to say, he had his eye on Palmer from week one.\nGriffin does love Servicing the guys, so we started out with some major oral. Griffin had been waiting months to get Palmer's cock all the way down the back of his throat, and he was not disappointed. He takes control and rolls Palmer upside down and makes a meal of his tight ass.\nPalmer power fucks Griffin too, eventually planking him so Griffin could not escape the ass pounding. Some super hot Ass to Mouth in there for ATM fans, so keep a watch for that!\nGriffin rides Palmer's cock until he busts, spilling his load all over my brand new bedspread's maiden voyage.\nPalmer's cum shot is a little tricky as he ramps up his cock and they both hustle to get it in. What can I say but it was a full on internal breeding. Not much to show for it, which is one of the risks of doing internal cum shot. But if you like you boys bred and bred deep, this ending is for you!",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    },
    {
      "name": "Palmer",
      "person_id": 7427
    }
  ],
  "release_date": "2014-12-05",
  "scene_id": 7641,
  "tags": [
    "Build - Muscular",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Griffin Barrows & Palmer - RAW"
}