{
  "collections": [
    "ChaosMen"
  ],
  "description": "Raymond is one hot daddy! He had his body hair fairly trimmed back when I first saw his pics, but with his mature looks, I asked him to let it go natural. I think he hit just the right length to showcase his amazing pecs and abs, and still give us daddy goodness!\nHe has a couple scars on his chest and forehead that he got in a car accident when he was younger, so if you were wondering, that's what they are from.\nHe has been with the same girl for a while, and it sounded like she was the bread winner in their relationship. He almost sounded a little 'kept'. He is a very sexual guy, so he thought he would do some adult work to add to his contribution to the relationship.\nRaymond has had his dick sucked by a couple guys who seemed to relentlessly pursue him until he gave in. He said he was not into it, and basically watched porn on his phone while they sucked him.\nHe said he felt 'dirty' afterwards. I asked him if was hard and if he had nutted, and he said had really ejaculated pretty easy, and that guys definitely give better head, but he was pretty sure he was not into dudes. But given his past experience, he would be fine with getting a blow job.\nI think he will do more than just oral, but for a Daddy type, I am not sure we will get a bossy-vibe out of him. You can tell by his demeanor, he is relatively quiet, and almost stern, but I think he will need the other guy to take control. Kind of at odds with his age and body type.\nNext week he will be back to get head, and he certainly does very well, but we will have to wait and see if he can wrap his head around full-sex with a guy.",
  "models": [
    {
      "name": "Raymond",
      "person_id": 7646
    }
  ],
  "release_date": "2014-12-08",
  "scene_id": 7645,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Raymond - Solo"
}