{
  "collections": [
    "ChaosMen"
  ],
  "description": "Teo and Skot have been best friends since high school. They met in a sports history class (Sports history is a class?!!). Teo had no real affinity for the sports being discussed and kept cracking jokes in class. The other straight guys thought Teo was a jerk, but Skot was cracking up and they quickly became friends.\nTeo has seen Skot do solos and cam shows, and the two have had sex in the same room, so they aren't shy at all, but they set their limits to only a side-by-side jack-off before getting started.\nThese Best Friend Themed videos are really more about humor, having a good time, and a bit of competitiveness, so if you are looking for a hard-core scene, you will have to wait till Teo starts banging (and being banged!) by other dudes. This is a FUN video, with lots of goofy behavior. (Yes in June you will see him again!)\nThey really aren't very nervous like other Best Friend videos, but they stick to their limits and eventually get down to business.\nThough Skot has done lots of things, he's not jumped ahead in comfort level like Teo has. So really, Teo is newer, but ahead of Skot. Teo was kind enough to let Skot dump his load on him- which is a much more \"advanced\" thing to do. Most of the straight guys don't want any DNA landing anywhere near them.\nThere is some mutual hero worship going on here, as they both clearly have great affection for each other. But watching Teo bust 'cuz his buddy shot on him will leave most viewers wondering \"What's up with that?\"\nI left in some direction in the end as I keep telling Skot to \"just look up\". I was doing my pan over the aftermath, and Skot was looking at the destruction he wrought, and was holding back laughter as best as he could. He just kept looking so I was telling him look away.\nIt's a hot ending, and cute..all in one!",
  "models": [
    {
      "name": "Skot",
      "person_id": 3624
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2008-05-30",
  "scene_id": 765,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Video - HD - High Def",
    "Theme - Best Friends"
  ],
  "title": "Skot & Teo - Side-By-Side"
}