{
  "collections": [
    "ChaosMen"
  ],
  "description": "I believe this about Braxton's fifth or sixth full-interactive video, and he definitely has found his confidence. He is a really relaxed and easy-going guy, but always seemed nervous when it came down to the scenes. I think after doing scenes with Vander and Brenner, he finally has let go and is not so worried about what he is doing, but focuses instead on pleasing his scene partner.\nI have said it before, but Braxton would make an amazing boyfriend!\nHe even gets a pretty good spank on Cooper, who didn't even flinch! He seems to love getting his cock sucked, and he really goes after Cooper's cock in this video. Working with an uncut guy didn't seem to throw him this time.\nCooper has been topping a lot lately but I was hoping to get Braxton to bottom a portion of this video, but as much as he tried, he just couldn't make it happen. Cooper was in the zone to get fucked anyway, and I am pretty sure Braxton was hitting his sweet spot, because he was hard the entire time. Braxton ever the thoughtful partner and stroked his cock while ramming him.\nCooper has also turned a corner on busting a nut while getting fucked. He usually is really trying, but after several times getting the cum fucked out of him, he strokes his load out while Braxton slides his cock in and out.\nBraxton breeds his hole, and despite the hardcore action, there a hot bit of intimacy to this entire video!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Braxton",
      "person_id": 3576
    }
  ],
  "release_date": "2014-12-29",
  "scene_id": 7652,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Braxton & Cooper Reed - RAW"
}