{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a video you have to watch from start to finish!\nDalton showed up again wanting to do more work, and says he is in for full-on sex.\nOn one hand I was surprised because he was so nervous, but on the other hand, he did get WAY excited during his Servicing, leaving many of us to think something more is going on with the kid. (which in all honesty, I'm pretty dang sure he is straight)\nAnd this is the first time Teo bottoms, ever as far as I can tell.\nI told him he should practice and stretch beforehand, but he was confident he could take the pain (I think he might like a little pain!). I asked him if he had anything up there before, and he said, \"No just what you did during the Serviced video.\" Which was basically a tongue ON his ass....not the same!\nSo I figured he'd jump right off of it during the first insert. I had him sit on it so he could control the depth. Doesn't make for the best camera angle (sorry!) but it broke his cherry, and he was ready to go.\nNow Dalton, you can tell at the beginning he just isn't sure what to do. Teo is Full Force into it, and Dalton is scrambling to catch up.\nSo as you watch the entire movie you see him open up and just get more and more into it. He really lets go and gives back equally.\nDalton wasn't quite ready to put a dick in his mouth, and kissing wasn't gonna happen either.\nBut the two off them race to nut, Dalton squirts all over Teo's body while Teo frantically plays catch up.\nAnd then wham, just after busting Dalton bends over and REALLY kisses all over Teo (I love kissing!). It's very hot as I try to show off all the cum AND the deep kissing. I can't decide what to show you, all the cum or the hot kissing!?\nA super hot pairing you don't want to miss!",
  "models": [
    {
      "name": "Teo",
      "person_id": 3261
    },
    {
      "name": "Dalton",
      "person_id": 3240
    }
  ],
  "release_date": "2008-07-18",
  "scene_id": 766,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Dalton & Teo - Wrapped"
}