{
  "collections": [
    "ChaosMen"
  ],
  "description": "Blu scores extra points for verbal dirty talk!\nBlu is former infantry. He did 4 years in the Army and a year tour in Afghanistan. He is definitely struggling to make ends meet after being out for a while. He did have a job doing landscaping, but that work is seasonal, so he was hunting for any work he could find.\nHe has a very high sex-drive, so he thought he would put that to work him. His pubes are as natural as it gets. He has some hot chest and tummy hair, but otherwise he is relatively hairless. The scruffy beard helps, and he still has his military buzz cut.\nBlu spent time in Germany and girls always called him Blu. He would hang out in the red light district, and it sounded like he had \"fun\" two or three times a night! So he has staying power!\nHe has had his cock sucked by a guy once before, and he did admit to thinking about the dudes in the straight porn he watches. Like what it would be like to suck the guy off. Just like many of the models who love getting their dick sucked more than anything else, he also puts himself in the positon of doing the servicing. My guess, like Jonas, he will do his best to service another guy.\nHe is a little wobbly in this video. Takes him a while to get into it, but he is putting so much energy and dirty-talking into it, you may not mind. He busts a mean nut as he aggressively jerks his load out, all the while asking you if you want it!\nBlu is a super nice guy, easy to hang with, and will be back next week to have his cock serviced.",
  "models": [
    {
      "name": "Blu",
      "person_id": 7666
    }
  ],
  "release_date": "2015-01-05",
  "scene_id": 7671,
  "tags": [
    "Build - Average",
    "Build - Hairy",
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Blu - Solo"
}