{
  "collections": [
    "ChaosMen"
  ],
  "description": "I forget how small-framed Noah Riley is. I also forgot just how hung Pax is! I should known better, given he was featured in Monster Cock week. Duh!\nNoah takes pride in his ability to swallow a horse-hung guy, but I think once he realized he was sitting on Pax's cock, it became a new mountain for him to climb.\nI wanted to start Pax off slow, despite him having had his cocked sucked and fucking a guy in his private life. I really got the vibe it was very down low, and he did not reciprocate at all. He just sat back and imagined he was fucking a girl.\nBut Noah went in and got some kissing out of him straight away! Kissing is usually hard for the new guys. Noah kisses down his body, and then works his cock with his mouth until it is bone hard! Geez his cock is massive!\nYou can really tell Pax is used to only being serviced. I think he likes watching his cock go down anyone's throat. Guy or girl! Pax did jerk Noah's cock and even did some nice kissing while he stroked their cocks together.\nNoah pushes Pax back and gets in a better position to deep throat his cock. Pax continues to stroke his cock and Noah really worked his dick. Couldn't get him to take the plunge and suck Noah's dick, so baby steps for Pax.\nNoah finally goes to sit on him, but has to take it slow. Noah is not quiet used to sitting on the big guns, he is more used to just servicing them with his mouth. But once he got used to it, Pax could really power fuck him! It is pretty astounding to see Noah's small frame, being skewered by Pax's enormous cock!\nNoah takes a break from sitting on his cock, by jumping off and cleaning Pax's cock, getting it slicked-up so Pax could pound him even harder.\nPax actually did even better with Noah in a doggy-style position. Being upright and aggressive seems to be his best position. Noah's cock is hard the entire time he is getting fucked- both in doggy-style and on his back. I love seeing a bottom truly enjoying being ass-rammed!\nPax also stays rock hard while fucking the cum out of Noah. I think it turned him on seeing Noah cum from his cock inside of him. Pax then ramps up his cock, starts to cum and breeds Noah properly. His cock spasms as it fills his hole up!\nPax does amazing his first time out. A little quiet, but I think when he gets a little more comfortable, he will loosen-up even more. I really want to see him suck cock, so perhaps, if I can get him back, we can see how he handles some cock-sucking!",
  "models": [
    {
      "name": "Noah Riley",
      "person_id": 7572
    },
    {
      "name": "Pax",
      "person_id": 7615
    }
  ],
  "release_date": "2014-12-19",
  "scene_id": 7674,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Noah Riley & Pax - RAW"
}