{
  "collections": [
    "ChaosMen"
  ],
  "description": "Duncan brings his\n'Grade A Meat'\nto Monster Cock Week, along with his\n'A Game'\n!\nHe has an amazing body, a hot sexy vibe, and a 7-8 inch cock that he literally can't wrap his hand completely around! I am sure there are longer cocks out there, but the dude has got some monstrous girth on him!\nDuncan did a solo about 6 years ago, and has changed much since then. He did a stint in the Navy, and now devotes his time to personal training. You can tell by his amazing body that he is his best client.\nHe likes the Latinas, but his current girlfriend is Asian. Duncan didn't say it exactly, but I think he likes girls shorter than him, and gets off on seeing them suck his cock to it's full mass.\nHis stroking action is hot to watch! As I said, his hand barely wraps around his cock, and he does this great twisty motion around the head and shaft, leaving much of his cock exposed. It is like he is stroking a flashlight handle that he can't quite seem to surround.\nSorry about the pubes, but I got him here very last minute, wanting him for Monster Cock Week. Duncan normally is shaved bare, so that is the best we could do on short notice. Still, he actually looks awesome all hairless.\nClearly he also shaves his ass hole. I find it 'interesting' when straight guys pay so much attention to their hole, but he doesn't seem to be interested in having his ass played with. He sure does a fine job showing it off to us though!\nThe dude is made for video too. Strokes and plays to us viewers like a pro!\nLike I said, he is\n'A Grade Premium Monster Meat'\n!",
  "models": [
    {
      "name": "Duncan",
      "person_id": 7675
    }
  ],
  "release_date": "2014-10-29",
  "scene_id": 7676,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Shaved",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Duncan - Solo"
}