{
  "collections": [
    "ChaosMen"
  ],
  "description": "Duncan finished up his shoot with Griffin pretty quickly. We had an hour to kill before taking him to the airport. He said he was still horny, and that he liked that second (or third!) orgasm. He wanted to go into one of the studios and rub another one off before heading to the airport.\nWhy not film it!?\nI didn't really want to shoot another standard solo, but I also wanted to bring you guys more of him. I was fairly certain he was not down to do more with a guy, so I didn't want to waste another opportunity to see his fat cock getting stroked.\nSo we tossed together a few cameras, headed to my house, and set him up there. He had attempted to send me a Peep video before, but the settings were not even close to HD, and the camera shut off mid cum shot. So he was eager to do that again and make it right.\nWe only had an hour, so we kept it pretty simple. After nutting a couple times in the previous 12 hours, he was pretty sure he would just get his cock up and likely blow his load.\nBut he still gave us a strip tease, shows-off some of his push-up skills, then he whips his cock with a frenzy.\nIt was hot just letting him be alone and do his own thing. I came in a couple times to make sure the cameras hadn't tilted over or he hadn't moved around, but he was pretty much on his own.\nHis load is not nearly as big as the two previous, but he still catches quite a bit of air, and it is a fair amount of jizz for having just an hour before filled Griffin's mouth with his load!\nIf you pay attention to production dates, you will see this was shot the same day as his video with Griffin. The dude is a cum factory!",
  "models": [
    {
      "name": "Duncan",
      "person_id": 7675
    }
  ],
  "release_date": "2014-12-03",
  "scene_id": 7681,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Shaved",
    "Theme - Peep",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Duncan - Peep"
}