{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is where I insert my obligatory \"The other model didn't show up\" excuse for performing again with a model.\nAugustus's scene partner missed his outbound flight, and texted that he would not be in until 9pm that night. Ugh! That's a super late video shoot, but what can ya do? I picked Augustus up earlier in the day and he hung out at the studio for 4-5 hours.\nI headed back to the airport, aaand... nothing. No show. No texts. No phone call. I waited around an hour, fearing he had lost all the juice on his phone, but no sign of him.\nI drove the 30 miles back to the studio and told Augustus that it was a no go.\nHe was of course disappointed he had flown all the way here, and was going home empty handed.\nHis flight the next day didn't leave till 3pm, and I woke up the following day and thought maybe we could do an Edge video. I asked him if he had finally jerked-off the night before, and he said he had. I had too! :-)\nBut he said he was all charged up and ready to go. And well, so was I!\nBoy, was he ever ready to go! I have had to 'help' Augustus get over the top a couple times, so it was somewhat familiar territory. For me it was super easy to cum, despite having unloaded 10 hours earlier, mainly cuz Augustus's ass is amazing to look down at while your cock goes in.\nFor his cum shot, I used the FleshJack on him. You gotta give me a hand for my timing on that! If I had let him cum inside the toy, no one would have believed it. I yank off at just the right time! What a workout though!\nSo here is a fun RAW Edge for you for your mid-week update!",
  "models": [
    {
      "name": "Augustus",
      "person_id": 7507
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2015-01-07",
  "scene_id": 7687,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - Edge",
    "Theme - RAW",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Augustus & Bryan - Edge"
}