{
  "collections": [
    "ChaosMen"
  ],
  "description": "Since Roderick had done some videos a couple years back, he was very vague about what went down. As many of you can tell, we producers get surprised by models who claim they have not done anything. Many studios will no work with models that have done previous work, so they learn real quickly to keep previous work on the down low, and hope they don't get found out.\nRoderick was not one of them, but was not incredibly forthcoming. He just started by saying it was a solo before flying out, but then when he met me, and realized I was a nice guy, felt guilty, and started divulging all the information. So he went from a solo to full-on sex with guys in one car drive to the studio.\nSo when it came down to do the oral video, I was kind of pushy about him sucking back. He was just going to receive head, but when I asked him straight-up to suck back he said, \"No problem!\" By then, I think not only did he like me, but also wanted more video work. He really liked the setup and professional vibe.\nHaving said all that, clearly Roderick had done work. He was very comfortable and was great at engaging Addison, who only has a couple shoots under his belt. Roderick was great at looking at his buddy's cock, and not just staring at the TV.\nEven still, there is a vibe of reluctance from Roderick to not do too much. Addison actually take the initiative, and when sucking dick, you can tell he is totally into it. When you watch Roderick suck dick, he is just doing it to complete the task. He may have previous video work, but not a lot of cock-sucking experience!\nHe doesn't look like he hates it or anything. Certainly not a lot of skill doing it, but there is that lack of enthusiasm that is not hard to miss.\nWe stuck to a lot of the toy play, and there are few hot moments when they get up close and start nuzzling each other while fucking their toys. There is a bit of intimacy that could have gone into the kissing zone, but not quite there. They both certainly looked like they loved jamming their cocks and fucking towards each other!\nAddison gets on his knees while Roderick jerks his cock furiously, pretty much nailing Addison's open mouth. Cum all around his lips and mouth!\nAddison then beats his meat till he unloads too!",
  "models": [
    {
      "name": "Addison",
      "person_id": 7664
    },
    {
      "name": "Roderick",
      "person_id": 7691
    }
  ],
  "release_date": "2015-01-28",
  "scene_id": 7695,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Addison & Roderick - Serviced"
}