{
  "collections": [
    "ChaosMen"
  ],
  "description": "Check out the baby blues on Chet! Wow!\nHe has very dark hair, and his blue eyes pop! And if you like natural fur, this guy grew it out for us. But to be fair, the battle to keep it at bay was long lost. He is very hairy! Even his arm hair has a cowlick to it! Love his beard too, and his bright white teeth also really pop nicely amongst all that dark fur.\nChet is a 'mostly' straight guy. He has messed around with guys often enough to try everything, but he didn't seem comfortable labeling himself as Bi. But pretty sure that's where he is. He likes fucking guys, and actually enjoys being fucked. Says it makes him super hard, and cum really intensely.\nHe does say he has a terrible gag reflex, and the one thing he is bad at is sucking dick. I told him we had training facilities available!\nHis interview makes me grin. I feel like he is on a game show and he is racing to get the answer first. I think in all the interviews I have done, I never had one quite like this one! It's cute!\nFor the photos, his cock just would spring to life in mere seconds. But once the cameras rolled, his cock got shy. This happens often because the audio on the porn is on during the photos, but for the solo, I keep it super low or off. So he goes into super hummingbird mode and jerks his cock rapid fire. That does the trick!\nOnce he is erect, he shows off his cock like a pro. Chet even makes it dance for us when he is on his knees!\nHe will for sure be back to do an oral, but he is not too sure about the world seeing him mess around with dudes, but I will try my best! Based on other model's popularity, I just know you will love him.\nWouldn't you love to wake up with him next to you? Big blue eyes and you can pull him on top of yourself to keep warm!",
  "models": [
    {
      "name": "Chet",
      "person_id": 7698
    }
  ],
  "release_date": "2015-02-02",
  "scene_id": 7700,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Theme - Solo",
    "Video - HD - High Def"
  ],
  "title": "Chet - Solo"
}