{
  "collections": [
    "ChaosMen"
  ],
  "description": "When Brannon first came in to do some videos for ChaosMen, I took one look at him and knew he would look amazing with Cooper Reed. Sure enough the two of them look awesome together! Both are tan, shredded, and ready to fuck some muscle ass!\nI was not sure how Brannon was at bottoming, so I set this up as a flip-flop video, just in case he struggled to get fucked. Well, of course he did just fine, and Cooper ends up fucking him most of the video.\nBrannon still seems to need to be guided, which is no problem for Cooper who likes to be in charge. Cooper is used to new guys, so he just takes the lead if the other guy won't. Brannon starts by sucking on Cooper's cock.\nCooper returns the favor then bends Brannon over the bed, to rim his hole and gets it all slicked up to stuff his cock in. I thought Brannon would have to stop as Cooper slid it in, but he toughed it out and road through the initial pain. Before long he was loving getting ass-rammed!\nAfter Cooper had his way with Brannon's ass, he tosses him down and climbs on top of him. He then proceeds to milk Brannon's cock with his ass. Cooper rides him like a pro, jerking his cock with Brannon deep inside of him.\nBrannon said he had not cum while getting fucked, or at least he didn't remember doing it. So we made that our mission. Cooper fucks him until he is spilling his load, and you can tell the orgasm is really intense.\nCooper nuts all over Brannon's hairy hole. He uses his finger to slide globs of jizz deep into his ass!",
  "models": [
    {
      "name": "Brannon Bolton",
      "person_id": 7597
    },
    {
      "name": "Cooper Reed",
      "person_id": 3592
    }
  ],
  "release_date": "2015-01-23",
  "scene_id": 7704,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Brannon & Cooper Reed - RAW"
}