{
  "collections": [
    "ChaosMen"
  ],
  "description": "Byron took some time off to have his newest edition to his family. As soon as things got settled his wife was pushing him out to go have some fun making some extra cash. He has a new job, new location, and seems a lot less stressed. Also I knew I could get him to take a rather large cock, so I had a perfect dude for him.\nJordan pretty much has the same thing going on. Still married and helping run his dad's biz. His wife too seems to get-off seeing him fuck other guys, so I really thought these two would be great together.\nByron's cock sucking skills are not equal to Jordan's girth. But he gives it his best shot. Jordan isn't much better, so this is part where you realize they are in fact straight and just trying their best. Ironically, both stay bone hard, so despite their inability to really throat a cock, they seem to have kept each other happy.\nAfter some 69'ing they get down to some serious fucking. Byron CAN take a huge cock! He barely lets out a whimper as Jordan slides it in. It is just astounding to see it split Byron in two! I think Jordan's cock is even bigger?!\nThe best part is watching them spoon fuck. This is a hard positon and Jordan has got it down. Byron's cock is so hard, it is leaking pre-cum. The dude really likes to be fucked!\nSince getting fucked turns him on so much, I figured we could have Jordan make him cum. Jordan is such a Power Top. He likely could just fuck for hours. Jordan reaches with his hand and starts stroking him, all the while hammering his hole. He beats the load out of him, and Byron is in complete ecstasy!\nJordan squirts a shot of jizz on his hole, the pushes his cock in to unload. His cock does some amazing pulsing and twitching as it pumps his load inside him.\nPerfect!!!",
  "models": [
    {
      "name": "Byron",
      "person_id": 3625
    },
    {
      "name": "Jordan Cleary",
      "person_id": 3551
    }
  ],
  "release_date": "2015-01-09",
  "scene_id": 7707,
  "tags": [
    "Build - Lean",
    "Build - Stocky",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Byron & Jordan Cleary - RAW"
}