{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jeremiah took some time thinking about doing more full-on sex with a dude. Not sure why it took him a while. He has messed around with guys and certainly comes from a very liberal area. He prefers women, but I think there is a part of him that loves dominating a submissive guy.\nAnd boy, you sure see that in this video! He had aggressively throat-fucked Griffin in the Serviced video, and he brought the same game to this one. Thankfully Noah can take it, and rarely doing we get to see a guy dominate a dude's holes like Jeremiah does!\nYou can see he relishes in Noah deep-throating him! Jeremiah just power-fucks his face relentlessly! Tears are coming out of Noah's eyes, but he keeps going back for more!\nJeremiah threw himself totally into this video. He sucks on Noah's cock, and then gets himself in a 69 position to bury his cock down Noah's throat again. Not sure how Noah was breathing but his cock stays bone hard between gasps for air!\nAnd the power fucking does not end with the oral. Jeremiah really lets him have it deep in the ass. Jeremiah is not exactly lacking in the cock department and splits little Noah in two! He pounds Noah relentlessly, but Noah's cock is dripping pre-cum from all the anal action! Jeremiah is truly having sex and he is dripping with sweat with all the pounding he is doing/ A couple times he slows down to catch his breath and not actually cum.\nNoah accidently busts his nut while I am underneath Jeremiah filming him banging his hole. Thank goodness for multiple camera angles! Noah shoots a huge load, and then Jeremiah fucks him about 30 seconds longer until he is about to bust and squirts a couple shots onto him, then plunges in. Rarely do we get guys who can fuck right up to cumming and was super happy I was below when that happened.\nSoooo much great energy in this video! The guys are fucking like there is no tomorrow!",
  "models": [
    {
      "name": "Noah Riley",
      "person_id": 7572
    },
    {
      "name": "Jeremiah",
      "person_id": 7606
    }
  ],
  "release_date": "2015-01-16",
  "scene_id": 7717,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jeremiah & Noah Riley - RAW"
}