{
  "collections": [
    "ChaosMen"
  ],
  "description": "When Brannon came on board, I had a laundry list of the guys I wanted to pair him with. Palmer was right up there on that list. Both are about the same height and their sculpted bodies look amazing together!\nBoth guys just finished a physique show, but thankfully Palmer did not opt to do the spray tan. Even Brannon opted out of the spray tan they do for those shows. So Palmer is a pale echo of Brannon's bed tan, both with fantastic bodies and cocks! I am just glad no one showed up orange!\nWe started the video with some oil and body worship and it quickly turned into some mutual cock sucking. Brannon's skills are improving. He is still not a pro, but then Palmer is not either. They both looked evenly matched in this department. The suck each other in a 69 and Palmer gives us a great showcase moment of Brannon perfect hairy hole!\nI wanted to have Palmer to try bottoming again, just to see how he was. Palmer starts by fucking Brannon and the energy is really good. Then Palmer takes a turn being ass rammed, and you can tell he is just getting through it, though his cock woke up a couple times. Brannon was not staying terribly hard as a top, so we switched it back, and everyone was back to be happy.\nSo Palmer is likely going to be all top, and I suspect will mostly have Brannon bottom. He did fine in other videos, but if there is a dominate guy on set, Brannon seems to not mind letting the other dude have his way with him.\nBrannon also was pleased he came while getting fucked. That's the second time for him, and I think he is gonna be addicted to it!\nAnd Palmer gives yet another amazing breeding!",
  "models": [
    {
      "name": "Brannon Bolton",
      "person_id": 7597
    },
    {
      "name": "Palmer",
      "person_id": 7427
    }
  ],
  "release_date": "2015-02-13",
  "scene_id": 7719,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Brannon & Palmer - RAW"
}