{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ouch! This is a long video.\nI notice these videos creep up to the 25 minute mark (and almost 300 megs) when the models are taking their time and bringing the action up from a slow simmer to a full on boil!\nAnd Slade takes his time with Gram. Lots of caressing, and ass eating (I popped a boner or two editing the video..so hot to watch!). You even get to watch Gram's cock spring to life from Slade's blow job.\nAnd the fucking is amazing. Slade is not normally a bottom. I've promised him to find a dude for him to fuck so he can redeem himself as a Top! But before I started shooting, I told Slade I really wanted some good close-up shots of fucking. He really went to all sorts of acrobatics to make sure you are part of the action!\nI watch this video and wonder at how he stayed up on top like he does. It's cool and shows that a more mature guy knows what he is doing!\nAnd again, I think this is just an amazing cumshot.\nSlade takes it in the face, eating a glob or two of DNA. Then he sucks the last bit out, cum oozing down the side of his face, and then busting his own nut while the last little bit goes down his throat. It really is worth the long download to watch it...over and over and over again!\nAnyway, enjoy these two hot muscle guys, and though Gram, who was supposedly \"exclusive\" to my site, this will be his last appearance here. So enjoy his true first time fucking a dude.",
  "models": [
    {
      "name": "Gram",
      "person_id": 3255
    },
    {
      "name": "Slade",
      "person_id": 3253
    }
  ],
  "release_date": "2008-08-08",
  "scene_id": 772,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Gram & Slade - Wrapped"
}