{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is Addison's first time doing a full-sex scene. He is local and I had him doing a lot of oral type videos, but had not got him committed to doing some fucking until now. It wasn't that he was not down to do it, I just wanted to put him with the right guy, and getting Cooper and Addison's schedule the same was harder than I thought it would be.\nAddison thought he would be better as a bottom. He has had sex with guys, but mostly it has been oral. He has topped and bottomed in his personal life, it just had been a long time since he actually did either, and was not sure he could stay hard enough to top. He was a little nervous and we needed to take it slow.\nCock sucking seems to be his thing. Although he is not as skilled as Griffin or Noah Riley, he sure enjoys it. If he has a cock to nurse on, and access to his cock, he gets turned on fast. Cooper does return the favor, and we even get some armpit worship, with some really nice 'armpit to mouth' sucking.\nAs for the ass fucking, we had to keep it slow and smooth. Addison really found it hard to convert pain to pleasure, and you can tell he is just taking it. By the end of the video, he was finally getting off to it, but if you like your bottoms squirming around, this video is for you.\nI didn't think Addison could cum from getting fucked, so he shoots his load into Cooper's arm pit. So fans of armpit action will really enjoy it when he licks it up and shares a cummy kiss with Cooper!",
  "models": [
    {
      "name": "Addison",
      "person_id": 7664
    },
    {
      "name": "Cooper Reed",
      "person_id": 3592
    }
  ],
  "release_date": "2015-02-06",
  "scene_id": 7726,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Addison & Cooper Reed - RAW"
}