{
  "collections": [
    "ChaosMen"
  ],
  "description": "With Byron telling me his wife uses some fairly large toys on him, I have been pairing him with guys with extra thick cocks. Pax more than fits the bill with his long girthy stick, but I still worried he might split Byron in two.\nI gave Pax one more pass on sucking dick, so the video is a bit shorter than others. He promises me he will give it a try next time. He is not grossed out, but I get the sense that he wants to do it good, but has no idea how to suck. So I am sure soon we will be seeing if we can get some tentative cock sucking out of him. I told him I would be happy to practice off camera with him! ;-)\nThe two start by jerking their cocks, and I love the glances back and forth. A little bit of worry creeps across Byron's face as he sees what he is up against. And I do detect a bit of genuine interest in Pax as he strokes his cock and watches his buddy's dick.\nByron sets to the task of working Pax's big stick. As usual, he is not super skilled, but he keeps Pax's bone hard, and it is astounding to see Byron try to wrap his lips around it. They joust their cocks for a bit, then Byron climbs on top and wedges it in. Lot's of deep breaths on that insert!\nBut true to his married bottom boy ways, he took it like a champ. Grinding up and down on Pax, who stares in wonder that this dude is totally taking his cock balls deep. Pax is a quiet one, but he sure seems to be a power top, and we do get some verbal out of him.\nIn the meantime, Byron is struggling not to cum. In fact he nutted once when the cameras were not rolling just as Pax was pulling out of him top get more lube. Like Jet, he said it wouldn't be a problem going again, and that he could just keep cumming.\nSo I told him to just let us know if he is that close and we would scramble to get it. Not 5 minutes later, Pax fucks the cum out of him again. That one we caught!\nHe needed no recovery time, so Pax flips him on over and fucks him doggy style. About 3 minutes later, another load starts leaking out of his cock. Love seeing it dribble and strands of cum swinging in the wind!\nAfter 3 orgasms, Byron was ready to hang up his hat, so Pax juices his hole like a pro.\nAfter fucking him with his cum soaked cock, he makes Byron turn around and lick all the jizz from his big piece of meat!",
  "models": [
    {
      "name": "Pax",
      "person_id": 7615
    },
    {
      "name": "Byron",
      "person_id": 3625
    }
  ],
  "release_date": "2015-02-27",
  "scene_id": 7731,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Byron & Pax - RAW"
}