{
  "collections": [
    "ChaosMen"
  ],
  "description": "I am so excited to be working with Lorenzo. His solo was awesome, and his energy for this video is real and electric! Of course, it helps a lot that not only is there genuine chemistry between him and Noah, but also that Noah also has got some great energy and skills too.\nFrom the moment they start kissing you know the sparks are going to fly! Lorenzo has a bossy vibe that Noah responds to with enthusiasm. He has Noah worshiping his cock in no time. But he is also eager to please his boy, and sucks and rims Noah till pre-cum is dripping out of his cock like a faucet. His cock sucking skills are in the elite category!\nThere is a moment when Lorenzo was sliding his cock around Noah's hole, and it might feel a little bait and switch to the viewer, but they stuck to the limits for the shoot. I think we have all been in the position where you almost start fucking, but the timing is not right. Both guys really wanted to fuck!\nLorenzo does manage to slide his finger into his hole while sucking his cock.\nThey swap facials in this movie, and Noah's is hot because he was so close to cumming that he only had to slowly fuck Lorenzo's mouth for a few minutes, before pulling out to cum. He shoots out jets of cum that fly past Lorenzo's face, but he corrects for the final couple squirts.\nLorenzo's aim is a little off too, but in an amazing way. He starts by aiming for Noah's mouth, but the cum shoots out at different angles, hitting him square in the eye! The shame of going home with red eye!\nBut not only did he hit his eye, but his forehead, his cheeks, his lips, his mouth! He coats his enrie face like frosting a cake!\nOn both cum shots they share their loads, and it is hot watching Lorenzo lick strands off cum from Noah's chin!\nI definitely asked Lorenzo to be part of the team and he is eager to get started. He of course has asked for a re-match with Noah so he can fill his hole up, but I have a few other guys I would love to see him with. But if you liked the chemistry between these two, I will consider a re-match!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Noah Riley",
      "person_id": 7572
    }
  ],
  "release_date": "2015-03-04",
  "scene_id": 7739,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Trimmed",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Lorenzo & Noah Riley - Serviced"
}