{
  "collections": [
    "ChaosMen"
  ],
  "description": "A bottom is born!\nAs I mentioned last week, Lincoln has had a 'prostate massage' from a girl before, so he knows his back door likes that attention.\nRansom sets to work getting Lincoln hard, and despite his skills, Lincoln stays pretty wobbly. Lincoln even tells him to \"rub it\" but I think Ransom was unsure what part he needed rubbing, so he started working on his balls. Finally I step in and tell him to flip him over and pay attention to his ass.\nThat did the trick! Ransom was amazed at how quickly he boned-up once he had his ass in the air. In fact, I think just getting in that submissive position was enough to get his cock hard!\nRansom sets to work stroking his cock, pulling on his balls, while playing and licking hi hole, all of which sends Lincoln over the moon.\nHe gets Lincoln on his back again, this time his legs in the air, then thumbs his hole some more. You can tell Lincoln was eager to be fucked with the toy, so we start small but then quickly upgrade to a larger toy. The vibration action gets him even more turned on.\nLincoln almost comes once, and we should have run with that one. He kind of 'half cums' and it made getting a full cum shot out of him a lot harder. I had to cut it down for time, so its not the normal ramp up that I like. But Ransom jerks the load out of him!\nThe cum shot is powerful, and poor Ransom gets a nose full of jizz for all the hard work! A couple shots go down the back of his throat, and it took all his will-power to not cough it up.\nLincoln is young, and I think he may want to play with a guy in person. He clearly loves having his ass played with, and my guess is,a cock pounding would be a euphoric experience for him!",
  "models": [
    {
      "name": "Lincoln",
      "person_id": 7711
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2015-02-18",
  "scene_id": 7746,
  "tags": [
    "Build - Average",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Shaved",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Lincoln & Ransom - Serviced"
}