{
  "collections": [
    "ChaosMen"
  ],
  "description": "Devin Dixon was in town over the holidays, and I jumped at a chance to work with this hot little stud- and avoid Holiday air fare travel fees! Glenn had ONE day off himself, and the guy I had set to work with him, never even showed up for his solo. So his timing was perfect.\nGlenn does construction, and when he shows up in his work clothing he gets even hotter. So I asked Devin if he had anything like that, and did he ever! Devin's look has changed over the years. His body hair is more natural, and there is more of a 'dirty boy' vibe than twink.\nI was planning on shooting this in a workshop setting, but the weather was not cooperating. They look a little out of place in a plush setting, but fans of ball caps and boots will still be pleased.\nI think it is interesting watching them both work their ball caps throughout the shoot. Turning the caps forwards, backwards, and even sideways, while trying to negotiate sucking each other's cocks, is like watching two dancers in sync. Clearly both have had sex many times while they kept the caps on! Anyone who has ever given head knows the first thing you gotta do is get the brim out of the way!\nAnd this is a super-hot cock sucking video too! Glenn never fails to put all his energy into it, and Devin certainly has skills. Both clicked nicely and I think having the accessories on turned them both on. They sure worked naturally together!\nThis is a hot Serviced video with a little fabric fetish thrown in, so you don't wanna miss it!",
  "models": [
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Devin Dixon",
      "person_id": 7748
    }
  ],
  "release_date": "2015-03-02",
  "scene_id": 7747,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Devin Dixon & Glenn - Serviced"
}