{
  "collections": [
    "ChaosMen"
  ],
  "description": "After seeing Lorenzo with Noah Riley, I knew exactly who I wanted to put him with for his first full-sex scene. Griffin!\nI admit it, I wanted an easy shoot where the two guys would instantly connect and have amazing chemistry. I was not disappointed. I basically chased these two around for 45 minutes while they did their thing. I only had to chime in if Lorenzo was blocking whatever it was he was doing (he is still learning to let the camera in) and of course stop to take some photos.\nThese two are nicely matched. Lorenzo seems to be a bossy Top, though he admits he can take a 9 inch cock, albeit with a lot of elbow grease, and says he has really liked getting fucked. But you can tell he moves like a Top. I have likely said it before, but the best Tops are also experienced bottoms.\nGriffin is usually showing off his cock sucking skills, and Lorenzo is impressed, but I think Griffin was equally impressed with Lorenzo's oral skills. He focused on his head, and it drove Griffin crazy with desire. You can also tell Lorenzo loves to eat ass! Chomp!\nSlightly different ending as Lorenzo bust his load first inside Griffin, then I hustle up from the floor to catch Griffin nutting. Lorenzo cock is just about limp, but the two nearly nut at the same time.\nAnd you can tell Lorenzo is going to give us a great show every time. He laps up Griffin's cum and spits it into his mouth!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    }
  ],
  "release_date": "2015-03-13",
  "scene_id": 7758,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Griffin Barrows & Lorenzo - RAW"
}