{
  "collections": [
    "ChaosMen"
  ],
  "description": "I hadn't seen Jet in a while and he was eager to get his legs back up in the air! Roderick has done some full guy-on-guy work before, so he was easily down to fuck some ass. He had heard about Jet's ability to cum multiple times, and was impressed that anyone could do that.\nI knew Roderick's cock was the perfect size to make him nut. BIG, but not too big or thick, hitting the sweet spot that triggers his ejaculation reflex.\nThey start by jerking their own cocks then switch to sucking each other's dicks. Roderick does a great job sucking on Jet's thick cock, and overall he seemed a lot better at it than when he did in his video with Addison. He certainly seemed a lot more turned on!\nJet eventually rides his cock until he cums. He pulls off at the last moment, nuts on Roderick's dick, then slides the cummy cock back in. Jet needs no recovery after cumming, so his cock stays hard and he just keep riding with a cum-soaked dick sliding in and out.\nSince Roderick was so turned on, and has nice long cock, we got some spooning in, and Jet lets another load spurt out while Roderick grinds his cock into his hole. I always say this is a challenging position, but these two make it look easy!\nWe get one more nut out of Jet before Roderick shoots all over his ass, jamming the rest deep inside him. He pulls out and makes Jet clean his cock!",
  "models": [
    {
      "name": "Roderick",
      "person_id": 7691
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2015-03-06",
  "scene_id": 7764,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jet & Roderick - RAW"
}