{
  "collections": [
    "ChaosMen"
  ],
  "description": "Corban is a completely different dude in this video!\nHe was fairly closeted when he did his solo/oral video, and would not even suck Jonas, despite him playing with guys in his private life. It was just 'too gay'. He was married at the time, and not Out to any friends. Well that changed, and now he is a way more open. Corban has a new dude in his life and has the family situation in hand. This is an all new Corban!\nAnd boy does he ever let go in this video! What a change! It is raw sex energy unleashed! Seriously, go back and watch his Serviced video with Jonas and compare it to this one. He is downright voracious in this one!\nAnd Vander was surprised too! He had watched his Serviced video also, and was expecting someone to be a reluctant performer. Instead he had a dude hungry for cock! Vander was in total bliss during this video, matching him in energy and cock size!\nCorban had a few surprises too. He has always had to fuck guys slow and gentle, and when Vander told him that he literally could not fuck him hard enough, Corban works up a major sweat pounding Vander's hole! He could not believe he was able to fuck so aggressively!\nThe only issue was getting Corban to cum. Even though he says he is a Total top, it turns out has been getting fucked and really liking it. Vander unloads, so there was no way he was going to fuck him, so we insert out trusty butt plug, and let Corban stroke his cock while sucking on Vander's spent cock. I left the insert in as kind of an OutTake.\nDespite this issue, which I think is actually hot, this video will likely go down as many viewers favorite video!",
  "models": [
    {
      "name": "Corban",
      "person_id": 7414
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2015-03-20",
  "scene_id": 7765,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "Video - OutTake",
    "X-Tras - Tattoos"
  ],
  "title": "Corban & Vander - RAW"
}