{
  "collections": [
    "ChaosMen"
  ],
  "description": "In many ways, the beginning of this video feels a bit like Francisco is a typical straight guy about to get serviced by another dude. But he is Bi, and should be comfortable, but he seemed a little tense to start with.\nFrancisco seemed very focused on the video playing. We found a Bisexual one to watch, and even though his cock was responding he seemed intent on watching the video and was avoiding eye-contact with Noah.\nNoah just slides down and starts sucking while Francisco stays tuned to the TV.\nBut then the video shifts gears as Francisco realizes he is getting an amazing blow job.\nAnd then he is all about sucking Noah's dick. Noah was happy to have his cock sucked, and you can tell Francisco has some experience sucking dick, but he is by no means an expert.\nThey both 69, but I think Francisco was most turned-on when he was on his knees getting sucked by Noah. Perhaps he was enjoying the view of Noah's amazing ass?\nWe know Noah is more than happy to take a facial, and I was surprised Francisco was cool with it too. So they both give each other facials. Noah is up first to get his face splattered and for once he didn't get it in his eye. He laps up a thick creaming load from Francisco's long uncut cock!\nFrancisco then lies down to get his facial, and literally chokes on the clear load that pumps out of Noah's dick. I think some of it went down the back of his throat the wrong way, so there is a little gagging, but he recovers nicely!\nIf you like spending a day at the spa getting facials, this video is for you!",
  "models": [
    {
      "name": "Francisco",
      "person_id": 7777
    },
    {
      "name": "Noah Riley",
      "person_id": 7572
    }
  ],
  "release_date": "2015-04-15",
  "scene_id": 7781,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Francisco & Noah Riley - Serviced"
}