{
  "collections": [
    "ChaosMen"
  ],
  "description": "Steven was super nervous about this shoot. Not sure why Glenn always ends up with the uptight ones.\nI don't think Steven was concerned about performing, but as I mentioned last week, he was more worried his buddies would find out. So if you know Steven, mums the word!\nBoth he and Glenn have the same taste in women, so it was easy to find a video for them to watch together. Unfortunately, Glenn is not Steven's 'type' when it comes to guys, if he even has one, but based on skinny hairless guy he watched the day before, Glenn has moved long past being considered a twink.\nSo he did look pretty anxious when we got started, though you could tell he was interested in Glenn's cock, which as usual, was at the ready! However, Steven struggled to rev up his own engine.\nGlenn just gets down on his knees and gets him hard. That did the trick! From that point forward we were good to go. Just had to break the ice!\nGlenn's cock sucking skills are now totally refined, and he knows all the tricks to keeping a dude who has the nerves, up and aroused!\nAs for Steven's cock sucking, it is about what you would expect from a novice. Mostly jerking, no deep throating, but still determined to keep his buddy hard. He gets in there a couple times 'hands free' so he is no dummy when it comes to trying to suck dick. But you can tell he is having to stop and breath through his nose to not gag.\nSteven's cum shot is much better this day. It took him a while to nut, so Glenn was edging the whole time. I barely get my camera down to his cock before he is shooting ropes of cum. Nicely timed, but you can tell Glenn is a little panicked that he might have cum too quickly. It's a good thing his aim was a little to left or he might have hit himself in the eye. Instead it ricochets onto Steven's thigh!\nGlenn literally shoots ropes of cum! No wonder when he breeds a dude, his cock pulsates with so much force!\nAnd for those who like a little reality in their amateur porn, there is a fun (possibly gross) Out Take after the end titles.",
  "models": [
    {
      "name": "Steven",
      "person_id": 7778
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2015-04-22",
  "scene_id": 7784,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Video - OutTake",
    "X-Tras - Tattoos"
  ],
  "title": "Glenn & Steven - Serviced"
}