{
  "collections": [
    "ChaosMen"
  ],
  "description": "Like most magazines (that have gone the way of 8 track cassettes, porn to follow?) I tend to shoot 2-3 months in advance. I never know if I will have enough guys to keep the site up and running with a steady stream of at least 3 videos a week.\nSo this video was shot the day before Christmas, as evidenced by the Christmas tree in the background. I am not a big fan of holiday themed porn. Even the Monster Cock week around Halloween are 'Holiday Neutral'. I always think it is strange if you are re-watching a video in July and the video has some sort of theme that is not even close to the current date.\nBut I had Devin Dixon in town, and Maximilian called me up saying he had become a bit more comfortable with the guy on guy thing. His girlfriend was going to be out of town (actually ex-gf as they had broken-up a month earlier, but were still living together), and that he could shoot a Peep video at his place.\nAt first I was going to set this video up as him playing with some toys alone, but with Devin in town, and wanting some Holiday money, I set the two of them up to do a POV video together.\nPeep videos are 'at home' self-filmed amateur videos that I try to put a ChaosMen 3-Camera twist on to help smooth over the rough patches.\nWith Maximilian being very passive and inexperienced, while Devin has a ton of experience, I put Devin in charge. Boy! Did he take charge!\nLots of great POV action in this. Some toy play, lots of stroking and sucking. Devin cums twice, while Maximilian barely nuts. But overall, if you love the \"There\" or POV themed type videos, this one will take you right There, but also give you a top down view of all the action!",
  "models": [
    {
      "name": "Devin Dixon",
      "person_id": 7748
    },
    {
      "name": "Maximilian",
      "person_id": 3522
    }
  ],
  "release_date": "2015-03-23",
  "scene_id": 7785,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Oral",
    "Theme - Peep",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Theme - There",
    "Video - POV-CAM",
    "Cock - Uncut"
  ],
  "title": "Devin Dixon & Maximilian - Peep Serviced"
}