{
  "collections": [
    "ChaosMen"
  ],
  "description": "Theon is back!\nTheon took some time off for knee surgery, so he was super ready to dive back into having sex with dudes. He was never fussy about performing, but needed a break to get his knee worked on, and of course to get back into shape. Though from the sound of it, weeks after the surgery he was back in the gym, in a wheel chair!\nBoth Brannon and Theon seem to be better at bottoming, so I was a little concerned starting this shoot. I had them set to flip-flop, but Theon seemed to be doing just fine topping, so we ran with it.\nThey look amazing together, both tan and muscles ripplin'!\nSo it was nice to see his thick cock back in action, splitting Brannon in two! Brannon can handle a thick one, but on this day it took him some time to adjust to Theon's girth. Lots of 'Ouchie Faces' as he struggles to accommodate his cock! He finally got loosened-up but he was also having one of those days where he would get hard and just want to cum. That was yet another reason we kept him as a bottom. He was worried between takes he would just cum as soon as he got hard and started fucking Theon.\nUnlike some of the other guys, once he blows his load, he is down for the count!\nWhich made it ridiculously easy for the Theon to fuck the cum out of him!\nAfter seeing the major load he busted, I thought it would be hot to see Theon add his own load to it. Theon does his best to nut in a timely manner, but Brannon's load is just starting to dry out when he gets there. Theon adds his own huge load to on top all over Brannon cock and stomach!\nI love seeing all that cum coating Brannon's hot body!",
  "models": [
    {
      "name": "Brannon",
      "person_id": 7597
    },
    {
      "name": "Theon",
      "person_id": 3535
    }
  ],
  "release_date": "2015-04-17",
  "scene_id": 7791,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Brannon & Theon - RAW"
}