{
  "collections": [
    "ChaosMen"
  ],
  "description": "After seeing how sensual Lorenzo was, I just knew I wanted to put him with Cooper Reed!\nThis is a very long video, because the two take their time toying, teasing, licking, sucking and fucking each other. If you are one of those viewers that just scrubs past the oral to the sex, you really should take some time and get into it with these guys! They are truly enjoying taking their time!\nLorenzo kisses all over Cooper's body, inching his way down to his cock. He pulls it out and slowly licks and sucks it to full mass. Lorenzo knows what he is doing! Cooper was impressed!\nThey 69 for a bit, but I think Cooper was more interested in Lorenzo's ass. He played with his hole, while Lorenzo worked on his cock. Lorenzo got a little time to play with Cooper's hole also.\nCooper then pushes Lorenzo back to give him some oral TLC. Lorenzo is so turned on! Cooper takes command and pushes his legs into the air so he can get at his ass with his tongue. He fingers his hole, loosening him up so he can fuck him. There is some great interaction between the too, as Cooper talks him into opening wide!\nI thought after seeing Lorenzo with Griffin that he was all Top, but this video will make you think he is all Bottom! He takes Cooper's cock with ease, with pre-cum oozing out of his cock! He keeps his hands away from his cock, trying not to cum too soon.\nThey switch gears, and Cooper rides his cock, milking it with his ass. Nice little bit of Ass to Mouth too! Cooper is so tidy, cleaning Lorenzo's cock for him!\nNext Cooper fucks him doggy-style, and I love watching Lorenzo's hard cock bob up and down as Cooper fucks him.\nSince Lorenzo was so close to cumming while on his back, they return to that position so Cooper could fuck the cum out of him. Lorenzo normally takes a long time to ramp up and unload, but not this day! A Top that needs to get fucked to cum! Hmmmmm! It's a great nut shot too!\nCooper never fails when it comes to breeding a boy! His load is equally awesome, squirting his jizz all over and in Lorenzo's freshly fucked hole. Cooper laps it up and kisses Lorenzo with his cum soaked lips!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2015-04-24",
  "scene_id": 7793,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Cooper Reed & Lorenzo - RAW"
}