{
  "collections": [
    "ChaosMen"
  ],
  "description": "Noah has been doing a lot of Serviced videos, so it was time for him get his bubble-butt back into action! I asked him if he would be down to play with Palmer to which I got an eager, \"Yes!\"\nPalmer has been great as a Top, so I have been steering him towards just topping. He will bottom of course, but to me, he is just is taking it. Whereas when he is Topping, he is really loving it. After this shoot, Palmer claimed this was the easiest and most fun video he had shot. He really liked Noah, and him being gay made it easier for him. Score one for the pink team!\nYou can also tell he loves how Noah is sucking his cock! He just sits back and lets Noah service him. He eventually gets up on his knees so he can play with the hole he is about to fuck. Noah nurses on his cock while his boy hole is toyed with.\nPalmer slides his fat cock in and fucks him nice and smooth. I love the power humping he does. His body looks amazing as he strains to the hold the position. How he manages to kiss Noah like that is beyond me. Seriously, the rear view of him humping him is awesome!\nNoah blows his load while Palmer fucks him. He sure squirts a lot!!\nPalmer breeds his boy good, cumming on and in his hole. You can see his cock spasm, and just when you think he is done unloading, he pulls out and squeezes out some more!",
  "models": [
    {
      "name": "Noah Riley",
      "person_id": 7572
    },
    {
      "name": "Palmer",
      "person_id": 7427
    }
  ],
  "release_date": "2015-05-08",
  "scene_id": 7796,
  "tags": [
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Noah Riley & Palmer - RAW"
}