{
  "collections": [
    "ChaosMen"
  ],
  "description": "Pax is like a lot of guys with extra thick cocks. He tends to fuck slow and steady, worried that they are gonna hurt the girl or guy they are fucking. So I wanted to put him with someone he could really pound and not worry about hurting anyone.\nVander of course loves it rough, and so far, no cock has been too big!\nPax is still quiet, but he is talking a bit more. He does let go and really get his fuck on in this video. I think he actually liked when Vander would hop off and clean his cock, getting it all slick to fuck some more.\nVander basically worships his cock. Pax does not suck back. Spoiler alert! It was cough and cold season and Pax was coughing the entire time before the shoot. How we got through the video without a major cough attack was amazing, but he didn't think Vander's cock down his throat would help him.\nRegardless, it really is all about seeing Vander expertly handle Pax's unit. Watching Pax fumble with Vander's mighty cock might have only been mildly entertaining.\nBut overall, he said this was his best video yet. He does seem more I inclined for twinks, so that is who I have him setup with next, but he liked working with a gay guy better, loved being able to fuck at a higher speed and with deep penetration.\nThe Cum shots are perfect on this one. Vander was ready to nut, so fucking him while they spoon was easy and Pax even nails his cumshot in that awkward position.\nIf you like Ass to Mouth action, it is extra hot watching Pax's cummy cock slide out and have Vander lick it clean!",
  "models": [
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Pax",
      "person_id": 7615
    }
  ],
  "release_date": "2015-05-01",
  "scene_id": 7797,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Pax & Vander - RAW"
}