{
  "collections": [
    "ChaosMen"
  ],
  "description": "This was a hard video to shoot!\nWhy?\nBecause these two just went at it like two cock hungry guys, completely forgetting that they were being filmed. I was saying, \"Guys! Open up! Let us see!\" and they just kept going as if no one else existed in the world. Griffin does his best to showcase, while you can tell Tegan is just trying to please his buddy, and not really aware of where the cameras and audience is.\nTalk about instant chemistry! I am a little worried that Tegan had it too easy his first shoot. He wants to come back and do more, but he got off to being filmed for the solo, and the crazy energy between these two made for simple shoot. Not all shoots go so smoothly. We had only one stop to take some photos of the action, then it was time for everyone to bust. Even the cum shots we were scrambling to get cameras re-adjusted as they both quickly unloaded in each other's mouths.\nGriffin talks dirty to Tegan, to encourage him to bust. He laughs nervously at one comment, but whatever Griffin was saying worked as he busted his load in no time. Griffin was the exact same. Not sure how they both came so easily while doing a balancing act, but it likely had to do with the genuine attraction.\nTegan's solo is calm and deliberate, but this Serviced video shows he also has some genuine sexual intensity!",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    },
    {
      "name": "Tegan Zayne",
      "person_id": 7805
    }
  ],
  "release_date": "2015-05-06",
  "scene_id": 7813,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Ethnicity - Middle Eastern",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Griffin Barrows & Tegan Zayne - Serviced"
}