{
  "collections": [
    "ChaosMen"
  ],
  "description": "Just like his solo, I am hoping you all will really watch Noel's body language and facial expressions. And we get 2, possibly 3 ejaculations!\nHe was super nervous to do this video. We had one false start where he was not sure he was going to get hard. Reset!\nWe tried again, and things not only went smoother, he got really into!\nWatch him as Noah starts sucking on him. He watches the TV to start, but also throws his head to the left and right as if saying, \"No.\" Then he takes a serious interest in what is going down on his cock.\nThe switch gets thrown, and he makes Noah his cock sucking bitch!\nHis facial expressions run the gamut of freaked-out, pleasure, angry suck my cock face, to adorable boy with his tongue licking his upper lip, all sly and knowing you love sucking his rod.\nNoah does an amazing job sucking his curved cock. It is truly the prefect angle for sitting between his legs and servicing Noel.\nNoah make him cum too!\nI struggled to edit the cum shots on this one. Trying to balance the Instant Replays, with showing each round of ejaculation as a separate event.\nNoah sucks on him and jerks him until he starts cumming. You will have to listen carefully for Noel to tell him he is cumming. A load cums out and Noah licks it up.\nNoel grabs his cock. I am pretty sure he was done cumming, and was working to get a second load. But he could have just been trying to get the rest of the first load out. You be the judge. After I watched it a couple times, I think he did ejaculate three times. Or two and half!\nHe slows down his jerking a bit after the first round, then ramps up his speed again to get even more cum out of his cock. Noah his there to lap it up. A little bit still manages to splat across his nose.\nSo it is up to you guys to decide. One really long orgasm? Two orgasms? Or three?\nAnd after doing your forensics, you will want to have an orgasm of your own, or three!!",
  "models": [
    {
      "name": "Noah Riley",
      "person_id": 7572
    },
    {
      "name": "Noel Anton",
      "person_id": 7804
    }
  ],
  "release_date": "2015-04-29",
  "scene_id": 7814,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Noah Riley & Noel Anton - Serviced"
}