{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kieran has been camming for about 6 months. A buddy of his decided to help him get more established in his burgeoning adult business. So his friend was kind of managing him, when his images got submitted to me. I had to pretty verify that I was legit with a video phone conference.\nHe lives kind of local, so he and his buddies drove to Austin, checked out 6th street, and then came in on Sunday before they drove home. His two friends were really nice, but they didn't want to around when he did his solo, so they hung out on the front porch.\nKieran clearly had done photos before, so he was super easy to work with. Very easy to smile, and also very easy to get hard! He has left hooked, uncut cock, which has a decent amount of girth to it.\nVery natural in front of the camera, and you can tell he is used to watching himself do his thing for an audience.\nKieran is very Metro sexual, and I was not really sure what team he played for until he picked his porn. Which was a lot of lady action. Am I bad for saying I was surprised? Well, the video he picked clearly worked, so I shouldn't be so quick to judge.\nHe was not overly interested in showing his ass, so I asked him to grind his cock into the couch so we could see some nice muscle-butt action. He took it literally, and fucks his cock between the couch cushions. I always forget that uncut guys can get away with this trick without any lube! Lucky!\nHis load is strong and powerful, and over all, shooting this video was really a pleasant way to spend a Sunday morning.\nHe and his posse headed back home, and I am pretty sure he won't be back for an oral video. But ya never know! Maybe his cam followers can convince him!",
  "models": [
    {
      "name": "Kieran",
      "person_id": 7812
    }
  ],
  "release_date": "2015-05-11",
  "scene_id": 7815,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Shaved",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Pubic Hair - Intact",
    "Theme - Solo",
    "Video - HD - High Def"
  ],
  "title": "Kieran - Solo"
}