{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is Noah's first time doing a massage themed video.\nIt runs a bit long, about 30 minutes. Noah takes his time with Emile, and of course some of that time is the 'massage', oiling, and the body worship. Noah plays with Emile's butt cheeks, trying really hard to spread his firm cheeks apart.\nHe doesn't make much progress, so he asks Emile to get up doggy-style. Emile thrust his ass in the air, giving Noah an all-access-pass to his hole and his junk. That position is what finally flipped the switch on Emile's cock, and from that point on, he was at the mercy of Noah's hands and mouth.\nNoah is not normally into guy's asses, but the last couple guys he has started really enjoying it. He loves to please guys, and I think when he gets a great reaction, as Emile does, it turns him on even more.\nEmile flips onto his back, and his hard cock is just demanding more attention. Emile takes the initiative and begins to grab at Noah's dick through his shorts. Noah eventually gets them off, and it is hot watching him make Emile play with it.\nNoah sucks on him until he his writhing around. He climbs on top of him so Emile can suck on him. It is an awkward position, but Emile shows that he is not shy about sucking a guy's cock, and does a great job nursing on Noah while getting his own cock hoovered.\nThere is some cock jousting, and Emile looks totally turned-on rubbing their dicks together. This puts Noah in the perfect position to make Emile cum.\nThe length of this video is also due to me leaving in all of Noah making Emile cum. Sometimes it is hard to make these guys nut, so I have to cut here and there, but Emile was ready to nut, and with just a little bit of encouragement, Noah pulls the load out of him in a couple minutes.\nIt is a perfect cum shot, with Noah sucking on Emile's cummy cock. Without any hesitation, he gets on top of Emile and quickly busts his own load with Emile's cum still all over his face!\nAfter nutting all over Emile, he bends down and licks-up the mess he made!",
  "models": [
    {
      "name": "Emile",
      "person_id": 7820
    },
    {
      "name": "Noah Riley",
      "person_id": 7572
    }
  ],
  "release_date": "2015-06-10",
  "scene_id": 7826,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Trimmed",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Emile & Noah Riley - Serviced"
}