{
  "collections": [
    "ChaosMen"
  ],
  "description": "Armani is back after taking a couple months off to be with a new girlfriend. It happens all the time. They get serious, then things go awry, and then they are hopefully back to filming. To Armani's credit, he did say chances were high he would be back, but wanted to give the relationship his total focus.\nSpeaking of returns, Brannon returns to the table. He did his Serviced video on the table, but I wanted a video where he was getting his prostate massaged as well as his throat. Time to pound that muscle ass!\nI knew Armani would have the sensual energy to pull it off. He is little unsure about the massage part, as well as giving head, but once he is on top of Brannon, making him suck his cock, he is in more familiar territory. Armani can be super passive and mighty dominant!\nI continue to have Brannon be a passive bottom. Seems to suit him, and the boy never complains.\nArmani is also a great a top. His curved cock is great for shooting and I think his size made it so Brannon was enjoying getting fucked. I didn't spot him putting his 'hand to thigh' trying to stop Armani from going to deep. Well, maybe once or twice when Armani is power fucking him while standing.\nMaking Brannon cum is easy too. Armani found just the right speed and depth to push the load out of Brannon. Armani unloads one squirt in the air, then buries the rest inside Brannon!\nIt is great to have Armani back in the saddle again!",
  "models": [
    {
      "name": "Armani",
      "person_id": 3609
    },
    {
      "name": "Brannon Bolton",
      "person_id": 7597
    }
  ],
  "release_date": "2015-05-22",
  "scene_id": 7832,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Armani & Brannon - RAW"
}