{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wow! Truman is awesome! There are so many great things about this video!\nGlenn' massage table skills are now in the elite category! It does help that Truman was incredibly turned-on, very responsive to touch, and willing to push his limits. Glenn showed up wearing his cap and I thought it would be hot to see him film in it.\nI'm not going to go into much detail on this one. Just it is a joy to watch Truman writhe around as Glenn toys with him. He also gives cock-sucking a try, and despite the awkward position, does a decent try.\nThe cum shot is just tremendous! Unique even! Truman is quick to cum anyway, so we knew Glenn was not going to have to yank on him for 20 minutes. Once Truman decided he was going to allow himself to cum, Glenn just had to toss a little extra energy at it, and then kerpow!\nTruman's verbal as he is about to cum is as hot as it gets. He gives Glenn a warning, but a squirt hits the back of his throat. He pulls away with a strand of cum between his mouth and Truman's cock.\nThen the geyser erupts! Truman's dick is squirting all on its own, cum cascading down the shaft, making it so slippery Glenn can barely get a grip! Cum just keeps piping up out of his cock! Just when you think the eruption is over, another squirts bubbles up!\nGlenn tries his best to get a grip and jerk the rest out. He then climbs up and unleashes his own load all over Truman's cock and stomach.\nPerfect!\nI am definitely asking Truman to come back! More please!",
  "models": [
    {
      "name": "Truman",
      "person_id": 7806
    },
    {
      "name": "Glenn",
      "person_id": 3480
    }
  ],
  "release_date": "2015-05-13",
  "scene_id": 7834,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Glenn & Truman - Serviced"
}