{
  "collections": [
    "ChaosMen"
  ],
  "description": "Very often I rely on my local guys to help do the orals. I book guys all the time that never show up, so having someone fly in to do Serviced videos with new guys is always a gamble.\nBut Bradley seemed very sure that he would be here, and with his 6'4\" height, I knew just the tall drink of water to put him with! Wren, who often 'towers over' whoever is on top of him, would be the perfect choice, though it meant having to fly half way across the country.\nBoth guys were pleasantly surprised when they met that they would be working with someone who matched their height. Wren rarely feels shorter than anyone and for once someone had an inch or two on him! Well worth the air fare!\nWren is so chill with everything, and even though he identifies as straight, the guy has got to be at least bi. He and Bradley hit it off, and there was instant chemistry. They spend a lot of time kissing and playing with each other's cocks. Standing while kissing and not having to bend over was a first for both!\nYou will see Bradley's bossy-vibe kick in, and happily, it fit nicely with Wren's passive nature. Bradley loved making Wren suck his fat uncut meat! Wren does have that 'just use me' vibe about him.\nBradley sucks on Wren, getting his boy all hard and worked up. Next, Wren rims Bradley's hairy hole, keeping Bradley hard.\nAfter Bradley sucks some more on Wren's cock, Bradley rims Wren, and you can see how hungry he is to put his meat inside of him. There is some hot-dog-in-a-bun action that will leave you wanting him to just shove it in, but that was not the game plan for the day.\nBradley was thinking about how hot it would be to fuck Wren, and that put him over the top. He straddles Wren's face and jerks his cock until he cums. Wren gets a major facial as Bradley coats him from chin to forehead!\nBradley doesn't leave his boy hanging either. He lies down beside him and strokes him until he cums. I love that it is so easy to make Wren cum. He is always turned on when a dude takes over his cock. Clearly, Bradley knows what he is doing!\nThey finish the video with a hot, cum-soaked kiss!",
  "models": [
    {
      "name": "Wren",
      "person_id": 3581
    },
    {
      "name": "Bradley",
      "person_id": 7827
    }
  ],
  "release_date": "2015-05-27",
  "scene_id": 7835,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Bradley & Wren - Serviced"
}