{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jonas is back with longer hair. He got a new job, a new girlfriend, then finally had some free time to come in and play with a dude.\nAs fate would have it, just as Jonas was asking to do a video, Lorenzo was ordering from the ChaosMen menu, asking to work with Jonas.\nOnce again, Jonas was happy to be playing with a gay guy. Not sure why he is more willing to 'let go' and run with it, but it is a great combination for him. As usual, he is best at having his cock worshiped, while his own skills barely get Lorenzo pleasantly plump.\nAs soon as Jonas started ramming him with his boomerang, that got Lorenzo up and aroused. We take advantage of Jonas's curve, and get some awesome penetration.\nThe only thing that was funny or off in this video is I was down on the ground, filming some penetration when Lorenzo let his load fly. Thankfully other cameras caught it, but I laid there wondering what the heck was going on up there. I couldn't see a thing when I hear Lorenzo say he is cumming. Really? Now? I'm on the ground!\nSo I came up from the ground to see a big pile of DNA on his stomach. Oops! Not a huge deal, and I didn't want to spank Lorenzo too much. Jonas does know how to hit all the right spots and make you nut!\nJonas breeds Lorenzo's hole like a pro, cum dripping everywhere and some nice cock spasms as he fills Lorenzo up!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Jonas",
      "person_id": 3589
    }
  ],
  "release_date": "2015-06-05",
  "scene_id": 7838,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Jonas & Lorenzo - RAW"
}