{
  "collections": [
    "ChaosMen"
  ],
  "description": "When I first met Pax, he said he had messed around with one or two guys. One of them was just a onetime thing, but the other, it sounded like it lasted over a year. Not sure how many times in that year, but he basically got serviced and fucked the guy.\nWhen he described the guy, he mentioned he was young, very well-groomed, no body hair, and very thin. Basically a 'twink'. So if he had a type, twink would be it.\nWhen Jon said he was up for getting fucked, I knew just who to put him with for his first time. I thought Pax would see him as a twink.\nDespite Jon's fascination for fisting, he actually is not too keen on over-sized cocks, so I wasn't too sure he could handle Pax. For getting fucked, he prefers an average-sized unit. Jon was a little worried about Pax's size, but as you will see in this video, it was not an issue.\nPax has come quite far from his first video. He still is quiet, but he whispers dirty things to the other models. I think after working with Vander, he let go a little bit, and his energy seems to be more tender, and wanting to please the guy with his cock.\nHe does aggressively work over Jon's hole pretty good, but I think his natural tendency is to be sensual and tender.\nJon does great his first time out. He has very little gag reflex, and loved worshiping Pax's dick. Jon's fat cock stays pretty hard through most of the shoot, and came from Pax sliding his cock slowly in and out.\nAnd once again, you can tell Pax loves dumping his load inside of someone. I think the breeding part is his favorite!",
  "models": [
    {
      "name": "Jon",
      "person_id": 7767
    },
    {
      "name": "Pax",
      "person_id": 7615
    }
  ],
  "release_date": "2015-05-29",
  "scene_id": 7839,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jon & Pax - RAW"
}