{
  "collections": [
    "ChaosMen"
  ],
  "description": "Once I saw how aggressively Jeremiah fucked, I knew I had to pick the right guy for him to work with next. Jet can take a pounding, and his cock just becomes a fountain of cum when a dude is aggressively fucking him.\nJeremiah was actually having problems not shooting his load. Even when he is on top of Jet, awkwardly squatting to fuck him doggy-style, he would have to pull out and rest a bit before accidentally shooting. He says he can cum multiple times, but each time he would get close to cumming, his cock would deflate as if it had already cum, so he was not willing to risk it and make a 5 minute fuck scene.\nJet must have a super sensitive prostate. He says he doesn't really like getting fucked, but his cock sure does. Jeremiah, who is straight, just seems to like anyone enjoying his cock. But you can tell it turned him on even more to see that his cock was making him cum. He surprises me because he dives in to every seen, not worried about sucking cock or rimming an ass. Just as long as his cock has a place to nestle into!\nI think Jet cums three times in this video. Each time he nuts, Jeremiah pulls out and makes him clean his cock. This gives Jet time to recoup, then Jeremiah gets him a new position and fucks the cum out of him at a different angle.\nThe juicing on this is the best out there. Since Jeremiah was struggling not to cum the entire time, he was pretty sure he could cum from just fucking Jet. A lot of the guys will pull out and stroke themselves until nutting. Sometimes the guys do it because it is the only way for them the cum, other guys know that once you unload, most bottoms are not keen on getting fucked anymore and they feel guilty.\nBut with Jet, you can just keep fucking him after he cums, and he may unload again!\nSo Jeremiah gives us one of those rare moments where he is actually fucking someone till he cums. He pulls out just a moment to let some jizz cream his hole, but back in it goes to fill him up!",
  "models": [
    {
      "name": "Jeremiah",
      "person_id": 7606
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2015-06-12",
  "scene_id": 7848,
  "tags": [
    "Build - Average",
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Jeremiah & Jet - RAW"
}