{
  "collections": [
    "ChaosMen"
  ],
  "description": "Daz said that he had been sucked by guys before, and I think one time he even topped, so he was actually not too nervous for this video. Most of the guys are worried they will not stay hard or cum, but Daz was charged up and ready to go!\nThis is Tegan's first Serviced video, and he is a little quiet, unsure about working with a guy who predominately identifies as straight. I told him to just dive in as quickly as possible, just to keep Daz hard. After a couple minutes, he realized Daz's cock is not going to wilt, so takes his time nursing on his dick and playing with it at a more leisurely pace.\nAfter a while, Tegan lies next to him, and Daz quickly pulls his shorts off to jerk on Tegan. He wasn't ready to suck back, but he did a great job keeping Tegan hard and turned-on.\nDaz even liked having his ass rimmed. He has had girls do it, and his cock liked being jerked while his ass was licked.\nTegan flips him on to his back and gets to the task of making Daz bust his nut. The load cums out slow, and then spurts out in a couple globs near the end. Making a cottage cheese mess!\nTegan then grabs his cock and jerks-off onto Daz. He struggles a bit, but as soon as Daz started encouraging him, he adds a large load to Daz's tummy.\nNot sure why, but I think Tegan was embarrassed cumming on to him. He scoops it up to clean up his mess then jerks his cock with it.",
  "models": [
    {
      "name": "Daz",
      "person_id": 7860
    },
    {
      "name": "Tegan",
      "person_id": 7805
    }
  ],
  "release_date": "2015-07-15",
  "scene_id": 7868,
  "tags": [
    "Build - Average",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Middle Eastern",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Daz & Tegan - Serviced"
}