{
  "collections": [
    "ChaosMen"
  ],
  "description": "It took me a couple tries to get Zale back in. He moved and changed jobs. I had him on the schedule once, but his new job kept him busy and he missed a shoot. I was worried he might miss this shoot, but he promised his schedule had settled down, and he was eager to make some great porn.\nEven still, I put him with Griffin who is local. I didn't want to fly anyone in, and then not have him show.\nThankfully he did show, and was looking awesome! His body looks great, and his pubes are fully grown out now.\nHis mindset had changed too. Zale no longer seemed as reluctant to work with a guy. He was down for sucking cock back, and topping. He thought bottoming might be in his future, but today he worked on the oral and fucking a guy.\nZale has some great energy too. We start by having Griffin rub his shoulders, then he flips him on over, and takes his cock from 0 to 60 in about 60 seconds and has him fully aroused. Gotta love Griffin's mad oral skills!\nZale is tentative to suck at first, but once he got a cock in his mouth, he went after it with as much skill as he could muster. His ability to suck cock and fuck Griffin's face is amazing!\nHe was also pretty good at fucking a guy, so I am not vouching for it being his first time. He claims it was, but you know how it is with these guys. I think they tell you want you want to hear.\nRegardless, Zale has a nice long cock, and he uses it to impale Griffin with furious energy. He unloads on Griffin's hole. He tries to shove it in, but then just gives up and dumps the rest into Griffin's mouth.\nGriffin's eats it up, cleaning his cock until he bust his own load!",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    },
    {
      "name": "Zale",
      "person_id": 7692
    }
  ],
  "release_date": "2015-07-03",
  "scene_id": 7870,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Griffin Barrows & Zale - RAW"
}