{
  "collections": [
    "ChaosMen"
  ],
  "description": "After the Griffin & Vander video, I had a few suggestions to add Glenn into that mix with a rematch. Griffin has come on strong, taking on the veterans of my site, so matching them up again would have been a problem. But putting Glenn and Griffin together still seemed like a great idea.\nGlenn was looking for some extra money for Spring Break, so agreed to do a full on sex scene. Finally I could put Glenn and Griffin together. One problem though was I really wanted the two veterans to have someone new to work with.\nEnter Ares who said he really liked to bottom, and was eager to be dominated. Griffin, while an amazing bottom, is equally good at topping. Actually the same could be said for Glenn.\nFor this video, I wanted to capitalize on Ares's need to be dominated, and the goal was for Glenn and Griffin to use Ares as their play thing.\nMission accomplished!\nThe video is definitely more fuck-oriented. They get right down to using Ares who seems very happy to have a cock in his mouth and ass.\nGriffin breeds Ares's hole while Glenn gives him an amazing facial!",
  "models": [
    {
      "name": "Ares",
      "person_id": 7858
    },
    {
      "name": "Glenn",
      "person_id": 3480
    },
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    }
  ],
  "release_date": "2015-07-24",
  "scene_id": 7879,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def"
  ],
  "title": "Ares & Glenn & Griffin Barrows - TagTeam RAW"
}