{
  "collections": [
    "ChaosMen"
  ],
  "description": "Director's Cut with all the action!\nAfter West came in, I told him it was likely he would work with Griffin. Some of the gay models tend to be pickier about who they work with, so will ask for access to the site. Anymore, I just set them up an account so they can see the other models, but also see samples of videos and how they go down.\nSo I gave West access to the site to do some research, and at the time, the Griffin & Vander Director's Cut video had just aired. West texted me that he didn't realize we did wet stuff on the site, and said he would totally be down for it.\nI guess I haven't really integrated this fetish play into a Serviced video. A glory hole video, sure that happens. But I thought we could have a little in Serviced video to help spice things up.\nWest was immediately attracted to Griffin, and was a surprised at how hard Griffin was. He himself said he struggled a little to stay hard, and he got new found respect for models that are totally on top of their erection game. Even still, he is super charged-up, and he was just shocked he got wobbly a couple times.\nIronically, West was hardest during the wet portion of the video. His cock loved the extra moisture to jerk-off with!\nAs usual, Griffin brings his 'A' game, and West certainly throws it back at him.\nWest seemed a little hard on himself about staying hard. Frankly, I really didn't notice it. And when it came down to cumming, he busted so easily! Griffin's timing is also spectacular!\nWest really does have what it takes to do adult video work, so I hope he comes back for more!",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    },
    {
      "name": "West",
      "person_id": 7867
    }
  ],
  "release_date": "2015-07-22",
  "scene_id": 7883,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Director's Cut",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Griffin Barrows & West - Serviced DC"
}