{
  "collections": [
    "ChaosMen"
  ],
  "description": "I picked Zale up from the airport and on the car ride up he asked about his scene partner. I told him they had a lot in common. They both previously have only done one full-sex scene, and that they were both straight.\nI was really surprised at how Zale did not think it would work. His two previous scene partners were gay, and for some reason it intimidated him that the other guy would be straight.\nI assured him that Truman had really good energy his first shoot and that he seemed to really like getting fucked. I didn't think there would be a problem. Zale still seemed mystified as to how it was going to work.\nTruman is a character. When he arrived at the studio, he was chatty, goofy, and always ready with some crazy story of something that happened to him. Usually it is alcohol related. Not sure why, but the two Bro'd out, and that finally relaxed Zale.\nEven still, I was not expecting there to be romance. I started them off doing doing a side-by-side stroke, and let Truman take the initiative. I think Zale is going to be a passive Top until he gets a few more shoots under his belt.\nOne thing that did surprise Zale was how Truman, who seemed straight to him, REALLY liked getting fucked. Zale knew the gay guys would like it when he was with them, but he just didn't think someone who identified as straight would be into it all. Wrong!\nSeeing Truman trying to NOT cum while he fucked him did put the idea that he might even try bottoming too. I think if we start him with a standard-sized cock he will be fine.\nIt blew his mind even more seeing just how easily it made Truman cum.\nI have to admit, Truman's downward curve really makes his cum shots interesting.\nHe only has to stroke a little before the cum goes flying out. He quickly redirects the output towards Zale's abs, and lot of it shoots down on to Zale's cock then he fucks his own cum into him. The jizz drips down his own ass cheeks.\nZales pulls out and jerks his cock rapidly. Truman's cum is still all over his own ass when Zale adds his own. He almost has the breeding down, but can't quite let go of his cock once it is inserted back in.\nHe pulls out, and the cum oozing out of Truman's ass is amazing!",
  "models": [
    {
      "name": "Truman",
      "person_id": 7806
    },
    {
      "name": "Zale",
      "person_id": 7692
    }
  ],
  "release_date": "2015-07-31",
  "scene_id": 7888,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Truman & Zale - RAW"
}