{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bjorn was eager to get started, and I knew the boy could handle a lot of cock!\nI had been wanting to put Pax and Cooper together, but had my reservations that Cooper could handle Pax's giant rod. Oh, he never would complain, and would take it, but I think his expression would look pained, and his cock would crawl up inside of him. He is trooper, but I think I would have felt like a sadist making him sit on it.\nSo Bjorn was set to be the bottom boy and Cooper and Pax would use him!\nWe start with Bjorn servicing Cooper and Pax, who spend some time kissing while their cocks get worked on.\nThey all move over to the bed where Cooper gets a taste of Pax's meat. He then feeds it to Bjorn, making sure it goes all the way down his throat. Pax was in the zone and actually eager to try sucking an uncut cock. He seemed fascinated by it, and nursed on it while Bjorn worked his stick.\nCooper and Pax lay across from each other, while Bjorn took turns sucking their cocks.\nIt wasn't long before they had Bjorn doggy-style. Cooper rimmed Bjorn's hole, getting it all slicked up for his cock. In the meantime, Bjorn kept his mouth action on Pax's cock.\nBjorn said he could handle anything, but ironically both Cooper and Pax struggled to get inside Bjorn's tight hole. Cooper did the loosening up with his tongue and finger, and you can tell he struggled to get into Bjorn's tight hole.\nPax climbs over Bjorn and feeds his ginormous cock to Cooper, who bangs the heck out of Bjorn. Cooper really liked that and encouraged Pax to try the same thing.\nPax, our shy and reserved dude, looked very happy fucking a dude while sucking a cock. He really had to concentrate at doing both tasks, but it is so cool to see him just dive in and try most anything.\nThey switch it up to some spooning, which I think is Pax's specialty. Cooper goes back and forth feeding his cock to both Bjorn and Pax. Again, Pax looks happy sucking and fucking at the same time.\nPax was actually struggling to not cum through out this video. That presented a problem for him to fuck Bjorn until he would nut.\nIn order to make Bjorn cum, we knew it might take a lot of time to get Bjorn over the top. Pax feared he would nut inside of him, while Cooper knew he could keep going without busting. So we had our final ending position and everyone was really ready to bust.\nCooper fucks the cum out of Bjorn, and nearly seconds later, Pax is feeding his load to Bjorn. I am sure Bjorn was in pig bottom nirvana! Timing is a hard thing to accomplish in porn, and these two were on their game!\nNot to say that Cooper wasn't! I quickly had to get down underneath to capture Cooper giving Bjorn a creampie. He was super close too and you can tell I am racing to get it all in focus and at the right angle.\nVander recommended Bjorn, and this tiny titan is a power bottom. He is off to an amazing start!",
  "models": [
    {
      "name": "Bjorn",
      "person_id": 7851
    },
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Pax",
      "person_id": 7615
    }
  ],
  "release_date": "2015-08-07",
  "scene_id": 7894,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Bald",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bjorn & Cooper Reed & Pax - TagTeam RAW"
}