{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had sent Griffin a couple advance images of Colby. I think he was salivating days before doing this shoot. Griffin said he could not wait to worship his cock.\nSo we started with Colby standing there, simply getting head. His cock always seems a little wobbly. I think it just gets a lot of blood near the end, and he has no foundation inside his body to support the gravity pull.\nBut it slides down Griffin's throat with ease, who really could be a sword-swallower for the circus.\nAnd you can tell that Colby has NEVER had anyone deep throat him before. He talks under his breath, clearly astonished. Cock blown, mind blown!\nWe kept this shoot to just cock worship. Griffin loved the texture of his cock (he said that about Troi) and just could not get enough. Colby does have a nice ass, but I did wanna keep the focus on just his dick.\nColby sits down to give Griffin a few more angles of attack. Colby strikes me as an aggressive dude, so we moved from a passive sitting position, to one where he could really pound Griffin's throat with his cock.\nGriffin's specialty! Throat fucking!\nColby's relentlessly hammers his throat while his balls are smashing into Griffin's cheeks and eyes! The under shot on this video is tremendously hot! I love that you can see Colby's face and his cock slides all the way down Griffin's neck.\nColby grabs his dick and jerks a load out for Griffin to eat. And Griffin, who barely got a chance to touch his own cock, nuts moments later, glad to have eaten Colby's seed straight from the pipe!",
  "models": [
    {
      "name": "Colby",
      "person_id": 7896
    },
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    }
  ],
  "release_date": "2015-08-05",
  "scene_id": 7900,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Colby & Griffin Barrows - Serviced"
}