{
  "collections": [
    "ChaosMen"
  ],
  "description": "Vin said he was down to go all the way with a guy. He had sat and took a year or so to really decide he could do guy-guy video.\nI don't think he has his brain wrapped around it yet. He struggles a bit to get hard, and his facial expressions go from nervous to turned-on. Mostly nervous.\nNoah just plows ahead, and starts sucking on him until he is fully hard. Vin is in the habit of checking the cameras on what he is doing, typical of a cam performer trying to make sure they are in the shot.\nI think his cock looks bigger today. Or maybe he was just more turned-on. As far as him conquering sucking dick, he just couldn't go there. He even struggled to just play with Noah's cock, so if he is going to do more with guys, he is going to be slow at it.\nIf you like the nervous straight type trying to make it with a dude, then this video is for you. He is really pushing himself to even just grab a cock. Hey, at least it is believable he has not been with many guys! I know many of you love it when everything is hot and heavy, but many viewers also like the guys who truly look like they are lost.\nVin is not totally lost. There is a LOT of potential. He is great when he is up on his knees and also face fucking Noah. Definitely a more dominant type of guy.\nHaving said all that, getting him and Noah to cum was well, super easy. One thing you can say about cam performers is they can lay down rope on command. He makes sure every last drop goes into Noah's mouth, and Noah begins to cum as he feeds him his load!",
  "models": [
    {
      "name": "Noah Riley",
      "person_id": 7572
    },
    {
      "name": "Vin",
      "person_id": 7903
    }
  ],
  "release_date": "2015-08-12",
  "scene_id": 7909,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Noah Riley & Vin - Serviced"
}