{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had been hinting to Zale that he should start thinking about pushing his limits and try to bottom. He never seemed dead-set against it, but I think he wanted to try topping his first couple shoots before going ankles up.\nAs often happens, he worked with a couple guys that were enjoying getting fucked, and they would tell him it is not bad at all, in fact the orgasms seem to be stronger. So his curiosity was piqued. Plus he also wanted to be a more rounded performer, getting a chance to do more video work.\nSince Armani has been doing great as a Top, I figured he would be a great \"starter\" guy for Zale. He stays hard, and could take his time while Zale got used to the sensation.\nBut Armani is also a great bottom, so I set it up as a flip-flop video, with Zale only bottoming one position.\nZale wanted to get fucked first time in doggy-style position just in case he needed to jump away. Armani took it easy on him, and he did actually volunteered getting fucked in a second position. Progress!\nHe stayed soft for most of both positions, so I am not sure he had an epiphany to bottoming, but he no longer will fear it, and will become a more versatile performer.\nMeanwhile, Armani continues to excel at both positions. A couple times while getting fucked, he nudged Zale's hand away from his cock to avoid cumming.\nWe used this to our advantage so that Zale would actually fuck him while stroking him to orgasm. You can see Armani's hand hovering just above, as if he wanted to grab and take over, but Zale does indeed make him nut.\nZale also has his breeding down. I think last time he just could not let go of his cock while cumming, but this time he starts to shoot, then nuts inside of Armani, hands-free.\nI still have not got either guy to rim, so the video is lacking that, but the fucking and breeding are all top notch!\nI know 'first time fucked' videos are always dubious, but this one has some great energy, and you can really tell Zale is reticent, but still eager to enjoy it!",
  "models": [
    {
      "name": "Armani",
      "person_id": 3609
    },
    {
      "name": "Zale",
      "person_id": 7692
    }
  ],
  "release_date": "2015-08-14",
  "scene_id": 7912,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Armani & Zale - RAW"
}