{
  "collections": [
    "ChaosMen"
  ],
  "description": "With Rupert being so dominant and good with the dirty talking, I knew we should setup his blowjob video with him standing while being serviced. Not sure why being upright makes it even more dominant, but it sure worked for this video!\nYou can tell Rupert is really unsure about getting his dick sucked. You can see waves of disbelief cross his face. But his cock sure was into getting sucked, and Griffin had him hard in mere seconds.\nGriffin also quickly showed him that he could deep throat his cock with ease. Rupert was shocked to see his long cock disappear down his throat. That has not ever happened with the girls he has been with, so you really see just how surprised he is that his cock went completely down his throat.\nAs if that was the green light to 'Go!' Rupert just uses Griffin's mouth and throat like the natural dom he is. Very aggressive! Griffin was once again in cock sucking nirvana!\nGriffin gets Rupert into the chair for some more thorough servicing. It is so hot to see Rupert's legs in the air, while Griffin licks his hole, taint and balls.\nWhen it came time to make him bust, Griffin had to really grab and twisty jerk his cock to make him spill his load. If Griffin had a third hand, there would room on Rupert's cock for it!\nThe load spills out onto Griffin's tongue and he laps it up!",
  "models": [
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    },
    {
      "name": "Rupert",
      "person_id": 7913
    }
  ],
  "release_date": "2015-08-19",
  "scene_id": 7920,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Griffin Barrows & Rupert - Serviced"
}