{
  "collections": [
    "ChaosMen"
  ],
  "description": "I knew Lorenzo and Tegan would look great together, but they both have very different personalities. Lorenzo is all about sports, school, and the parties that go with them. Tegan is more reserved and a Bohemian type.\nSo I was little worried they would not click, but now I don't know why I ever worried. They both hit it off right away, and you can see the chemistry brimming in this video.\nLots of kissing and Lorenzo takes his sweet time playing with Tegan's cock. You can tell he delights in teasing Tegan until he is bone hard. Lorenzo spins around on top of Tegan, who begins to eat his hole aggressively.\nAfter getting rimmed, Lorenzo basically plants his cock in Tegan's mouth. Tegan gets his cock nice and hard so that Lorenzo can fuck him.\nTegan is more of a Top, but has been exploring getting fucked. He takes a lot of selfies, that show-off his amazing ass, and it is so hot to see him finally getting fucked. So it is a shame to not see him take it up the bum.\nThey flip-flop fuck, and Tegan starts to pound Lorenzo. He fucks him doggy-style and then on his back. That of course made Lorenzo cum, and it looks like a double cum shot as you can tell Lorenzo has two giant spasms.\nTegan tugs on his own cock, juicing Lorenzo's hole.\nThis is a super-hot pairing with two guys that are obviously into each other!",
  "models": [
    {
      "name": "Tegan",
      "person_id": 7805
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2015-08-28",
  "scene_id": 7922,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Ethnicity - Latin Guys",
    "Ethnicity - Middle Eastern",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Lorenzo & Tegan - RAW"
}