{
  "collections": [
    "ChaosMen"
  ],
  "description": "Valentin Petrov approached me about doing a video, and I considered putting him with one of my professional guys, namely Vander.\nValentin has a large body of work, and has been with a lot of the big names in the professional side of the industry. I still consider myself an amateur site, but I do have a few of my own professionals that I count on to help with the newbies.\nI think Valentin said he had mostly bottomed, but was down to fuck Vander also. Vander does bottom great, while Topping he really needs someone who is really into bottoming. The two were a match, and it was instant chemistry, as evidenced by the aggressive kissing at the beginning.\nIt's a long video as these guys take their time pleasing each other. They actually get down to fucking fairly quickly as eating Valentin's ass turned Vander on so much, he couldn't help but fuck his ass.\nAss to mouth action was something both guys were into, and if you love watching a boy clean a cock, you won't be disappointed.\nValentin does a great job Topping, which turned Vander on even more. They almost grudge fuck other, trying to one up the other!\nWith Valentin able to take Vander's cock so readily, I do believe this is one the few instances where he cums from fucking. He pulls out to spew some seed on his hole, but then plunges it deep inside Valentin!\nThey swap places so that Valentin can ramp and juice Vander's hole!\nA double cream pie ending!",
  "models": [
    {
      "name": "Valentin Petrov",
      "person_id": 7919
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2015-08-21",
  "scene_id": 7926,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Valentin Petrov & Vander - RAW"
}