{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is a shorter than normal sex scene.\nIt has nothing to do with the chemistry, but everything to do with the temperature.\nYa see I waited days for someone to come fix the air conditioner in the studios, so this shoot was done in one VERY hot room. The repairman showed up the next day of course, but it was about 85 degrees in the room.\nI told Dyson and Teo we should cancel, but they were ready to go (Dyson was so nervous I wasn't sure I could get him back in the studio a second time) and Teo just wants to have fun no matter where he was. You can tell he floats through life.\nAbout 5 minutes into filming they were both soaked and it was draining. Normally I am very pushy about making sure we can see the insert, but holy crap, Dyson was thrusting super hard into Teo's ass! Ouch!\nHe's a mean fucker. So I just kept my eye on Teo to make sure he was fine, and let Dyson fuck in a more natural position. Easier on Teo, but frustrating for viewers. Sorry.\nBy the time it was time to bust, they were sweating big time, but I will be danged if Teo didn't cum seconds after Dyson nuts all over his cock.\nAnd a nice kiss at the end too.\nDyson's still not sure about all this, but he sure tried almost everything in this video, including sucking dick for the first time. I think I am gonna try to put him with an eager bottom next time (or maybe a flip flop!?)\nDyson really likes to watch the \"mean to girls\" videos in order to get himself in the zone to do a scene. I think he's got a very dom streak to him and this translates well to working with guys. I think he can get off making \"anyone\" service him.\nAnd Teo of course is always eager to show off for you all!",
  "models": [
    {
      "name": "Teo",
      "person_id": 3261
    },
    {
      "name": "Dyson",
      "person_id": 3259
    }
  ],
  "release_date": "2008-09-19",
  "scene_id": 793,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Dyson & Teo - Wrapped"
}