{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jensen was really nervous for his solo, and even more nervous to get head from a guy his first time. Thankfully, the solo went well, and he got more confident.\nI don't think his cock wilts but once during this video. He kept his hands in his sweats, playing with his cock, while we setup the camera and got Noah in position to start. He pops out of those sweats bone hard and ready to go!\nI gave Noah some tips on how he likes to stroke, so he gets right down to sucking it like he means it. He deep throats his cock a couple times, and I think it is the best Noah has done at this. His cock is a great length, and it can be put in any direction, so Noah could find just the right angle to go balls deep.\nJensen doesn't pay too much attention to the video playing for him, so pretty much got lost in the sensation. He did say it was the best blowjob he had gotten. He also kept requesting Noah to play with his hole. Noah even fingers his hairless hole while sucking his cock.\nAfter getting his ass rimmed, Noah lays down so Jensen can fuck his face. He does lose firmness while fucking his face in an awkward position, but I think in this position it kind of needed to be bendy. Jensen sure liked fucking his face aggressively!\nJensen lays back down, and Noah sets to the task of making him nut. He works real hard at it! Every time I thought he might give up, Jensen would make an encouraging noise, and then Noah would suck harder.\nAnd the hard work was worth it! Jensen starts shooting and Noah lets some fly in the air, but also makes sure to eat some as it come out of his cock.\nYou may notice that it started raining really hard while Noah tried to make Jensen cum. So in a way, Jensen makes it rain all over Noah hair and face. Very fitting!\nIt is raining cum inside today!",
  "models": [
    {
      "name": "Jensen",
      "person_id": 7936
    },
    {
      "name": "Noah Riley",
      "person_id": 7572
    }
  ],
  "release_date": "2015-08-26",
  "scene_id": 7942,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jensen & Noah Riley - Serviced"
}