{
  "collections": [
    "ChaosMen"
  ],
  "description": "Teo is back!\nI get requests for a lot of previous performers. I do read them, but for the most part, many of the guys have gotten married, taken good paying jobs, or just needed a spot of cash now and then to balance a budget. Inevitably when I air someone who has not been on the site in a while, I get a lot of requests for other previous models.\nI think Taylor, Darius, Delaney are the most requested, and while I touch base with each of them, I think they have retired. Sorry guys!\nBut then, you never know when suddenly we get to see Teo back with his ankles in the air. Anything is possible!\nI knew Cooper Reed and Teo could pull-off the more sensual stuff that I try to include in a Pure video. Teo had lost over 40 pounds, and was feeling good about his body. His body hair is trimmed-up as he had totally shaved it all bare. He only had about a month's worth of hair, by the time we shot the video.\nSo his look has changed, and on top of all the body morphing, he has become such a handsome man. The curly-haired twink dude, has morphed into a striking young man!\nHe and Cooper clicked easily. They both love working-out, so tips and tricks were shared, and that broke the ice.\nI wanted Teo to be passive in this video and just let Cooper use him. I think Teo excels as a Bottom, while Cooper can handle both, but makes for a great Top.\nTeo was actually a bit worn out after this video. He said he had never been fucked so long during a scene! Cooper's dick just doesn't wilt!\nTeo got most hard when he was on his back, so Cooper takes a break from fucking him to give him some oral pleasure. Teo was happy for the break, but Cooper went right back to pounding his hole.\nTeo uses that oral boost to stroke his cock until he nuts. I forget how fast he jerks off! Cooper jerks really fast too, and creampies Teo's battered hole.\nThis is an awesome video with two hot guys slicked up, kissing, sucking and really getting into each other!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2015-09-11",
  "scene_id": 7943,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Pure",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Video - OutTake"
  ],
  "title": "Cooper Reed & Teo - Pure"
}