{
  "collections": [
    "ChaosMen"
  ],
  "description": "Alec's is back after having a baby with his girlfriend. New babies cost a lot of money, so he was back to get a few shoots to help with the home budget. I was actually running out of guys that I thought could take Pax's cock, so his email came at the perfect time.\nThere is a little Bi in both these guys, so we get a little more intimacy than other videos from them. Alec seems more relaxed about having sex with guys, and he really does like to get fucked. I think Pax even liked sucking on Alec's big cock! Progress!\nThey start by wearing jeans while kissing and exploring each other's bodies. Alec sits down to get his cock serviced, and you have to admit Pax is getting better at sucking cock. He got Alec's wobbly cock hard in no time!\nAlec's also seems to like to suck. He stays hard and stroking the whole time he is trying to jam Pax's cock down his own throat. They 69 for a bit, but then Alec gets his ass in the air so Pax can play with his hole.\nIt had been a while since Alec had been fucked. The dude has taken some really big cocks, but I figure having Pax use a dildo on him would loosen him up. It sure turned Pax on! His cock stays hard and Alec even gives him some courtesy strokes while Pax pushes the toy in and out.\nAfter loosening him up, Pax was eager to go balls deep on him. The insert must have been torture for Alec. Pax gets a rhythm going, while Alec's ass is spread wide. Pax dives deep in this position! Alec is a champ taking his whole cock!\nPax pulls him off the bed to get a better angle, and you see Alec is turned-on by being nailed by Pax. The dude is such a bottom!\nPax is pretty good on his back, so Alec rides him for a bit. There is some amazing penetration as you see his fat cock splitting Alec in two!\nThey get Alec on his back so that Pax can fuck the cum out of him. It is a thick goopy load but you can tell it was really intense.\nPax breeds his hole perfectly, creaming Alec's battered hole!",
  "models": [
    {
      "name": "Pax",
      "person_id": 7615
    },
    {
      "name": "Alec",
      "person_id": 3600
    }
  ],
  "release_date": "2015-09-18",
  "scene_id": 7948,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alec & Pax - RAW"
}