{
  "collections": [
    "ChaosMen"
  ],
  "description": "Dalton had fun with Teo, and after that good experience he said he was down for picking up more scenes for sure. Sorry, no luck getting Dalton with Baxter.\nI was a little worried, cuz he did struggle with doing more than fucking a dude in the last video, and I'm gonna have to give half the credit to Teo for showing Dalton that you can \"just let go\" and have fun.\nThe other half goes to Stash, who seems equally at home with the girls and gets off on the straight video that is usually playing. So he is another guy for Dalton to see that \"boys just wanna have fun.\"\nLots of Firsts for Dalton in this one, and I didn't even have to do the \"Ok, you need to try dick sucking this time\" speech before hand. I think he saw Teo was straight and could just dive in, so why not himself. He just went for it.\nAll this leads up to the fact that we filmed this in record time. One of those rare videos with very few stops, in fact I think the only reason we stopped was so I could move cameras around. Dalton just wanted to fuck Stash.\nHere are the cool parts of this video:\n1. Watching Stash get Dalton hard in Real Time.\n2. Dalton just decides to suck dick on his own, and in fact I think it made him harder. I credit Stash for turning him on and leaving him an opening to suck his dick.\n3. Great insert and angles on the fucking.\n4. The cumshot is another greatly timed one, this time Stash busts first, which makes Dalton dump gobs of DNA all across Stash's chest.\nNot sure we can get Dalton to keep breaking his boundaries, but he sure had something goin' for Stash.\nI'm super pleased with this video, and I think you will be too!",
  "models": [
    {
      "name": "Dalton",
      "person_id": 3240
    },
    {
      "name": "Stash",
      "person_id": 3263
    }
  ],
  "release_date": "2008-09-26",
  "scene_id": 795,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Dalton & Stash - Wrapped"
}