{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is Tegan's first time with a guy who identifies as straight. I was a little nervous about pairing him up, mainly because he is very intense, and has so much natural chemistry with the gay guys he has been with. As you all are aware, some the straight guys struggle to connect with their scene partners.\nThankfully, Zale is very chill, and he admitted that he was getting boners the entire day before the shoot. He didn't quiet say that he was excited to be working with a dude, but he pretty much implied it. Zale also had an epiphany during this shoot about bottoming. He played with his cock a lot while being fucked and almost nutted one time. He is a really good Top, but I suspect after a few more tries, he will totally get-off to being fucked.\nSince Tegan is also completely versatile, we decided to do a flip-flop video. We started-off the same way as we did in Zale's video with Griffin. As we are preparing the room, Zale seems to just lay on his stomach facing the TV, ass in the air. I think the brief massage before the serious stuff gets him in a more organic zone. My gut tells me that he might like an Edge or massage table themed video where he gives over complete control to the other guy.\nThe rub down certainly excites him, as Tegan starts stroking his cock and fingering his hole. Tegan flips him on over and devours his cock. After a bit of sucking, he rolls Zale up to make his asshole a nice platter that he could lick clean. Zale is a big guy, and it is hot to see him tossed upside down while getting his ass rimmed! Tegan's tongue is a little blue from the energy drink he had before the shoot. Ooops!\nThey suck each other's cocks for a bit, but I think Tegan really wanted to get inside of Zale's hot ass.\nZale really got into being manhandled, so Tegan just ran with being in control. Tegan slides his cock around Zale's hole and then slowly pushes it in. Zale had no problems, and the dude was hard most of the time while getting fucked!\nSince Zale was staying hard, they swap places, so Zale fucks Tegan for a bit. He does a great job sticking it to Tegan! They switch again, and this time Zale is on his back while Tegan hammers his hole. This is when Zale almost came. But he saved his nut so he could later creampie Tegan's ass.\nTegan shoots his load on Zale's hole, plunging it in!\nAfter only a few moments of cum play, Zale gets up to unload into Tegan's eager hole. He shoots once then unloads inside Tegan!\nYou have to really pay attention, but there is cum still dripping from Zale's ass as he juices Tegan's ass! Double creampie!",
  "models": [
    {
      "name": "Zale",
      "person_id": 7692
    },
    {
      "name": "Tegan",
      "person_id": 7805
    }
  ],
  "release_date": "2015-09-25",
  "scene_id": 7954,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - Middle Eastern",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Tegan & Zale - RAW"
}