{
  "collections": [
    "ChaosMen"
  ],
  "description": "After pairing Lorenzo with a few straight guys, I knew he needed a little more intensity from his scene partners. While Armani identifies as straight, he is always present and doing his best to turn his scene partner on. Armani also likes Brazilian women, and he confessed on the way to the studio, that Lorenzo's Latin looks would work for him.\nSince Armani always turns it up to scorching hot, I knew they would be a natural fit! Both guys like topping and bottoming, so I also knew a flip-flop video was going to be at hand.\nI wanted Lorenzo to turn on his sensual vibe, and do a little muscle worship. Armani can be both passive and aggressive, though he seems to be better on the passive side. So Lorenzo takes control initially, rubbing Armani's body, kissing him, and then pulling out his hard cock to stroke him.\nLorenzo slides down his own underwear and makes Armani suck on his cock. You can tell he loves having Armani work his cock. Lorenzo gets Armani standing, and shows-off his own cock-sucking skills. They then lay down, nursing on each other's cocks in a 69 position.\nLorenzo gets Armani doggy-style and really rims his hole like it is his last meal. Armani's cock is throbbing with anticipation! After worshiping Armani's hole, he climbs on top and fucks him like a dog. It is a bit of a balancing act for Lorenzo, but he got his rhythm down quickly and Armani sure was happy to have a cock in his ass.\nAfter the quad work out, Lorenzo needed a break, so Armani fucks him next. We may need to trim back Lorenzo's ass hair. He is a super hair guy, and I think a modest trim job will be fine. Armani had to do some bush whacking to find his intended target! But if you like super hairy holes, Lorenzo is a beast this time out!\nArmani gets Lorenzo on his back, and like most guys, this is Lorenzo's favorite position to bust in. Armani pounds his hole until ropes of cum go flying out of Lorenzo's cock.\nArmani has mostly bottomed, but that didn't stop him from properly breeding Lorenzo's hole!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Armani",
      "person_id": 3609
    }
  ],
  "release_date": "2015-10-02",
  "scene_id": 7956,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Video - HD - High Def",
    "X-tras - Leather",
    "X-Tras - Piercings",
    "X-Tras - Tattoos",
    "Theme - RAW"
  ],
  "title": "Armani & Lorenzo - RAW"
}