{
  "collections": [
    "ChaosMen"
  ],
  "description": "I always get to spend some time with the models carting them from airport to studio and hotel.\nJax decided to come back and do the Serviced video, as he'd done a little passive searching and had gotten head from a dude. He \"got through it\" and actually had fun, so he was now certain he could do it on film. Ok, cool, so I'm not his first, but was more than pleased he was really looking forward to the scene.\nHe says he's kind of getting off to be a little naughty, and thinking outside of the box. But so far it's pretty passive.\nI kept digging, \"So you don't think you could ever suck dick back?\"\n\"Only if I was fucking a girl or a girl was there.\" he admitted.\n\"Well, what about fucking a dude? Putting a cock in your mouth is pretty advanced. Fucking is less..uh..in your face.\" I replied back.\n\"I think a girl needs to be involved.\"\nI am sitting there thinking that a seed has been planted, and since he hadn't flat out said \"no\" chances are it's not out of the question.\nI told him bottoming tends to be easier on the straight guys and he was like \"no way anything could go up his butt\". I replied back that sometimes the mood can make all the difference.\nI'm telling you this only so that the outtakes at the end of this video make a bit more sense. You see the tail end of this conversation we had come to fruition. While it's a short exchange, it is very telling of what was said before, and how this Serviced video had a little ass play that is waaaay hot.\nHe is so cute and coy about it...and totally in the zone.\nAlso....\nI leave these interchanges to the end, as opposed to leaving them right in the center of the film where they happen.\nWhile I know some you want to see it unfold as it happens, I really like these videos to be as continuously shot as possible, so you, the viewer, can rev-up and jack with them. And hopefully nut with them also!\nI am jumping up and down on occasion to move cameras around so that it's not all the same, and generally the model and I talk. 95 percent of the time it's just directorial stuff, but these little moments of honesty are important, so I guess ultimately I feel like they would interupt the rhythm of the video but you gotta see 'em.\nThe cream on this Serviced Sundae is the unique cumshot - complete with finger up the bum that makes him nut!",
  "models": [
    {
      "name": "Jax",
      "person_id": 3269
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2008-09-03",
  "scene_id": 796,
  "tags": [
    "Sex Act - Toys",
    "Chest - Smooth/Natural",
    "Build - Muscular",
    "Ethnicity - White Guys",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Jax - Serviced"
}