{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would give you 16 inches of cock. Ok, so it's more like 8 inches per guy, but both Alec and Bradley are nicely hung and between the two of them, that's a lot of meat!\nAlec is not shy about showing-off his cock, so I set them up to watch each other while they stroke their cocks. Both guys are very turned on. Bradley tells Alec to come suck his cock. Bradley is good with his Bossy vibe.\nAlec dives in and manages to get a lot of Bradley's uncut cock into his mouth. His cock-sucking skills have improved so much over his time at ChaosMen. The dude is always down to play with a cock, either in his mouth or up his ass!\nBradley has Alec stand up, and then sets to work on getting Alec's cock back up. After getting him solid, he moves onto to Alec's ass, getting it slicked up for his big cock with his tongue.\nAlec continues to surprise me at how easily he takes a large dick AND stays hard. He even rides Bradley's cock with his own dick flopping around hard. Bradley gives him the reach around and strokes his cock to full attention while also banging his ass.\nThe cum shot is fun too. Just as Alec is about to cum, Bradley's cock falls out. Alec freezes mid cum shot as if to say, \"keep fucking me!\" Bradley gets it back in, and Alec ejaculates for a very long time.\nBradley didn't need any training when it came time to breed his boy! Perfect!",
  "models": [
    {
      "name": "Alec",
      "person_id": 3600
    },
    {
      "name": "Bradley",
      "person_id": 7827
    }
  ],
  "release_date": "2015-10-30",
  "scene_id": 7977,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alec & Bradley - RAW"
}