{
  "collections": [
    "ChaosMen"
  ],
  "description": "Our little rosy-cheeked Russian is back!\nIvan started with ChaosMen way back in 2008 when he was just 19 years old. He is all grown up, and at 26 he is a lot more comfortable with doing guy on guys stuff. Sorry that the stat readout still shows 19. When I set the Age up, I went with Start Age. I can do Current Age, but there never seems to be room to display it.\nHe has a new girlfriend that is very open-minded about him doing video work, and since he seemed more relaxed about it, she encouraged him to contact me.\nIvan usually struggled during the videos, but he is dang adorable, has matured nicely, and I wanted to put his uncut cock next to Cooper Reed's uncut cock.\nHe no longer was all about Topping. He suggested right off that he would rather Bottom than have the pressure to stay hard while Topping. I remember him making a lot of 'ouchie faces' the one time he got fucked.\nHe assured me he could handle it now, and sure enough, he gets really turned on when working with Cooper Reed. He was envious of his body, but also I think he felt more comfortable with another uncut guy.\nThey swap oral, and then when they fuck, you can tell that the first insert on Ivan is a little rough. He smiles a bit and makes a ouch face, but then you see it quickly turn to pleasure.\nHis cock never wilts! I think he has discovered his back door can give him a lot of pleasure! We started him off doggy, and with him so turned on we tried him riding Cooper's cock. Love watching him slide up and down on Cooper's stiff rod!\nHe also cums while getting fucked, though his legs push Cooper out as he is cumming. Cooper, ever the pro, gets it shoved right back in mid-ejaculation!\nCooper creams his hole, then bends down to eat his cummy hole!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Ivan",
      "person_id": 3277
    }
  ],
  "release_date": "2015-10-16",
  "scene_id": 7982,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Cooper Reed & Ivan - RAW"
}