{
  "collections": [
    "ChaosMen"
  ],
  "description": "Reuben gave us a really awesome solo last week. He was very nervous to do the Serviced video.\nFor photos he gets hard super easy and even got himself hard before the filming began. Noah slides in quickly, and then perhaps spends a little too much time playing with his cock through his shorts before attacking.\nSo our confident Reuben suddenly had a wave of anxiety wash over him as his dick started to go down.\nBut Noah got more aggressive, and after a couple minutes he has it up and stone hard! I left all that footage in because it shows how great Noah was doing.\nAnd with his cock hard again, Reuben was back to being super confident. He has great bossy energy, and pays little attention to the video. He loved jack-hammering his cock into Noah's face! We definitely need to see this dude fucking!\nEven up on his knees, he makes Noah suck on his cock with rapid-fire action!\nWe do get a bit of rimming. Noah's beard tickled his ass, so he moves down to suck his cock backwards. Hard to do because Reuben's cock likes to point up and not down. But you get to see how perfect Reuben's hole is!\nTruly an awesome facial! Noah flips Reuben on his back, and he pumps and slurps until he pulls the load out of Reuben. It spills out all over his beard, which Noah LOVES! The cum lingers on his beard so he can enjoy it long after the amazing nut! Noah is not afraid to admit he is a #CumSlut!\nPretty sure Reuben will be back. He had a lot of fun. He of course wants, to Top to start with, but he does not seem opposed to trying everything eventually.",
  "models": [
    {
      "name": "Noah Riley",
      "person_id": 7572
    },
    {
      "name": "Reuben",
      "person_id": 7985
    }
  ],
  "release_date": "2015-10-14",
  "scene_id": 7994,
  "tags": [
    "Build - Muscular",
    "Build - Stocky",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings"
  ],
  "title": "Noah Riley & Reuben - Serviced"
}