{
  "collections": [
    "ChaosMen"
  ],
  "description": "Trying something new at ChaosMen!\nI had been using the new Periscope app to live broadcast. I think it is a fun way to see some behind the scenes action, but it does not archive the videos longer than 24 hours, so I started thinking maybe it was time to do a cam on the site. I still wanted to use Periscope, but also film using a webcam so members could watch more naughty content. Periscope does not allow explicit sexual content, so I knew we would have to keep the Periscope broadcast a lot less frisky.\nMaybe do an interview, or behind the scene moment Periscope, and when things get naughty, have members switch to the Member's Area to chat live.\nIf you don't know about Periscope, it is an app for iOS and Android that allows you to watch but also live broadcast. It is tied to Twitter, so if you want notifications about one of our live broadcasts, add ChaosMen to your Twitter. You can also install Periscope and do a search for ChaosMen. Once setup, the app will notify you about a broadcast.\nMany of you see the models, but never get a chance to meet and interact with them. They are often in the studio for day to shoot, and then they are off to their hotel in order to catch an early morning flight back home. Occasionally a model will stay and do two scenes, which was what Vander was doing this week.\nI knew he was coming, so I asked my server guys to help me setup a live cam so members could chat and perhaps even play along with Vander. They cobbled together a way to stream (and archive) video, along with a basic chat.\nI was not sure about Vander getting too sexual, as I knew he would have just filmed a scene, and needed to do another the following day. But Vander has a high sex drive, and I think he nuts a couple times a day.\nI slapped together a quick banner, and my server team added 'ChaosLive' to the toolbar. We did some very last minute install, and started broadcasting!\nOriginally I just thought people would ask Vander a bunch of questions, but he got right down to sex. He had done some camming, so he came prepared. Something to piss in, a big blue butt-plug, a jockstrap, and he was also ready to show off his feet.\nThe audio on this broadcast is a little irritating. Sorry! The chat room was making plinky noises, and Vander pulled up some random porn to stroke too. He actually did not hear any of the audio, as the computer sent the audio on the background. Apparently we have to mute ALL sound on the computer before broadcasting.\nAs always he puts on an amazing show! He cums on his feet for the foot fans, and there is some fun piss play also.\nThe next night Lorenzo came in and did 90 minutes, and it was mostly an interview. Better sound on that one, and lots of great questions. He did get naked in the last 30 minutes, but he too had a scene to shoot the following morning.\nI am not sure about the schedule on this. I am working out who will be here, and who can stay and do these little Meet and Greets. I also need to work out ways to notify you all. MANY of the models are eager to give this a try.\nI plan to add Tipping to this, so you can help the models make some extra money. As of now, the ChaosLive Cam is planned as part of your ChaosMen.com memberships, but the models would get paid directly and at a much higher ratio than they would at any of the mega cam network. So it is much more like tipping a stripper at a night club.\nThis is a long video at well over an hour, so I am sure you will jump around. You don't see the chat questions this time out, but Lorenzo did a great job of repeating the question for the archived broadcast. I will post his video in a couple days, and it is actually a very cool interview video.\nWe learned a lot, and hopefully this will get a lot better as we fine-tune all parts of it!",
  "models": [
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2015-06-25",
  "scene_id": 7995,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Piss",
    "Sex Act - Toys",
    "Theme - Solo",
    "Video - ChaosLive Cam",
    "X-Tras - Piercings"
  ],
  "title": "Vander - Live! 06-24-15"
}