{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is Zale's first time doing a TagTeam 3-way and he jumped in mouth first! And what a mouthful!\nI am sure Lorenzo has messed around with two guys at once on his own time, but Zale had yet to lose his TagTeam cherry. He tried his best to wrap his mouth around Vander's big cock, but barely managed it. Lorenzo was pretty impressed with his girth too, as they shared sucking duties.\nThey all swap oral, and it takes Zale some time to find his legs. Once we get him standing, he usually is good about staying hard. They get down on the bed and do great daisy chain suck fest.\nNext, they get Lorenzo in the center in a doggy-style position. Lorenzo sucks on Zale's cock, while Vander rims his hole, getting him all lubed up to get fucked. Vander steps up to his back door, but I don't think Lorenzo would be able to handle Vander's thick cock. Change of plan!\nSo Zale and Vander switch places, and Zale breaks in Lorenzo's ass. Zale was having a great time as the Top. It would have been hot to see him bottom for Vander, but he is so in the zone for Topping in this video, you won't mind a bit.\nAfter getting Lorenzo loosened up, it was time for Vander to open him wide. Vander takes his time sliding it in, and thankfully Lorenzo has no problem. He keeps sucking on Zale as Vander plows his ass.\nZale straddles Lorenzo so Vander can suck and fuck at the same time. This is actually a great position for the guys. They love having something in their mouth while fucking someone!\nLorenzo needs a break, so Vander bottoms for Zale first. Vander is in pig bottom heaven! Lorenzo then dives into Vander ass while sucking Zale. They flip Vander onto his back so Zale can really pound his hole.\nVander starts to get close, so Lorenzo helps his buddy out by sitting on his face. Vander loves to rim and that puts him over the top. Zale fucks the cum out of Vander then Zale cleans up his cock!\nSince Zale was eager to keep fucking, Lorenzo was up next to bust. Vander stays at the ready to eat the load of his cock while Zale fucks it out of him! Vander even licks clean Zale's cock, and gets it all lubed up so he can breed Lorenzo's hole.\nZale unloads on his hole, and then shoves it in. Vander is there to suck his cum-soaked cock as it slides in and out of Lorenzo. Vander then eats the cum out of Lorenzo's ass!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Zale",
      "person_id": 7692
    }
  ],
  "release_date": "2015-11-06",
  "scene_id": 8003,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Lorenzo & Vander & Zale - TagTeam RAW"
}