{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wow! This is an amazing Serviced video, with two guys who are totally into sucking and pleasing each other's cocks!\nYou can see a Bossy Top vibe that Atticus has when he takes control of Noah from the outset. He is all about toying and teasing his new buddy. Noah was dripping precum the whole time!\nThe verbal on this video is really hot. You might have to turn your speakers up as Atticus whispers some amazingly hot things to Noah!\nThe two also clearly love to kiss each other!\nThey also rim each other, but pay close attention to Atticus as he plays with Noah's boy hole! Yep, that looks like a natural Top to me! Sucking and licking his hole while also making sure his cock is teased really showcases the skills Atticus has in bed!\nNoah didn't miss out on rimming Atticus either. He has such a massive frame that we got him upright so Noah could plunge his tongue deep.\nThey get in a 69 position with Noah on bottom. Atticus keeps his cock planted in Noah's mouth while working his cock extra hard.\nThat makes Noah cum, and he is left gasping for air with Atticus mass practically suffocating him!\nThey swap places so Atticus can rim and play with his Noah's hole. That gets Atticus hard again, so Noah moves in between his legs to get into a Full Servicing position!\nNoah makes Atticus cum and it mirrors perfectly his own cum shot. They both lap up the oozing seed from each other's cock!\nNoah finishes it off by sharing Atticus's load with a nice cummy kiss!",
  "models": [
    {
      "name": "Noah Riley",
      "person_id": 7572
    },
    {
      "name": "Atticus",
      "person_id": 8001
    }
  ],
  "release_date": "2015-11-04",
  "scene_id": 8006,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Trimmed",
    "Ethnicity - White Guys",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Atticus & Noah Riley - Serviced"
}