{
  "collections": [
    "ChaosMen"
  ],
  "description": "Truman Tops!\nOk, so I know that it is usually a bigger deal when someone Bottoms, but for Truman is was a big deal to Top.\nBefore the shoot he reminded me he had not ever fucked a girl in the ass, and that he really wanted to try. He has been doing awesome as a Bottom. Always hard when getting fucked, and guys can easily fuck the cum out of him.\nSo we decided if he was in the zone, he should try topping. Lorenzo was excited to be his 'first.'\nLorenzo starts by getting Truman's cock hard, toying and teasing his dick until he was fully hard. Truman was impressed, \"You're really good at that!\" Lorenzo smiles and really goes after his dick like a pro.\nHe climbs on top of Truman and starts to fuck his face. He spins around and they both give each other head.\nLorenzo lifts his legs up and shows us Truman's perfect hole. He rims it, getting Truman in the zone to get fucked.\nTruman gets on his stomach so that Lorenzo could fuck him flat. It is one of those positions that require guys to get a workout in and is tough to do. But Lorenzo had done a cam show with members the night before, without nutting, so he was soooo ready to fuck someone in any position!\nLorenzo puts him through his paces, fucking him doggy style and then on his back. That gets Truman charged up enough to finally try Topping. He was staying hard from the ass pounding and just knew he could Top.\nHe struggles to find Lorenzo's hole, but once he is in him you can tell he he loves drilling a dude for the first time!\nLorenzo also knew this was his first time, and totally got-off on taking his Top virginity. He cums quickly after Lorenzo pounds his hole!\nTruman does an amazing job unloading on Lorenzo's butt hole. Like frosting a cake, he totally coats his hole with his DNA. He pushes the cum inside of him with his spent cock!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Truman",
      "person_id": 7806
    }
  ],
  "release_date": "2015-10-23",
  "scene_id": 8007,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Lorenzo & Truman - RAW"
}