{
  "collections": [
    "ChaosMen"
  ],
  "description": "Berkeley did say that on two occasions he had been sucked-off by guys. They both sounded like down low moments where he did not reciprocate at all. One guy was mature, and the other was his age. So he wasn't too nervous about getting his dick sucked.\nTurns out what he was nervous about was someone playing with his ass. The dude had his ass cheeks flexed so tight that he was not going to let me in. You can tell I am really trying to just spread them so we can see his butt hole. Rimming was likely out of the question. I get him doggy style to help get a better view. His cock starts to get hard, but once I try to even show-off his ass, he starts to lose it.\nNo problem. I just flipped him on his back, and got his cock nice and hard. One cock servicing coming up!\nBerkeley did say that he cums very quickly from blow jobs, so he warned me that he might bust too quickly. I tugged and sucked at his cock, keeping him on the edge for about 5 minutes.\nHe sneaks peeks at the Asian female porn playing, but for the most part, he is watching his dick get sucked and jerked.\nI ramp up the speed on him, going from soft and gentle fingertipping, to an aggressive jerking motion.\nThat did the trick, and he spills his seed down the side of my fist.\nThis video is definitely a straight forward Serviced video. And I mean straight! He really just kicks back and watches his cock get serviced!",
  "models": [
    {
      "name": "Berkeley",
      "person_id": 8008
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2015-12-23",
  "scene_id": 8010,
  "tags": [
    "Build - Mature",
    "Build - Stocky",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Berkeley & Bryan - Serviced"
}