{
  "collections": [
    "ChaosMen"
  ],
  "description": "Barry is a super polite and a very professional guy.\nHe showed up for his shoot and was really quite nervous. We did paperwork and I showed him around the studio, and you could hear a quaver in his voice. I thought I had my work cut out for me!\nHe showered up, and we did a little make-up on some scars on his neck. He had a pretty bad neck injury, and I am sure everyone asks him about it. He looked at himself in the mirror with just a touch of make-up on it to diminish the redness and he was blown away. He never had attempted to do that.\nIt really made him feel immensely more confident. When I did his digital make-up for the HiRes images, I tried to diminish it a bit more, but then went ahead and removed it along with all of his other little blemishes. It is a part of him and probably should have left it, but he seemed so happy to have it diminished for the video I just went for it.\nAnyway, as soon as we started doing photos, he was hard and excited. It was like a switch was thrown. Such a simple thing that a dab of make-up can do.\nBy the time we started the video, he was very confident and ready to show-off his body to us. Not too nervous at all!\nBarry has a hot body on him, and he wiggles his ass us for us during the strip tease.\nHe sits back down and strokes his cock to full mass. His jerking motion is very much below the head, with an 'OK' hand position, pinky to the air. He does not like lube to jerk off, and am eager to see what happens when someone plays with his head with some slick action.\nI love his cum shot too. He keeps his eye right on you as he proceeds to pull the load out of him. It looked like it felt fantastic!",
  "models": [
    {
      "name": "Barry",
      "person_id": 8015
    }
  ],
  "release_date": "2015-09-21",
  "scene_id": 8016,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Barry - Solo"
}