{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had two Cuban guys come to the studio with a about a week or two. I knew I wanted to put them together. Malik loves to bottom, and with Amador's big cock, he assured me he could take him. Two hung uncut Latin guys!\nMalik knew he could handle Amador, but I was not so sure how Amador would do. Even though he has stripped for guys in clubs, he seems quiet and reserved. You can tell this is his first time being filmed. He has a 'down low' vibe going.\nStill I asked that maybe he jump into doing porn by sucking some dick right away. He didn't seem to mind at all, and you can tell it was his first time tackling another's guy cock. Amador kept Malik reasonably hard, and Malik seemed to enjoy the fact he was getting sucked by such a straight acting guy.\nMalik returns the favor, and Amador is more in his element. Getting his dick sucked! Malik is having a great time servicing him, and his passive nature really comes to the foreground. He has no problems keeping Amador hard. I think he was hoping Amador would be more verbal. We encouraged him to talk dirty, but he seemed a little shy and silly about it.\nMalik gets on his back so he can fuck his face. It is so hot seeing Amador's curved cock slide down his throat. Amador strokes his cock, trying to keep his buddy hard. Malik works his way to his ass, rimming his hairy hole.\nIt was time to fuck and we let Amador fuck Malik doggy style so he would easily penetrate him. Amador's seems uncertain about how much motion he can use, so Malik just does all the work, grinding his ass back and forth on his uncut cock.\nSince Malik was doing most of the work, and Amador was staying hard, we had Malik ride him next. Using his down curve, Malik sat on him reverse style. Perfect! Malik grinds up and down, servicing his cock with his ass.\nAmador fucks him on his back next, and that gets Malik's cock rock solid. At first I thought they were evenly matched in the cock department, but I do believe Malik's cock is quite a bit bigger than Amador's already significant cock!\nAmador gets his speed going, and fucks the cum out of Malik. It is a huge load that flies everywhere!\nAmador then breeds his hole, shooting a huge wad of cum on Malik's spent hole. He drives his cock in, and you see it spasm as he continues to unload inside him.\nHe pulls his cock out and makes Malik clean his cum soaked cock! It slides perfectly down his throat!",
  "models": [
    {
      "name": "Malik",
      "person_id": 7955
    },
    {
      "name": "Amador",
      "person_id": 7970
    }
  ],
  "release_date": "2015-11-20",
  "scene_id": 8019,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Amador & Malik - RAW"
}