{
  "collections": [
    "ChaosMen"
  ],
  "description": "I actually hadn't planned on doing a Serviced video with Vance.\nI pretty much \"save\" the Serviced videos as a way for the nervous straight guys to have an intro to the whole process of filming and the guy-on-guy thang. Vance is definitely at the head of the class, and didn't need any easy in to it all. A few of the gay guys suggest, I think in large part they are curious as to what it would be like.\nBut we had been exchanging a lot of texts back and forth, discussing projects and his limits, when he brought up the whole \"Serviced\" video thing he had seen on the site. He totally suggested that he would be down with that, and how soon could we shoot?\nI have no illusions that he thought my cock sucking skills had preceded me. The boy was in need of money and was trying to find as many videos he could do as quick as possible.\nSo it was easy to setup and he was pleased we could shoot right away. I am, after all, easier to schedule.\nMost models are in it for the money, no doubt. And Vance is in it to make quick money, but he does want to have a good time, and he DOES want you you enjoy the stuff.\nI think he had fun. We had a few close calls with him almost cumming. His dick is a clone of mine so it was like playing with my own!\nOhhhhh..and that ass! He sure did like being rimmed!\nSo in summary, yeah, I know, no new ground for Vance, but I've got him lined-up with some new guys and I am totally psyched to have in playing on the team!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Vance",
      "person_id": 3281
    }
  ],
  "release_date": "2008-10-01",
  "scene_id": 802,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Chest - Smooth/Trimmed",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Bryan & Vance - Serviced"
}