{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jensen said he was down to fuck a dude. He packs some big meat so I knew Jon could take him.\nThey stroke each other's dicks, and then Jon dives in to suck on Jensen's long cock.\nJensen gets upright and feeds his cock to Jon. He flips him on to his back to fuck his face, and it is hot to see Jensen throat fuck him. I like the way Jensen grabs his neck as he face fucks him. Jon loves to rim, so he licked Jensen's hole. Jensen would go back and forth to having his ass licked, to fucking Jon's throat.\nNow it is a good thing Jon is a practiced bottom. When it came to fucking Jon, Jensen just pushes his cock in like it was a loose pussy! Poor Jon looks surprised, but like a true bottom, didn't jump away.\nJensen fucks him pretty good for his first time. We got him to play with Jon's cock, and there is even a quick kiss in there. Jon gives us some nice Ass to Mouth action too.\nJon confessed riding a cock would be the easiest to cum by. For most guys, on their back is the easiest. Sure enough Jon dumps a mighty big load all over Jensen's thigh; all while bouncing up and down on Jensen's stick cock.\nJon goes to clean up his mess and while stroking his own cock, Jensen begins to cum. Jon scrambles to get on top, and the load goes shooting every direction before being able to plant his seed inside. The cum drips down and out of Jon's hole. Some ricocheted off of Jon's ass and coated Jensen's chest.\nJon climbs off of his cock, and then gets back to his cum cleaning, licking and cleaning the load off of Jensen's spent cock!",
  "models": [
    {
      "name": "Jon",
      "person_id": 7767
    },
    {
      "name": "Jensen",
      "person_id": 7936
    }
  ],
  "release_date": "2015-11-27",
  "scene_id": 8030,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Jensen & Jon - RAW"
}