{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bentley was finally done with school and came out to do a couple shoots. We got him to bottom for Armani the day before, so the next day, he was going to top and give his freshly fucked hole a break. Truman was a little sad to not top, but only because he had just recently found confidence in being a Top.\nTruman is not a complainer, and once he saw how big Bentley's cock was, he just turned into a subservient boy.\nI have a fan who loves jeans, and I have been trying to incorporate them into more shoots. They both look really hot in their denim, and Bentley's package looks awesome as Truman rubs him through the fabric. It pops-out all engorged and ready for action. Truman was surprised as to how thick it was!\nHe gets down to business of getting him fully hard while Bentley encourages Truman to worship his cock.\nBentley returns the favor by having Truman stand up. He works his cock until Truman is hard, stroking his own cock. One thing I love about Truman is all you have to do is play with his cock a moment or two, and he is bone hard.\nThey 69 and suck each other for a bit before Bentley slides his cock inside of Truman. Truman is such a trooper! He was getting nervous that it might not fit, but as I said, he never complains. Once inside him, his cock never wilts. The dude does love to get fucked! Or at least his cock does!\nBentley gets him to lay down on his stomach and fucks him flat. He kept going really deep, making Truman wince in agony and bliss.\nHe pulls him to the edge of the bed for a proper pounding. Bentley has never been in better form!\nIn the past, we have had Truman on his back until someone fucks the cum out of him. But with his downward curve and ability to stroke his cock backwards, I knew we would get a really good under shot while he was doggie-style.\nBentley pounds his hole until Truman's cum is raining down on the camera! Explosive!\nBentley fucks him some more than sprays cum everywhere, showering Truman's hole with his load!",
  "models": [
    {
      "name": "Truman",
      "person_id": 7806
    },
    {
      "name": "Bentley",
      "person_id": 3486
    }
  ],
  "release_date": "2015-12-11",
  "scene_id": 8041,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bentley & Truman - RAW"
}