{
  "collections": [
    "ChaosMen"
  ],
  "description": "Byron is back after some time moving and with a new job that is keeping him quite busy.\nHey has a mustache now that I am not sure I am really digging, but he is still the ultimate straight married dude that just loves to have his ass rammed.\nHis wife loves to watch his videos and it also always fun to see how many times he can hold back from coming.\nZale was on his game this day, and I think I can safely say he fucks 3 loads out of Byron.\nThey start with oral and Zale does a great job of getting Byron hard. Zale's cock is looking amazing with his full bush, and looks extra-large with Byron's mouth wrapped around it. They 69 for a bit but then Byron straddles Zale and inserts his cock.\nByron had warned me he would likely cum quickly once the fucking began. He wanted to start facing Zale, so I told him if he started to cum, he really needed to spin around so we could see him cum.\nSure enough, after a bit of ass pounding Byron starts to cum so quickly tries to turn around, mid cum shot, to sit back down on Zale's cock so we can see it. Cum shooting everywhere.\nIt is quite a big load, but Byron didn't think he had came all the way. He scoops up the cum, lubes up Zale's cock with it, then squats some more on his cock. He does some riding to see if he can get even more cum out of his cock.\nAnother load quickly builds and he shoots his second one for us!\nThat was quite a work out, so we get Byron doggie style so Zale can get some own high speed fucking in. Zale was starting to get close, but wanted to see if he could get one more load out of Byron.\nHe flips him on to his back and hammers him without mercy. Byron jerks out his third load. Not a lot comes out at this point, but you can tell it is intense.\nZale shots his load onto Byron's hole, juicing his hole until cum is oozing everywhere.\nByron literally bites the bullet by flipping over and giving Zale's cum-soaked cock a good cleaning!",
  "models": [
    {
      "name": "Byron",
      "person_id": 3625
    },
    {
      "name": "Zale",
      "person_id": 7692
    }
  ],
  "release_date": "2015-11-26",
  "scene_id": 8045,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Byron & Zale - RAW"
}