{
  "collections": [
    "ChaosMen"
  ],
  "description": "Walker is friends with Jet, who referred him after he found out what kind of work Jet was doing. Walker was eager to get in and try doing some video. Never had any experiences with guys, but Jet convinced him how easy it was to go with the flow.\nWalker was very polite and has country boy charm. On his trip to Austin, he got bumped on two flights. He was due in at 1pm that day, but didn't arrive until 11:30pm. So we shot this solo at a very late hour. We both got a little sleep, enough to reset for his oral. But if you like Behind the Scenes facts, this one was shot a 1 or 2am in the morning.\nWalker has a 7.5 inch thick cock, and he usually leaves his pubes untrimmed. So there was no waiting for pubes to come back! Though, he was seemed concerned that his tan lines would be a problem. To me, it looks like he just wears board shorts all the time so it looks like a surfer boy tan. I told him not to worry.\nWalker does construction work as well as landscaping. So I am surprised his tan is fairly even. He must work outdoors shirtless, and it must be hot to see this piece of eye-candy working out in your yard!\nHe was good doing for the photos, but once the video started rolling, he got a little shy. He tugs his cock to life and starts to show it off a bit.\nHis ass is amazing, and it totally needs to be rimmed! Any volunteers?\nWalker's cum shot is hot too. A lot comes out and I think it surprised him. He came very easily, which was a blessing given how late the hour was.\nHe will be back next week to get some head!",
  "models": [
    {
      "name": "Walker",
      "person_id": 8044
    }
  ],
  "release_date": "2015-11-30",
  "scene_id": 8053,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Pubic Hair - Intact",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Walker - Solo"
}