{
  "collections": [
    "ChaosMen"
  ],
  "description": "I love it when I can get two guys together that play on the same team and are totally into each other!\nAlthough the two didn't order each other from the ChaosMen menu, when I asked each of them if they were down to fuck, I got a resounding \"Yes!\" from both.\nThe two start off a bit more sensual and romantic and it is great to see them just go for it with each other. Tegan gets into his bossy daddy vibe while Bjorn is his natural passive bottom boy. Lots of great kissing too!\nTegan's cock is hard and ready for Bjorn is eager to suck it. Bjorn plays with it a bit, but Tegan gets his ass in the air so he can lick and finger his tight hole. Bjorn is ready to get fucked, but Tegan makes him service his cock first. Tegan fucks his face and then they 69 so that he can get Bjorn's cock hard.\nTegan has one track mind and get Bjorn in the perfect position to fuck him. He slides his cock in with little effort, and the hard core fucking begins!\nTegan totally has his way with Bjorn, who is the consummate bottom boy! He breeds his hole with an amazing amount of cum splatter.\nHe crawls on top of Bjorn to clean his cock, and Bjorn blows a huge load while nursing on his cock!",
  "models": [
    {
      "name": "Tegan",
      "person_id": 7805
    },
    {
      "name": "Bjorn",
      "person_id": 7851
    }
  ],
  "release_date": "2015-11-29",
  "scene_id": 8059,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Middle Eastern",
    "Ethnicity - White Guys",
    "Hair - Bald",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bjorn & Tegan - RAW"
}