{
  "collections": [
    "ChaosMen"
  ],
  "description": "Since Ricky Decker has a large body of work, I thought I would skip his oral video and jump right to getting his ass fucked raw!\nAtticus had done a couple other videos at another studio in which he got pounded pretty hard. It kind of scared him off from bottoming. He really wanted to start by Topping and move into bottoming at his own pace.\nBoth Ricky and Atticus arebig and meaty and look fantastic together. If you like hairy men, then this video is filled with eye-candy!\nDespite Ricky's big cock, he tends to want to bottom so the pressure isn't on him to stay hard. I am sure he is a great top, but he seemed super relaxed and very into working with Atticus, content to have his ass fucked.\nRicky starts by oiling up Atticus' chest and cock. If you love the sensual part of the Pure videos, you won't be disappointed! Great chemistry between these two guys! Lots of body worship, kissing, and sexual energy. Atticus even gets some armpit worship going, while Ricky sucks on his nipples.\nAtticus gets his cock sucked expertly by Ricky. Atticus then lays Ricky down to oil up his backside, and shows-off his amazing ass. Atticus grinds his cock around, tempting Ricky with penetration. Instead, he flips Ricky on to his back and starts to suck his buddy's cock. Ricky has a lot of mass, and it just astounding to see how big his cock gets!\nAfter getting Ricky all turned-on, Atticus flips him onto his stomach again, this time with the full-intention of fucking his ass. Ricky takes it like a champ, while Atticus eventually pulls him to the edge of the bed to really pound his hole.\nRicky rides Atticus's cock too. His fat floppy cock bouncing around as Atticus slides his cock up inside him over and over!\nAtticus fucks Ricky on his back until he blows his load all over and in his hole. So nice to see Ricky's ass seeded once again!\nAtticus lays down so Ricky can stroke his cock and shoot all over his face.\nRicky delivers a perfect huge load into Atticus open mouth!\nPerfect!\nCum gurgles out everywhere!",
  "models": [
    {
      "name": "Atticus",
      "person_id": 8001
    },
    {
      "name": "Ricky Decker",
      "person_id": 8048
    }
  ],
  "release_date": "2015-12-21",
  "scene_id": 8060,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Pure",
    "Video - HD - High Def"
  ],
  "title": "Atticus & Ricky Decker - Pure"
}