{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bradley was watching for his videos to air when a video of Jon & Pax aired the very week his Serviced video appeared.\nAfter watching Jon get fucked by Pax, he asked if he could do a video with Jon. I suppose wanting to give Jon's hole a pounding from his own cock.\nI asked Jon if he would like to work with Bradley, to which he took one look at his fat uncut cock and said, \"Yes!\" Jon thinks uncut cocks are the best to be fucked by. There is a little Out Take at the end of Jon advising Bradley on how best to use his cock to make him cum.\nSo, I knew I had a video with chemistry going even before we got to the studio.\nBradley said he would like to try bottoming for a video. He is mostly a Top, and you can tell he is damn good at it. But he had wanted to try bottoming on camera. I asked Jon if he thought he could top, and despite me pegging him as a Bottom, he said he would totally be down to fuck Bradley. Turns out Jon is a great Top!\nOf course Bradley did not even realize that Jon is quite hung, and once he saw how big he was, Bradley soon regretted making his bottoming debut that day. But he was not gonna be a baby about it, after all, guys take his hung cock.\nSince there was natural chemistry, I just let the two do their thing. Bradley leads the way. Lots of kissing, sucking and foreskin worship! Both guys eat each other's hole, but who will get fucked first?\nBradley begins to play with Jon's hole, and he slides his cock up and down his ass cheeks, wanting to slide it in. Jon puts his ass in the air, making a ready target for Bradley. His cock goes in easily, and the two fuck like they mean it!\nWhen it came time for Bradley to bottom, we thought maybe sitting on Jon's ample cock would be the easiest. Bradley struggles to sit on it, and you can tell he is not very experienced at taking a cock. But, his own cock never seems to wilt.\nThey change it up so that Jon can fuck him doggie style, and they hit their groove. Bradley loved being pounded by Jon's cock! He may not be a natural bottom, but he sure did like it!\nI asked Bradley if he could cum from getting fucked, but he thought he would be better at breeding Jon's hole. Bradley goes back to fucking Jon on his back. He fucks the cum out of Jon!\nBradley strokes his foreskin until he unloads all over Jon's battered hole!\nLots of great energy, sucking, rimming, and fucking you won't be disappointed!",
  "models": [
    {
      "name": "Bradley",
      "person_id": 7827
    },
    {
      "name": "Jon",
      "person_id": 7767
    }
  ],
  "release_date": "2015-12-18",
  "scene_id": 8073,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "Video - OutTake",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Bradley & Jon - RAW"
}