{
  "collections": [
    "ChaosMen"
  ],
  "description": "Cruz is back after having a second baby. He took some time off for school also. He and his wife are still going strong, but Cruz is now comfortable with his attraction to men, and with his new mindset wanted to try gay porn again. Bi guys do exist!\nHe also has been working out hard, and when I saw his progress, I knew I wanted to put him Channing.\nIn the past, Cruz was a better bottom, but he says he has gotten a bit more aggressive as a Top, so I figured they could fuck each other.\nCruz has a lot more passion also, which Channing responded to nicely. Lots of kissing and a little bit of body worship.\nI would say Cruz has leveled up at giving head. He sucks on Channing's cock like he means it, and even eagerly rims his hole. I think Channing is also getting better at sucking dick. I haven't quite figured Channing out. He has not had girlfriend in the time I have been working with him. He is always charged up and ready to play with a dude. He is super shy, but at times I wonder if maybe he is playing for wrong team. Even still, we had straight porn going on set, and both relied on it to get hard between photo takes. Channing is young and it took Cruz awhile to declare himself officially Bi.\nCruz bottoms first with him sitting on Channing's dick. Channing pulls his ass cheeks apart so we can see his cock slide in and out. Yup! Cruz is still an amazing bottom, and made out with Channing as he fucked his hole!\nIt was time for some Cruz control, so he fucks Channing doggie style. For the first time since working with Channing, he actually winces as he gets penetrated. Cruz is quite hung, and Channing struggled to accommodate it. Channing finally loosens up so that Cruz can get some deep fucking action going. Was a little worried for a moment!\nCruz knew for certain that he could cum from getting fucked. Have yet to get Channing to try this, so I think the next video we will see if he can cum while being fucked. He stays so hard as a Top that he can just keep fucking until the Bottom busts his nut. It is great to see Cruz's cock spurting cum as Channing's cock hammers him!\nChanning pulls out and bust his load all over Cruz's hole, breeding our young daddy's hole!",
  "models": [
    {
      "name": "Cruz",
      "person_id": 3503
    },
    {
      "name": "Channing",
      "person_id": 7961
    }
  ],
  "release_date": "2015-12-27",
  "scene_id": 8080,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Channing & Cruz - RAW"
}