{
  "collections": [
    "ChaosMen"
  ],
  "description": "I don't normally give guys a chance to do 3 oral only videos where all they do is get their dick sucked, but Vaughan is so dang cute, and somewhat local. Like a few of the other models where I give multiple chances to push through their limits, I keep thinking Vaughan will eventually come around.\nHe is still trying to get his vehicle situation worked out. He has a really nice muscle car, so my guess is he is addicted to upgrading it. So perhaps not as hungry for video work as many models to pay bills. His motivation is for super charging his need for speed for his cars and motorcycle.\nI like Vaughan, and well, I wanted to suck his dick. Also I was looking to do some videos to help with the Holiday Marathon. Airing 12 days of video is expensive and hard to do, and I am cheap labor!\nThis video really reminds me of Troi's Serviced video. Vaughan seems in disbelief, and focuses on the TV playing porn. But as soon as I started sucking him, he lost interest in the porn, and I had him lost in the sensations.\nI could have made him cum with my mouth, but after filming so many serviced videos, I knew Vaughan is not a distant shooter. So ramped him up orally then switched to jack-hammering his cock till his load spills out.\nOnce again I left only one camera shot as I build him up to cumming. So it is a bit long of a Serviced video, but you can really tell that I worked hard to pull that load out of him!\nJust after he cums, his eyes settle back on the TV, perhaps a bit embarrassed and not sure what to do after having a man make him cum.",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Vaughan Rafferty",
      "person_id": 7968
    }
  ],
  "release_date": "2015-12-26",
  "scene_id": 8088,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Cock - Uncut",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Bryan & Vaughan Rafferty - Serviced"
}