{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have to admit when Atticus first walked in the door, I knew he would look perfect with Vander. Vander can of course work with pretty much anyone, but both have similar builds and body hair.\nAtticus, who had previously said he wanted to avoid getting fucked for a couple videos, changed his mind when I told him he would be working with Vander. He said he would try flip-fucking. He may have changed his mind back and forth while waiting for the scene, but he knew he can handle Vander. Eventually, he just didn't want to pass up a chance to sit on Vander's cock.\nI let the guys do their thing and chased them around. There is some great cock-sucking, but also a lot of rimming. Both guys love to eat ass!\nAtticus starts by fucking Vander, and nothing gets Vander harder faster than being ass rammed. Well, maybe eating ass works slightly better, but it is a close second.\nThen it came time for Atticus to take Vander's thick cock. Not going to lie, but it took several tries to get it in. I still don't find the Out Takes on this very interesting, but let's just say it took 3 attempts for Atticus to handle Vander's cock.\nYou can see the progress of Atticus accommodating Vander's cock on his face. Definitely biting back the pain, but once Vander was in him, the pain turned to pleasure.\nI did recommend for one position that Vander lay on top of Atticus like an upward facing sandwich. We have done this a couple times when Vander's mass matches the other guy. They make a hot, hairy, sweaty man sandwich!\nThis got Vander turned-on so much that Atticus fucked him until he came. At the last second, Vander pulls out and cums all over Atticus's cock! Like a good boy, he cleans up his mess.\nAtticus wanted to see if he could fuck until he came. With Vander able to take a pounding after ejaculating, Atticus didn't feel like he had to hold back. Many guys are not keen on getting fucked after they have nutted. Game over! But not with Vander!\nAtticus fucks him until he cums, pulls out to show he is nutting then buries the rest of his load inside Vander's hole.\nVander must have been on clean-up duty that day, as he spun around and cleaned Atticus's cock dripping his cum along with the remnants of his own load trapped in his pubic hair.\nBoth guys left that day feeling fully satisfied, and I am very sure you will be too!",
  "models": [
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Atticus",
      "person_id": 8001
    }
  ],
  "release_date": "2016-01-08",
  "scene_id": 8090,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Atticus & Vander - RAW"
}