{
  "collections": [
    "ChaosMen"
  ],
  "description": "Noah has been on Blow Job Duty for the last couple months. He reminded me he really would like to get fucked again. Ooops! He is so good at Servicing the guys I forgot he is a great Bottom!\nEnter Amador, who struggled with his first shoot to even breathe heavy. You could tell the last video he did with Malik was his first time. But he asked to come back again, but I told him he really had to amp up his game. He promised he would.\nThough he still did not want to bottom, he has no problems kissing, rimming, and sucking dick. And this time out, he is a LOT more into it. You can tell a switch was thrown. With Noah egging him on, his performance is vastly different than his first time. Give him another chance!\nNoah gets some kissing out of him, and then slides his underwear down to reveal his big uncut cock. Noah truly looks surprised to see it staring at him all hard and ready to go. Amador is very quiet and somewhat stern, and I think Noah thought he was going to have to work extra hard to get Amador in the zone.\nNope! Amador was good to go, encouraging him to suck his cock. I left his shoes on again. We had done that in his Serviced video, and I got some positive feedback on it. Hope it doesn't bug some of you. I don't know why, but he looks damn hot standing naked in his shoes!\nI also love seeing his feet up in the air while Noah rims his hole and sucks his cock.\nNoah climbs up and lets Amador suck on his cock. At first I thought Amador was only going to stroke it, but with Noah stroking and sucking him, he helped his buddy out with some oral love.\nNoah straddles Amador's face so he can suck his cock better. Amador uses the opportunity to lick Noah's eager hole!\nAmador gets him in the zone to be fucked, so Noah slides down his body and gets his cock inside of him. Noah's cock drips pre-cum practically the entire time he is bouncing around on his dick. So I if you love pre-cum, pay close attention as Noah rides Amador.\nNoah gets doggie style, letting Amador really have at his ass. Again, Amador is really on his game this time. Talking dirty and teasing Noah's hole with his rod.\nAmador flips him on his back and begins to stroke Noah's dick. Between him hammering his hole, and stroking his cock, Amador jerks the load out of Noah!\nWhat ya know!? Amador has got skills!\nHe fucks him a little longer, then pulls out to stroke his own load out. He paints Noah's hole with his DNA, shoving his jizz deep inside.\nAmador rubs the cum around his hole, then makes Noah clean his cum-soaked cock!",
  "models": [
    {
      "name": "Amador",
      "person_id": 7970
    },
    {
      "name": "Noah Riley",
      "person_id": 7572
    }
  ],
  "release_date": "2015-12-30",
  "scene_id": 8098,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Amador & Noah Riley - RAW"
}