{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sergei is my own personal \"Queer Eye\" makeover.\nThis is actually his second shoot with me, both for photos and video.\nOur initial shoot was his first time in front of the camera. He showed up looking disheveled and unkempt. Sergei is a BIG guy, and I wasn't about to tell him he needed a haircut and style. He also had only a teeny tiny patch of pubic hair showing, which I knew would get me some email.\nRight after the first shoot, he asked if there was anything he could change. We went over the pictures and I confessed that he needed to style his hair, get a haircut, and grow those pubes out. He laughed because he came to the shoot completely raw, figuring that I would do the styling. I told him I was a much better photographer than I am a hair and make-up stylist, but I could give him a few pointers for a follow up shoot.\nReally, Sergei just didn't know what to expect, and as soon as he knew how the process went, he came back only three weeks later looking like a completely different man. He even grew his pubes out a bit for me, though he was aching to shave it all off again. Straight boys!\nSegei is a big beefy guy. You might think he's a big dumb jock, but geez, this guy is intelligent, quick-witted and sarcastic. You have to stay on your toes when you talk to him, or you might get zinged.\nI plan on debuting his initial photos and videos in the coming months. Both videos are awesome, and the boy can dump a giant load at a moments notice. But I wanted to start ya off with him at his finest, and then we can go back in time, and see him a little less refined.",
  "models": [
    {
      "name": "Sergei",
      "person_id": 3126
    }
  ],
  "release_date": "2006-01-01",
  "scene_id": 81,
  "tags": [
    "Theme - Solo",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Video - Standard Def"
  ],
  "title": "Sergei - Solo"
}