{
  "collections": [
    "ChaosMen"
  ],
  "description": "We started this Serviced video with Franco standing. He seemed more confident getting hard and even cumming that way during his solo. So I wanted to start strong.\nBjorn works his way down to his cock, and quickly gets him hard. Franco is great at dirty talking! Wow! I haven't heard a young guy say \"daddy\" before, but it works with him! His bossy nature took over.\nBjorn has him lay down, and I worried this position would be too passive for him. But Franco had no problems staying hard, though he snuck a lot more peeks at the video playing for him.\nBjorn had access to his hole, so started rimming it. Franco loses interest in the porn playing for him, and strokes his cock while enjoying having his ass rimmed! Hmmmmmm! Another sign he might be a versatile type of guy?\nWe even get a short amount of Franco sucking on Bjorn's cock. For his first time, he hesitated only a moment, then tried his best to explore techniques to turn his buddy on. It doesn't last long, but basically I wanted him to get that hurdle over with before coming back to do a full sex scene.\nBjorn lies on his back while Franco strokes his load right into Bjorn's mouth. His cock puts out a lot of cum, and Bjorn swallows what he could. Franco pushes his spent cock into his mouth, making him clean it. He starts encouraging Bjorn to cum by dirty talking while rubbing his chest.\nThat did the trick and Bjorn busted a nut that actually hit Franco!",
  "models": [
    {
      "name": "Franco",
      "person_id": 8102
    },
    {
      "name": "Bjorn",
      "person_id": 7851
    }
  ],
  "release_date": "2016-01-20",
  "scene_id": 8108,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Ethnicity - White Guys",
    "Hair - Bald",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bjorn & Franco - Serviced"
}