{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would start the year off BIG!\nBig muscle dude with a BIG uncut cock!\nClaudio has done video work before. As always, sorry about the name change as I never know if a studio feels like they own the name that they gave him. Think of it this way, he is an actor who is now playing the role of Claudio at ChaosMen.\nHe has beefed up recently too. Other than spending hours in the gym each day, he also does martial arts to stay in shape. He is yet another Cuban guy. I believe that makes my fourth or fifth Cuban guy in 2015! Giving all new meaning to 'opening relations' with Cuba!\nAs usual, I started him off with a solo. He was also curious about how I shot video, and was not quite ready to jump all the way in. So we will get the full spectrum of his performance, with a solo today and a swap oral video next week. Then hopefully some raw fucking after that! Fingers crossed!\nHe is straight, so I queued up some of the other model's all-time-favorites, and he was hard in not time. Claudio did keep suggesting I get some women in, but thankfully the porn did the trick.\nHis cock is nearly 9-inches, and if you like big uncut cock, my guess is that it would score a 10 for perfection.\nHis body is perfect too! Nice abs, and those pecs! With that handsome face he is a total package! Yum!\nI had him use a FleshJack, to which he nearly destroyed with some aggressive fucking. He could get a job doing safety testing of their toys!\nFor cumming, Claudio is best standing or upright. Yet another dude who grew up jacking-off in the shower.\nSo for his cum shot he is up on his knees and he spills a juicy load that fills up all that delicious foreskin!",
  "models": [
    {
      "name": "Claudio",
      "person_id": 8111
    }
  ],
  "release_date": "2016-01-04",
  "scene_id": 8110,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Pubic Hair - Trimmed",
    "Sex Act - Toys",
    "Theme - Solo",
    "Video - HD - High Def"
  ],
  "title": "Claudio - Solo"
}