{
  "collections": [
    "ChaosMen"
  ],
  "description": "Oscar showed up a little sad this day. His girl had just broke-up with him, and they were furiously texting each other before the shoot. I was a little worried he would be distracted when it came to do the video. He put the phone up, took a shower, and was ready to play. Even still, he seems very serious in this video.\nDespite being able to lick his own cock, he was not ready to suck another guy's cock. I thought that if I had Luca there, with his cock out, that he may actually take the leap and suck him off. But he only stroked Luca's cock for a short period. Though he did show a lot of interest in watching Luca jerk his own cock.\nAgain, Oscar's cock is hard in seconds, tormenting himself by aggressively rubbing his cock head.\nLuca sees how hard he is, so slides down to stroke and suck on Oscar's rod. If you like OutTakes, stay for the ending to see a moment where Luca was sucking a little too well!\nOscar does some dirty talking, and Luca seems to be into it. He gets super hard while Oscar is fucking his face.\nSince we had a moment when Oscar might accidently cum to soon, we set Luca up to pull the load out of Oscar. Clearly Luca was going to be able to make Oscar cum. With Oscar coaching him the entire time, it only took a couple minutes to make him bust. \"Don't stop! Don't Stop!\"\nHis load spills out of his cock. Luca of course lost his own hard-on while trying so hard to make Oscar cum, so we had to give him a moment to get hard. He bust his load all over Oscar's stomach, adding his own spunk to Oscar's load!",
  "models": [
    {
      "name": "Oscar",
      "person_id": 8099
    },
    {
      "name": "Luca Rosso",
      "person_id": 8074
    }
  ],
  "release_date": "2016-01-27",
  "scene_id": 8114,
  "tags": [
    "Build - Average",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Video - OutTake"
  ],
  "title": "Luca Rosso & Oscar - Serviced"
}