{
  "collections": [
    "ChaosMen"
  ],
  "description": "Cooper Reed is not on any social media, so I think this is the first time any viewers get to hear him talk and answer questions. He has such a great personality that I should have done this a long time ago. You will adore him as much as I do!\nWe have been having really great chatroom participants! Lots of journalistic style questions to see what makes Cooper Reed tick.\nI re-learned a few things too. I had forgotten I had initially declined working with Cooper because he would only Top, and once he learned that, he said he would be down for whatever. I skipped his solo/oral and tossed him in with Gavin Sevin and Jet. He bottomed, and I could instantly see how great he was to work with.\nBut I had forgotten he had not bottomed on film before. I guess in my mind I have heard him talk about getting fucked before, so I figured it was on camera for other studios, but apparently it was during some 'at home' adventures.\nCooper is going back into the military, so a there were few questions about that. It will take him a couple months to figure out if he will have free time, but we are both thinking we should be able to occasionally set up a shoot.\nWe shot a video early that day, with new guy Colby. Colby has an extra big dick, but turns out he is a bottom. Cooper fucked the hell out of him, and he still had energy to do this show.\nAnyway, you will love his Tennessee accent, sparkling blue eyes, and his amazing body with natural body hair!\nHe still has 3 videos to air, but I suspect there will be a gap after they ari as he gets himself situated.\nI added an extra camera for this re-broadcast. The audio is much better, and also I added some better lighting. Going to decrease the compression on the webcast so the quality will improve for the next show,\nHe answers a lot of questions, then gets down to the serious business of busting his second nut of the day!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    }
  ],
  "release_date": "2015-09-29",
  "scene_id": 8117,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Theme - Solo",
    "Video - ChaosLive Cam",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Cooper Reed - Live! 09-22-15"
}