{
  "collections": [
    "ChaosMen"
  ],
  "description": "Colby came in and tried doing a scene a month or so after his solo/oral. He wanted to Top, and I really too also wanted to see his fat cock going in and out of an ass. It is an impressive cock, but like many ginormous cocks, they often don't get super hard.\nAnd it turned out Colby was very nervous his first try. His cock was just too wobbly to penetrate a tight hole. He has not fucked much ass, and sex with a vagina is much easier. He also didn't think he could suck dick. At the time, he was also not ready to bottom, so we called it quits.\nMonths passed and he said he had tried bottoming on his own, liked it, and said he be down to get fucked, and do a whole scene.\nI know it's criminal to not see that cock pillaging a hole, but it is awful nice to see Cooper Reed's mouth trying to wrap around it! Also, Colby had no problems sucking Cooper's cock. He seemed a lot more relaxed this time, and sexually more adventurous. I do think if we give him a couple more videos, he will be a confident Top.\nAnd as it turns out, Colby is an amazing Bottom. He was close to cumming the entire time. He had to stop from stroking his cock a couple times as Cooper fucked him hard.\nCooper fucks him until he nuts, then unloads all over his hole.\nColby is stunned after such an intense orgasm. Cooper licks up Colby's load, then goes down to eat the cum out of Colby's cock and ass.\nI definitely will try to get Colby back to do more. Maybe Bottom a few more times, then find the perfect guy for him to work with!",
  "models": [
    {
      "name": "Colby",
      "person_id": 7896
    },
    {
      "name": "Cooper Reed",
      "person_id": 3592
    }
  ],
  "release_date": "2016-01-22",
  "scene_id": 8120,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Bald",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Colby & Cooper Reed - RAW"
}