{
  "collections": [
    "ChaosMen"
  ],
  "description": "Despite having swapped oral with guys before, Santino was definitely nervous.\nNot about the blow job, but just having 3 people around him, waiting for him to get hard and perform made him extra nervous.\nNoah gets in there and quickly gets his cock hard. Santino told him he loved really sloppy wet blow jobs, and boy, did Noah deliver!\nSantino is quiet to start with, but starts coaching and egging him on. A couple times he lifts up and power fucks Noah's face.\nSince Santino has sucked before, he was down to suck on Noah. You can tell he has not had a lot of practice, but does his best to service Noah while stroking his own cock.\nWhatever he was doing was working, because at one moment, Noah had to have him stop or risk busting too soon. If you like OutTakes, then stay after the final credits for that moment.\nNoah gets his head over the bed, and this is when Santino really gets vocal and works his cock deep into Noah's throat. Love the verbal from him!\nSantino gets his ass rimmed for the first time, and the two suck on each other's cocks.\nAfter some aggressive face-fucking, Santino jerks his cock until his load spills into Noah's mouth. Noah busts his own load seconds later!\nI definitely loved working with Santino and am eager to get him back!",
  "models": [
    {
      "name": "Noah Riley",
      "person_id": 7572
    },
    {
      "name": "Santino",
      "person_id": 8135
    }
  ],
  "release_date": "2016-02-10",
  "scene_id": 8137,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Middle Eastern",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Video - OutTake"
  ],
  "title": "Noah Riley & Santino - Serviced"
}