{
  "collections": [
    "ChaosMen"
  ],
  "description": "I really couldn't tell if Adam was nervous about getting head from a guy for the first time. He is very professional, calm, and had his mind up that he could do this. After doing cam shows for guys, he knew he would eventually level up to full-on porn.\nI had the TV on for him to start with, but after West got in there and got his cock hard, he spent most of his time with his head thrown back in ecstasy, or watching his dick get sucked, with an occasional glance at the porn playing.\nThe most noticeable thing about this serviced videos, is it really looks like Adam is being electrocuted throughout this video! West learned quickly to focus on his cock head, and that kept Adam on the edge of cumming. Adam is literally vibrating throughout this video!\nOccasionally West would slow it down, fearing he might make him bust too soon.\nWest tries to get some rimming in, but you can tell it was tickling Adam too much. He sure does try to stay still, but he can't help but jump away. Whiskers are tickly!\nThe cum shot is crazy! Adam jerks around with giant spasms. West loses his grip but got back on top of it with his mouth and jerks the rest of his load out. Droplets of cum flying everywhere, with West sucking down most of it.\nAdam conquered getting head, and now say he will Top a guy. He isn't ready to suck back so will give him one pass. But I really want to see this hot muscle stud fucking the heck out of a dude!",
  "models": [
    {
      "name": "Adam Cub",
      "person_id": 8139
    },
    {
      "name": "West",
      "person_id": 7867
    }
  ],
  "release_date": "2016-02-17",
  "scene_id": 8140,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Adam Cub & West - Serviced"
}