{
  "collections": [
    "ChaosMen"
  ],
  "description": "Before I dropped Franco off for his return flight after his first video, he was down to come back ASAP to do a full scene. He was excited by the experience, and wanted to try messing around with a guy again.\nInitially he wanted to just Top, but by the end of the car drive, he was down for anything.\nWhich is good, because after you watch this video, you get a Bottom vibe from Franco. Well, the first part of the video you may think that. It changes as when the flip fuck.\nGriffin pays a lot of attention to his ass and cock. Franco writhes around, practically begging for something to be stuck in it. When we mapped out the video, I thought maybe he would fuck Griffin first, but as the video naturally evolved, turns out Franco got fucked first.\nYou can tell he struggles a bit with the first insert, but then has an epiphany as he realized it felt really good. His cock sure liked it, and he stroked his hard rod, edging himself as Griffin hit his prostate.\nSince he was staying so hard, it was Griffin's turn to bottom. Franco is a little wobbly at first, but then got his groove on. Maybe he isn't just a Bottom after all! I think he will be totally versatile guy. He is an amazing Top too!\nNow, both guys were loving getting fucked. They both wanted to cum that way. Franco figured if we raced, he could cum from Griffin fucking him, then before losing his boner, flip around and fuck Griffin until he nuts,\nMission accomplished! With some bonus cum licking and swapping to put you over the edge!",
  "models": [
    {
      "name": "Franco",
      "person_id": 8102
    },
    {
      "name": "Griffin Barrows",
      "person_id": 7466
    }
  ],
  "release_date": "2016-02-19",
  "scene_id": 8143,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Franco & Griffin Barrows - RAW"
}