{
  "collections": [
    "ChaosMen"
  ],
  "description": "Some of you might remember an Out Take when Lorenzo did his solo. I think he indicated I should take some clothes off while filming him. Recently, he did his cam show with members, and mentioned he would be down to do a scene. So he has hinted a few times he would like to play. Griffin has mentioned doing a scene also, and I usually just say to them that if a scene partner fails to show up, then we can give it a whirl.\nTwo weeks before the shoot, Lorenzo's scene partner dropped off the radar. No replies to emails, calls, text, etc. It happens about 3-4 times a year. I gave Lorenzo the heads up that I suspected we were going to have issues making the scene happen, and started giving him a list of guys that were tested and ready to go.\nHe just said he wanted to do the scene with me, and reminded me that now was the rainy day to do it.\nLorenzo is super sexy, and I thought he would respond to the Bossy vibe I have. I shot some of it POV, along with the side cameras.\nMany of you love the scenes where I get naked. I am not a big fan myself. At 50 years old and 155 pounds, I am not exactly a hot specimen, and I am sure many non-members will have a field day with the negative comments.\nBut as I said, many of you do seem to like these videos, and new sales that day are encouraging. Maybe it is because you live vicariously?\nWe had a lot of fun. I loved watching Lorenzo cum from fucking him. I also wanted to do a full internal cum shot. It is the fastest way to make cum. We tried to showcase some cum, but alas, not much dripped out.\nAnyway, not sure how many of these more I would like to do. I will monitor feedback and of course new sales, but for now, I really just had a lot of fun with Lorenzo, and glad he was down to fuck!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2016-02-24",
  "scene_id": 8151,
  "tags": [
    "Build - Average",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Bossy",
    "Theme - RAW",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Video - POV-CAM"
  ],
  "title": "Bryan & Lorenzo - Bossy"
}