{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ulysses has been eager to work, so he knew he needed to tackle bottoming soon.\nReuben did such a good job his first sex film, and his cock is a good size to start with for a dude's first time. Reuben also turned out to be a very good Bottom, so I knew we could flip-flop. Ulysses' cock is a little bigger than Tegan's, so he was going to have to broaden his horizons as well. I am just gonna keep giving him bigger and bigger cocks!\nHaving two guys who identify as straight was a little awkward. I warned them that they both don't seem to have any limits, and to just plow through the scene like they each have done with gay guys they have been paired with. Even still, you can tell at the beginning they are not too sure. Thankfully, the awkwardness doesn't last too long.\nReuben starts-off slower this time, a little bit unsure. So Ulysses leads the charge. They swap oral, and their energy finally gets aligned. Ice finally broken.\nUlysses has Reuben sit on his face, and you can tell the dude loves to eat ass. I think Reuben loves the anal attention too! Ulysses slides up to the couch, while Reuben slips his cock inside.\nReuben rides him cowboy style, then flips around on his cock so we can see him stroke his dick. A challenging position, straining those quads, but Reuben loved every minute of riding Ulysses' hard dick.\nThen it was Ulysses' turn to take a dick for the first time. He makes some pretty painful facial expressions in the first minute, but then starts to stroke his cock and turn the pain into pleasure.\nI wanted to see if Reuben could cum from getting fucked. His first video, he swore it would likely not happen, but this time out, he seemed to think he could do it.\nI am reasonably sure this is the first time he has cum from getting fucked by a cock, and I think his reactions show how mind-blowingly intense the experience was. You can tell he will be back to try it again.\nUlysses, who always seems to be on the edge of cumming, quickly dumps his load onto Rueben's freshly fucked hole!",
  "models": [
    {
      "name": "Reuben",
      "person_id": 7985
    },
    {
      "name": "Ulysses",
      "person_id": 7993
    }
  ],
  "release_date": "2016-02-12",
  "scene_id": 8153,
  "tags": [
    "Build - Average",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings"
  ],
  "title": "Reuben & Ulysses - RAW"
}