{
  "collections": [
    "ChaosMen"
  ],
  "description": "Claudio said he was ready to try some raw action. I wanted to put him with one of my best. For a guy who has done video with dudes before, he seemed pretty nervous. I knew Vander would make him feel at ease.\nAfter some kissing, Vander goes after his pits. He had a tiny bit of funk going on, so it turned Vander on to no end. He gets down on his knees and sucks Claudio's cock till he is bone hard.\nIt is hot to see Claudio getting serviced, but I think it is even hotter seeing him take Vander's thick cock in his mouth. Talk about jaw stretching! He does his best to swallow all over Vander's cock!\nVander returns the favor by rimming his hole. You can tell Vander is tempted to put his cock in his perfect hole, but as far we could tell, Claudio was not keen on getting fucked. For those few moments, I am hoping that it is a glimpse of the future. Would love to see Claudio get fucked!\nThey 69 for a while, but Vander wants his hard dick inside him. He rides Claudio's uncut cock, while stroking his own. We even get some nice side-saddle action as Vander tries to milk a load out of Claudio's cock.\nClaudio then fucks Vander on his back. You can tell he is an amazing Top. Vander's cock was pre-cumming the entire time. I think Claudio realized he could fuck really aggressively, so he worked up a sweat while pounding Vander's hole.\nHe flips him on over and fucks him standing doggie-style. He slides his cock in and out until Vander dumps his load.\nClaudio shoots his load onto Vander's hole, then plunges his cock in, juicing his hole perfectly.",
  "models": [
    {
      "name": "Claudio",
      "person_id": 8111
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2016-02-26",
  "scene_id": 8156,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings"
  ],
  "title": "Claudio & Vander - RAW"
}