{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have a couple videos coming out of \"first timers\" so if you enjoy amateur action, you will be really pleased. If you likely finely tuned porn, well maybe you can watch as the models grow. Go back and watch Glenn's first couple videos, you see how he grew into an amazing performer.\nI had two guys wanting to start doing video. Both guys said they would be down for bottoming and topping. Sam's girlfriend has played with his ass before, so he was more relaxed about getting fucked. Lambert was not as sure, and ironically he is the one who got fucked the most in this video.\nThere is some awkward jerking and sucking, as this was also their first time sucking dick. I think Sam wins the cock-sucking round for enthusiasm. Sam, in general, is always expressive and he is also dang good at the dirty talking.\nSam rides Lambert's cock first. There is a bit of fumbling to get it in, and it took more than a few moments before he could let Lambert start to fuck him. Sam's hairy ass looks amazing as Lambert's thick dick slides in and out. Sam also seemed to stay hard while getting fucked, so I think the homework with his girlfriend has paid off.\nLambert's takes a cock for the first time, and you can tell he was biting his way through the initial fucking. He is not very hard while getting fucked doggie-style, so Sam flips him over on his back.\nThat did the trick for Lamber! He started really stroking his cock, and before I knew it he was about to cum. I got into place with only a moment to spare to catch the cum flying out of his cock. Sam's cock buried in him, making the orgasm super intense.\nSam pulls out and starts jerking, but his aim is off. I had him stand a lot more sidewise for the cum shot, allowing us to see him paint Lambert's hole with jizz. He then drives his cock into his cummy hole, giving Lambert his first creampie!",
  "models": [
    {
      "name": "Lambert",
      "person_id": 8034
    },
    {
      "name": "Sam",
      "person_id": 8065
    }
  ],
  "release_date": "2016-03-04",
  "scene_id": 8164,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Lambert & Sam - RAW"
}