{
  "collections": [
    "ChaosMen"
  ],
  "description": "Another 'First Time' video, this time with Santino taking a cock in his virgin ass.\nFranco and Santino are still in the amateur stage, though Franco has conquered cock-sucking and getting fucked, we are still working on intimacy. I give both guys a 'pass' on things like kissing and rimming for a couple videos, but eventually I will try to push their limits. For now, they are pretty straight forward.\nSantino always has lots of questions. They are thoughtful, appropriate, and he remembers the answers! So he had asked a lot of questions about what it feels like to get fucked. What happens if he can't take it? What happens if he cums too soon? How does he prepare?\nHe did have his girl play with his ass the night before. He said she got a couple fingers in, and it was fine when it was in, but she pulled out and he had fight the urge to run for the bathroom. So he was a little dubious of his own performance.\nBoth guys have nice long cocks, and I started them with a simple side-by-side jerk-off. They stroke each other, and then take turns sucking cock.\nAgain, you can tell I am not fibbing about their level of experience. These guys aren't professionals, but then again, it's always hot watching these guys push their limits and increase their skills.\nI wanted Santino to get fucked first, just so he would stop stressing about it, and then he would be good to go for the rest of the video to top Franco.\nFranco does his best to slowly insert, letting Santino's ass adjust to his thick cock. Santino is telling him to slow down, and not go so deep. There should not be any doubt that this was Santino's first time. Head down while just trying to take it! Though, I found it promising he kept stroking his cock, and stayed hard while getting fucked.\nThen it was Franco's turn, and I did worry that Santino would not be hard enough to fuck after having his ass violated. Turns out he is a pretty good top, and Franco really seems to excel at both top and bottom.\nSantino seems surprised that Franco can take a cock better than he did. They both bonded before the video, with Franco talking about his last video where he first got fucked, and how it could quickly start to feel good.\nFranco is definitely going to be a fully versatile performer. He fucks a guy really well, takes a cock like a pro, and his verbal skills in both positions will bring him into the pro-amateur league quickly.\nSantino fucks Franco with his balls slapping his ass. Franco starts grinding on his own cock while Santino fucks a load out of him.\nSantino scoops up the jizz, and uses it to stroke his cock.\nHe squirts once on his hole, and then plunges his cock in. You see his cock spasm and write around as he empties his balls inside Franco! Nailing his first creampie perfectly!",
  "models": [
    {
      "name": "Franco",
      "person_id": 8102
    },
    {
      "name": "Santino",
      "person_id": 8135
    }
  ],
  "release_date": "2016-03-11",
  "scene_id": 8167,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Franco & Santino - RAW"
}