{
  "collections": [
    "ChaosMen"
  ],
  "description": "It's always a game to see how many times we can make Jet cum when he is here. I think we average about three, which is also the number of times he nuts in this video. I put him with Amador, knowing that his long uncut cock would hit all of Jet's right spots.\nJet starts by sucking on his curved dick, even attempting to deep throat him. Amador loves to have his cock worshiped!\nI feel like Amador is now moving into the 'Bi\" category. He doesn't seem to be in it for the money anymore. He mentioned he was dating a male/female couple, sometimes playing with the dude. It sounds like a nice setup, and he seems very happy with the arrangement. Though he still seems shy about bottoming.\nDespite not thinking he can bottom, Amador tackles sucking dick and rimming a like a pro, which got Jet in the mood to take his cock. Amador climbs on top of Jet, making him rim his hole, and suck his cock. That angle works great for Amador, and it really turns him on. He really does have a dominant vibe about him!\nNext, Amador fucks him bent over the bed, ramming his cock in and out until Jet blows his first load.\nJet then rides his cock reverse cowboy style, and after bouncing up and down on Amador's cock, he busts a large second load. For the rest of video, you will notice the aftermath of this explosion in many of the photos/video.\nAmador breeds Jet's hole, and fucks the cum into him hard. He keeps going until Jet blows his third and final load.\nAnd like a good bottom-boy, Jet cleans the cum off of Amador's cock!",
  "models": [
    {
      "name": "Amador",
      "person_id": 7970
    },
    {
      "name": "Jet",
      "person_id": 3481
    }
  ],
  "release_date": "2016-03-25",
  "scene_id": 8178,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Amador & Jet - RAW"
}