{
  "collections": [
    "ChaosMen"
  ],
  "description": "Adam Cub said he would try fucking a dude, and with his big dick, I knew that Noah Riley could handle him.\nHe didn't think he could suck dick or kiss. Just get blown and fuck a dude. I usually give the guys a 'pass' their first couple videos. Welcome to amateur porn! You can tell Adam is pushing his limits for this one. I will keep working on him!\nNoah didn't care in the slightest. Adam's body is amazing and he starts by worshiping his chest and cock. He gets Adam hard real fast, and I have to say, he stayed that way for most of the video. He has done a lot of cam work, so he is very comfortable naked and only needs a bit of time watching some straight porn before diving into the sex.\nAfter Noah gives Adam an amazing blow job, they get right down to the fucking.\nAdam slides his cock around Noah's butt-cheeks, and you can really see how hung Adam is. I was not sure it was going to fit in our little Noah Riley!\nHe slides his cock in nice and smooth, and Noah is in for a great ride! Adam spanks his ass, making large red handprints on his cheeks!\nAdam tells him to sit on his dick, so Noah cleans his cock, and then sits down on it like a pro. He rides him reverse then spins around so we can see Adam's cock sliding all the way in and out of Noah's ass.\nNext, Adam fucks Noah on his back, shoving is cock in extra deep. Noah cums quickly from the jack-hammer action!\nAdam does a great job for his first cream pie. He jerks out a load, coating Noah's hole, then shoving the rest in. And then makes Noah clean his cum-soaked cock!",
  "models": [
    {
      "name": "Adam Cub",
      "person_id": 8139
    },
    {
      "name": "Noah Riley",
      "person_id": 7572
    }
  ],
  "release_date": "2016-03-18",
  "scene_id": 8180,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Adam Cub & Noah Riley - RAW"
}