{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought Shepherd would be nervous, but just like his solo, his cock was ready to go before Sean could get his shorts off.\nShepherd has a quiet yet bossy vibe about him. Sean buries his nose into Shepherd's musky pubes. Shepherd stayed totally in the moment, relishing having his cock serviced. No sneak peeks at straight porn, he was there to be serviced and to play with another dude.\nHe also played with Sean's cock, and they jousted for a bit. There is an energy about him that I really like. Bossy, masculine, but also really wanting to please his buddy. I get a \"I'm horny, your horny, so let's jerk and suck each other off here in the locker room.\" vibe about him!\nShepherd dives in to give Sean's cock a good sucking, while his own cock drips pre-cum. I think it is safe to say, that Shepherd was turned on doing this video!\nAfter Shepherd finishes sucking Sean's cock, Sean pushes him onto the bed to attack his cock at a different angle.\nThey also 69 for a bit. I love seeing Sean's cock buried into Shepherd's throat with no escape! The whole time, his cock is rock hard while Sean works it.\nShepherd knew he would have to stroke his own cock in order to cum, so he jerks a load into Sean's open mouth. One laser beam of cum wings the side of his head, but the rest gets lapped up.\nSean takes a couple minutes to ramp up his own cock, and dumps his load onto Shepherds still semi-hard cock.\nBoth guys did great in this video, and I am eager to get them both back in!",
  "models": [
    {
      "name": "Sean Peyton",
      "person_id": 8158
    },
    {
      "name": "Shepherd",
      "person_id": 8174
    }
  ],
  "release_date": "2016-03-16",
  "scene_id": 8181,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Sean Peyton & Shepherd - Serviced"
}