{
  "collections": [
    "ChaosMen"
  ],
  "description": "Last week you met both Leon and Sean Peyton doing their solos. I thought I would put them together to see how well they do with cock sucking. Two new guys first time being filmed!\nTruman was supposed to do a cam show, but he got a new job catering, and could not leave. Sorry cam viewers! He was of course looking for money for the holidays and regretted missing the cam show. So I thought why not drop Truman in there and have someone in the shoot that is familiar with being filmed.\nSean starts by getting Truman hard. Such an easy thing to do as Truman, self-admittedly, is a dirty boy. He has been playing with guys now outside of doing ChaosMen work, but nothing serious. He is still dating girls, and I think the band-aid he is wearing is a result of run in with one of the girls he was dating. He loves getting fucked by guys, but girls keep luring him in.\nLeon was nervous, and it took him a bit to get hard. Sean works his cock until his big uncut cock was fully hard. Truman climbs up so that Leon can suck on him while Sean services him.\nTruman then sucks on Leon's cock, while Sean strokes his own cock to get hard and join in on the fun. Truman goes back and forth sucking both dudes. Finally both Sean and Truman suck on Leon's big cock, licking his foreskin, and sharing the task of taking on his monumental cock.\nTruman straddles Leon and puts his cock up against Leon's dick. Sean has a chance to suck both guys, trying to get both cocks in his mouth!\nTruman spins around and starts to make-out with Leon. That leaves his cock and ass available for Sean to rim and suck. Sean goes to town rimming Truman and then having a nice big cock to suck.\nSean volunteered to be the recipient of both guy's loads. Leon gets up and feeds Sean his cock. Sean tries his best to get Leon's cock down his throat. Sean also rims Leon's hole.\nAll the guys start jerking-off and I have to admit the timing on this video is crazy good! Leon shoots his load onto Sean, then Sean blows his load, and Truman adds his load to everyone else's. Boom! Boom! Boom! It's a domino effect of\nSean's furry body is coated in cum! You can practically smell all that cum through your screen!",
  "models": [
    {
      "name": "Leon",
      "person_id": 8160
    },
    {
      "name": "Sean Peyton",
      "person_id": 8158
    },
    {
      "name": "Truman",
      "person_id": 7806
    }
  ],
  "release_date": "2016-03-02",
  "scene_id": 8183,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Leon & Sean Peyton & Truman - Serviced"
}