{
  "collections": [
    "ChaosMen"
  ],
  "description": "I could be wrong, but I am pretty sure this is the first time Luca Rosso has done a raw video. In the past he has usually bottomed on video, but in real life, he is actually more of a Top. He also tends to go for twink type guys, and though I am not sure if Wren qualifies as a Twink, he is pretty close to one and Luca was really happy to work with Wren.\nSo in other words, I got a great match-up for him for his first time condom-free!\nI pushed for a little more sensual on this video, having them starting out by making-out. I think you can see that Luca has a bossy vibe when paired properly. Wren certainly was hard and ready to have his cock sucked. Luca's dom vibe turned him on.\nLuca is definitely a pleaser when it comes to cock sucking. He works all his skills on Wren's cock, and when he is done, he straddles Wren's face and gets his own cock sucked. Luca really liked Wren's long hair, so he was VERY turned on for this video!\nThey 69, and Wren rims Luca's hole for a bit.\nLuca flips Wren doggie-style and then he slides his raw cock deep into Wren. Luca may not be horse-hung, but he is an accomplished Top! I think this video really showcases his ability to be a Top!\nEven when Wren rides him, which is typically an issue for most Tops, he stays hard. Of course it helps that Wren is riding his cock like a pro!\nWren gets on his back so that Luca can fuck the cum out of him. Luca has to work to keep thrusting while on the couch, but he keeps it going until Wren's cock is spurting cum!\nAnd if this is indeed Luca's first bareback video, then this would also be his first cream pie. He nuts all over his hole, then shoves the cum in.",
  "models": [
    {
      "name": "Luca Rosso",
      "person_id": 8074
    },
    {
      "name": "Wren",
      "person_id": 3581
    }
  ],
  "release_date": "2016-05-20",
  "scene_id": 8188,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Luca Rosso & Wren - RAW"
}