{
  "collections": [
    "ChaosMen"
  ],
  "description": "I was planning on hooking Dyson up with another dude. Neither of them had bottomed, so it was going to be a coin toss or maybe a flip-flop video as they both tested out the waters.\nBut I, like a dumbass, didn't realize that booking models on July 5th was not a good idea. I guess I am used to a relaxing 4th of July with spent at a BBQ and small parties. Then maybe swing by a fireworks display, with a somewhat early evening.\nBoth the other model and Dyson took the opportunity to party like rockstars. The main issue was the other model had to board a plane at 11 am on the 5th. He woke up late, without a car, hung over, and in a stranger's bed on the opposite side of the city. No chance to make it, and he was in no condition to fly.\nGrrrrrr...\nSo I called Dyson to let him know that the gig went belly up, and it turns out he was hurting from partying the night before as well. He needed the money so I thought why not wait a day and have him do a Toy video so he can see that he can get off by sticking things in his butt.\nBoy, did that ever work!\nSometimes when I watch toy videos, the guy's dick will invariably wilt a couple times during the video and they have to stop and recharge. Which I guess means to me, they aren't getting off to it.\nWell, Dyson's dick just got harder and harder the bigger the toy got.\nWe tried out a FleshJack as they had sent me a bunch for product placement. Not sure this is a good video to showcase their product. He struggled with it for a bit, and it just generally was a challenge for him.\nThe real fun was the various butt plugs I got for him. He leveled -up twice and finally decided to tackle the uber-pink-flesh colored dildo.\nA little bit of a struggle as his lube covered hands tried to get it in. He's for sure an amateur at navigating a toy up his hole.\nHe got it up there and I saw his dick jump another level and he murmured to me that it was gonna make him cum. I quickly moved my cameras into position, just in time to catch him bust a gloppy nut.\nThis is a pretty dang good Toy video, so I hope you will enjoy. And maybe we can get Dyson to try some anal action with a dude in the future!",
  "models": [
    {
      "name": "Dyson",
      "person_id": 3259
    }
  ],
  "release_date": "2008-10-22",
  "scene_id": 819,
  "tags": [
    "Theme - Solo",
    "Sex Act - Toys",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Video - HD - High Def"
  ],
  "title": "Dyson - Toys"
}