{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had been putting Franco and Reuben with solid partners, but I thought it was time for each of them work with another newbie. Franco and Reuben have a lot in common and had a lot to chat about on the ride to the studio. Franco has two very young kids, and Reuben is now expecting to be a Dad, so a lot of family-talk that day.\nI know, it doesn't sound extremely hot or exciting, but when models connect before the shoot, it generally goes a lot better.\nBoth guys were ready to go, and we tackled kissing this video. I know you love seeing it, but often I have to really remind them to go there, and of course sometimes they just refuse. So if you like some kissing, there is a bit of that.\nThey swap oral, and they each have their own technique. Reuben gets in there to suck and then rapidly jerks his buddy's cock. Franco is more passive and lies down on his stomach so Reuben can fuck his face.\nI get the feeling that both guys enjoy sucking on dick, and when they 69 with each other, they both are hungry for each other's cocks. Both trying their best to impress each other!\nBoth guys are versatile, so I knew we could flip-flop. Reuben was the more worried of the two, so we had him start first by riding Franco's cock. Takes a bit of maneuvering, but he gets it in and starts to grind down while stroking his own hard cock.\nNext, Franco fucks him doggie-style, and we get some hot penetration. As nervous as Reuben gets about bottoming, his cock sure does like it when his ass is plowed!\nThey switch positions so Reuben can have a chance at Franco's tight ass. Franco is a great Top, but he sure is an awesome Bottom! His facial expressions are amazing as Reuben slides his cock in and out!\nA couple times Franco told him to slow it down, so he is not ready to be aggressively fucked.\nSo slow and easy seems to be the trick for him. Reuben fucks him on his back, and within a couple minutes Franco is busts a big load.\nReuben tries to fuck him until he cums, but needs to pull out and jerk to get close. His load shoots all over Franco's hole and then plunges the load in!",
  "models": [
    {
      "name": "Reuben",
      "person_id": 7985
    },
    {
      "name": "Franco",
      "person_id": 8102
    }
  ],
  "release_date": "2016-04-15",
  "scene_id": 8198,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing"
  ],
  "title": "Franco & Reuben - RAW"
}