{
  "collections": [
    "ChaosMen"
  ],
  "description": "Two hot Latin guys!\nLorenzo was super pleased to be working with Claudio. Lorenzo has a hot body, but he was thrilled when he saw Claudio's amazing build.\nThey start by kissing, and then Lorenzo slides down to suck Claudio's magnificent cock. You can tell Lorenzo is enjoying every minute of worshiping his uncut cock. Claudio too seems less reluctant and more present for the videos.\nClaudio lies down so that Lorenzo can suck his big cock at a better angle. Lorenzo then straddles Claudio and fucks his face. I have had a lot of new guys starting up that will not suck dick, so it is so nice to have Claudio go after Lorenzo's cock with enthusiasm.\nLorenzo was surprised how big Claudio's cock was, so he wanted to start by sitting on his cock. Like many of the guys, they usually struggle to stay hard in this position, even with a girl riding them. So it took a little bit of maneuvering, but after Claudio got it in, he fucked like a jackhammer!\nClaudio fucks him doggie-style, the plows his ass while he is on his back.\nWhen we stopped to do photos, Lorenzo informed me that he was so turned on by Claudio, that cumming would be easy.\nSure enough he easily busts a load and Claudio fucks the cum out of him.\nClaudio squirts on his hole, and then shoves his cock in, filling Lorenzo up with his Latin load!",
  "models": [
    {
      "name": "Claudio",
      "person_id": 8111
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2016-04-29",
  "scene_id": 8206,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Claudio & Lorenzo - RAW"
}