{
  "collections": [
    "ChaosMen"
  ],
  "description": "Theodore was a little nervous getting his dick sucked by a guy his first time. He did seem curious and excited to give it a try, so I figured things would go smooth.\nHis dick was excited too. He pops out of his shorts hard, so Sean sets to work on servicing him.\nTheodore is doing fine with the porn video playing for him, and as usual I ease the audio down to mute as we go along. He gets a little wobbly without the sound of the porn playing for him, but Sean moves into full stroke mode.\nNot sure if it was his stroking that got his cock back to hard. Sean finally peels off his shorts, and spreads Theodore's legs wide, and that passive position seemed to be the turning point. He got rock hard with his legs in the air! Theodore paid little attention to the video after that.\nAnd in all the videos I have shot, I have never had any one make the request that Theodore did.\nTheodore asked Sean to rub his beard on his cock! It tickled him AND turned him on! Not many guys, gay or straight, can handle that, but Theodore was enjoying it, smiling really big! Hmmm.\nSean went to rim him, and his beard tickled him again. After a few giggles though, Theodore was loving having his ass licked.\nTheodore stands so Sean can get at his cock even better.\nTheodore strokes his cock and gives Sean an amazing facial that coats his entire face!",
  "models": [
    {
      "name": "Sean Peyton",
      "person_id": 8158
    },
    {
      "name": "Theodore",
      "person_id": 8212
    }
  ],
  "release_date": "2016-04-06",
  "scene_id": 8216,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Sean Peyton & Theodore - Serviced"
}