{
  "collections": [
    "ChaosMen"
  ],
  "description": "If Desi was nervous on camera the day before, he sure didn't show it this day!\nHe loves head, and he clicked with Noah Wiley on the car ride to the studio.\nDesi was hard from the start, eager to get his dick stroked and sucked. He is strongest while standing, so that's how we started. It put Noah in a very subservient position, which he enjoys.\nI couldn't tell who was having more fun, Desi or Noah. Desi was making really good eye contact with Noah, along with some nice verbal. Noah was really turned on by servicing this guy! Declaring him his favorite!\nDesi laid on the bed, and once again you can tell when he is on his back that he doesn't stay super hard. It is touch-and-go and Noah tries to keep him hard.\nI thought we had lost him, but Noah flips him over to rim his hole and that got Desi charged up again! He loved it so much that after the shoot, Desi thought he might be able to take a cock. I told him a little rimming was different then a cock, but he still seemed very curious and admired his enthusiasm.\nDesi gets on his knees and Noah keeps him on the edge of cumming. He pulls that load of him with ease, and Desi was blown away by the powerful orgasm.\nI yell cut, and a few minutes later I am talking to Noah, who reveals he has cum in his sweat pants. Arggghhhh! Why didn't he show us earlier!\nSo we sent Noah home in the pair of the gym shorts Desi wore, while Desi was now excited to try new things with guys!",
  "models": [
    {
      "name": "Desi",
      "person_id": 8217
    },
    {
      "name": "Noah Riley",
      "person_id": 7572
    }
  ],
  "release_date": "2016-04-20",
  "scene_id": 8221,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - American Indian",
    "Ethnicity - Latin Guys",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Desi & Noah Riley - Serviced"
}