{
  "collections": [
    "ChaosMen"
  ],
  "description": "Come on, you knew who I would put Shepherd with for his first raw scene!\nOne look at him and I knew he could be Vander's little bro.\nIt was a bit musky in the room that day. Though I do want to say that Vander is not a musky boy all the time. Only on set when the guys tend to not wear deodorant because it shows on camera does he get a little ripe. Shepherd is the same way.\nShepherd love the way Vander smelled and you can tell that he really let himself get into this scene. He is passionate and enthusiastic, not mention also astounded at how thick Vander's cock is!\nI love that he just dove in. Kissing and sucking like he had been starving for this kind of action. He identifies as straight, but clearly this is a Bi guy. Vander also shows him how amazing he gives head. Shepherd is blown away, literally, by his oral skills.\nVander buries his tongue into Shepherd furry hole too, spreading his cheeks wide so we get a great view.\nThey 69 suck each other, and I can't decide which dude was hungrier than the other.\nShepherd fucks Vander doggie-style and wow, you can see just how skilled he is at Topping! His skin is not in great shape, but his vibe is so hot that I think you can overlook it.\nHe even fucks Vander side-by-side. Very challenging to do, but he fucked him while playing with his cock and kissing him.\nShepherd gets him on his back and rams his hole, also continuously playing with his buddy's cock to keep him happy.\nVander busts a huge load, while Shepherd does a perfect job of coating Vander's hole with a stripe of cum, and dumping the rest inside.\nVander cleans his cock, licking and eating all that delicious cum!",
  "models": [
    {
      "name": "Shepherd",
      "person_id": 8174
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2016-05-13",
  "scene_id": 8234,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Shepherd & Vander - RAW"
}