{
  "collections": [
    "ChaosMen"
  ],
  "description": "So Degan did pretty well getting fucked by Slade's big dick, and seems to get off on being subtly dominated.\nI already knew that Cooper was a bossy top, loving to make dudes' gag or sit on his fat cock. So I thought the dynamic would be a natural fit. And it sure was.\nBefore the shoot, I snuck aside Cooper and told him to have Degan suck his cock. Something Degan wouldn't do in the last video, but I knew Degan needed a cock in his mouth.\nSo many fans are a bit uh..jaded by all the talk about \"first timer\" videos, but, lol, I think you can tell Degan has never had a dick in his mouth. He gags over even the smallest amount, and generally doesn't seem to know how to suck dick.\nWhich I think is even hotter, and Cooper got off by making him take as much as possible.\nCooper has a natural knack for dirty talk. Nice under-his-breath command that Degan responded well too.\nClearly Degan is experienced in taking things up his ass (thanks to his wife and her dildo!) and he just turns into bliss mode when a fat cock is up inside of him.\nThe video lasts about 20 minutes. A bit on the long side. It crept up to that length because I left in the last scene where Cooper is fucking the cum out of Degan.\nCooper is sweating and trying to keep the pace going. He is almost exhausted and losing steam as Degan struggles to make himself cum. But Cooper just keeps going and you can hear us both whispering and encouraging Degan to bust.\nA major load, and I gotta give Cooper props. Despite being exhausted after fucking Degan so hard for so long, he busted his nut all over Degans' still almost hard cock.\nIf you like a little domination and love seeing a straight guy get fucked hard, you won't be disappointed by this video!",
  "models": [
    {
      "name": "Cooper Soltis",
      "person_id": 3222
    },
    {
      "name": "Degan",
      "person_id": 3276
    }
  ],
  "release_date": "2008-11-07",
  "scene_id": 824,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Cooper Soltis & Degan - Wrapped"
}