{
  "collections": [
    "ChaosMen"
  ],
  "description": "Gunther had been submitted back in June of 2012. He had long hair, and was undeniably hot. But he was only 18 and still unsure about doing gay video work. Very worried what his friends would think.\nFast forward 4 years and with some maturity, those worries have ased. Gunter had been doing some solo cam work as well as some live cam video work with his girlfriend. He was a lot more comfortable and mature with the idea of doing full on porn so he started pursuing it once again.\nGunther sent in updated photos, and I was pleased to see he had matured into a fine young man. The longer hair was gone along with the completely shaved bare body. He was now scruffy and looking like an adult male.\nWith his winning smile and personality, a juicy 7.5\" uncut cock, and a body that has a nice beefy mass to it, Gunther was a joy to work with.\nI loved everything about this guy, but he did have troubles trying to nut for both his videos. He put a lot of pressure on himself to cum, and balked when it came time. Now, this is not at all unusual, and it did not surprise him as he said even his girl complains it takes a while.\nBecause of the magic of editing, you don't see this, but it did make him think twice about doing adult work. But when it happened, it happened big time! A nice, thick, and copious load!\nI really like working with him and will do my best to see if we can get him back to do more. I of course suggested sometimes getting fucked makes you cum faster, but I don't think he believed me.\nAlso be sure to check his model portfolio page for a second set of pictures. The following day, Truman was running late for the Serviced he was going to do with Gunther. We killed some time doing some quick photos in the bathroom. I think they are nice and show how super sexy this guy is!",
  "models": [
    {
      "name": "Gunther",
      "person_id": 8248
    }
  ],
  "release_date": "2016-05-02",
  "scene_id": 8249,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Gunther - Solo"
}