{
  "collections": [
    "ChaosMen"
  ],
  "description": "With Truman still waiting to start a new job, he has been coming in a lot and helping with the cock-sucking duties. He is not a pro, but he is eager, and since he is a passive bi guy, he loves servicing a cock. He was not sure about an uncut cock though.\nHe thought this was his first time with an uncut cock, but Cooper Reed was uncut, but that was a long time ago. Cooper is a confident performer, whereas, Gunther was VERY nervous. So Truman had his work cut out for him in learning the Ins and Outs of working with an uncut guy.\nHe works hard to get Gunther hard. Gunther stares a lot at the TV, but then finally Truman gets him up, and Gunther does not have to rely on the video to stay hard.\nTruman is also always eager to rim, and I think this is one of the best parts of the video. He just dives into Gunther's hot ass.\nIt took Gunther quite a bit of time to cum during his solo. Even if I was attempting to blow Gunther, I might likely lose steam before actually making him nut. Sure enough, it took Gunther quite a bit to give Truman a facial, despite just letting him jerk his own cock on to Truman' face. Though, because of the magic of editing, it looks pretty good.\nIt's a great load, and Truman is not squeamish about eating cum!\nI really like Gunther, but he definitely puts a lot of pressure on himself to cum. I'd like to get him back, but he and I will have to discuss tricks for alleviating the pressure he puts on himself to cum.",
  "models": [
    {
      "name": "Gunther",
      "person_id": 8248
    },
    {
      "name": "Truman",
      "person_id": 7806
    }
  ],
  "release_date": "2016-05-11",
  "scene_id": 8250,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Gunther & Truman - Serviced"
}