{
  "collections": [
    "ChaosMen"
  ],
  "description": "Truman has been doing some of the Serviced videos, and I was little worried about doing the massage table theme with him. There is a certain ceremony to it. Boy, was I wrong to be worried!\nCliff is gay so was turned on at the thought that Truman would be rubbing all over him. I don't know for sure if he has personal experience getting a Happy Ending, but he looks like he has experience!\nTruman nails this massage theme. Oiling up Cliff, eating his ass, and sucking his hard cock like a pro. The daddy vibe is strong in this video, but also the chemistry between them is electric!\nTruman gets his dicked sucked too, and since Cliff is local, I am going to have him come back and do some of the servicing on the newbies. Cliff has got skills!\nNow the ending on this video is the kind I only get 3-4 times a year. Their timing is astounding!\nCliff crawls up onto Truman's chests and busts his load all over his face. Truman was stroking his cock, edging. Just after Cliff cums, Truman says he is about to cum, so Cliff spins around quickly, grabs his cock to make him cum!\nWith Cliff's cum splattered all over his face, Truman's entire body spasms as his own cock begins dumping out a giant load! Watching Truman writhe around in ecstasy, with cum all over his face, is just perfection!\nCliff licks up the goopy cum then spins back around and gives Truman a cum-soaked kiss!\nThis one is FANTASTIC!",
  "models": [
    {
      "name": "Cliff",
      "person_id": 8243
    },
    {
      "name": "Truman",
      "person_id": 7806
    }
  ],
  "release_date": "2016-05-04",
  "scene_id": 8258,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Cliff & Truman - Serviced"
}