{
  "collections": [
    "ChaosMen"
  ],
  "description": "After doing a handful of Serviced videos, I realized that not only is Sean a pro cocksucker, but he reminded me he is an 'avid' bottom.\nSo I thought I would put him with another pro. Cooper Reed has been waiting almost a year for his re-admittance back into the military. He thought he was getting in 6 months ago, and now has a 'for sure' entry date. Official date is now July, so I can sneak in a few more videos with him.\nHe has been training really hard too and it shows. He was swimming a bunch so the last couple videos he was lean muscular, but switched back to power lifting and wow, you can really tell!\nSean is looking great too! All lean muscle, though he went a little crazy on his manscaping. Sorry!\nI had told Cooper that Sean is great at cocksucking, so I think you may notice Cooper upping his own oral skills. I think Sean was happy having someone eager to please him.\nCooper also expertly rims his hole, getting it ready to be penetrated by his uncut cock.\nAnd true to his word, Sean IS a fantastic bottom! Cooper rams him and then makes him clean his cock.\nSean rides Cooper's cock reverse and dumps a HUGE load all over Cooper's thigh. I think that is the most I have ever seen Sean nut!\nSean slides off the bed and makes his hole into a nice platter for Cooper to nut in. With his hole gaping, Cooper drops his load down his chute! He shoves the extra in, then gets down and eats the cum out of his hole!\nWhat a finale!",
  "models": [
    {
      "name": "Sean Peyton",
      "person_id": 8158
    },
    {
      "name": "Cooper Reed",
      "person_id": 3592
    }
  ],
  "release_date": "2016-05-18",
  "scene_id": 8266,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Cooper Reed & Sean Peyton - RAW"
}