{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is one of those videos you have to watch right up to the very last second, otherwise it's not worth sitting through all the silliness.\nBaxter & Dalton have been friends since they were five. They both grew up playing sports and chasing girls. They even have pictures of them together (Dalton's hair was so blonde it was white!). Baxter was a thick kid, and Dalton was all wiry.\nBaxter is now much more of an athlete, and the two of them live and work playing sports together.\nDalton failed to make it in for a planned sex shoot, and in his effort to make sure he still had a gig, he volunteered his best friend to come in and do a side-by-side.\nThey are silly, but i'ts not over the top goofy. It's fun to watch them rock-paper-scissor for who was gonna jerk the other one off first.\nAfter the shoot Dalton pulled me aside and swore that Baxter would not have done oral, but if you watch this video where Dalton grabs his dick, there is clearly a mischievous look on his face that IS inviting him to do more. Dalton is not looking at his face, and I think had he glanced over, some cock sucking would have happened.\nI left in some of their \"planning\" as they figured out who was gonna bust where, and it's kind of hot how now \"veteran\" Dalton is giving suggestions.\nThe cumshots hot too as they nut simultaneously.\nAnd as I said at the beginning, the end in the shower is just delightfully SHOCKING!",
  "models": [
    {
      "name": "Dalton",
      "person_id": 3240
    }
  ],
  "release_date": "2008-09-10",
  "scene_id": 827,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Theme - Best Friends"
  ],
  "title": "Baxter & Dalton - Side-By-Side"
}