{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Rylan came in and did a fantastic job with Ulysses, I wanted to pair him with someone who would love to sit on his fat long dick. Ulysses can of course bottom, but I thought Rylan might have more of a 'advanced' cock for him.\nVander accepted the challenge to take on Rylan's cock, and it was instant chemistry!\nBoth are really into each other, but are relaxed, taking their time to please each other.\nI don't t think Rylan was expecting to encounter a cock that rivals his own, and you can tell he was impressed. He tried to get as much of it down his throat as he could.\nVander had no problems showing Rylan that he could give as well as take, and easily slid his cock down his throat.\nRylan stoops over Vander, letting him rim his hole, which always gets Vander extra horny. Rylan spins around and sucks on his cock, while letter Vander make a meal of his ass.\nAfter getting Vander's hole all wet, Rylan slides his dick deep inside of him. Rylan's cock is enormous, and it is about time we got to see it spreading some ass cheeks apart!\nVander climbs on top of him, riding him and working his cock with his hole.\nThen it was time to see if Rylan could handle Vander's thick cock. Vander did have to take it slow at first, pausing to eat his hole, but he eventually wedged it in and was able to fuck the hell out of him. This video has a double internal cum shot!\nVander fucks Rylan until he is cuming and pulls out long enough to give us some jizz on the outside. It is very rare for these guys to fuck until they cum, but I got it twice on this video. Rylan then breeds Vander's hole, and only a small amount of cum falls out. You guys ask for these internals, but we always run the risk of them not being able to show they came, or well, it doesn't ooze out cleanly.\nWith both guys willing to just let the other rail on them until they busted, this video is twice as hot for those who like guys who dump their load deep inside!",
  "models": [
    {
      "name": "Vander",
      "person_id": 3382
    },
    {
      "name": "Rylan",
      "person_id": 8025
    }
  ],
  "release_date": "2016-06-17",
  "scene_id": 8282,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Rylan & Vander - RAW"
}