{
  "collections": [
    "ChaosMen"
  ],
  "description": "Antonio was one happy sub pup in this video!\nIf you remember last week, he responded with a big grin every time he was dominated. Sometimes a smile reads like they feel silly, but watch closely. He is just so happy to have someone controlling him, he can't help but grin.\nOriginally I thought maybe we could do an Edge with him. But with Antonio's amazing oral skills, I knew the focus would be on him servicing someone else. So I made sure Troi was in town to play with Antonio.\nFor the Edge scenario, really it would have to be Antonio in the chair, and Troi doing all the head. So it was just going to be too backwards as an Edge video.\nA week before the shoot, I got message from Antonio asking if he should shave his head before coming out. That he usually just does it himself, and how short did I want it? He said he just runs a razor over it. His scout suggested maybe we could do that live for a video.\nYES! Something fun and different!\nWe use a massage chair to get him in just the right position for his head shaving. But first Troi gets his hole all wet, tongues it, and pushes in a nicely sized dildo. The toy wants to slide out, so Troi orders him to keep it in place.\nThen the shaving begins! I know this is a fetish for some, while others might be bewildered, but it does have a nice dom vibe to it, and as I said, Antonio was grinning ear to ear.\nInstead of stopping to take photos, which would have been impossible re-enact during a head shaving, Ransom shot some photos on my iPhone. The quality is not as great on the hi-res stills, but using my DSLR and a Flash during the video would have been too disruptive. If the Hi-Res photos seem a little skimpy or off, that is why.\nAlso, we did take a break to clean up some of the hair on the floor. Some of you who really watch for continuity may notice. I just had to stop and get most of it up. I feared while the head shaving would be interesting, Troi standing in large clumps of hair might not be appealing to most. I am sure I will have some foot fetish fans upset that he didn't, but I think there is enough hair dropping on his feet to still be titillating.\nAfter the shaving, Troi fucks his face while commanding Antonio to fuck himself with the toy.\nTroi flips Antonio over on the chair and starts spoiling his boy by giving him some head. He replaces the dildo with a butt plug that would stay firmly in place for the rest of the scene.\nAntonio tilts his head back while Troi unloads into his mouth. A few moments later, Antonio jerks his cock until he is nutting all over himself.\nBetween his 'solo' and this Serviced video, Antonio left Austin feeling ecstatic and euphoric!",
  "models": [
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    },
    {
      "name": "Troi",
      "person_id": 3586
    }
  ],
  "release_date": "2016-06-22",
  "scene_id": 8289,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings"
  ],
  "title": "Antonio Cervone & Troi - Serviced"
}