{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is Adam Cub's third video and we are still trying to get him to push his limits. Sorry guys, I am trying!\nI think he is just going to be a great Top only. Of course his body and cock are amazing and he sure knows how to use it! But getting him to be more interactive has been a challenge.\nI know you guys all have loved him from the moment he hit the site. I guess we are just going to wait and see if he will push his limits.\nCooper has not bottomed for a while, and with both their rockin' bodies, I wanted to make sure I paired Adam with Cooper before Cooper goes on hiatus.\nThey start by stroking their own cocks, then jerking each other off.\nCooper then gets down to servicing Adam's big club. Cooper works his cock, teasing and toying with him. He also rims his hole, and I keep forgetting how ticklish Adam is.\nCooper then sits on Adam's huge cock, splitting his tiny cheeks wide! Cooper bobs up and down on his cock, working it like a pro. He spins around and rides him while nestled on Adam's hot body.\nI felt for Cooper who was doing most of the work and was not really able to play with his cock. So we got him doggie-style so that he could stroke and enjoy while Adam hammered his hole.\nI wanted Cooper to cum while that big cock of Adam's was wedged in his hole, so Cooper strokes a load out with Adam deep in him.\nAdam fucks him a bit then pulls out and nuts all over Cooper's hole. He uses his cock to push the load into him, and then Cooper makes him pull out and cleans the load off his cock!",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Adam Cub",
      "person_id": 8139
    }
  ],
  "release_date": "2016-05-27",
  "scene_id": 8297,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Adam Cub & Cooper Reed - RAW"
}