{
  "collections": [
    "ChaosMen"
  ],
  "description": "Clearly Jayce is one of my ringers when it comes to pairing him up with anyone. Hence his appearance at least once a month for the last year. He makes the nervous straight guy comfortable, and never takes their reluctance to suck his dick personally. He remembers being there himself.\nSebastian was only a little nervous his first time out. He really put the whole gay sex thing into perspective and was down with it from the beginning. He's one of those guys that is very secure with women, so is secure enough to let a dude play with him.\nWe didn't get him to suck dick his first time out (maybe next time!) but he sure did like getting his dick sucked. Jayce has really become a great cocksucker, and if he lived locally, I would hire him to take over the Serviced videos. Sebastian's dick really enjoyed the oral treatment.\nI'm always trying to find different things for the guys to do, but still stay in their rather narrow limits. They of course think they are stepping way out of their limit range!\nI just thought the two of them had similar dicks and Sebastian was bone hard and I suggested Jayce jack their two dicks together. A pretty hot visual, that actually turned Sebastian on. He really watches it!\nHe was also eager to fuck ass, as he rarely can get the girls to give it up. He kept saying how tight and hot it felt.\nAs always, Jayce gets in a Zone for the cumshot. Sebastian fills his mouth with his cum and then with it gurgling out of his mouth, Jayce nuts almost immediately. Another stellar ending to a hot fuck scene!",
  "models": [
    {
      "name": "Sebastian",
      "person_id": 3283
    },
    {
      "name": "Jayce",
      "person_id": 3226
    }
  ],
  "release_date": "2008-11-14",
  "scene_id": 830,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Theme - Wrapped"
  ],
  "title": "Jayce & Sebastian - Wrapped"
}