{
  "collections": [
    "ChaosMen"
  ],
  "description": "Zak was not kidding when he said he could swallow some cock!\nInstead of him just getting serviced, we started with Franco and Zak both stroking their own cocks. They eyeball each other's dicks, then start to stroke each other.\nZak's cock was hard first, so he slides on down to nurse on Franco's semi-erect cock. Zak must have some great skills because Franco go hard pretty quick!\nZak just zones out while cock-sucking. You can tell just how focused he is, and happy to have a cock in his mouth.\nWhen it came time for Franco to suck him, it took Zak some time to get hard. It showed me right away that Zak really like seeing and sucking a cock in order to stay in the zone.\nSo Franco flips on to his back and shows-off his hard cock. Giving him some visual stimulation, Zak strokes his own cock until it is hard. He fucks Franco's face with it, but he then leans over and gets Franco's dick back in his mouth. He just can't stay away from it!\nFranco is a little trapped under there, so he fingers Zak's hole. Between servicing Franco and the ass play, Zak was hard and really turned on.\nHonestly, I think all Zak really wanted to do was to get face fucked by a big cock. He gets on his back and drapes his head over the edge so Franco can jam it down his throat.\nThe dude can indeed deep throat!\nFranco pulls out then jerks his cock fast. He spills his load all over Zak's face! Even full-on gay guys are not always eager to eat cum, but Zak loved having the seed on him! I think 'mostly straight' is a stretch. I think we can put him in the full-on bi category. For now.\nAs soon as Franco coats his face and mouth with his seed, Zak ramps up and bust his own load.\nI will ask Zak to come back. He said he wants to start by topping, but given the anal play and his interest in sucking cock, I am hoping he will be a versatile team player!",
  "models": [
    {
      "name": "Franco",
      "person_id": 8102
    },
    {
      "name": "Zak Fit",
      "person_id": 8302
    }
  ],
  "release_date": "2016-07-06",
  "scene_id": 8306,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Franco & Zak Fit - Serviced"
}