{
  "collections": [
    "ChaosMen"
  ],
  "description": "So here is the scoop on this video.\nYes, I am trying find other dudes to do the Serviced videos. I know full well not everyone wants to see me do them all the time. It is challenging 'cuz the guys feel comfortable with me doing them, and I have the experience to make them nut, and I am always available at a moments notice when they finally decide to do them.\nAdd on to that, most of the models are in fact straight, and asking them to blow a dude till they cum is just not in their skill set.\nTeo is local so he has been telling me he is down with taking a few of the guys on, but I'm just not sure he can make a guy nut. He's got foreskin action himself, and though he can blow a guy in a video, he seems a little unsure about how to work a cut dick, especially to the point of cumming.\nEnter Ransom. A hot local Bi guy. He showed up for a solo, but said that it would be no fun to just jerk-off. So we did photos, did the interview, and proceeded to do a Serviced video. Turned out pretty good too.\nI was looking at the schedule. Trying to balance all the releases. Still trying to make sure there is an oral video every Wednesday. I have got this Summer and most of Fall covered. But it's all Meeeeeeeee.\nA couple days after the Serviced video with me, I talked to Ransom about getting his dick sucked by Teo. He thought Teo was hot, and said he'd really like to suck his dick back!\nIn order to have less \"me\" on the site, I shelved the video I did with Ransom (Likely will be a bonus scene on Serviced Volume 2 DVD), and give you guys a break from all my cock sucking.\nThe video seems a little strange as I did put the interview I did with Ransom during the Serviced video, and then it just goes to Ransom and Teo going at it. I like to hear the guys talk, so you can put a voice to the face/bod, and the standby interview is good at doing that.\nThe beginning is kind of funny. Before the shoot, we agreed Ransom would take charge and blow Teo first. Ransom was certain he would get himself easily hard by blowing Teo.\nBut Teo just went for it and tossed Ransom back. Ransom looks a little lost but rolls with it.\nSome really great cock sucking, and geeeeeezzz..Ransom can really suck dick! I think I found another local dude to help with the Serviced videos!\nAnd of course another great timed cum shot and Teo even volunteered for a facial!\nRansom is awesome, and can't wait to work some more with him!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2008-08-20",
  "scene_id": 832,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Long",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Theme - Serviced"
  ],
  "title": "Ransom & Teo - Serviced"
}