{
  "collections": [
    "ChaosMen"
  ],
  "description": "Santino has been getting more into his shoots. I think you can tell by his first videos that he was down for the sex, just not quite 'present'. I remember Glenn's first couple shoots where he just seemed bewildered. Santino is growing as performer much like Glenn did.\nLorenzo has not done a massage video, and I figured this would put Santino in a natural mindset to getting played with. I think Santino is actually quite passive and the thought of doing this scene had him intrigued. He stood their stroking his cock our initial photos, and then again before entering the room for the massage. Like most guys, he is always worried his cock will look small and scared, so he is always trying to keep it up.\nSo, Santino was charged up and ready to go for his intense massage!\nUsually I have porn playing to the side. Astute viewers will catch as they sneak glimpses of the TV. Often it is not to stay erect, it is just that there is a TV in the room, and we are all programmed to watch it, no matter what is playing.\nBut this time I kept the video off, and it helped Santino stay in the moment. There is a lot of chemistry between Lorenzo and Santino, as Lorenzo took charge. So no porn was needed!\nLorenzo oils him up, plays with his hole and his amazing low hanging balls. He rims his hole than puts in a rather large butt-plug. Santino does stress a little before getting fucked, and I might use this trick on him in the future. Once Lorenzo got it in him, he was enjoyed having a toy stuffed in him while sucking Lorenzo's cock, and then getting his own cock sucked. It loosened him up, but more importantly, it really turned him on.\nHaving the toy inside him also made his first time sitting on Lorenzo's cock a breeze. He pulls out the toy, and slides Lorenzo's cock in like a pro. Lorenzo was turned-on twice as much seeing Santino enjoy getting fucked by him! Even though Lorenzo was on his back, his 'Topping' skills really shined!\nNext Santino fucks Lorenzo on his back. I have some really nice overhead shots of Lorenzo getting fucked, and his body looks amazing as Santino hammers his hole!\nOur final mission was to get Santino to cum from getting fucked. I believe a first for him.\nSome models obviously take a lot ramping up to cum, but with Santino, he goes into lightning fast jerk mode, cumming in less than 3 minutes. It is definitely a skill that we producers enjoy having, but we had never put it to the test while he was getting fucked.\nLorenzo fucks him for a bit, but falls out as Santino flexes his legs while orgasming. He tries to keep it in, but Santino orgasm is just so intense. It's up to you to decide if that counts as getting fucked while cumming. But Santino got that extra boost from getting fucked and cumming because he was shocked at how intense it felt.\nNormally I would love to get a creampie, but getting Lorenzo to cum is easiest with a cock in his ass.\nSo the race began to get Lorenzo cumming before Santino went soft. Santino scoops up some of his own load, and lubricates his cock with it in order to fuck Lorenzo.\nHe pounds his hole for only about a 3 minutes before making Lorenzo nut, his own cum still dripping from his stomach as pounds Lorenzo!\nSantino pulls out so that Lorenzo can clean his cock and lick the last bit of cum from Santino's body!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Santino",
      "person_id": 8135
    }
  ],
  "release_date": "2016-07-15",
  "scene_id": 8326,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - Middle Eastern",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Lorenzo & Santino - RAW"
}