{
  "collections": [
    "ChaosMen"
  ],
  "description": "This has got to be one of the best TagTeam or Pure videos on the site!\nWith Jonas now being an Out gay guy, Gerard's sexual intensity, and Antonio's submissiveness, this made for a perfect blend of three hot guys really into each other.\nYou will notice that Gerard is struggling to not cum through most of this video. I feel like he is a lot like Jet, a very quick cummer, but he is worried he might need 10-15 minutes of recovery.\nThere is a great OutTake at the end, so stay-tuned for that.\nEven while getting head, Gerard would have to push either Antonio or Jonas away to avoid nutting too soon.\nBoth Antonio and Jonas love sucking dick, so we started with that. Gerard is a sexual dynamo and took turns sucking both his buddies while he got serviced.\nThey daisy chain suck each other, and there is a moment where Gerard realizes that Jonas did not get into the right position. He smiles up at me and I am making a motion to just grab him. It's cute and I left it in the movie itself.\nNot only is Antonio a professional cocksucker, but he is also a fantastic bottom. But with Gerard on the edge of cumming so quickly and having a massive cock, I gave Jonas first dibs at fucking Antonio's ass. Antonio is thrilled to have both his holes filled.\nGerard was still having problems holding back from nutting, so he let his cock go down and switched places with Jonas. He sucks on Antonio's hole, rimming him like an expert, revving his cock back up to penetrate him.\nAt this point, even stroking his cock slightly soft was getting him close. He goes to shove it in when a load just explodes out of him! Ooops!\nBut once he creamed his hole, he got fully hard, and fucks his cum into Antonio! I guess he just needed to get his first load out of his system!\nWith his cum dripping down his cock, he rams him really good then invites Jonas to come fuck Antonio's sloppy hole.\nAntonio cleans Gerard's cock, while Jonas then flips Antonio onto his back. This gives Gerard a chance to suck on Antonio's cock while he is getting fucked.\nGerard's dick was spent by then, so he spun around and sat on Antonio's face. While getting rimmed, he reaches back and keeps Antonio hard. With a little recovery time, Gerard is back in the game, fucking Antonio's face.\nThey spin Antonio in place so that Jonas could fuck his face, and with Gerard's reloaded cock, he fucks the hell out of Antonio.\nJonas jerks his cock and unloads right into Antonio's mouth.\nThose of you who watch these videos know I love it when all the guys cum at once, so I kept my camera going. There is little hiccup as I pan up to give you a view of Jonas and Gerard kissing, but then decided that Antonio was going to bust and that I had better keep my camera aimed at Antonio's cock.\nWith Jonas's load all over his face and Gerard pounding his hole, Antonio busts a huge load. Gerard keeps fucking and seconds later bust his second nut of the day!\nI feel so lucky when this happens, and I hope you can tell by my edit how fantastic the big finale is!\nMagic!",
  "models": [
    {
      "name": "Gerard",
      "person_id": 8279
    },
    {
      "name": "Jonas",
      "person_id": 3589
    },
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    }
  ],
  "release_date": "2016-07-22",
  "scene_id": 8335,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - African American",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Pure",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Antonio Cervone & Gerard & Jonas - Pure"
}