{
  "collections": [
    "ChaosMen"
  ],
  "description": "This one has a crazy funny ending!\nI know you guys like to skip to the end, but you gotta spend a little time watching extra nervous Chance slowly melt into the blow job. It took a few times of me whispering \"relax\" and \"breathe\" but he finally got into it.\nI was really surprised that Chance was so stiff and nervous. He's got several gay friends, and didn't seem worried, but boy when he sat down he was all but frozen in his seat.\nWhat didn't surprise me was what a crazy shooter he is. If you remember from his solo, ropes of cum goes shooting out of this guy.\nDuring the cumshot I try to balance it out so that fans of cum eating know that a couple squirts go down the back of the throat, but then pull away in time so you can see him nut. It's surprisingly challenging to make sure it all plays out well.\nThis time I was bound and determined to take a full on facial. I actually have a video that I haven't aired (perhaps a bonus on a DVD) that has the same thing, but I jerk back so hard with surprise, that it is hysterical. My friends previewed and rolled around on the floor laughing so hard that I thought, \"Ok, not the effect I want.\"\nI realized that I had better switch from oral to fast jerking, and lined myself up for the firing squad.\nThis time out, Chance is the one stifling the laughs, as he just cum and cums and cums like a sprinkler head, coating my hair, eyelashes and dumping a huge pile on the comforter. It's craaaaaaaazy!\nAnd this time, I didn't flinch!\nEnjoy!",
  "models": [
    {
      "name": "Chance",
      "person_id": 3286
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2008-10-08",
  "scene_id": 834,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Chance - Serviced"
}