{
  "collections": [
    "ChaosMen"
  ],
  "description": "Justis really dives in to this video!\nSean starts by playing with his cock through his shorts, but Justis is hard and ready to go. He looks around uncomfortably, not really sure where to look, but VERY turned on.\nDespite Justis saying he is straight, I am going to toss him in the 'bi, at least' category for now. He was very comfortable, and shaking with excitement, very much like we all did during our own first times.\nI know 'first time' videos are dubious, but he swears he has never done anything with a guy, so perhaps he has been saving-up for a situation where it would be \"just a job.\"\nRegardless, Sean works his cock like a pro. He gets him on the couch to really attack his dick with his mouth.\nSean stands up to give Justis access to his cock. Justis tries sucking dick for the first time. He goes at it with gusto. There is a glimmer of skill, but it does seem like he is still learning the ropes. He sucks on Sean while stroking his own cock, enjoying having a cock in his mouth and trying to please Sean.\nThen Justis gets his ass rimmed, and he sure does pop that ass of his out for the licking. Future bottom? He does look a little uncomfortable at first, but he eases into it, and his cock definitely liked the extra attention.\nJustis then fucks his face, trying to get close. I think the angle was a bit too hard to navigate, so he stands upright and jerks his cock until he sprays all over Sean's face.\nSean stands up quickly and busts his own load all over Justis's spent cock.\nNot wanting to leave a mess, Sean gets on his knees and cleans all that delicious cum off!\nJustis said he had a great time, and is excited to try more, so I will definitely try to get him back in!",
  "models": [
    {
      "name": "Justis",
      "person_id": 8336
    },
    {
      "name": "Sean Peyton",
      "person_id": 8158
    }
  ],
  "release_date": "2016-08-24",
  "scene_id": 8340,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Justis & Sean Peyton - Serviced"
}