{
  "collections": [
    "ChaosMen"
  ],
  "description": "Since Whitaker is somewhat local, it took me a couple weeks to have him drive back in and do the oral video. I was a little worried I would not get his second video.\nHe was very nervous about doing it. Like many of the straight guys, they are fine with getting their dicks sucked in private, but putting it on the Internet took him some time to think about following through.\nCooper was in town to do another scene, so I called Whitaker up last minute to see if he wanted to make it happen, and sure enough he was down to play.\nBoth guys are super friendly, and once they met, Whitaker relaxed a little. He also was interested in Cooper's workout routine and they traded tips.\nAs far as getting started, you can tell Whitaker was really unsure what to do. Cooper just blithely pushes him to play with his cock then begins servicing him. Whitaker's eyes dart about, not sure what to think, but his cock was in it to win it.\nHe was also nervous about getting rimmed, but he eventually got into it.\nWhitaker shined most when he was standing and able to fuck Cooper's face.\nCooper has had a lot of cum on his face over the years, but Whitaker coats his face with a load like no other! Whitaker sure can make a lot of jizz!\nCooper cums seconds later, while licking on Whitaker's spent cock.",
  "models": [
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Whitaker",
      "person_id": 8330
    }
  ],
  "release_date": "2016-07-27",
  "scene_id": 8345,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Cooper Reed & Whitaker - Serviced"
}