{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video is likely one of the best TagTeams ChaosMen has ever produced!\nEveryone gets fucked in this video, including Jeremiah's bottoming debut!\nAll three guys are super hungry for each other, and there is so much kissing and ass to mouth, your head will spin! You will have to watch this one over and over!\nAntonio starts by servicing both the guys. Cooper and Jeremiah make-out while getting their dicks sucked.\nNext it was Antonio's turn to get his dick sucked by Cooper, while Jeremiah blows Cooper's uncut cock.\nJeremiah has always been an aggressive Top, and after getting Antonio doggie-style, we see he can also fuck a face just as hard. Antonio barely keeps up with the face-pounding, but wow, he sure can take it.\nCooper rims Antonio, getting his hole all wet and slicked up. He slides his cock in so that Antonio is getting rammed at both ends. Jeremiah spins around so Antonio is made to eat his hole while getting fucked.\nWith Jeremiah's thicker cock, it was time to spread Antonio's hole wider. They swap places, and Jeremiah attacks his hole with his cock. Cooper gets his cock cleaned by Antonio, and then later stands over Antonio so that Jeremiah can suck him while fucking Antonio.\nJeremiah flips Antonio on his back and then helps Cooper to sit down on Antonio's cock. Antonio is mostly a bottom, so this is his first time fucking a dude on film. I was a little worried he would be wobbly, but with Jeremiah sliding his cock in his hole while he fucks Cooper, he has no problems staying hard. Antonio is in bottom boy heaven!\nJeremiah slides his cock out of Antonio and even wedges his dick into Cooper's tight hole!\nJeremiah takes a cock for the first time on film. He has always thought of himself as a Top, but has been practicing his bottoming skills and was super eager to take a cock. Cooper plunges into his hole, while Antonio sucks on Jeremiah's cock. Needless to say Jeremiah will be an eager bottom in the future!\nI wanted a double cream-pie ending for this, so Cooper fucks Antonio until he lays some ropes all over his hole. After nutting, he goes to get his cock cleaned while Jeremiah uses the cum to fuck Antonio!\nCooper's cum is oozing out the sides of Jeremiah's cock, who fucks him right to the last second and dumps his load on and into Antonio.\nWith two loads dripping out of his ass, and Jeremiah fucking the load in, I could hear Antonio getting close to cumming. I scramble up quickly and catch him busting his load! Perfect timing!\nCooper laps up all the cum, cleaning both their cocks, then goes up to Jeremiah and swaps a cum soaked kiss!",
  "models": [
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    },
    {
      "name": "Cooper Reed",
      "person_id": 3592
    },
    {
      "name": "Jeremiah",
      "person_id": 7606
    }
  ],
  "release_date": "2016-08-05",
  "scene_id": 8354,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Antonio Cervone & Cooper Reed & Jeremiah - TagTeam RAW"
}