{
  "collections": [
    "ChaosMen"
  ],
  "description": "Yet another super hot TagTeam video!\nThese 3-ways have been scorching hot! Perhaps it is Gerard and his crazy sexual energy. Or is it because Santino is fascinated by Gerard's big cock? Or could it because Wren, who has been hitting the gym, has a sharp new hair cut that harkens back to when he first got started?\nWren is the bottom boy in this video, with Santino taking some cock as well. Gerard and Santino start by servicing their bottom. Santino attacks his cock, while Gerard rims Wren's hole. I love the undershot on this one, especially seeing Wren's face as he is being orally treated front to back!\nGerard helps Santino suck on Wren's ever growing cock, then goes down on Santino who keeps working on Wren's dick.\nGerard's cock needed some attention, so Wren starts sucking Gerard's uncut cock. Santino climbs up on the bed so Gerard would have a cock to suck while his own cock was serviced by Wren. Next both Santino and Wren get on their knees and take turns sharing Gerard's amazing uncut cock.\nThey get Wren on his back, and Gerard rims his hole while Santino sucks his cock. Gerard gets his hole all lubed up and slides his cock into Wren's eager hole. Wren nurses on Santino's low-hanging balls while he gets his ass pounded.\nSantino then takes a stab at Wren's ass, while Gerard sucks on Wren's cock. Poor Wren! But he is loving having both guys ram all his holes with abandon!\nSantino gives him a break by sitting down on Wren's cock. Now at first, Santino wanted to be fucked by Wren because he thought Wren would be smaller, but once faced with seeing Wren fully hard, he was not sure if he had made the smaller choice.\nHe does his best to ride it, while Gerard encourages him and sucks his cock.\nSantino spins around and sits on it properly, Wren's cock barely wedged into his tight hole. Gerard stands over him, feeding him his cock so that both of Santino's holes are filled. After that, Gerard goes back to fucking Wren, while Wren fucks Santino.\nThis turns on Gerard so much that he gets close to cumming. He fucks Wren right up to the moment he is about bust, pulls out and squirts once to paint his hole, and then plunges his spasming cock back into his hole. The key word is spasm, as his cock pumps a giant load into Wren.\nSantino slides in quickly to use Gerard's cum as lube and fucks him until he pulls out and jerks his cock and gives Wren another coating of jizz, also dumping the rest inside of Wren.\nFilled with two loads, Wren quickly and easily busts his own load. Gerard was telling him he is a good boy, kissing him just as he was cumming.\nGerard slides down and cleans both boys cocks!",
  "models": [
    {
      "name": "Gerard",
      "person_id": 8279
    },
    {
      "name": "Wren",
      "person_id": 3581
    },
    {
      "name": "Santino",
      "person_id": 8135
    }
  ],
  "release_date": "2016-08-26",
  "scene_id": 8363,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Middle Eastern",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Gerard & Santino & Wren - TagTeam RAW"
}