{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jet had been hitting the gym hard so he sent some updated pics. Wow! Jet is looking great! I know the start age on the site does not update, but he is now 31, and he is only getting better with age. Very handsome!\nOliver also stepped up his workout routine. He showed up more ripped and with a scruffy beard that he had when he submitted his pics to me. He is looking mighty handsome as well.\nSometimes, I have very mismatched pairings, but these two look great together.\nFor his first time filming, Oliver only wanted to top, which of course works great with Jet who loves to bottom.\nI knew Oliver had sucked dick before in his private life, but we didn't get any of that on his first visit, so I had him down on his knees servicing Jet first thing out of the gate! He does a fine job working on Jet's thick cock.\nOver the years, Jet has worked on his own cock sucking skills, and stills loves to see how far back he can jam a cock down his throat. It's always hot to see him succeed!\nWe get a couple cum shots out of Jet. One of his favorite things to do is cum on the cock that is fucking him, and he uses his own cum as lube. Jet rides Oliver's cock until he is close, then pulls off then unloads all over Oliver's dick. He uses his hand to totally coat his cock, then slides back on it, making a creamy mess.\nThey switch to Jet on his back and there is just white creamy cum leaking out all over Oliver's cock. The OCD part of me wanted to stop and clean it up, but I thought it was hot to see all that cum being used to keep Jet's hole slick.\nOliver fucks another load out of him, and then uses his cum to lube up his cock some more. He busts a load all over Jet's hole, breeding Jet like a pro.\nJet drops to his knees and cleans all three loads off of Oliver's dick!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Oliver King",
      "person_id": 8324
    }
  ],
  "release_date": "2016-08-12",
  "scene_id": 8368,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Jet & Oliver King - RAW"
}