{
  "collections": [
    "ChaosMen"
  ],
  "description": "Franco seems to be coming to terms that sex with dudes actually feels good. He has been sheepishly admitting to me that getting fucked feels REALLY good.\nDespite often telling his partner to take it slow or having a hand down on his partner's thigh so he doesn't go in too deep, he seems to be in to it. Getting fucked makes him cum easy and he so he was ready to get ambitious.\nI setup a 3-way with him, another model, and Vander, but the third guy could not get off work. So it was just going to be Franco and Vander. Franco looked Vander up on the site, and then a string of worried emails flew my way.\nHe saw how big Vander was and was super worried he couldn't take it. I calmed him by telling him that Vander prefers to get fucked so most of the video would be him fucking Vander. Franco could just let Vander fuck him in one position. Pretty much what I had in mind for the 3-way anyway.\nSo he was nervous, yet fascinated by Vander's thick cock. When he got started, he tried to get it in his mouth right away. When they are 69ing, you can tell Franco is doing his best suck and stroke Vander's massive wood.\nFranco fucks Vander first, and then it was time for him to take the biggest cock he has ever had. Ironically, I never hear that Vander is hurting guys. He IS thick, but kind of spongey, and I don't know, some guys with thinner cocks are BONE hard and I think that can be painful.\nWe have seen Vander unleash his fucking skills in many videos, but you can tell he is taking it easy on poor little Franco.\nBut, Franco is a champ, and now he knows there is no mountain too high for him!\nFranco also fucks Vander right up until he cums, another new skill for the new guy!",
  "models": [
    {
      "name": "Franco",
      "person_id": 8102
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2016-10-07",
  "scene_id": 8387,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Franco & Vander - RAW"
}