{
  "collections": [
    "ChaosMen"
  ],
  "description": "Alonso is one of the few models that I ever have approached at the gym.\nWe seem to have the same workout schedule, and often ended up changing and showering at the same time. I could clearly see he was very hung, and not shy. I'm not one to chat with a bunch of guys at the gym, and Alonso keeps to himself also so I knew I had to find the right time to talk to him.\nI didn't really know how to approach him, but I decided it was time to get some business cards so that I could actually approach him with something that looked legit.\nWe finally had a moment where I didn't think he would feel uncomfortable, and asked him if he thought about doing adult video. He laughed and he said, \"Sure!\"\nSo I gave him my card and figured I would not hear from him. Way back when I first started I would occasionally try to find models this way, but it never seemed to work out.\nBut I got a text from him about 45 minutes later, and I spent some time texting him that it was legit. The next day we met at restaurant in the shops that the gym is in, and got some personal history and sold him on the idea of doing a solo and an oral video, possibly more.\nHe seems fluid with what he likes. More into girls, but likes stroking or even sucking guys, but has never taken it beyond that. He has been married twice, and has sworn off getting married again, and seems to exploring messing around with guys.\nI had that weekend free, so only a couple days later he was up at the studio busting a nut for us. It is a huge nut and he was very turned on being filmed.\nYou will notice a lot of extra photos sets. Since he is local, we spent a morning trying to get some shots outside the studio. Something I rarely have a chance to do and miss terribly.\nI hope you enjoy Alonso. He has a ripped body, and a long thick uncut cock that makes my mouth water!",
  "models": [
    {
      "name": "Alonso",
      "person_id": 8394
    }
  ],
  "release_date": "2016-09-26",
  "scene_id": 8395,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - African American",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Shaved",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alonso - Solo"
}