{
  "collections": [
    "ChaosMen"
  ],
  "description": "This summary is really more about Caley and his mission to take on a HUGE challenge.\nI would get emails from him asking to come back, and he said he was down to get fucked. Caley is definitely Bi, and like many Bi guys, he is fascinated with the one thing a girl can't give him, a cock in his ass.\nA few of the emails would come in overnight, so they were middle of the night messages that sounded like he was horny and thinking of hot things to do. I wasn't sure if he was serious, or just fantasizing.\nHe had a trip overseas planned, and was going to be gone for a many months, but I couldn't get him in before he left.\nWhile waiting for his return, I continued to get an occasional email saying he thought he could take two cocks, and that he really wanted them to be hung. His emails became more serious, and I realized he was really looking forward to actually shooting a video.\nCaley finally returned, so I tried to setup a hung TagTeam video with Caley the center of attention, but one guy failed to show up. That left Caley working only with Bentley.\nNow Bentley is quite hung, and I figured Caley would not be disappointed.\nTurns out, it was way more cock than he thought. Bentley had to go slow and easy on him.\nI asked Caley after this shoot if he was glad it was not a double penetration scene after all. He said, \"Yes! I guess I have been messing around with guys with smaller cocks, I can't imagine taking two of them!\" He then requested smaller cocks for future videos.\nHe does a pretty good job taking Bentley's cock. Clearly he is both struggling with handling it, but also very turned-on!\nMaybe in the future we can see if we can get two cocks in him, but for his first sex film, Bentley was more than enough!",
  "models": [
    {
      "name": "Bentley",
      "person_id": 3486
    },
    {
      "name": "Caley",
      "person_id": 7816
    }
  ],
  "release_date": "2016-09-09",
  "scene_id": 8399,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Bentley & Caley - RAW"
}