{
  "collections": [
    "ChaosMen"
  ],
  "description": "So Sebastian fucked Jayce last, in which I tried to steer him towards sucking Jayce's cock, but he just couldn't get past it.\nThis time when I picked him up for the shoot I said, \"Alright, this time you need to suck some dick!\" He said he would give it a try.\nTeo is used to by now helping the guys get oriented with male-on-male action. And he of course has an amazing uncut dick (which does through the straight even more off a game they have never played)\nSebastian and I actually talked a bit about what he should try, dealing with foreskin, and some pointers to helping Teo's dick grow.\nI basically edited the blow job in real time, which may bore some of you wanting to see fucking, but I thought it was hot to see Sebastian make Teo's dick grow all on his own.\nThey 69 for a bit, and Sebastian really got off to having his dick sucked and a cock in his mouth. (He said his mindset was to imagine like when he was a kid and tried to suck his own dick, but couldn't)\nSome really hard fucking as Teo can take it pretty good now, and Sebastian was pleased he could really ramp it up fast and furious. He was even more turned on that Teo was hard and enjoying it. It left him wondering if maybe he could try bottoming in the future.\nI don't know if Sebastian was hitting Teo's prostate, but this was Teo's first time that he turned to me and basically said, \"Yikes, this is really starting to feel good!\" and it kept his dick hard and near busting through out most of the video.\nIt took about 6 films, and now I think he will look forward to the added sensation.\nNice nut shot as Teo cums all over Sebastian's cock. Teo got some distance this time too!",
  "models": [
    {
      "name": "Teo",
      "person_id": 3261
    },
    {
      "name": "Sebastian",
      "person_id": 3283
    }
  ],
  "release_date": "2009-01-23",
  "scene_id": 840,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def"
  ],
  "title": "Sebastian & Teo - Wrapped"
}