{
  "collections": [
    "ChaosMen"
  ],
  "description": "Antonio is such a great cocksucker AND an amazing bottom. His first two videos were TagTeams and it was clear he could take on just about anything.\nThis was supposed to be another TagTeam, but my luck on setting these up is still Hit or Miss. We all waited at the airport for the 3rd model's 45 minute delayed flight and turns out he never got on it, and have not heard from since. Ahhh, The pain of running an adult site.\nIn a way I was glad to give Antonio a break and for him to not be overshadowed by two power tops. But given his hunger for cock in both of his holes, I am sure I will be back to having him power-fucked by two Tops.\nThis was Zak's first sex film. We had tried to get him in the month before and days before his shoot, he realized he could not get off from work. Hence the major delay in his full-performance video.\nZak is also a lot more hung than I had remembered. He is a little guy at 5'6\" so I guess I underestimated his cock size. Antonio was joyfully stretched to his limits, but I suspect if this had been a 3-way, we would have worn him out.\nAntonio gleefully sucks Zak's fat cock, showcasing his ability to swallow a giant sword to the hilt. Zak, who is proud of his own cock sucking skills, was not to be outdone, and eagerly attacks Antonio's cock with his own throat.\nAntonio also loves to please his Daddy, so he rims Zak's hole while Zak strokes his cock until it is at full mass. Once charged-up, Antonio sits down on his fat dick, straining his hole to the max.\nI love having an eager Bottom who is using his ass to best please his Top.\nAnd Zak is an excellent Top too! For a Bi guy, he clearly has had a lot of practice with both sexes. He has great skills and energy!\nZak jerk his cock and unloads inside of Antonio. Having his load deep inside of him, Antonio jerks his own cock until he spills out his own load!",
  "models": [
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    },
    {
      "name": "Zak Fit",
      "person_id": 8302
    }
  ],
  "release_date": "2016-09-30",
  "scene_id": 8402,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Antonio Cervone & Zak Fit - RAW"
}