{
  "collections": [
    "ChaosMen"
  ],
  "description": "It is going to be interesting to see where or even if Daniel lands in one spot on the sexuality meter.\nPicking porn for him to watch went from hot girl action, African-American guys pounding twinks, to transsexual videos. All of which seemed equally appealing to him, but I think the guy-on-guy stuff worked best for him.\nBased on how he acts in this video, you can tell he is a passive Bottom. He gets most turned-on with his ass in the air, waiting for someone to rim and play with his hole.\nDaniel wasn't kidding when he said he liked to get fucked!\nSo we get more than a glimmer of what his specialty will be. Power Bottom!\nLorenzo does a great job making him comfortable, and he even got Daniel to suck on his cock.\nAfter flipping Daniel on his back, Lorenzo works to get Daniel hard, but after not making progress, he slides a butt-plug into Daniel and that does the trick.\nDaniel's cock looks extra big after getting that toy in there. There were a couple times when he almost ejaculated too soon, so that toy was hitting the right spot.\nLorenzo jacks his cock really hard, trying to get him to cum, but Daniel needed a little more anal stimulation. He reaches down and fucks himself with the toy.\nBetween Lorenzo's jerking, and ass butt-plug penetration, Daniel busts a thick creamy white load!",
  "models": [
    {
      "name": "Daniel",
      "person_id": 8418
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2016-11-02",
  "scene_id": 8429,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Trimmed",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Daniel & Lorenzo - Serviced"
}