{
  "collections": [
    "ChaosMen"
  ],
  "description": "I was a little surprised when Mika said he would come back and do a Serviced video.\nHe seemed curious, but not too curious. When we first spoke, he thought maybe he could suck back.\nI chose Teo for him to play with, mainly because their cocks are so similar, and that maybe playing with Teo's uncut dick would be familiar territory.\nAs the days got closer, the more nervous he got, and by the day before the day of the shoot, he was just wanting to receive head.\nOf course Teo doesn't care, but we set the video up as a side-by-side jerk-off, hoping to get Mika to reach out and play with his buddy's cock. Alas, he stuck to his limits, but does a fine job staying hard and in the moment.\nTeo throws a lot of energy into keeping Mika hard, trying to see how close he could get him.\nTeo rims him, and it gets a little awkward as Mika was not expecting some anal attention. I am sure Teo's whiskers tickled too!\nBest moment in this scene is when Mika fucks Teo's face while he is on his back, head draped over the edge of the bed. I don't think Teo has ever had a cock that far down his throat before, and I believe Mika was enjoying making him gag on it! He had a devilish smile much of the time!\nMika jerks his cock and unloads thick ropes of cum on Teo's face. Teo, who was trying to time his cum shot, suddenly remembered cum on his face was not his favorite, and kind of lost his inertia.\nAs for Mika, he did say later that day he was down to fuck a guy, but as a couple days passed, he got less enthusiastic. I would love to have him back. This guy is a total package. Mika has a hot body, very handsome, and great uncut cock! But as of this writing, he is still debating on his limits.",
  "models": [
    {
      "name": "Mika",
      "person_id": 8435
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2016-11-16",
  "scene_id": 8462,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Trimmed",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Mika & Teo - Serviced"
}