{
  "collections": [
    "ChaosMen"
  ],
  "description": "Caley bit-off way more than he could chew when it came to getting fucked on screen his first time with Bentley.\nHis emails when he was discussing doing his first scene were all about \"The bigger the better\" and \"I can likely do double penetration!\"\nWell after being hammered by Bentley, he decided to aim a little lower. Apparently what he thought were big cocks he had taken, were not really all that big.\nSo this time out he requested a more average-sized dude so he could enjoy the prostate massage rather than being split in two. Perhaps he can step-up to bigger cocks as we move along.\nWe managed a Goldilocks moment, where Oliver's cock was juuuuuust right for Caley's eager hole.\nCaley is naturally passive and loves to service a dudes' cock as well as get fucked by it. He is fairly quiet, but you can tell he is enjoying it.\nWhile Caley is not a great cock sucker he certainly is eager to do it. He has had very little guy-on-guy experience, and that was mostly getting fucked. He has spent most of his time fantasizing about dudes, with only a few real life experiences to help improve his skill set.\nNow on the other hand, Oliver may not have had a lot of experience with guy, but he fucks a lot of girls, and his skills certainly translate over to guys. The dude can fuck!\nCaley gets the cum fucked out of him, while Oliver juices his hole and breeds him good. Caley's load is not huge, but Oliver more than makes up for it by coating his ass with loads of jizz!",
  "models": [
    {
      "name": "Caley",
      "person_id": 7816
    },
    {
      "name": "Oliver King",
      "person_id": 8324
    }
  ],
  "release_date": "2016-11-24",
  "scene_id": 8464,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Caley & Oliver King - RAW"
}