{
  "collections": [
    "ChaosMen"
  ],
  "description": "Daniel intrigues me as far as his sexuality goes.\nPinning him to one sexuality is going to be tough. He really likes the ladies, especially African-American women, and for guys, he likes Latin and African-American dudes. Since he likes both sexes, he tends to ask for Trans-themed videos to be playing in the room. It has a little of everything for him to enjoy.\nHe is a bit obsessed with getting his ass fucked. According to him, the bigger the better. I recently had an issue with Caley shooting with Bentley, who also specified a huge cock for his first film. I learned quickly that his version of huge would be considered average. Porn production definitely lures in the extra big cocks that are fewer and far between in the wild. When on set, the guys are really surprised what an extra big cock is REALLY like.\nSo I set Daniel up with Ledger. Despite identifying as straight, he is a dang good Top, and honestly, gives better head than pansexual Daniel. The guy has got skills! But he is more in the average sized cock arena, so just in case Daniel was having fantasies of a big cock fucking him, but the reality would be too much, Ledger was a perfect start.\nAnd it turns out this was a good thing. It took Daniel a bit to accommodate Ledger's cock. But once settled in, the dude clearly loves to be fucked!\nHe cradles himself up so he can wrap his arms around his knees, holding his legs back so that Ledger can get full penetration while he still can jerk his cock.\nLedger shines in this video too! I said it earlier, but the dude has got skills, and despite a lack of kissing or rimming, he just has a sexy Dom Top vibe that can only be explained by his body language.\nGetting both guys to cum was easy. Daniel had to stop a couple times or risk cumming early, and with Daniel able to take some full force fucking, Ledger was also fighting back the urge by pulling out and waving his cock around Daniel's hole.\nSure enough, Daniel busts a huge load, shooting his load past his head while Ledger pounds his hole.\nLedger then coats his hole with his seed, then shoves it deep inside of Daniel.\nWe even get Daniel to clean Ledger's cum-soaked cock!\nDaniel will be back in a couple weeks to take on some really Big Black Cock, so stay tuned to see if he can handle being split in two!",
  "models": [
    {
      "name": "Daniel",
      "person_id": 8418
    },
    {
      "name": "Ledger",
      "person_id": 8346
    }
  ],
  "release_date": "2016-11-18",
  "scene_id": 8473,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Daniel & Ledger - RAW"
}