{
  "collections": [
    "ChaosMen"
  ],
  "description": "Daniel was really hoping to work with an African-American guy, and just as I was starting to work with him, Alonso and I met at the gym and we started filming his solo and oral. The timing was fortuitous; though Alonso was not sure he wanted to do full-on sex scenes.\nSo I set Daniel up with Ledger and got them on the calendar. Of course, a couple days later Alonso says he was down to fuck a dude and thought Daniel was hot. So I changed Daniel's flight to leave a couple days later so Daniel would have a chance taking on Alonso's BBC.\nI am so glad I paid the extra fees to have Daniel stay to get fucked by Alonso! Wow!\nAlonso is a natural bossy Top. His verbal skills are amazing and geez, that cock is humongous!\nDaniel had been practically begging to work with a big black cock, but I feared he might not have as much experience with big dicks as he was claiming. Actually, he was claiming he did NOT have a lot of experience, but it was more like something he really wanted to try and that he would be great at it.\nAlonso sure knows how to suck cock with enthusiasm and you can just tell he will be a great Top.\nFirst, I had Daniel sit on Alonso's cock so he could go slow and easy. There is a little bit of wincing now and then, but Daniel took it all in pretty much one try.\nIt is hot to watch him get fucked. You can tell he is going from pain to pleasure from minute to minute, but never once stops to say it is too much. The dude CAN take a big cock!\nAlonso fucks the cum out of him, and the jizz flies across his body, splattering everywhere.\nI told Alonso to just fuck him until he cums, so poor Daniel gets hammered until Alonso fills him up. A proper breeding with cum oozing out his hole!\nYou have to check this video out. Alonso has great bossy energy, while Daniel is very subservient. It truly was a perfect pairing!",
  "models": [
    {
      "name": "Daniel",
      "person_id": 8418
    },
    {
      "name": "Alonso",
      "person_id": 8394
    }
  ],
  "release_date": "2016-12-09",
  "scene_id": 8479,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - African American",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alonso & Daniel - RAW"
}