{
  "collections": [
    "ChaosMen"
  ],
  "description": "I mentioned in the summary for Jackson's blow job video that he had texted back right away, saying he was down to try anything.\nI was a little dubious the oral was his first time, and him ready to jump in to getting fucked added the idea he might have some 'at home' experience. Although, in his oral video, he clearly was not smooth and by no means a pro.\nSo I setup a flip-flop video with Franco. I asked Jackson if he ever had his ass played with and he said no. So I thought maybe having him bottom for one position would help break him in.\nAs in his previous videos he was fairly passive, and that pattern continued. Franco takes control by sucking his cock, and Jackson returns the favor, more skilled than before.\nFranco plays with Jackson's cock and his hole, getting him loosened up for his cock.\nJackson struggles for a little bit, but he seems perfectly happy getting fucked.\nNow Franco was a little intimidated by the size of Jackson's cock, so he was keen on doing all the fucking in this video. And with Jackson taking to bottoming, he fucks some more on his back. Jackson stays hard and turned on, so he is definitely a great Bottom.\nHowever, I did want to see Jackson's thick cock inside of Franco. We tried unsuccessfully to get him fucked on his back, but swapped it out so he was doggie-style. That position worked great with the downward curve of Jackson's cock, and Franco was actually thrilled with the feeling! Seriously, he was shocked that the his thick cock felt great!\nI actually don't think Franco lasted very long getting fucked in that position. It just felt too good. I guess that curve was hitting him in all the right spots? His cock was straining not to cum. Franco, who was nervous about how thick Jackson's cock was, said it was the best it had ever felt.\nHe cums 'accidently' while I am under there filming him getting plowed!\nIt takes Jackson a bit to play catch-up, but successfully creampies Franco's hole!",
  "models": [
    {
      "name": "Franco",
      "person_id": 8102
    },
    {
      "name": "Jackson",
      "person_id": 8441
    }
  ],
  "release_date": "2016-12-07",
  "scene_id": 8496,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Franco & Jackson - RAW"
}