{
  "collections": [
    "ChaosMen"
  ],
  "description": "I love this Serviced video!\nAt first blush, it is much like any video with a straight guy being serviced. Disclaimer, I just go with whatever sexuality they say they identify with. You and I both will form an opinion, but my guess is Ron has to be at least Bi.\nRon was worried about this shoot, but once on set, he was super turned on. He glances around a fair bit as we are filming, distracted by me moving about, but not a glimpse at the straight porn playing for him. A couple of the glances were looking at me, and I believe he was worried he might cum too soon. I will explain shortly.\nHis cock looks to be 8 inches in this too. It is a long fuck stick. Or in this case, a suck stick!\nSean goes to town on it, servicing his rod, balls, and hairy hole.\nI don't know how many of you just scrub to the end of these videos for the cum shot, but there are some especially hot moments that you might miss if you do that.\nAt 7:30 we finagle Sean so Ron has access to play with his cock. I often tell the models that if they can suck back, then give it a try. So we always give them an opportunity. Put a little bait out to see if they will bite.\nAt that time frame, he is now presumably for the first time, playing with another dude's cock. Now Sean is at an awkward angle, perhaps not the best to make someone cum. I think that playing with another dude's cock really excited Ron, because he has a moment of terror thinking he might cum too soon.\nWatch as Ron pushes Sean away a couple times because he was getting too close to cumming. I don't think Sean even realized why he was being brushed off, as he kept attacking his loaded weapon.\nYou even see a bit of pre-cum form on the head, Sean doesn't even spot it from the angle he is at, but my camera easily caught. I knew we might be in trouble if Sean didn't ease up on him.\nI directed Sean to focus on his balls, and that gave Ron some time to scale back, but that was it for him playing with Sean's cock. Was it too exciting to even attempt to suck?\nThe other moment I like is just watching Sean work his cock until Ron cums. Ron doesn't make a lot of noise, but does whisper, \"I'm gonna cum.\" So Sean grinds faster on his cock. Since he goes silent, Sean is taken a bit by surprise as jets of cum shoot into the air.\nAfter a few squirts, he clamps his mouth down over the head, drinking as much of his load as he can.\nSean then quickly gets up and adds his own load to Ron's cock, completely coating it!\nSean then cleans his buddy's cock off!\nRon is quiet in this video, but I so want to have him back to see what other things might overly excite him!",
  "models": [
    {
      "name": "Sean Peyton",
      "person_id": 8158
    },
    {
      "name": "Ron",
      "person_id": 8499
    }
  ],
  "release_date": "2016-12-24",
  "scene_id": 8503,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Ron & Sean Peyton - Serviced"
}