{
  "collections": [
    "ChaosMen"
  ],
  "description": "Every now and then I get an email from a viewer who complains that the model getting serviced should NOT suck back. They just want them to sit there and be Serviced.\nI totally get that. But I do encourage the new model to let things get out of hand, to push their limits. Lately, I think I have had a lot of guys willing to jerk or suck their buddy, and that often gives me a good idea of who should come back. It is by no means a hard and fast rule, I just know that if they come back for a full sex scene, there is one less box to check off of what they will try for the more expensive full-sex video to film.\nBorden does kick back and let Antonio service him. And to be fair, Antonio IS the best at sucking cock. No gag reflex and he just gets in his passive mode, doing everything he can to please his buddy. He slides up and kisses him, and I was a little frozen as we did not discuss this beforehand, but Borden rolled with, kissing him back.\nAntonio focuses heavily on just using his mouth, whereas Ransom and I both include our hands to help stimulate their cock. Then again, neither of us can shove a cock down our throats and use our throat muscles to clamp on and basically massage the cock as it is deeply imbedded. Antonio is the master at that trick!\nThis actually led us to an issue with trying to get a cum shot that you could see. Antonio can use that technique that milks a load out, but it goes straight down his throat, and I worry that you all think it is dubious that the guy actually ejaculated. All that evidence goes straight to Antonio's stomach.\nAs it turns out, that the throat massage technique that works for him off set, was likely not going to work on Borden. He need some serious focus on his head. I did have to give Antonio some tips for having to actually use his hands to get a guy off.\nAntonio does an amazing job, gripping his cock head and pulling the load out. After laying their calm and stately, Borden practically has a seizure from the powerful orgasm! You don't see that very often!\nThis is a strong Serviced video with a fantastic happy ending! It looks like Borden's orgasm knocks him into another reality!",
  "models": [
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    },
    {
      "name": "Borden",
      "person_id": 8493
    }
  ],
  "release_date": "2016-12-28",
  "scene_id": 8509,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Antonio Cervone & Borden - Serviced"
}