{
  "collections": [
    "ChaosMen"
  ],
  "description": "Instead of a blow-by-blow of what happens in this video, I thought I would give you some Behind the Scenes backstory.\nTeo is straight, but his girlfriend does porn, and on a couple occasions, she has invited a guy to come play with them. She always wants Teo to play with the guy, and he has had only a couple chances to suck dick back. That led him to tell me that he was more skilled at sucking cock. That didn't sound like a lot of practice, but whatever extra training he could do, I was not going to diminish.\nBut overall, he sticks to women. He has sent me a dozen referrals of his male friends, most of which are his friends he thought that I would like to work with, and most were not porn ready. I figured Teo was just too straight to even pick out a handsome dude. But then he sends me guys like his best friend, Skot and a few others, and it seemed to redeem his judgement of guys.\nFor today's shoot, he walked in and jokingly said to me about Sam, who was standing there with us, \"When you going to get some hot guys for me to have sex with?\" Sam was taken aback, mainly because Teo cracks jokes non-stop, so had no idea he was complimenting him in his own joking way.\nTeo quickly realized that Sam didn't realize he was joking and immediately gushed about how handsome he was, and how great his body was. From his square cut jaw, to Sam's amazing lats, Teo was impressed. Nice recovery Teo!\nBut the compliments continued throughout the shoot. Teo had broken his leg and has been working really hard to get back to a great fitness level. I think seeing Sam's lean muscle build and broad shoulders, Teo was envious and also, dare I say, attracted to Sam.\nI think given that context, you can tell Teo is way into Sam in this video. That energy could be attributed to body worship, but I think we found a guy that Teo would take home to meet his girlfriend. He also had a few moments when getting fucked that he had to stop or risk cumming.\nSam likes to bottom, and I think that makes him a great top. He doesn't fuck like a porn star, but he fucks like someone who is trying to angle his cock to stimulate his partner's prostate. He knows where to zero in, because he knows where his own trigger spot is.\nBut with Teo's leg still giving him problems, he just could not maintain a position to get fucked AND cum. So Teo fucks the cum out of Sam, then breeds his hole.\nNot a lot of cum as he buries it deep, and Sam has so much ass hair that it all just blends in. I think I might have to trim his ass. Don't hate on me!\nSo what do you guys think? Does Teo have a man-crush on Sam in this video?",
  "models": [
    {
      "name": "Sam",
      "person_id": 8065
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2016-12-27",
  "scene_id": 8525,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Shaved",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings"
  ],
  "title": "Sam & Teo - RAW"
}