{
  "collections": [
    "ChaosMen"
  ],
  "description": "When I talk to Travis or my friends that help out, we often have a debate about what famous person a model looks like or reminds us of.\nI immediately though of Christopher Reeves, and Kyle wears glasses, which added a little Clark Kent to his vibe. But it wasn't just his face and hair style, but his deep voice also reminded me of the actor. What do you guys think?\nKyle is 23, straight but open-minded, and has been working out hard on his body the last couple years. He is down to mess around with a guy, and says it will be his first time. Though he has had one girl play with his ass, and that lead him to believe he might be fine with getting fucked.\nHe was actually not very confident he could get hard, or even cum. I was worried his attitude might become a self-fulfilling prophecy, but thankfully, no problems.\nHe has done live cam before, so Kyle was great playing to the cameras.\nKyle gets hard easiest standing. After he takes his clothes off, he works his cock until it is fully hard.\nHe had no issues staying hard for the rest of the video, maybe getting a little wobbly when he shows-off his ass. But he is definitely not camera shy.\nAlso one of his strengths is cumming while standing. Many guys sit or lay down while they jack-off, so standing while ejaculating has been a skill I see less and less of these days.\nAnd that's just what he does. He tosses down a towel so we can see him cum on a dark surface, and with very little effort, bust a load. He says he likes to imagine cumming on a girls face, and leaning over them is perfect for getting off.\nLet's see if we can get him to put that skill to use next week!",
  "models": [
    {
      "name": "Kyle Parker",
      "person_id": 8529
    }
  ],
  "release_date": "2017-01-09",
  "scene_id": 8536,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Theme - Solo",
    "Video - HD - High Def"
  ],
  "title": "Kyle Parker - Solo"
}