{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have been trying to find Daniel a hot Latin or African America guys since they turn him on so much.\nBut again, he is so passive that he usually closes his eyes, tilts his head, and gets lost in the feeling of getting fucked. He loves servicing Amador, but with so little eye contact, you might think he is just not in to it. Oh, he is!\nI do try to encourage him to make some noise and step out of his headspace, but he just loves the feeling of getting fucked.\nDaniel tends to not jerk-off much while getting fucked, often saying he is too close to cumming. He sure is turned-on, only jerking his cock occasionally to keep hard.\nAmador is a bossy guy, and really puts Daniel through his paces.\nSince Daniel is always about to cum, I thought I would challenge him to see just how close he truly is.\nSome of the Bottoms out there may think that standing while bouncing up on a cock is an acquired or advanced skill. Many prefer just laying on their back, or even doggie-style, so they can be comfortable while hammering their own cock.\nDaniel was standing and repeatedly bashing his ass onto Amador's cock while Amador sat back and enjoyed having his cock ass-rammed. Amador would reach around and stroke Daniel's cock, getting him closer and closer.\nWhile getting an intense quad workout, Daniel easily blows his load while basically doing squats on Amador's cock. Not exactly impossible, but it is a tricky maneuver!\nThey switch things up so Daniel makes a platter of his ass. Amador coats his ass and his hole with thick ropes of cum. He even manages to dip his cock in, giving him an amazing creampie!",
  "models": [
    {
      "name": "Daniel",
      "person_id": 8418
    },
    {
      "name": "Amador",
      "person_id": 7970
    }
  ],
  "release_date": "2017-01-06",
  "scene_id": 8554,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Amador & Daniel - RAW"
}