{
  "collections": [
    "ChaosMen"
  ],
  "description": "Before we begin let me remind everyone that this site is not \"all\" about barebacking. The site is a little of this and a little of that. Everyone did the proper testing, and neither performer is going to be all about condom-free.\nBoth Ivan and Teo were looking to spice things up, so like they would for a straight film, they made sure they were \"all clear\" and amped things up on the set without condoms.\nTeo had a blast, as he finally got to play and suck a dick just like his. Ivan, though nervous to start with, enjoyed someone who knew how to play with the extra skin. Through out the shoot, he is smiling with disbelief that he is actually fucking a dude.\nHe's never actually even ever fucked a girl in the ass, so his learning curve was a bit steeper than most.\nI have to admit, it sure was easy to film as they both clearly got into the fucking. Watching Ivan's uncut cock slide in and out as Teo jerks his own uncut cock at rapid fire is way hot to see.\nWe got Teo in his traditional \"on his back\" to cum postion. It's truly the best way to make him bust with the other guys. While Ivan did surprisingly well jerking his dick off onto Teo's own spurting cock. I love these well-timed cumshots as it's such a cum fest!\nIf you've been waiting a while for a condom-free video to come back to ChaosMen, NOW would be the time to re-join!",
  "models": [
    {
      "name": "Ivan",
      "person_id": 3277
    },
    {
      "name": "Teo",
      "person_id": 3261
    }
  ],
  "release_date": "2008-10-24",
  "scene_id": 857,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Long",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Video - OutTake",
    "Theme - Wrapped"
  ],
  "title": "Ivan & Teo - RAW"
}