{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kouri is definitely into mature guys, so I thought I would step in and work his amazing cock.\nI set this up as a traditional Serviced video, mainly because for his solo he relied a lot on watching his porn. I knew I had my work cut out for me.\nSure enough, he does watch quite a bit of porn during this video, but then you also notice he starts watching himself on the monitors. I think that turned him on even more.\nIt took me 3-4 minutes to get his cock fully hard, and the trick was to play with his ass. I quickly remembered he said he loved to bottom for guys, and I guess he wasn't kidding. From that point forward, I played with his ass a lot in order to keep him charged-up.\nOnce he was up and fully hard, I brought out a couple of toys to really work his ass. Both toys slide in easily, and again, he is enjoying watching himself get fucked with a toy.\nI flip him on to his back with a butt-plug in his ass, and when he rolls his legs up practically past his head, I knew for sure this guy was all Bottom. That is an advanced Bottom Boy position!\nFor his solo, it took him quite a bit to cum, so I knew I had my work cut out for him. I barely catch his cum shot in time, after jerking and tugging on his cock for a long time.\nIt is a huge load and it is hot to see him writhe around in ecstasy from the massive relief!",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Kouri",
      "person_id": 8575
    }
  ],
  "release_date": "2017-03-29",
  "scene_id": 8580,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Bryan & Kouri - Serviced"
}