{
  "collections": [
    "ChaosMen"
  ],
  "description": "Dakota came in for his solo when I was shooting a ton a video at the beginning of the holiday season. I usually have to pack in a lot videos before air travel becomes too expensive to get models to the studio.\nBut Dakota is local so he just popped over for a quickie solo in between my busy schedule. Finally, things slowed down and I immediately regretted not getting him back ASAP. This dude has some amazing sexual energy!\nKodi was in town, so I didn't have to get him a ticket, and on top of that, the two had instant chemistry. Even before the shoot, they were flirting and touching.\nI put them in the room and let them have it. They immediately started kissing, and Dakota's cock woke up fast. Sometimes I am able to let them just do their thing, but they kept switching things up to quickly, moving about, and even standing blocking the cameras.\nDespite their hunger for each other, I had to step in and guide them and let us in to see what they were doing. Even with that limitations, the two are so hungry for each other, that you can easily imagine these two exchanged phone numbers after the shoot.\nBoth guys tend to be Bottoms, but Dakota really took charge, and you can tell he so wanted to fuck Kodi's ass after thoroughly rimming him. I might have to do re-match with these two!\nEven Kodi, who has been very passive, felt more aggressive at times.\nAs many of you know by now, Cum Shots can be tricky and sometimes the timing is out of whack.\nBut both guys said they were eager to cum. Kodi tilted his head back on the edge of the couch, while Dakota easily grinds out a giant load into Kodi's open mouth. Dakota then kisses him, swapping his load with him.\nDakota quickly got comfortable so that Kodi could give him a facial, and with some ball licking and dirty talk, Kodi unleashes a massive load into Dakota's mouth and all over his face.\nEven more cum-soaked kissing, as these two instant Pros, can't get enough of each other!\nIf you normally skip Serviced videos, DON'T! This one is a keeper!",
  "models": [
    {
      "name": "Kodi",
      "person_id": 8353
    },
    {
      "name": "Dakota Payne",
      "person_id": 8546
    }
  ],
  "release_date": "2017-02-08",
  "scene_id": 8585,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Dakota Payne & Kodi - Serviced"
}