{
  "collections": [
    "ChaosMen"
  ],
  "description": "Everybody gets fucked in this video!\nTwo newbies, Joss and Rebel, both agreed they would try bottoming for the first time.\nRebel really had the furthest to go, given that he didn't even try sucking dick during his Serviced video, but he was determined to expand his horizons.\nJoss was more optimistic and open-minded, and he seemed the most eager and turned-on of all the guys.\nFranco is down for just about everything, and lead the pack.\nHe started by showing Rebel how to suck a cock, then let him take over sucking Joss's uncut cock.\nRebel doesn't do too bad either, and ends up servicing both Franco and Joss.\nAs for the fucking, we started again with Franco leading the way. Joss opens him up with his thick cock, while Rebel not only fucks his face, but sucks on Franco's cock as he is getting rammed.\nNext up, the newbies get fucked. Boy, you can really tell Rebel is struggling to take a cock for the first time. I know many want to see these guys be pros, but this is an amateur site, and I know some of you love seeing them struggle.\nFranco fucks him gently, and eventually Rebel gets over his discomfort and sucks on Joss's cock.\nJoss, was more optimistic about getting fucked, but the reality was a little more painful. You can see on his face he is struggling with the initial insert. Surprise!\nBut after that he got into it, stroking his hard cock and even encouraging Rebel to fuck faster. Joss is pretty good at multi-tasking too, sucking on Franco while he gets fucked.\nRebel gets close and then creampies Joss's virgin hole.\nWith cum still dripping from his ass, Joss then fucks the cum out of Franco. That Franco, he sure does like the feeling of being fucked.\nJoss does a great job cumming all over and inside Franco's hole. A pro in the making!\nI don't want to play favorites, but Joss really stands out in this video, and I love that he is willing try anything once!",
  "models": [
    {
      "name": "Franco",
      "person_id": 8102
    },
    {
      "name": "Joss",
      "person_id": 8512
    },
    {
      "name": "Rebel",
      "person_id": 8520
    }
  ],
  "release_date": "2017-02-10",
  "scene_id": 8587,
  "tags": [
    "Build - Average",
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Franco & Joss & Rebel - TagTeam RAW"
}