{
  "collections": [
    "ChaosMen"
  ],
  "description": "I was a little surprised that Wright hit me up to do a full sex film. But he said he kind of enjoyed getting head, and he didn't think fucking a dude would be that much harder. He has such a hot body and I really wanted to his big uncut cock in full-action.\nYou can tell at the beginning he is really unsure. He smiles a little at the start, not believing he is in the situation. Antonio was the perfect guy for him to play with his first time. Antonio just plows on through, licking his nipples and armpits then getting down to his thick cock bulging in his jeans.\nAntonio is a pro at deep-throating, and it was great to see Wright impressed with his skills. Antonio swallows him whole, and Wright seemed surprised to see his entire cock disappear. He gets Antonio on his back to properly fuck his throat.\nWright reaches out to play with Antonio's cock, but I couldn't quite convince him to suck back. Antonio doesn't mind and was just eager to rim Wright's hole. I would love to see him get fucked, and that seems like something he might be willing to try.\nBut with his huge uncut cock, he is a natural Top, and he fucks Antonio like he has done it before. It is just astounding to see his big cock sliding in and out of Antonio.\nI love seeing Antonio bounce up and down on Wright's cock as he sits on the edge of the bed. Antonio sure is enjoying it too!\nWright also breeds Antonio's ass like a pro. Gooey cum drips all over his hole and then he plunges his cock deep inside.\nAntonio is not far behind as he shoots his own load as Wright fucks his cum into him!",
  "models": [
    {
      "name": "Wright",
      "person_id": 8507
    },
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    }
  ],
  "release_date": "2017-02-17",
  "scene_id": 8589,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Antonio Cervone & Wright - RAW"
}