{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Barton came in for his solo/serviced videos, I knew I wanted to get him back right away. I also knew in a couple weeks I had a model set up to work with Jackson who was acting flaky. So rather than risk a 'No Show' I quickly booked Barton another flight back to the studio to work with the one model that was not acting flaky.\nBarton is a natural Top, and I still haven't figured out what Jackson's thing is. He has a girlfriend, who really enjoys watching his videos, so she seems real keen on watching her boyfriend show-off his Bi side. I think I would place him in the Bi category. He just wants to have hot sex regardless of gender.\nJackson likes being aggressive with girls, but he gets very passive when a guy is around. Barton takes charge and pretty much tosses Jackson around. Sucking his dick and eating his hole like a hungry animal, Jackson looks disarmed. I think Jackson was a bit surprised that he was kissing another dude too!\nJackson always seem slightly taken aback and nervous, but he never complains once about getting fucked. I think he likes it!\nWith this being Jackson's second fuck film, I was worried having him bottom the entire time for Barton would be too much. In hindsight, he likely could have.\nBut Barton was down to get fucked too, and despite being a gay guy, he struggled a little bit more than Jackson did. I think he mentions during his solo that he is still learning to be a good Bottom. It doesn't show much, as he strokes his hard cock while taking Jackson's huge curved dick. It is kind of an 'advanced' cock for a beginner Bottom.\nEventually Barton fucks Jackson on his back, and we did try to see if Jackson could cum while being fucked. Barton works up a sweat, but Jackson doesn't get to the Cum Zone.\nBarton gets close to cumming while trying to make Jackson cum, so just pulls out and jerks his load on and inside of Jackson's hole.\nWith his ass full of cum, Jackson strokes out his load on to Barton's face!",
  "models": [
    {
      "name": "Jackson",
      "person_id": 8441
    },
    {
      "name": "Barton",
      "person_id": 8564
    }
  ],
  "release_date": "2017-03-03",
  "scene_id": 8590,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Barton & Jackson - RAW"
}