{
  "collections": [
    "ChaosMen"
  ],
  "description": "When Jerome came in for his solo/serviced, he said he had very little full-interaction with guys or girls. He was hesitant about sucking cock back, but once he was on set, he was shaking with excitement. Ahhh to be so young!\nTurns out we flipped a switch and he was eager to get back in and try everything. He even considered bottoming his first time out, but that sounded more like money was motivating him and I wanted to stick to what would turn him on.\nI had set him up with Daniel, who is a consummate Bottom, so I steered Jerome into sticking with being a Top, and pushing all the other limits that newbies struggle with; kissing, rimming, and sucking dick are all things hard for the new guys to take on.\nBut wow! He jumped right in, and his skills will make all of us wonder if this was indeed his first time.\nI did warn Jerome that Daniel was passive and to take charge, and he said to bring it on. It was brought!\nJerome is one horny dude, and he sucks cock like a pro. He doesn't even gag, despite a tear forming in his eye. I know some of you bad boys love that!\nHe also really knows how to fuck, and aggressively fucks Daniel until he is whimpering.\nDaniel, as always, is close to cumming though out most of the shoot. He cums easily while Jerome slides his long cock in and out of his hole.\nJerome's first creampie is very good too. He jerks his cock and squirts his opening shot onto Daniel's hole. He does his best to re-insert his cock to dump the rest of his load into Daniel, but you can tell Daniel had already tightened up. But he shoves it in successfully and dumps the second half inside of him. A little awkward, but counts as a proper juicing.\nI had told Daniel to clean his cock after, and that was something Jerome had never thought of. After the shoot, he told me that was hottest moment, having someone clean his cum-soaked cock. Hmmm. I think we have dirty boy in the making!\nJerome is ready to come back and try bottoming. He was highly skilled for a 'first time' so it is up to you to decide. He seems like an honest guy to me. To me, I feel like he is a dude who finally gets to do all the things he has been fantasizing about and dove in, cockhead first!",
  "models": [
    {
      "name": "Daniel",
      "person_id": 8418
    },
    {
      "name": "Jerome",
      "person_id": 8561
    }
  ],
  "release_date": "2017-03-10",
  "scene_id": 8595,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - African American",
    "Ethnicity - Latin Guys",
    "Ethnicity - Mixed Heritage",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Daniel & Jerome - RAW"
}