{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wright said he was down to get fucked, but he was really unsure about succeeding. He has had girlfriends play with is ass, but it was small time stuff, and was worried going big would be too much.\nI believe this is Dakota's first full-scene with ChaosMen, and he is really a Power Bottom. BUT, he has also shown he is a pretty good Dom Top in his Serviced video with Kodi. He sure looked ready to fuck Kodi a couple moments in that one! Sure enough, Dakota excels at both positions like a pro, and just seems to love it all.\nWright is a little awkward at the start of this video, still finding it funny that a dude is sucking his cock.\nBut when he sucked Dakota's cock, which he claimed was his first time, a switch was thrown, and he became relaxed and totally in the moment. For those that like to jump to the fucking, I suggest watching him 'melt' during the oral portion to the sex portion as he really does have a significant change is body language.\nDakota rides Wright's big cock first, and yep, the guy is a pro! He had no problems taking Wright's dick balls-deep and was relishing having it slide in and out.\nThen it was Wright's turn. I left in some of the fumbling as Dakota tries to ease Wright into taking his cock for the first time. It takes a bit, but then Dakota picks up some speed, and Wright discovers that his prostate loves the attention! Wright really enjoyed it, and now feels confident he can do anything.\nWright then fucks the cum out of Dakota, who you can tell was clearly only needing to stroke his cock a little bit before busting.\nWright pulls out and juices his hole, and if you watch closely, you may see Dakota bust a second small load!",
  "models": [
    {
      "name": "Wright",
      "person_id": 8507
    },
    {
      "name": "Dakota Payne",
      "person_id": 8546
    }
  ],
  "release_date": "2017-03-24",
  "scene_id": 8607,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Dakota Payne & Wright - RAW"
}