{
  "collections": [
    "ChaosMen"
  ],
  "description": "Barton sent me a few pics of guys that he thought were hot on the ChaosMen site. He definitely had a type, and with Caspar recently starting work, I knew he would be way into him.\nCaspar is down for anything, mostly enjoying being dominated and fucked, but he mentioned he was a pretty good Top too.\nBarton is more of a Top himself, but he was more than willing to bottom for Caspar!\nBoth guys clearly love sucking each other's cock, and I love watching Caspar's bearded face dive in to rim Barton's hole. I think there is even a moment where Barton rubs his chin whiskers on Caspar's cock. Not my most favorite thing, but Caspar loved it, and I think Barton enjoyed reminding him he was with another man.\nLot of passionate kissing in this video as the chemistry was quite high.\nCaspar rides Barton's cock, sliding it in easily. We may have to trim back some of his ass hair as it does block a lot of the penetration, so forgive me in advance if we trim it lightly next time. Even still, he rides Barton's cock like a pro and we can see him bounce up and down on Barton's cock.\nNext up, Caspar fucks Barton. Caspar did have to go slow on Barton initially, but he soon ramped it up to some severe ass ramming speed. Caspar locks Barton's arm behind him, making him submit to his cock pounding.\nBarton gets his revenge by fucking him on his back, pounding him until he shoots his load!",
  "models": [
    {
      "name": "Barton",
      "person_id": 8564
    },
    {
      "name": "Caspar",
      "person_id": 8555
    }
  ],
  "release_date": "2017-04-07",
  "scene_id": 8620,
  "tags": [
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Ethnicity - White Guys",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Barton & Caspar - RAW"
}