{
  "collections": [
    "ChaosMen"
  ],
  "description": "Talk about instant chemistry!\nThese two were making-out with each other even before I got the cameras rolling.\nBoth Antonio and Easton have amazing oral skills, but once Easton saw how much Antonio liked to be bossed around, he was in full-command.\nHe makes Antonio service his big cock, pushing it deep down his throat. Easton returns the favor, but when they start to 69 suck, you can tell that Antonio loved being face fucked and cock-gagged while Easton deep throats his cock.\nEaston eagerly eats his hole, getting it all lubed up for his giant cock.\nHe flips Antonio onto his stomach and power fucks the hell out Antonio. He holds his arms behind him and mercilessly fucks his hole. And I mean MERCILESSLY! There was no escaping that ass pounding!\nEaston climbs off and makes Antonio clean his cock, then has Antonio ride his dick. Balls are flying as he hammers Antonio's hole. And I mean HAMMERED!\nThose of you who love a dude who can fuck till he cums, will love the ending on this one.\nI let Easton just fuck and fuck and fuck until he is about to cum. He pulls, squirts a little, then shoves his cock head in. His cock THROBBING and PUMPING his load into Antonio.\nHe shoves his cock in further to deeply breed his boy!\nI am not kidding when I knew Antonio was about to cum from that and I better hurry to re-position. I scrambled quickly to get above to watch him beat out his own load while Easton fucks his cum into him! That is not the first time I have had to do that, so I might need more cameras.\nThis is one fucking hot video!",
  "models": [
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    },
    {
      "name": "Easton",
      "person_id": 8522
    }
  ],
  "release_date": "2017-04-21",
  "scene_id": 8623,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Antonio Cervone & Easton - RAW"
}