{
  "collections": [
    "ChaosMen"
  ],
  "description": "Both these guys cum from getting fucked!\nNot a big deal to you? Well, this was Jerome's first time taking a cock, and he found out he loved it!\nJerome practiced at home with a small toy, but was still anxious about bottoming for the first time. He is always turned-on during the shoots, and despite thinking he was completely straight, he has been enjoying the videos and really pushing his boundaries. He has moved himself more center on the sexuality meter.\nI figured he would go soft while getting fucked, but he stayed hard. Once, while Phineas was fucking him and playing with his cock, we had to halt shooting or risk an early cum shot. No doubt that he was enjoying it!\nPhineas is a Power Bottom, but he is actually a great Top too. This is his first time Topping for ChaosMen. It took a bit to get Phineas' cock inside Jerome, but after a few minutes, Jerome had an \"Ah Ha!\" moment when he realized why guys like to be fucked.\nWe shot most of the video straight through. Lots of passion and the guys just kept going. We stopped to do photos just before the cum shot. We debated how each guy should cum. Phineas cums easiest being fucked, and Jerome claimed he could easily cum from being fucked also.\nI hated to miss a chance for a cream pie, but I also wanted Jerome to experience an orgasm while being fucked. That usually has them coming back to do more and be versatile players.\nWe decided both guys should cum from being fucked.\nPhineas cums first, then uses his jizz as lube to fuck Jerome. Phineas is a little wobbly after just cumming, but we timed it perfectly. There is a little sense of urgency as we try to pull this trick off.\nJerome strokes his cock until he has the most intense orgasm he has ever had!\nJerome was blown away! He fully realized why guys bottom and though I wouldn't say he is a Power Bottom, he will totally be down to experience an orgasm like that again soon.\nBoth guys lick each other's cum, and share their loads between them as they kiss. Jerome has pushed through a lot of limits. Kissing, rimming, eating cum, getting fucked- the dude really enjoys it all!\nJust watch for Jerome's reaction when he cums, you can tell it was a life changing orgasm!",
  "models": [
    {
      "name": "Jerome",
      "person_id": 8561
    },
    {
      "name": "Phineas",
      "person_id": 8380
    }
  ],
  "release_date": "2017-04-28",
  "scene_id": 8632,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jerome & Phineas - RAW"
}