{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wright has been showing-up to the shoots a lot more relaxed and confident. He seemed down to work with new guys, so I thought I would pair him up with Michael. Wright likely won't be working with guys that he would only have to Service, but swapping blowjobs with other dudes really interests him.\nThey both are a little awkward as they get started, smiling and trying to make small talk with their big dicks out.\nBut wow! Michael had no problems jumping into this shoot. You can tell he has plenty of experience and is not going to be shy about anything. He sucks cock like a pro, and you can tell he is loving every second of sucking Wright's big uncut cock.\nWright has also really gotten into sucking dick, show-boating a bit, but also trying to please his buddy.\nMichael is great with rimming too, though he had a tough time craning his neck in order to lick Wright's hole.\nSpeaking of show-boating, for his first time in front of the camera, Michael totally nails taking a facial!\nWright ramps up and shoots his load onto Michael's face. The first squirt overshoots, hitting his chin, but then Wright drives his cock into Michael's mouth, filling him up with his jizz.\nMichael showcases the load, spitting it out and re-tasting it. Such a show-off! I love it!\nHe ramps up his own cock, and spills a big load all over his own body!",
  "models": [
    {
      "name": "Michael",
      "person_id": 8621
    },
    {
      "name": "Wright",
      "person_id": 8507
    }
  ],
  "release_date": "2017-04-12",
  "scene_id": 8636,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Ethnicity - American Indian"
  ],
  "title": "Michael & Wright - Serviced"
}