{
  "collections": [
    "ChaosMen"
  ],
  "description": "I mentioned to Lorenzo that I would love to see him in a flip-fuck video, and that Sam was a totally versatile guy. Lorenzo said that he had been eyeing Sam on the site, so was eager to work with him.\nLorenzo begins by sucking on Sam's cock. I think Sam loves to have his dick sucked, and it is his favorite part of any video.\nHe returns the favor, and his cock-sucking skill are much improved.\nLorenzo then rims his furry ass, getting it ready to fuck. Sam is straight, but does like girls to use toys on him. He enjoys the sensation a lot, but gets a little wobbly after Lorenzo pounds his ass.\nAfter fucking him hard, Lorenzo flips him around and sucks on Sam's cock until he is fully-hard and ready to fuck him.\nSam stumbles a bit trying to find his hole, but once inside, he fucks Lorenzo just how he loves to be fucked.\nSam gets Lorenzo on his back and fucks him even more aggressively. He fucks a load out of Lorenzo, who spills a giant wad of cum on his stomach.\nSam ramps up his own cock, and I get a side shot of him juicing his hole. I prefer the undershot, to get the best shot of cum creaming a hole, but I am trying to get a variety of angles.\nAfter that, Sam drills his cum in, showcasing Lorenzo's sloppy hole!",
  "models": [
    {
      "name": "Sam",
      "person_id": 8065
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2017-04-19",
  "scene_id": 8641,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Lorenzo & Sam - RAW"
}