{
  "collections": [
    "ChaosMen"
  ],
  "description": "These two hot dudes look amazing together!\nJet hasn't been in the studio for a while. He has a new girlfriend and a job that keeps him busy. She also seems more straight-laced about sex, so he has not had any anal action in a long time. He was a little nervous that he would be out of practice.\nWright has a whopper of a cock too, so that was intimidating.\nThey start by briefly making out, but Wright's cock was bone hard, and Jet was eager to get it in his mouth. Wright returns the favor. Given how reticent he was to sucking dick, he sure looks like he loves sucking dick now.\nIn fact, Wright seems to be in the same league as Jet when it comes to getting fucked. It embarrasses him a bit that he likes it so much, despite always thinking of himself as strictly straight.\nWhen Jet goes to fuck him, he eagerly presents his ass to be fucked. There was a little bit of fumbling as Jet tries to ease it in slowly, but once in, Wright is in Bottom Boy bliss.\nOf course, it would be a shame to not put Wright's magnificent cock to use splitting an ass in two.\nHe fucks Jet, who had no problems accommodating Wright's ample cock. I guess you never forget to ride a horse hung cock!\nAs usual, once Wright starts really nailing his sweet spot, Jet blows his load.\nDespite Jet being spent, Wright still wanted to keep fucking him. He flips Jet on to his back and hammers his hole until he gets close. He pulls out and literally coats his hole with his cum. He slides it in, juicing his hole with the massive load.\nWright makes Jet clean his cock, and then fingers his cum dripping hole!",
  "models": [
    {
      "name": "Jet",
      "person_id": 3481
    },
    {
      "name": "Wright",
      "person_id": 8507
    }
  ],
  "release_date": "2017-05-05",
  "scene_id": 8652,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jet & Wright - RAW"
}