{
  "collections": [
    "ChaosMen"
  ],
  "description": "Phillip was excited but very nervous about getting head from a guy. He figured if his cock got hard, he would be fine.\nWe took some initial photos and he was hard for those. That was a great sign. After the photos, I quickly got Vander in to the room to keep the inertia going. Phillip quickly pulls his shorts over his hard cock, then Vander asks him if he is ready.\nVander rips his shorts off, and his hard cock pops out. Vander slides in and starts sucking, but you can see Phillip begin to lose it. Whaaaah!\nVander realizes he has lost him, so intensifies his sucking. Phillip also watched some porn, and after only a minute, we had Phillip up and in the zone.\nHe watches the straight porn we have going for him now and then, but once up, he got in the moment, and really pounded Vander's face with his cock!\nBased on his solo, we know that Phillip likes a little anal play, so when Vander got him doggie-style to rim him, he gently fingered his hole first, making his dick rock hard. Occasionally Vander's beard would tickle him, but overall, I think Phillip might be convinced to sit on a dick. Might, being the keyword there.\nAs far as making Phillip cum, Vander did work pretty hard to pull the load out of him. Phillip had not ever cum from a blow job before. We stopped to take some more pictures, and Phillip got a chance to ramp up his cock.\nVander gets in there and just sucks and pulls until a creamy load oozes out of Phillip's cock.\nPhillip's reaction is priceless, and worth the price of admission!\nI am pretty sure Phillip will be back. He has a month of school to finish up, but we have setup a date the following month for him to try Topping a dude, maaaybe even try a little Bottoming. We will just have to wait and see!",
  "models": [
    {
      "name": "Phillip",
      "person_id": 8655
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2017-05-10",
  "scene_id": 8667,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings"
  ],
  "title": "Phillip & Vander - Serviced"
}