{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have never aired videos with holiday themes because it seems awkward watching guys fuck in a pile of holiday presents in the middle of July. It 'dates' the videos.\nBut sharp viewers will spot that this video was shot on Valentine's Day, and the energy in this video really reflects a romantic vibe.\nFor Jalen's first time, he was really pleased to be playing with Lorenzo. Both guys were single for Valentine's Day, and you can tell they went at this video like it was a hot date.\nJalen starts by slowly sucking Lorenzo's cock, making him wait to have him devour it. He rubs his whiskers all over his cock, something that Lorenzo loves to do to other guys. Lorenzo loved it!\nLorenzo then sucks on Jalen's whopper of a cock, tasting and sucking on his foreskin.\nThey get on the bed and 69 suck, then Lorenzo rims his hole. Jalen sure looks like he would like to take a cock in there. Jalen also rims Lorenzo, and I was happy to see he has very few limits.\nLorenzo has had a lot of cum facials while at ChaosMen, so when I found out that Jalen would be happy to take a load, we had him lay on this back to receive Lorenzo's load.\nJalen ramps up his cock and shoots his load first. Lorenzo edged his cock, watching Jalen splatter cum all over himself.\nLorenzo then dumps his load into Jalen's mouth. I thought a lot had gone into his mouth, but when Lorenzo goes to lick it up, a lot had hit the opposite side of his face. It was quite a load!\nThey share a cum-soaked kiss.\nEager to get Jalen back to see what else he is down for!",
  "models": [
    {
      "name": "Jalen",
      "person_id": 8646
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2017-05-17",
  "scene_id": 8670,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jalen & Lorenzo - Serviced"
}