{
  "collections": [
    "ChaosMen"
  ],
  "description": "Another amazing TagTeam!\nThere was so much good stuff, it was hard to trim this down to 40 minutes. Sorry for the long download times! I just didn't know what to trim out!\nI knew that Jerome and Wren have amazing energy, but Michael was an unknown element. This was Michael's first time, and you can tell he is not quite sure what to think. Jerome and Wren keep pulling him in, and overall, I think he gets it together pretty quickly.\nAll three guys literally have no limits, but Jerome and Wren push the boundaries and energy is ballistic!\nJerome actually suggested this 3-way, so he is really getting into playing with men. He has so much fun on set that he no longer will claim he is completely straight. He also suggested the daisy-chain fucking position. Not the easiest move, and he was surprised that it was challenging to do. But hey, it works, and we get to see a cock in Michael's ass for the first time on film.\nThis video has everything! Hungry ass-eating, daisy-chain cock-sucking and rimming, ass-to-mouth action, cum eating, and cum kissing and swapping! Another video where you won't know which moment to time your own orgasm with!\nSo much to love in this video. Jerome cums from being fucked, then tries to fuck the cum out of Wren. His legs buckle from having just cum, so he tags Michael in to take over who then fucks the cum out of Wren. After Wren busts his nut, Michael creampies his hole.\nWhile watching Michael breed Wren, Jerome busts his second load, feeding his cum directly into Wren's open mouth.\nIt doesn't get much better than this, so it is time to sign-up if want to see one of the hottest TagTeams ever!",
  "models": [
    {
      "name": "Jerome",
      "person_id": 8561
    },
    {
      "name": "Michael",
      "person_id": 8621
    },
    {
      "name": "Wren",
      "person_id": 3581
    }
  ],
  "release_date": "2017-05-26",
  "scene_id": 8673,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "Ethnicity - American Indian"
  ],
  "title": "Jerome & Michael & Wren - TagTeam RAW"
}