{
  "collections": [
    "ChaosMen"
  ],
  "description": "I got to hand it to Joss, he is really pushing himself sexually. He appears to really love sucking dick, and he is even eager to make-out with another guy.\nThough, watching him get fucked is like watching most guy's first time. Waves of discomfort, pleasure, then back. Joss never complains, so I think he will be a lot more confident about bottoming in the future. He has learned if he plays with his cock while getting fucked, it quickly turns into pleasure.\nEaston bottoms in this video as well. Though he is mostly a Top in his everyday life, you can still tell he really enjoys taking it up the ass like any avid Bottom. At first, he too has a few moments trying to take Joss's cock, but once it was in, he was riding Joss's fat uncut dick like a pro.\nI am pretty sure this is the first time we get to see Easton cumming while being fucked. Joss runs a little bit out of steam while relentlessly pounding Easton until he cums. He is clearly out of breath and got a little wobbly, but Easton manages to shoot cum laser beams out of his cock.\nJoss starts stroking his spent cock, quickly getting it back up into firing position. He juices Easton's hole, and manages to drive the load into his hole. He was exhausted from the work-out but driven to breeding Easton.\nEaston clean his cock, and then they share a hot kiss. Joss reaches back and fingers Easton's sloppy hole!\nThese two pint-sized and hung dudes really have amazing chemistry!",
  "models": [
    {
      "name": "Easton",
      "person_id": 8522
    },
    {
      "name": "Joss",
      "person_id": 8512
    }
  ],
  "release_date": "2017-06-02",
  "scene_id": 8675,
  "tags": [
    "Build - Average",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Easton & Joss - RAW"
}