{
  "collections": [
    "ChaosMen"
  ],
  "description": "After I tossed Michael into the deep end of the pool by doing a TagTeam with Jerome and Wren, I thought he needed some one-on-one time. He was a little lost in that video. Not sexually lost, but he just seemed unsure how to open-up to the cameras and let us see all the naughty things he was doing.\nHe likes to both top and bottom, and Sean Peyton is always down to do both. I figured Sean could help guide him a bit with showing-off to the viewing audience.\nHe is still getting used to the cameras, but Michael is certainly not lacking any sex skills!\nMichael had no problems topping or bottoming, while Sean, surprisingly, struggled to take Michael's 8-inch cock. Sean struggled initially to take his cock, and I thought something else was wrong since I had never seen him have to go slow. Sean said, \"Well, he DOES have big cock!\"\nSean will teasingly brag about what a big Bottom he is, but that day, at least initially, he met his match.\nMichael got fucked next, and he took it like a champ. I love seeing him sprawled on his back, his hairy bush standing-out against his hairless body, and of course seeing his hard cock bounce around as Sean rams him in the ass!\nNext, Michael fucks Sean on his back. He gets real close to cumming so he juices his hole. Michael then fucks him with his cum, racing to make Sean cum before losing his boner. Success!\nSean spills one of his biggest loads ever, so Michael gives it a little taste!",
  "models": [
    {
      "name": "Sean Peyton",
      "person_id": 8158
    },
    {
      "name": "Michael",
      "person_id": 8621
    }
  ],
  "release_date": "2017-06-16",
  "scene_id": 8677,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - American Indian",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Michael & Sean Peyton - RAW"
}