{
  "collections": [
    "ChaosMen"
  ],
  "description": "After testing out the waters with a toy in his last solo video, Prentice said he would come back and do a full scene, and maybe even try getting fucked. Maybe.\nI had him setup with Antonio, who is one of the best Bottoms ever, but I knew he could stay hard to Top if he had some nice cock to suck.\nAntonio does enjoy sucking dick more than anything, and actually anytime they both wilted while off camera, Prentice would request a blow job. That would get him hard as well as recharge Antonio's cock. That seldom happens off-camera as most models will watch some porn to get back in the zone.\nBut obviously, Antonio's cock-sucking skills were doing the trick, so I was happy I paired these two together.\nPrentice even sucked dick for the first time. He goes right for it, and despite drooling like crazy, he doesn't gag and seemed enthusiastic.\nHe also loved getting his ass rimmed. Antonio loves to fully-service his partner, and eating out his ass while sucking his cock kept Prentice super happy.\nPrentice has fucked girls in the ass before, and clearly had no problems pounding Antonio's ass.\nWhen it came time for Prentice to take a cock, we set it up so he could sit on Antonio's cock and be able to do the insert himself. There are a couple fun OutTakes, so stay tuned to the very end to see just how challenging this was.\nThere is not a huge amount of footage of him riding cock, but he took his first cock, and I don't think he will be so worried about it in the future. Antonio keeps Prentice's cock hard by stroking it while he sits on his dick, and he did get some pleasure out of bottoming.\nThen it was back to Prentice fucking Antonio, and they both were back at full-steam energy.\nPrentice fucks the cum out of Antonio, while Prentice strokes his cock vigorously until laying a load on Antonio's taint. His aim is a little off to be a called a creampie, but he certainly doesn't lack enthusiasm.\nThis is a great First Time video. It has real energy, some real awkwardness, and it is hot to see Prentice pushing his limits!",
  "models": [
    {
      "name": "Prentice",
      "person_id": 3367
    },
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    }
  ],
  "release_date": "2017-06-09",
  "scene_id": 8685,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Antonio Cervone & Prentice - RAW"
}