{
  "collections": [
    "ChaosMen"
  ],
  "description": "With Caspar being so tall, it has been hard to find models to pair him with where he doesn't tower over them. But with Wright, I feel like they are a lot more closely matched.\nWright clearly spends a lot of time staying in shape, and is used to being bigger than the other models. He took one look at Caspar and said he actually felt small. I told Wright not to worry, because his dick would likely be way more than Caspar can handle.\nThey start with some kissing, and I am pretty sure that is the first-time Wright kissed a guy with a scruffy beard.\nAlso surprising was how well Caspar sucked on Wright's big cock. I love how he just settles in and starts servicing Wright with real intensity. I feel the same way about Wright. For a guy who really struggled to suck dick for the first time, he seems more than content to please his buddy.\nWright fucks Caspar first, and you can see Caspar straining to accommodate Wright's big dick. But one thing I have to give Caspar credit for, he takes it like a man, and powers through it.\nNext, Wright gets fucked. He seems to be in the zone and I think he now really likes getting fucked. He is still not at the point where he can cum from getting fucked, but he now finds the sensation a lot more pleasurable.\nFinally, Wright fucks Caspar on his back, and while that is not enough to make Caspar cum, Wright easily jerks out a MASSIVE load all over Caspar's hole, then fucks him with his cum.\nCaspar then jerks his own cock, shooting his cum all over Wright's spent cock!",
  "models": [
    {
      "name": "Caspar",
      "person_id": 8555
    },
    {
      "name": "Wright",
      "person_id": 8507
    }
  ],
  "release_date": "2017-06-23",
  "scene_id": 8690,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Caspar & Wright - RAW"
}