{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wow! This is a power-packed video!\nJerome is always turned-on when he is next to a guy, and often is on the edge of cumming. I definitely think an Edge video is in his future, but I just wanted to see how close he would get during a massage themed video.\nBarton oils-up his body and they took it upon themselves to do some dialog, which falls a little flat, but there is nothing else to criticize this video about. Jerome is super aroused and Barton actually nails the rhythm of what makes a great massage video.\nJerome even has a misfire in this video that is very hot. Barton climbs up on the table to let Jerome suck his dick. The second he gets his cock inside Jerome's mouth, you can see plain as day that Jerome is happy to have Barton's cock to nurse on. Hungry!\nWhile Jerome begins to suck his cock, Barton isn't barely stroking Jerome's cock when Jerome has a panicked moment when he reaches down to stop Barton from making him cum.\nToo late! A very decent load spills out of his cock. Based on my experience edging, I know if you don't jerk the cock, the cock doesn't realize it has had a full orgasm, so it stays hard, and you can keep making someone cum this way over and over.\nBarton just held his cock and let the cum shoot out, not giving him that final orgasm.\nIf anything, Jerome is sucking on Barton's cock more aggressively.\nBarton scoops up his cum and uses it to lube up Jerome's hole. He fingers him with his own cum. It is fucking super-hot to see Jerome's hole caked in his own cum!\nThen Barton gets between his legs, and eats out his cummy ass!\nUsing the opportunity to fuck Jerome's cum slicked hole, Barton begins to fuck him. Jerome's pleasure meter is off the charts!\nNext, Barton rides on Jerome's cock, while Jerome grinds his hips deep inside Barton.\nThough I think with that passive position, Jerome wanted to really pound Barton, so he bends Barton over the table and aggressively fucks his ass.\nWith both these guys, there is just no deciding who is a the better Top or Bottom. They both have amazing skills at both positions.\nBarton gets Jerome on his back again, this time is able to pound him and stoke Jerome's cock. Actually, you may notice that Jerome grabs Barton's hand and places it on his own cock so Jerome can be jerked-off by his buddy while being fucked.\nBarton fucks his ass while stroking-out Jerome's second load! A very intense orgasm for Jerome!\nBarton shoots his load all over Jerome's ass, breeding him nice a good. Jerome looks like he is trying for a third orgasm, but realizes he might not be able to pull it off. Instead, Barton leans over and kisses the dude that just gave him so much pleasure.",
  "models": [
    {
      "name": "Barton",
      "person_id": 8564
    },
    {
      "name": "Jerome",
      "person_id": 8561
    }
  ],
  "release_date": "2017-06-30",
  "scene_id": 8693,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Barton & Jerome - RAW"
}