{
  "collections": [
    "ChaosMen"
  ],
  "description": "Timmy kept up his winning attitude! The boy really has great sexual energy, and was definitely excited to work with Lorenzo.\nThe two guys loved kissing each other. Lorenzo works his way down his body, paying close attention to Timmy's sensitive nipples. Once Lorenzo pulls out his cock you can tell Timmy is all about a guy worshiping his cock. Lorenzo of course was impressed and entranced with his big stick.\nLorenzo pushes Timmy to his back and treats him to an expert blow job. Lorenzo jerks their cocks together and they flip around so they could suck each other's dicks. Timmy has some great cock-sucking skills too!\nMy favorite moment is watching Timmy sit on Lorenzo's face. His ass is amazing, and Lorenzo buries his face into it and practically smothers Lorenzo with it. Lorenzo then spreads his cheeks nice and wide so we can see his perfect hole. Timmy has a cock for being a Top, but he sure has an ass that needs to be fucked!\nTimmy gets on his knees while Lorenzo drops to the floor to suck his cock until he is close. Timmy grabs his cock and unloads into Lorenzo's mouth. Great aim!\nLorenzo stands up and shoots his load on to Timmy's cock. He then drops back to his knees and cleans up all that delicious cum!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Timmy",
      "person_id": 8691
    }
  ],
  "release_date": "2017-06-07",
  "scene_id": 8700,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Lorenzo & Timmy - Serviced"
}