{
  "collections": [
    "ChaosMen"
  ],
  "description": "After taking some time off to do some world travel, Gerard is back!\nHe is always eager to fuck some ass, and with his energy and dom vibe, I needed the right guy who can handle an intense fucking.\nKodi has been telling me he likes it rough, so Gerard was a perfect match-up.\nKodi's ass gets red hot from all the spanking in this video!\nThey start with some passionate kissing, but Gerard is keen on getting his cock down Kodi's throat. Kodi sure can deep throat a cock! Gerard will often bend over and suck on Kodi's cock, making sure his Bottom is turned-on.\nGerard squats on his face, getting his ass cleaned by his Bottom Boy. Gerard returns the favor, using his tongue to open Kodi up and spanking his ass cheeks.\nKodi is still tight, so Gerard flips him on his back and begins to slip more and more fingers in his hole. Gerard cock is just laying there, poised to enter Kodi's hole. It is hot to see just how big Gerard's cock is and how he is going to fit that massive thing inside of Kodi. Gerard is so turned-on, he is dripping pre-cum, so Kodi starts squeezing out and licking it up.\nAfter getting his boy all loosened up, he easily slides his cock into Kodi. Kodi struggles a bit, trying to get that cock wedged in there, but eventually Gerard wins the battle, hammering his hole with his cock without mercy.\nNext Kodi takes back some control and rides Gerard's cock. There are a couple times Gerard gets too close to cumming, so Kodi stops to clean his buddy's cock. I think even one time, Gerard was going to cum from the cock-sucking break.\nGerard gets Kodi doggie-style, and wow! You can see just how red hot Kodi's ass is from all that spanking!\nSeeing that glowing red ass drives Gerard crazy, so he easily cums from fucking Kodi. He pulls out and lets us see a blast of jizz, then pumps the rest inside of Kodi.\nI scramble out from underneath to catch Kodi who is about to cum. Before Gerard's cock could begin to wilt, Kodi bust his own nut, thoughts of being bred by Gerard. Gerard licks up Kodi's cum, and shares a cum-soaked kiss with him.\nHe then lifts Kodi's legs in the air, eating his own cum out of Kodi's ass!",
  "models": [
    {
      "name": "Kodi",
      "person_id": 8353
    },
    {
      "name": "Gerard",
      "person_id": 8279
    }
  ],
  "release_date": "2017-07-07",
  "scene_id": 8707,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Gerard & Kodi - RAW"
}