{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought Franco and Kevin would look perfect together. They definitely have the same look.\nI was interested to see what Kevin's cock-sucking skills were like. He said during his solo that he liked sucking big cocks. Franco is decently hung, but based on what Kevin said, I was thinking he was into MONSTER cocks.\nThey start by jerking each-other-off, and then Franco sucks on Kevin's cock. Kevin returns the favor. Honestly, I think they were evenly matched in their oral skills. Kevin uses his hand to stroke Franco's shaft while using his mouth on his head. Kevin seems moderately experienced.\nI could be wrong about Franco, but he said he has never rimmed a guy. I thought he had, but he said he had not. He wanted to give it a try, and it kind of looks like a First Time thing. Kevin also said that he has not ever rimmed a guy. Kevin he gives it a try, and you can sure tell he is really trying to connect his tongue to Franco's hole. He does finally get in there, but it is a slow and steady lick job!\nThe Pro part of the video is the cum shot. Kevin gets on his back and with Franco jerking his cock in his face he knew he could nut easily.\nThey race to time their cum shot. Kevin easily blasts out a load of cum and then Franco has impeccable timing and nuts immediately on Kevin's face!\nThis video has a Down Low vibe, like two straight guys (or in this case Bi) guys who are trying to keep what they are doing a secret.",
  "models": [
    {
      "name": "Franco",
      "person_id": 8102
    },
    {
      "name": "Kevin Reed",
      "person_id": 8708
    }
  ],
  "release_date": "2017-07-05",
  "scene_id": 8712,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Franco & Kevin Reed - Serviced"
}