{
  "collections": [
    "ChaosMen"
  ],
  "description": "When Barton found out that this would be a Phillip's first time with a guy, other than getting head during his Serviced video, Barton suggested we do a First Timer kind of thing.\nI was dubious about trying to go for that. Phillip initially only wanted to receive head, but after that shoot, throughout the course of one day, he was down for sucking, fucking a guy and getting fucked. Part of it was the money, but I think he discovered he liked his prostate played with AND he was very turned-on by showing-off for the cameras.\nSo, I told Barton I was wary of trying to go the 'First Time' theme, as it always seems to bite studios in the ass. The dude gets on set, and then ends up being a pro.\nHaving said all that, I was right. Phillip was down for just about everything and he certainly does not look like it was his first-time.\nPhillip said he would suck cock just like he likes it, and not only is there some skill, but there is some great showmanship there too.\nBarton sucks his cock back, and with all the eye-contact between them, I think Phillip has got more Bi in him than he is willing to admit.\nBarton gets Phillip doggy style and his furry bubble-butt is just so dang hot! Barton was going to fuck him, but we thought it would be more natural to try a small toy on him first to get him warmed up.\nAs you will see at the end of the video, Phillip seems taken with butt plugs, and I had hoped the small dildo first would relax and open-him-up.\nBarton eases his cock in slowly, and while Phillip looks like he is in pain for the first minutes, he stays hard and I think he now understands why many guys love to get fucked- straight or gay.\nPhillip also has some great Topping skills, and turns the table on Barton, fucking him doggie-style.\nAfter that, Barton gets fucked on his back, and we have another First Time in this video.\nBarton is normally a Top and has never cum from being fucked. But I guess Phillip was hitting the right spot, and for the First Time, Barton cums while having his ass fucked. Intense!\nNow Phillip wanted to cream Barton's hole. He tried fucking him some more and jerking but he just couldn't get over the top. Thankfully we had practice toys on hand for him, and he slides the vibrating butt-plug in and WOW, that mades all the difference for him.\nI guarantee you that next time I have Phillip in, we are going to have a dude fuck the cum out of him, or at least try!\nThis is a very hot video with a newbie who clearly is already a pro!",
  "models": [
    {
      "name": "Barton",
      "person_id": 8564
    },
    {
      "name": "Phillip",
      "person_id": 8655
    }
  ],
  "release_date": "2017-07-21",
  "scene_id": 8716,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Barton & Phillip - RAW"
}