{
  "collections": [
    "ChaosMen"
  ],
  "description": "It is hard to believe that both Franco and Jerome have more TagTeam experience then Easton, the only guy who fully identifies as gay. Not that in his personal life he has no experience, I just thought it was ironic that it took me this long to get Easton with more than one guy. I need to do this more often!\nAs always, Easton is completely in the moment, while Jerome is now requesting even more TagTeams. The dude does love to suck dick and get fucked!\nThere is so much to love about this video. Amazing chemistry, cock-sucking and rimming. Everyone gets fucked, and is clear that everyone is loving it. Ok, maybe Franco and Jerome had to 'tap back' when their partner goes a bit too deep, but everyone is so turned-on in this video!\nThe ending is awesome too. Franco cums all over Jerome's face, while Easton fucks him hard. With cum dripping into his mouth, Easton tries to make Jerome cum by stroking him. Easton gets him close, but Jerome takes over and spills a thick white load onto his stomach.\nEaston wanted to fuck Jerome until he came, but Jerome needed a break. So Franco steps in behind Easton, and fucks him until Easton is close to cumming and then jerks his load into Jerome. Franco then makes Jerome clean his cock, while Easton rims Jerome's cum-soaked hole!\nTeamwork!",
  "models": [
    {
      "name": "Easton",
      "person_id": 8522
    },
    {
      "name": "Jerome",
      "person_id": 8561
    },
    {
      "name": "Franco",
      "person_id": 8102
    }
  ],
  "release_date": "2017-07-28",
  "scene_id": 8718,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Sex Act - ATM Ass To Mouth"
  ],
  "title": "Easton & Franco & Jerome - TagTeam RAW"
}