{
  "collections": [
    "ChaosMen"
  ],
  "description": "Timmy surprised me with his cock-sucking skills in this video. Yes, he did blow Lorenzo in his last video, but his game was ON this day!\nWright and Timmy make-out for a bit, and then pull each other's cocks out. Both of them admired each other's cock size throughout this video. They were equally impressed with being able to play with such large tools.\nTimmy services Wright first and he does a fine job, but once he flips Wright over on to his back, and then fucks his face, he has access to slide Wright's cock deep into the back his throat. The guy can deep-throat like few others!! Literally balls deep!\nTimmy said he was mostly a Top, but was fine with bottoming if the cock was not too big. Ooops! But he took it like a champ, and he is clearly an experienced Bottom.\nWright sits on Timmy's cock, struggling a bit to get Timmy's massive meat inside of him. Once there though, Wright delights in having Timmy fuck him.\nTimmy couldn't decide which he wanted more for the end of this video. He knew Wright could fuck the cum out of him, but he so wanted to breed Wright's hole, and that is what won out. He juices his hole like a pro!\nWright enjoys getting fucked, but he still has not found that moment where he thinks it will make him cum. But he does love giving dude's facials!\nSo, after having his ass creampied, he strokes out a giant load, covering Timmy's face and mouth with an outstanding amount of cum.\nTimmy is somewhat local, so I am eager to keep him busy. Both guys are amazing in this video, but Timmy will blow you away with his skill and energy!",
  "models": [
    {
      "name": "Timmy",
      "person_id": 8691
    },
    {
      "name": "Wright",
      "person_id": 8507
    }
  ],
  "release_date": "2017-08-04",
  "scene_id": 8720,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Timmy & Wright - RAW"
}