{
  "collections": [
    "ChaosMen"
  ],
  "description": "I don't normally pair guys up a second time, then again, I haven't had too many of the guys get Serviced by other models.\nOther than I am always available, most of the models want me to do the Servicing, because they felt comfortable during their solo. Familiarity is usually what they seek.\nSo the same thing really holds true for Santana, who was Serviced by Ransom. When I suggested he fuck a dude, he asked if he could work with Ransom again. Ransom had already said, \"Get that guy back, I will even bottom!\" So I knew I could make that happen.\nI have to thank Ransom. He is normally a top, but knows most of the straight guys want to top to start with, so he basically gave up his Top Dude status to get these guys in the loop.\nIronically, we had to stop in almost each position, as Ransom got close to nutting. Finally, after a leg cramp break, Ransom said there was no way he wasn't gonna nut while riding Santana's cock. Sure enough, with very little effort, he was busting all over the place.\nYou can sure tell it was Santana's first time. I got him to touch Ransom's dick a bit, and you can tell he's just not quiet comfortable, checking in with me or the video playing for him.\nBut I think he did great! He nuts an awesome load, and I think he will just become more and more comfortable as he moves along.",
  "models": [
    {
      "name": "Santana",
      "person_id": 3297
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2008-11-21",
  "scene_id": 873,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Ransom & Santana - Wrapped"
}