{
  "collections": [
    "ChaosMen"
  ],
  "description": "Nuffin' like a side-by-side jack off that turns into a major fucking.\nOk, not a complete surprise, as we always discuss everyone's limits. But the deal with Connor was, try this, try that, and if you think you can do more... then do more.\nHe did more!\nSurprisingly, eager bottom Degan was struggling to lead the newbie through the gay sex.\nWell, actually, I shouldn't be surprised. I set up his last couple videos to really take advantage of his passive/submissive streak. The vids just start off with him in a position to be dominated.\nBut I knew Connor needed to be eased into a few things. While he is no pussy about it, clearly he's not sure what to do at the beginning. He checks in with me quite a bit, and you can really tell he can't believe he is playing with another dude's dick.\nSo Degan was a bit forced to take the initiative, and you can see it was a hard for him. I think he jut wants to be used, abused and blissfully ass rammed!\nAnd then the magic happened like it did with Degan's previous videos. Connor just needed to see his fact cock splitting Degan in two, and then seeing just how turned on it made Degan- it really brought out his Dominate side.\nOnce again, Degan literally gets the cum fucked out of him, while Connor bust all over his ass, spreading his load all over his new bitch.\nIf you like your men extra manly and mature, and bit tough...wow, you can't go wrong with this nearly flawless video.",
  "models": [
    {
      "name": "Degan",
      "person_id": 3276
    },
    {
      "name": "Connor",
      "person_id": 3294
    }
  ],
  "release_date": "2009-01-02",
  "scene_id": 874,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Mature",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Chest - Smooth/Shaved",
    "Sex Act - Oral",
    "Hair - Red",
    "Pubic Hair - Trimmed",
    "Video - HD - High Def",
    "Chest - Hairy/Hair",
    "Theme - Wrapped"
  ],
  "title": "Connor & Degan - Wrapped"
}