{
  "collections": [
    "ChaosMen"
  ],
  "description": "Brick seemed very relaxed about getting head from a guy. He and Lorenzo watch a little porn, and his cock was ready to go before even taking it out.\nLorenzo squeezes his hard cock through his shorts, showing us a nice outline of his rod. Lorenzo pulls his cock out while Brick crosses his arms behind his head, kicking back, ready to be Serviced. But Lorenzo takes his time, stroking himself, along with Brick's cock.\nNext, Lorenzo gets Brick on his back and starts to service his cock properly. Brick does not watch the porn video playing for him very much. Instead, he tilts his head back and closes his eyes. But he does not check out completely, often watching Lorenzo suck on his cock.\nBrick gets up on his knees and in this more dominant position, he takes more charge of Lorenzo. Brick makes him lick his balls and fucks his face.\nWe stopped to take some pictures and I asked Brick if he could cum from being sucked. He said he didn't think so, but I told him that Lorenzo was not really going full-tilt on him.\nBrick laid back down on the couch and Lorenzo EASILY makes him cum in mere minutes. Cum flies out everywhere, while Lorenzo laps it up. Lorenzo has shot quite a few videos, and he was astonished how easily he made Brick cum.\nI think Brick looks a little awkward just after he nutted. He is not quite sure how to react from cumming for the first time by a man's mouth and hand!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Brick",
      "person_id": 8731
    }
  ],
  "release_date": "2017-07-26",
  "scene_id": 8740,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Brick & Lorenzo - Serviced"
}