{
  "collections": [
    "ChaosMen"
  ],
  "description": "SPOILER: There are a couple OutTakes in this video. More later in the summary.\nTimmy wanted to do a massage table video. They are his favorite to watch, but I think he was hoping to be the one who was getting the massage. Based on what Timmy said, he sounded like he already had the rhythm and the ritual down, and since Phillip was new, I thought maybe Timmy should be the one to do the massage.\nNot a single complaint from Timmy of course, he was happy he got not only rub Phillip, but to fuck him as well. I promised him he could sit in the Edge chair at a later date.\nPhillip really enjoys being oiled-up, and Timmy works his cock from soft to hard with some gentle tugging. Once he gets Phillip's ass in the air, Phillip really got turned-on. It still boggles my mind that straight guys love ass play.\nAnd Phillip was downright hungry for cock too. After Timmy had rimmed him, he flipped Phillip onto his back, intending to oil up his front side and stroke his cock, but Phillip voraciously shoves Timmy's giant cock into his mouth. He nurses on it while Timmy strokes his cock.\nLater, Timmy pulls Phillip's head off the edge of the table, and you can tell that Phillip still is a newbie at trying to learn to swallow cock.\nThis worried me as I realized he was soon going to take that big cock in his ass.\nTimmy climbs between Phillips legs and ever so slowly slides his cock in. Phillip is a trooper. His cock starts to go soft, so he rapidly starts jerking while Timmy continues to slide his cock in and out.\nThen the first of the OutTakes happened. I was panning around, when Phillip realized he was about to cum. We all come to a screeching halt, worried that 3 minutes into fucking Phillip would cum. But I left the moment in because it was such a short pause, and Timmy is able to resume fucking him. A close call!\nTo give Phillip a break, Timmy straddles him, slowly sliding his cock in. Timmy if more of a Top, and actually took a bit longer than Phillip did to take it in the ass. But once in, he rides him like a pro. His giant cock keeps slapping Phillip's stomach and Phillip seems mesmerized by it!\nNext Timmy fucks Phillip doggie-style, and once again Phillip gets close to cumming. I had warned them beforehand that if that happens, just to stop and change positions.\nSo, Timmy flips Phillip on to his back and fucks him from a different angle. This is of course the same angle that had Phillip about to cum earlier. Maybe not the smartest idea after all.\nThose of you who read these summaries will often see me say, \"I had to scramble up and get in position to catch his cumshot.\" and this time there was just no avoiding it so I made it part of the final edit.\nAfter only getting fucked a few minutes on his back, and with me on the ground getting some under footage, I could hear Phillip shout out that he was about to cum.\nThis time you literally see me scramble out from under to catch his cum shot. There are some cameras in the replay shots as we were totally not ready to for Phillip to bust, but we got it!\nTimmy then has to take a moment to stroke his cock to shoot his load on Phillip's hole. He tentatively pushes his head in, trying to juice him with his load, but by that time, poor Phillips was spent!",
  "models": [
    {
      "name": "Phillip",
      "person_id": 8655
    },
    {
      "name": "Timmy",
      "person_id": 8691
    }
  ],
  "release_date": "2017-09-15",
  "scene_id": 8764,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Shaved",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Phillip & Timmy - RAW"
}