{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jerome always bring the hottest energy to the videos and I knew pairing him with Jalen would be magic. Both are extremely passionate, and this video sizzles!\nI believe there are four cumshots in this video, though one of them we will have to take Jalen's word for it. You can be the detective and try to find all four.\nBut let's not get too far ahead.\nThe kissing is passionate, and they both were into each other's armpits. Jerome had this done to him in a previous video, and he asked to give it a try. He has been looking at your feedback, and he is eager to get as raunchy as possible for you all.\nAfter sucking each other's dicks, Jerome rides Jalen's big uncut cock. Pretty sure this is the biggest dick Jerome has taken, and the dude just loves it! He rides it forward and reverse, giving us a quite a show of just how good he can take a cock now.\nNext, Jerome rims Jalen's hole, getting it lubed up for his cock. Jalen, who is more of Top, struggles to accommodate Jerome's thick rod, but they finally get it wedged in. After that, Jerome fucked him without mercy.\nHe flips Jalen on his back and continues to pound him. He keeps fucking until he starts to cum inside of him. Jerome pulls out only for a moment, letting some of his seed seep out, then unloading totally inside of Jalen. You can see his cock spasm and he unloads!\nJalen wants payback, so gets Jerome on his back and tries to fuck him until he too can breed him. Jerome had just cum, so he was trying really hard to take it. He kept playing with his own cock, just to keep himself in the zone.\nCum is dripping our of Jalen's hole as he ramps up to shoot his own load inside of Jerome.\nHe pulls out to give a few last jerks, then dumps his load deep inside of Jerome. He pulls out and a wee bit of cum squeezes out of his cockhead.\nHe shoves his cock in, starting to fuck him with his load, when suddenly Jerome shouts out that he thinks he can cum again.\nJalen picks up the pace and fucks another load out of Jerome!\nNow you really have to watch Jalen's face as Jerome is cumming as Jalen told me right after shooting this that he came a second time inside of Jerome. My focus was on Jerome at the time, but sure enough when I edited this, you can see Jalen is cumming again. Well, his face sure shows he is.\nJalen licks-up Jerome's second load, and he kisses Jerome with the load on his lips.",
  "models": [
    {
      "name": "Jalen",
      "person_id": 8646
    },
    {
      "name": "Jerome",
      "person_id": 8561
    }
  ],
  "release_date": "2017-10-20",
  "scene_id": 8765,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - Mixed Heritage",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jalen & Jerome - RAW"
}