{
  "collections": [
    "ChaosMen"
  ],
  "description": "For those wondering, I finally had two models that arrived with running shoes so we could do a video that would please fans of seeing guys have sex in their sneakers. I am sure some are bewildered, while others will say, \"It's about time!\"\nWhile filming this, I didn't realize Soren looked so nervous. But upon editing this video, I could see how anxious he was.\nJerome is in his environment and he took charge. His cock was hard and ready to play, and Soren was working his own cock up through his shorts.\nOnce Jerome takes his cock out, Soren seems to get a little shy. They stroke their own cocks together, but Soren starts to lose it.\nJerome jumps in with his own hand, then his mouth and Soren is finally rock hard.\nThere are still a few minutes where he is intently watching the straight porn we had playing for him. Right about that time, he realized he was turned-on, and was really liking the oral attention. He finally relaxes and gets into having his dick sucked by another dude.\nJerome gets down on his knees and properly services Soren's cock.\nI wasn't too sure Soren would suck back, but Soren seemed really aroused, and sucked on Jerome's dick with newbie skills. He looked like he enjoyed it, and his skills increased throughout the shoot.\nThey 69 suck, and that's when you can really tell Soren was finally enjoying sucking and being sucked at the same time.\nJerome rims him for a bit, and I had a little hint that Soren might like some anal play in the future.\nSoren easily strokes a load into Jerome's open mouth. Jerome sucks the last bit of jizz out of it, while making his own cock squirt a load.\nThat Jerome, he is such a treasure!\nI would love to have Soren back, he reminds me a bit of Glenn, and we know how well that turned out. I am just not sure if will go beyond what is in this video. But I see potential!",
  "models": [
    {
      "name": "Jerome",
      "person_id": 8561
    },
    {
      "name": "Soren",
      "person_id": 8751
    }
  ],
  "release_date": "2017-08-09",
  "scene_id": 8766,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Jerome & Soren - Serviced"
}