{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bronson's sexual activity with dudes was really just art and photo shoots. No actual contact.\nWith his hot body, I figured he would appreciate working with Wright. Sometimes the straight guys get into a little homoerotic body worship, that is close to being a chemical attraction.\nThere is a significant difference in height between the two guys, but at 5'5\", Bronson will likely be quite a bit shorter than his partners. Still, I think these two look extremely hot together.\nI set up the video as a side-by-side jerk-off, hoping Bronson would get into it. Wright is a lot more comfortable these days, so he got hard easily. Bronson watches the porn intently and gets solid, while Wright works his way up to jerking his buddy's cock.\nBronson then reached over and stroked Wright's dick, and I think that hit his limit. He gets a little wobbly, so Wright switches it so he is sucking on Bronson's cock.\nYou can tell Bronson is interested in Wright sucking him, but if his cock would start to go down, all he had to do was watch a little porn and it would spring back to life.\nI know everyone loves to see a facial, but I am also a big fan of guys racing to nut on each other's cocks.\nAs nervous as Bronson was, he came easily on Wright's cock. Something about that position definitely gibed him a Dom vibe, and I think he enjoyed busting his nut on another guy.\nWright was a little delayed, but he managed to shoot a hefty load before Bronson's cock wilted too much. So not perfectly timed, but still quite good! I know you guys don't think about this, but even gay guys will want to wipe the other guy's cum off their face so they can focus on getting their own nut to fly. So props to Wright for pretty good timing after another dude just shot his load on him.\nI would love to get Bronson back for more. So far, he says he might be down to suck dick and Top a dude, and he is scheduled to come back!",
  "models": [
    {
      "name": "Bronson",
      "person_id": 8761
    },
    {
      "name": "Wright",
      "person_id": 8507
    }
  ],
  "release_date": "2017-08-23",
  "scene_id": 8774,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Bronson & Wright - Serviced"
}