{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kevin Reed assured me that he used really big toys to play with his ass while at home. We even went through the variety of dildos I have in the studio, some of which are quite big. He said his toys were way bigger. Kevin is such a little guy, so I found it hard to believe, but sure enough, he could easily take Alonso's big cock.\nAlonso forges new ground in this video too. He has always been a dominant Top, with both men and women, and based on what he was telling me, this was his actual first time taking a real cock. We of course prepped and practiced a little during photos, so by the time we did the first insert, he was good to go.\nAlonso even gets verbal and encourages Kevin to fuck him faster. Kevin pounds his ass, but is eager to get fucked again. This was definitely a success for Alonso's 'first time'.\nWith this being Kevin's first time shooting a full sex scene, these two really have great verbal and chemistry. Kevin WANTED that big cock in his mouth and ass, and even loves cleaning Alonso's cock after being fucked with it, then wanting it back in his hole.\nIn order to cum, Alonso just kept fucking him harder and harder, and you can finally see Kevin break, trying to squirm away. But Alonso was having none of it. Alonso finally pulls out and jerks his cock and juices his hole. He shoves his load in, while Kevin strokes his hard cock.\nKevin licks the cum off of it, then gets Alonso on his back to fuck his face. He actually does get quite close from fucking his mouth and easily gives Alonso an amazing facial. I love the way he tells him he is about shoot. Much of it hits his face, but Alonso moves to taste his load and even swallows it. It is a really REALLY hot facial that rivals the creampie!",
  "models": [
    {
      "name": "Alonso",
      "person_id": 8394
    },
    {
      "name": "Kevin Reed",
      "person_id": 8708
    }
  ],
  "release_date": "2017-08-02",
  "scene_id": 8777,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alonso & Kevin Reed - RAW"
}