{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Cayden did his solo he went home and browsed through ChaosMen like he was shopping. He sent me a list of guys he would love to play with. This is not something I encourage, because well, they pick guys from 8-9 years ago. Sure enough, he had dug back through many years, but thankfully at the top of his list was Sean Peyton.\nAnd you can tell Sean was pleased with who he was working with too. They spend lots of time kissing, and clearly they are both pros at giving head.\nCayden mentioned he was more of a Top, and he was most eager for Sean to sit on his face. He rimmed his hole, making Sean eager to suck Cayden's cock.\nWhen you watch Sean make Cayden cum, you would think that Sean was struggling to make it happen but that is not the case at all.\nCayden confessed he actually has troubles nutting too soon. But when he was cumming he reaches down and grabs Sean's wrist and 'helps' make him cum. Pretty sure Sean could have handled it, and it made me think maybe Cayden needs to be tied in a chair with his hands tied behind him.\nThere was a lot of cum, and initially Sean used it to jerk-off on to Cayden's face, but Sean could not get any traction on his own cock with so much jizz. We did a quick wipe-up, and Sean easily gives Cayden a facial.\nAnd nails him right in the eye! This seems to be a thing, and I think the guys need some Target Practice!\nAny volunteers?",
  "models": [
    {
      "name": "Cayden",
      "person_id": 8755
    },
    {
      "name": "Sean Peyton",
      "person_id": 8158
    }
  ],
  "release_date": "2017-08-30",
  "scene_id": 8778,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Cayden & Sean Peyton - Serviced"
}