{
  "collections": [
    "ChaosMen"
  ],
  "description": "Pairing Caspar with guys who match his mass and height has been interesting. At 6'5\" he towers over most of the team. When Cayden came in, and I knew that his 6'2\" height would finally look a bit more evenly matched.\nOf course, Cayden has a lean build, but I figure we can scale Mount Caspar one dude at a time.\nCayden also has really great energy, and I think he pulled out one of the best performances Caspar has done. He responded to Cayden's chemistry and skills and was eager to play with Cayden.\nWhile bottoming, Caspar will occasionally wince his way through a video with a big dicked guy. Easton coming first to mind. But, Cayden fucked him like a pro and Caspar was really getting-off.\nCayden even shows that he is also a great bottom, riding Caspar's cock while stroking his own cock.\nFor Cayden's first ChaosMen creampie he did an amazing job. He jerked his cock to start cumming and while his load was shooting out, crams it into Caspar's hole. He pulls his hand away in time to see his cock pump the load in.\nWe still have not got Caspar to nut from getting fucked, but he easily strokes his cock until he cums, while Cayden laps up his load! Yum!",
  "models": [
    {
      "name": "Cayden",
      "person_id": 8755
    },
    {
      "name": "Caspar",
      "person_id": 8555
    }
  ],
  "release_date": "2017-09-22",
  "scene_id": 8787,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Caspar & Cayden - RAW"
}