{
  "collections": [
    "ChaosMen"
  ],
  "description": "These two were made for each other; In height, weight, build, and looks!\nEaston loves to be a power Top, and though this is only the second time Kevin has taken a real cock, he really does love to get fucked. I have mentioned before he loves giant toys at home, challenging himself to take the biggest he can.\nKevin is still a bit of a newbie at bottoming. It is not quite the same as his toy, and giving up the control is still new to him.\nBut he loves the anal attention, so Easton starts by rimming his hole, getting him all slicked up for his cock. But before allowing him to take his cock, he makes him suck on his cock, just so he can see how big his dick is before fucking him.\nKevin tries his best to suck on it, but it is more than a mouthful. Easton fingers his hole, getting 3 fingers in there, and spreading his hole wide for his cock.\nEaston slides his cock in slowly, giving Kevin time to accommodate his cock. It didn't take long for Kevin to encourage him to fuck him faster and harder.\nAfter getting pounded by Easton, Kevin quickly slams his cock into Easton. That took Easton by surprise, and you can tell Kevin is used to just sliding his cock quickly into a pussy. Easton loved it though and once again I am reminded the dude really can bottom with the best of them.\nKevin gets fucked on his back, and it surprises me that it is his least favorite position. I have tried twice now, thinking he might be able to cum from being fucked, but it is not his best position for it. Next time I think I will have him ride someone's cock.\nIn the meantime, Easton fucks him until he is about to cum, squirts some jizz on his hole, then pumps the rest inside Kevin. You can hear Kevin saying, \"Yeah, fill my hole!\"\nEaston plays with the load and then grabs his cock and ferociously jerks Kevin's cock. Kevin does find it easy to cum when he is stroking his own cock, but Easton easily jerks a load out of him, lapping up his cum, followed by sharing a hot kiss!",
  "models": [
    {
      "name": "Easton",
      "person_id": 8522
    },
    {
      "name": "Kevin Reed",
      "person_id": 8708
    }
  ],
  "release_date": "2017-08-14",
  "scene_id": 8792,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Easton & Kevin Reed - RAW"
}