{
  "collections": [
    "ChaosMen"
  ],
  "description": "I was really blown away by the chemistry between these two guys.\nI worried that Price would be quiet and reserved, but Timmy was excited to play with Price. LOTS of kissing to get things rolling, especially when they stroke each other's cocks.\nPrice sucks on Timmy's big piece of meat first, happy to have his cock in his mouth. Price jerks his shaft while sucking on Timmy's sensitive head. He tries his best to get Timmy's dick down the back of his throat, but I think he needed a better angle of attack.\nTimmy gets Price on his knees and sucks his cock until he is back to fully hard. I think I got some really nice under coverage.\nHe then gets Price doggie-style and really rims his hole. Timmy needed to get his cock fully hard, so rubbing his cock against his hole got him solid. Sorry for the tease again, but this trick works great for Timmy.\nThe two then 69-suck, but Price concentrates on Timmy's hole. With Price being a Bottom, I did not expect him to be such a voracious ass eater. I guess he is meant to service guys in all ways!\nTimmy spins around and dumps a huge load into Price's open mouth, most of it going in, but frosting his face a bit.\nThey share a quick kiss, then Timmy slides down between Price's legs to suck on his cock and encourages his buddy to nut.\nPrice grabs his dick and strokes out a load so Timmy could lap his jizz up like he was at a drinking fountain!",
  "models": [
    {
      "name": "Price",
      "person_id": 8795
    },
    {
      "name": "Timmy",
      "person_id": 8691
    }
  ],
  "release_date": "2017-10-04",
  "scene_id": 8799,
  "tags": [
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Price & Timmy - Serviced"
}