{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would try to mix-up the Serviced videos a tiny bit.\nJoiner was nervous about getting head from a guy for the first time.\nHe has such a tight little body AND since Micah was going to be blowing him, I knew they were virtually the same height. I figured Micah could put him at ease too.\nMicah starts off by exploring Joiner's body, kissing all around his neck, nipples and abs, tugging on his cock through his board shorts.\nJoiner is practically hard by the time Micah peels them off and in no time he has his boomerang dick hard as a rock.\nJoiner actually commented after the shoot that standing while getting head was a lot harder than he thought it would be. I know this to be true for a lot of guys, hence me doing most of the Serviced videos with them kicking back and chilling.\nAt 27, I think it is kind of funny that he just then was discovering standing while being blown was a challenge.\nSpeaking of first times, Micah actually (tentatively) rimmed Joiner. He wants to step up his game and I figure with Joiner being naturally hair free, his asshole would be a great one to start on. Don't look for some piggy butt eating, but he did try AND he kept Joiner hard the entire time. I love it when he flips him onto his back and his cock is standing straight up.\nMicah goes to town on him, trying to get him to nut. His arm was giving out and Joiner kept getting close. If you wait until after the titles, you can catch me getting him to almost nut as we try to do a sneaky trade-off. I so just wanted to make him nut! It is frustrating sometime to just be the \"director.\"\nThis trick didn't work, so Joiner ends up grabbing his dick and gives Micah a facial, but gravity grabs the load and most hits his stomach.\nMicah was down for trying a facial this time, and maybe next time I can get some cum in his mouth. He is eager to keep the fans happy, but still struggling with smells and tastes. (And yes, Joiner tastes amazing)\nI think Joiner said he might consider doing more, but he is going to think about it. Could be a while before we see him again.\nI sure would love to have him back though!",
  "models": [
    {
      "name": "Joiner",
      "person_id": 3446
    },
    {
      "name": "Micah",
      "person_id": 3390
    }
  ],
  "release_date": "2011-06-29",
  "scene_id": 8801,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Joiner & Micah - Serviced"
}