{
  "collections": [
    "ChaosMen"
  ],
  "description": "In a few ways, having Joiner uh...Join the team, after having not made an appearance in over a year, makes things challenging for viewers. Often I tell members that if a model hasn't made an appearance in a good long time, chances are they have moved on, or won't coming back. He's back!\nJoiner surprised me by texting me out of the blue. He said he wanted to come back and do more, and I was going over an oral video. He finally reminded me he had done one, and that actually he was eager to try bottoming.\nHe says he is definitely into girls, but none of them will play with his ass, and he has a very small toy that he likes to use when he jacks-off. He figured this might be a way for him get what the girls can't give him.\nJoiner wanted someone \"not too big\" and I wanted someone who could stay hard while patiently taking on a first-timer. Enter Allen who always seems to be UP for anything!\nIt was good thing I picked Allen. Joiner DID struggle to take Allen's cock up his ass. I think he must have shouted, \"Pineapple\" 10 times. I know, I should do a pineapple outtake update, but sometimes I feel like it ruins the fantasy.\nI did leave in that it clearly was taking him some time to adjust to sitting on Allen's rather large cock. Maybe I over estimated the size a little...or we need to get Joiner a bigger toy!\nWhat I like most about this video is Joiner was willing to go full-tilt, no-hold-barred sex! Kissing, eating ass, sucking cock - he did it all. Maybe a little tentatively, but he knocked down all the usual barriers and limits guys have. Bam!\nHe kind of has a \"non-cumshot\" as it is real clear AND he jerks off fast. Add onto that, he had been jacking-off non stop the entire week before the shoot, thinking about getting fucked. He arrived with his cock already sore, and likely a little spent.\nBut Allen saves the day with a terrific Juicing! He usually is on the receiving end of the creampies, and once again, I have to add another skill to Allen's amazing range.\nAnyway, if you thought Joiner's oral was a little stiff, (he was very nervous!) then don't worry about this video! Joiner and Allen really pushed and made this an amazing pair up!",
  "models": [
    {
      "name": "Allen",
      "person_id": 3477
    },
    {
      "name": "Joiner",
      "person_id": 3446
    }
  ],
  "release_date": "2012-11-19",
  "scene_id": 8805,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Allen & Joiner - RAW"
}