{
  "collections": [
    "ChaosMen"
  ],
  "description": "Not sure what order Zane's videos will appear on the site, but this was his first video back from a long hiatus. The big beefy Texas boy has matured nicely! He still is a massive dude, but looks more cut, and thankfully, has all his natural body hair. His beard is super sexy, and that natural bush framing his big 'ole cock is a joy to behold.\nWhen trying to find someone nearly as tall as Jayme, who at 6'8\" is going to be a hard match height-wise, I figured Zane's 6'4\" would at least give him a run for the money.\nBoth guys were a little nervous getting started. Zane was mainly nervous because of just being back on set, while Jayme was being filmed the first time with a guy.\nZane starts by blowing Jayme, who has a downward angle that Zane worked like a pro. Since his time at ChaosMen, he has been dating men only, so he definitely plays full-time on Team Gay. It shows in his experience level.\nWhen Jayme got on his knees to suck Zane, he hungrily went at it, and it took all of us by surprise. He had said he had only one real experience with a guy, but now we are left wondering if that was true, or if he just finally released his inner homo.\nHe even makes Zane almost cum, and I left that moment in as a little precum starts to dribble. I re-direct Jayme to lick his balls, and Zane cocks goes down a bit, giving him a break from almost busting.\nZane then rims Jayme's hole, hungrily eating him out while stroking his cock. Jayme goes from being tickled by Zane's beard to sheer delight at having his ass eaten-out.\nSince Zane is so easy to make cum, we got him sitting upright so Jayme could jerk and suck a load out of him. He gets him really close, but as he is cumming, Zane grabs his own cock to push the load out. Jayme recovers the cock back, fighting for control to jerk the last of his load out. Jayme licks up the cum from Zane's sensitive head.\nNext it was Jayme's turn to feed his load to Zane. He jerks his cock for a bit, and then literally feeds his load right into Zane's mouth. You can see just a bit squirting in, then he gives him a mouthful. Zane spits it back onto his cock, and jerks some more cum from his cock.\nBoth guys do an amazing job, and it appears that Jayme has very few limits when it comes to playing with a guy!",
  "models": [
    {
      "name": "Zane",
      "person_id": 3306
    },
    {
      "name": "Jayme",
      "person_id": 8789
    }
  ],
  "release_date": "2017-10-11",
  "scene_id": 8809,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jayme & Zane - Serviced"
}