{
  "collections": [
    "ChaosMen"
  ],
  "description": "I pronounce this the best Glory Hole video on the site!\nIt helps that I am not performing in it, allowing me to get better camera angles, but mostly, I had two very eager boys.\nBarrett is straight guy that hasn't been on the site yet. I didn't want to air his solo or photo series (yet) 'cuz I like the anonymity of the Glory Hole thing. Even though there is a rhythm to the vids, I figured a bit of \"just a random guy\" would spice things up.\nTris is an amazing cock sucker, and Barrett has an enormous dick that looks good stroking as well as through the hole. Before the shoot, Tris secretly whispered to me \"Uh, he really is straight.\" Yes even the gay models don't believe most of these guys identify as straight- until they meet them.\nBarrett said he would get his dick sucked, but he was really enjoying the sensation Tris was giving him. He \"volunteered\" to suck some cock back. Tris got pretty excited having a straight dude blow him, and nutted a bit in his mouth. We did a quick cut as Barrett got a bit more than he bargained for, and wasn't quite ready for that. I would have left it in, but the gagging wasn't a good gag!\nBut fair is fair, and Tris gets down to the serious job of making Barrett nut. Tris makes him cum and eats most of his cum, leaving a delicious drop on his face. Barrett sits down on the toilet exhausted, while Tris looks at him through the hole and VERY quickly spills his load on the floor.\nEven if you aren't a fan of this genre, this is a seriously hot video!",
  "models": [
    {
      "name": "Barrett",
      "person_id": 3302
    },
    {
      "name": "Tris",
      "person_id": 3301
    }
  ],
  "release_date": "2009-01-07",
  "scene_id": 881,
  "tags": [
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Theme - G:hOle",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Barrett & Tris - G:hOle Oral"
}