{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video seemed more like familiar territory for Lenny.\nHe has had guys blow him, and even has fucked a few dudes. He has a little bit of bossy Dom side to him, and I think that comes out nicely in the video. He just wants someone, anyone, to Service his cock.\nCayden was more than happy to be of Service. I told him if he was keeping Lenny hard, he could take his cock out and stroke along. Cayden pays more attention to pleasing Lenny, but Cayden is clearly turned-on by servicing Lenny.\nLike his solo, Lenny was best standing in order to bust. Cayden works really hard and consistently to suck a load out of Lenny. Cayden is more mature than the other models, and it was great to see a guy who instinctively knew how to attack a cock with skill, energy, and consistent technique.\nAfter the powerful orgasm, Lenny flops back on the bed exhausted. I was expecting Cayden to simply stand and cum on Lenny's cock while they were both standing.\nI did have to quickly move some cameras around to catch this last-minute change in position as Cayden is already known to be able to go from zero to cumming in about 90 seconds.\nWith Lenny's load on his face, Cayden stands over him and quickly bust his load all over Lenny's body. Then, Cayden cleans-off hiss buddy's cock, licking up the aftermath of both their loads.",
  "models": [
    {
      "name": "Lenny",
      "person_id": 8812
    },
    {
      "name": "Cayden",
      "person_id": 8755
    }
  ],
  "release_date": "2017-11-08",
  "scene_id": 8816,
  "tags": [
    "Build - Average",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Cayden & Lenny - Serviced"
}