{
  "collections": [
    "ChaosMen"
  ],
  "description": "I wasn't sure I was gonna get Jagger to come back and do more. He was pretty nervous during his Serviced video.\nBut when I picked him up, he full of energy and optimism about the upcoming shoot. He was saying he thought he could suck dick, and thought MAYBE, some day, he might even bottom. I was psyched to hear so much enthusiasm, and that he was wanting to go full-tilt.\nHe was being paired with Ransom, who once again gave up his Top status for a nervous straight guy. I promise soon you will see Ransom topping and it is off the hook!\nSo all was going well, and then Jagger got in the room with Ransom, and then it dawned on him (again) that this was another dude. He totally tensed up. You even hear me say to relax at the beginning. He went from literally doing back flips in living room, to very tense, all in the span of five minutes.\nRansom did great. He kept his head down and just kept at him. The oral is one of those good ones where you get to see Jagger's dick grow in Ransom's mouth.\nThe body language is interesting as Jagger tries to come to terms with the dude on his dick again. His eyes are closed and his head is turned away. Not necessarily wishing he was elsewhere, but he is going to a happy place somewhere else.\nRansom rides his cock expertly. When we change to doggy style, and it's like a switch is thrown on Jagger as he immediately starts showing off some fucking prowess. The dude has got some groove to his swerve! A hint of him \"letting go\" and how he might be in future videos.\nRansom knew he could cum by being fucked, so we got him on his back for the nutting that Ransom kept saying he needed badly.\nJagger is a bit awkward in this position as he tries to find a good position for energetic fucking. What's funny is Ransom seems to be oblivious to all the shifting about and is just in the zone to nut, which he does quite quickly.\nSo Jagger started off with good intentions. He didn't shatter too many barriers, but he did fuck a guy, and maybe next time we can get him to suck back!\nBut overall a huge step in getting Jagger to be the hot porn star I know he can be!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Jagger",
      "person_id": 3298
    }
  ],
  "release_date": "2008-12-19",
  "scene_id": 882,
  "tags": [
    "Ethnicity - Asian Guys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Theme - Wrapped"
  ],
  "title": "Jagger & Ransom - Wrapped"
}