{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bronson really took some time and thought into coming back. He wavered on doing more with a guy. I don't think money was a deciding factor, just trying to determine if he could do it. But when he committed, he said he was 100 percent sure.\nHe is very used to being photographed and filmed naked, so that was not the issue. Just the regular nerves about staying hard and sucking a cock for the first time.\nI put him with Lorenzo because he is the most laid-back model, plus their body sizes matched. And Lorenzo is patient amd he loves the idea of these straight guys exploring with him for the first time.\nWe start simple with Lorenzo giving him head. It took Lorenzo some effort to get him hard, while Bronson would look nervously around the room at me or the porn playing. I finally told him to just make Lorenzo his bitch and get dominant. I think that is what triggered his cock.\nWith girls, these guys know they can be bossy, but with another guy, they just aren't sure what role they need to get into. But having him take charge really worked great.\nLorenzo gets him to stand and sucks on his cock. Bronson also sucks on Lorenzo, and yes, you can tell it is his first time. Lots of stroking sessions between sucking. I am relieved Bronson got over this limit, and from this point forward I think he will improve at sucking dick.\nBronson was actually down to kiss, and it is hot to see him throw some energy into it. Though, he was not quite ready to try rimming. Lorenzo was eager to lick Bronson's hole. It tickled Bronson a bit, which sure gave me visions of a dude fucking Bronson. We can only hope!\nAs for Bronson fucking Lorenzo, he was a champ. He clearly has a lot of sex skills, and fucks like pro.\nBronson easily fucks the cum out of Lorenzo, then quickly paints his hole with his own load. He is much like Lorenzo, in that he can cum pretty much on command, a rare talent in porn that is always appreciated.\nI love this video. It has 'first time' charm, but some expert fucking that draws you in and makes you want to cum along with them!\nAnd damn, that Bronson is a hot 'lil fucker!",
  "models": [
    {
      "name": "Bronson",
      "person_id": 8761
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2017-10-09",
  "scene_id": 8829,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bronson & Lorenzo - RAW"
}