{
  "collections": [
    "ChaosMen"
  ],
  "description": "I thought I would put our resident Country Boy with our Lumberjack.\nCaspar, our lumberjack, does seem like a Sequoia compared to Kevin, who can barely reach up to kiss Caspar. So, he instead focused on his massive pecs, biting down on his nipples. Caspar loves that!\nKevin climbs down to his dick, and his cock-sucking skills have improved a lot! Caspar puts Kevin on his back and shows-off his own cock sucking skills.\nCaspar then manhandles Kevin, rolling him up into a ball to eat out his hole. Kevin loves to be rimmed, and I even think likes to be dominated. So, Caspar sits on his chest, pinning him down, and making him suck his cock. He spins around and sits on his face, making Kevin get his hole all wet.\nCaspar spins around again, and rides Kevin's cock. Caspar loves this position. He likes to be in control, and this makes his dick even harder.\nNext Caspar fucks Kevin on his back, fucking him gently at first but eventually ramming him while his strokes his buddy's cock. Caspar actually cums at this point, filling him up, but I will be damned if I can tell when it happened. (SORRY!) I think Caspar thought he could just keep fucking Kevin, and cum again later in the video.\nThis got Kevin pretty close to cumming, so we quickly switch so he can fuck Caspar. He ramps up and coats his hole, breeding our gentle giant.\nThey quickly switch positions, and Caspar does try to cum again, but in the interim, Kevin cums again, so Caspar moves in to lap up his load.\nKevin was super horny this day!",
  "models": [
    {
      "name": "Caspar",
      "person_id": 8555
    },
    {
      "name": "Kevin Reed",
      "person_id": 8708
    }
  ],
  "release_date": "2017-10-16",
  "scene_id": 8835,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Caspar & Kevin Reed - RAW"
}