{
  "collections": [
    "ChaosMen"
  ],
  "description": "I love having Zane ready to go for all types of scenes. Andreus had a great solo, and I knew these two would hit-it-off. With Zane's mass, I think Andreus is not as aggressive as he mentioned during his solo. Though, Andreus is first to attack Zane's huge cock.\nAndreus has skills too! He toys with Zane's cock, licking all around the head and shaft, teasing his cock. He gets most of his dick in his mouth despite the awkward angle.\nZane returns the favor, and I love seeing him nurse on a cock like it is his favorite thing to do.\nThey get into a 69 position with Andreus on top. Zane is sucking on his cock hungrily, shoving that Italian uncut cock deep into his throat.\nZane then rims him. Andreus's has a baby smooth ass, with only a little bit of fur around his hole. Zane looks hungry! I know Andreus says he is a Top/Versatile guy, but it will be hot to see his bubble-butt fucked!\nAndreus fucks his face, then gets Zane's legs up in the air to rim his hole. They then joust their cocks while kissing passionately.\nZane gets on his back while Andreus easily nuts into his mouth. Andreus makes sure that every drop goes in and Zane has no choice but to swallow it. Zane actually tries to pull more cum out of his cock, swallowing everything! It's as if he uses Andreus's cock to shove the load down his throat.\nAndreus gets on his knees so that Zane can unload in his mouth. Just like Andreus, Zane makes sure that every drop goes into Andreus's mouth!\nIf you love cum-feeding videos, this is one of the hottest!",
  "models": [
    {
      "name": "Andreus",
      "person_id": 8831
    },
    {
      "name": "Zane",
      "person_id": 3306
    }
  ],
  "release_date": "2017-10-26",
  "scene_id": 8837,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Andreus & Zane - Serviced"
}