{
  "collections": [
    "ChaosMen"
  ],
  "description": "What a way to end Monster Cock week!\nCamillo mentioned he liked fetish play, and I had to grill him about what exactly that meant. Mostly he likes to be tied-up and dominated. We added some bondage elements and Alonso really got into making Camillo his Boy.\nCamillo obviously loves the Daddy play, and the guy can take a dick!\nThis is a long video with just too many hot moments to trim down.\nWith Camillo's hands bounds, Alonso makes him service his cock. He then gets Camillo doggie-style and slides a large butt plug in him. Alonso slaps the plug, while Camillo tells him to spank him harder.\nAlonso then gets Camillo in the spreading bar, trapping his arms and legs, leaving totally vulnerable. Alonso slowly slides his cock in, but is soon power fucking the hell out of Camillo. Camillo even bounces up and down on his cock, loving being ass-rammed by his Daddy dick.\nAlonso give Camillo a break from the spread, laying on top of him, grabbing him by the neck and shoving his cock in. Camillo whimpers and groans ass Alonso goes balls deep on him.\nAlonso then gets him on his back and fucks the cum out of him. Camillo has a huge orgasm! Alonso then breeds his Boy's hole, making Camillo clean off his Daddy's dick!",
  "models": [
    {
      "name": "Alonso",
      "person_id": 8394
    },
    {
      "name": "Camillo",
      "person_id": 8841
    }
  ],
  "release_date": "2017-10-31",
  "scene_id": 8844,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - African American",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alonso & Camillo - Bossy"
}