{
  "collections": [
    "ChaosMen"
  ],
  "description": "Bronson is moving along on his limits. I keep trying to put him in situations that feel natural. I thought a massage themed video would keep him in familiar territory, but didn't want to be restricted to the balancing act that can occur having sex on a massage table. So we started with a massage on the bed.\nTimmy oils him up, relaxing Bronson immediately, maybe too relaxed? He pulls his underwear off. Initially, I think Bronson was being tickled with beard stubble between his ass cheeks. But he perks-up when Timmy's tongue dives in deep. Bronson gets a dominate vibe and pushes Timmy's face further into his hole.\nTimmy flips him on over, rubs oil on his chest, and kissing Bronson with the taste of his ass on his lips and scruff. Timmy moves down to his cock and gets Bronson hard. After servicing him, Timmy crawls up and sits on Bronson's chest, making Bronson suck his cock. Timmy is half hard, but looking down and seeing Bronson working on his cock, made Timmy all hard.\nTo give Bronson some neck relief, he flips Timmy onto his back and tries his best to get as much of Timmy's cock in his mouth from a better angle. His skills are rapidly improving!\nNext, Bronson fucks Timmy doggie-style. The dude can really fuck, and he has a smooth, experienced style.\nThey even spoon fuck, which is Timmy's favorite position. Though I think Timmy prefers to be the Big Spoon. They sneak in some kissing, and there is a lot of sensual energy. Bronson gets on his knees so he can power fuck Timmy.\nFinally, Bronson pulls him to the edge of the bed, and hammers his hole until Timmy shoots a HUGE load, even giving himself a facial. I think Bronson cracks a smile of wonder (or silliness) because it was such an outstanding cum shot and who can't help but giggle when someone shoots themselves in the face with their own load.\nBronson sure knows how to use his cock to fuck, and also cums easily, breeding Timmy's hole with ease. I would love to see him bottom, but he always brings his 'A' game when topping and breeding.\nYou might have guessed that I love working with Timmy, and I will continue to get Bronson in as much as I can, and continue to push his limits!",
  "models": [
    {
      "name": "Bronson",
      "person_id": 8761
    },
    {
      "name": "Timmy",
      "person_id": 8691
    }
  ],
  "release_date": "2017-11-17",
  "scene_id": 8876,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bronson & Timmy - RAW"
}