{
  "collections": [
    "ChaosMen"
  ],
  "description": "I love Easton! He always packs a punch when it comes to his sex films. He is an amazing Top and an excellent Bottom.\nSadly, he will be moving out of the country with his husband by the end of the year. So, I had him in to do two shoots back-to-back, and am hoping to get one more with him before he departs. Not a retirement from porn, but it will be hard for me to get him back from across the ocean.\nWhen Bennett aired on the site, I had a lot of model's hands in the air wanting a chance to play with him. Easton wanted to dominate his bubble-butt, and then the next day I figured Easton could get his legs up the air for some anal action.\nEvery guy I have had put with Bennett, they have instant chemistry. From sensual to hardcore, he brings out the best in whoever he is paired with. And YES, even Timmy will be back to play with Bennett, which I believe will air during the Holiday Marathon.\nThis video was filmed about the time we were having a lot of hurricane action, and poor Bennett spent an entire day trying to get here. We started late, and he was tired, but you sure can't tell by his energy in this video. These two are electric!\nIt also has a terrific ending with Easton ramping his cock up to cum, and then getting his head inside Bennett. His cock pulses as it unloads inside of him. Bennett also came a ton when Easton fucked a load out of him!",
  "models": [
    {
      "name": "Bennett",
      "person_id": 8769
    },
    {
      "name": "Easton",
      "person_id": 8522
    }
  ],
  "release_date": "2017-11-22",
  "scene_id": 8878,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bennett & Easton - RAW"
}