{
  "collections": [
    "ChaosMen"
  ],
  "description": "You might have to go pretty far back in the ChaosMen archives to find Jessy. Or just use our handy-dandy Search, and you will see he did a couple of videos way back in 2011. There are some models that I have kept in touch with, and Jessy is one of them.\nAt the time, he had just turned 19, knew he was gay, but thought he was a Top. It took him a bit to realize bottoming was definitely the better position, and with his amazing ass, I am sure he had a lot of interested guys volunteering to play with his back door.\nHe has grown-up quite a bit since then. Jessy knows what he likes, and has a much more mature outlook on life and goals.\nJessy told me he was ready to come back and bottom, but was not looking for donkey dicks. He likes mature dudes, likely 30-60 years old, and the furrier the better.\nI thought he would look great with Barton, though despite his age, still has a daddy-vibe about him.\nTurns out it was a perfect match. Both guys are totally into each other. Barton started by rimming Jessy, showing us how delicious his hole is, and just how fuckable it is. Barton literally could not get enough of eating his ass, while it put Jessy totally in the mood to get fucked.\nThey swap oral, and you definitely get the feeling this is a perfect Daddy/Boy video.\nJessy does his best to keep his Daddy happy, while Barton is eager to make his Boy get off on his cock.\nJessy easily nuts from being fucked, and Barton frosts Jessy's ass with a giant load, pushing the last bit of cum into his hole.",
  "models": [
    {
      "name": "Barton",
      "person_id": 8564
    },
    {
      "name": "Jessy",
      "person_id": 3436
    }
  ],
  "release_date": "2017-12-01",
  "scene_id": 8898,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Barton & Jessy - RAW"
}