{
  "collections": [
    "ChaosMen"
  ],
  "description": "These guys just kept cumming!\nPhillip is very versatile. He is a great Top and bottoming always makes him cum. I feel like Jacob is more of a Bottom, but he can step in and be a Top if needed. This is a great flip-flop video and both guys give as good as they take.\nThe guys suck each other eagerly, but when it came to fucking, Phillip starts to fuck Jacob, who cums about a minute into it. He had actually warned me he was horny and might have to let a load go, so I was ready to capture it when it happened.\nThis actually turned Phillip on even more knowing his cock made Jacob cum. Phillip relentlessly keeps on fucking him. Jacob encourage him to keep going, hoping to bust another nut.\nBut, Jacob's cock needed a little break before recharging, so Phillip fucks him doggie-style. That got Jacob hard again, but before busting another nut, he gets Phillip on his back to fuck him.\nAnd Phillip then proceeds to cum almost immediately! Agggh!\nAs punishment, Jacob keeps fucking him until he is almost ready to cum. He pulls out and nuts all over Phillip's cock, then tries his best to push the last drops into Phillips hole.\nHe then climbs over Phillip, making him clean his spent cock!",
  "models": [
    {
      "name": "Phillip",
      "person_id": 8655
    },
    {
      "name": "Jacob Marteny",
      "person_id": 8871
    }
  ],
  "release_date": "2017-12-15",
  "scene_id": 8911,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jacob Marteny & Phillip - RAW"
}