{
  "collections": [
    "ChaosMen"
  ],
  "description": "Calhoun bottoms!\nBest known for his 10-inch cock and bossy Top vibe, I figured he would always just want to be a Top.\nBut after having fucked a handful of guys who would cum from getting fucked, he wanted to see what the fuss was all about. The pay is better of course, but he was keenly interested.\nWe know Kevin can handle big toys, but actual cocks are harder for him. When I showed him Calhoun's cock, he said he was up for the challenge and practiced. I did let him know that Calhoun wanted to try bottoming, so he wouldn't be sitting on a giant rod all afternoon.\nWe start with Calhoun topping, and Kevin muscles his way through it. He is interesting to watch get fucked. He likes the challenge and the feeling, but I think he has it in his head that he won't be able to cum.\nCalhoun had zero expectations, but he did want to try to cum while being fucked. Kevin fucks him, and Calhoun really liked it!\nWe paused for some photos and I asked him if he thought he could cum from getting fucked. He answered with a definitive YES. Kevin slowly grinds his cock in to him while Calhoun has one of the most intense orgasms of his life!\nI don't think we have created an all Bottom Boy, but with Calhoun's massive cock, I was worried I might run out of guys who could take it. Now that he is confidently versatile, I think we will be seeing him more.\nI love turning guys on to bottoming!",
  "models": [
    {
      "name": "Calhoun",
      "person_id": 8779
    },
    {
      "name": "Kevin Reed",
      "person_id": 8708
    }
  ],
  "release_date": "2017-12-25",
  "scene_id": 8916,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Calhoun & Kevin Reed - RAW"
}