{
  "collections": [
    "ChaosMen"
  ],
  "description": "Angel and Sean start immediately by kissing and stroking each other's cocks.\nSean, as usual is hard first, so he decides to help his camera-shy buddy out to help get him hard. He has him at almost full-staff, but once Angel turns the table and starts sucking on Sean, his cock gets really hard.\nAngel can indeed deep throat, so we took advantage of that several times during this video.\nSean gets Angel up on his knees, and he tried his best to get Angel's whopper of a cock down his throat. It gets big!\nHe then flips Angel around and rims his hole. Angel says he is mostly a Top, but he sure loves his hole rimmed!\nAngel gets on his back and drapes his head over the side of the bed, and this is where we really see Sean can use Angel's throat without mercy. The boy can take it, though a tear drop leaks its way out of his eye.\nAngel then rims Sean's hole, and once again, Angel's cock gets super hard. Ok, so maybe he is a Top!\nSean then jerks a huge load all over Angel's face. Angel is timing his cum shot with Sean's, but needed something a little extra to get him over the top.\nHe begins to wipe all of Sean's jizz into his mouth, tasting and swallowing his seed.\nThis is obviously a trigger, sending him into shooting his own load into Sean's open mouth.\nAngel did fantastic in this video and I can't wait to see him in full-action!",
  "models": [
    {
      "name": "Sean Peyton",
      "person_id": 8158
    },
    {
      "name": "Angel",
      "person_id": 8925
    }
  ],
  "release_date": "2017-12-28",
  "scene_id": 8939,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Uncut",
    "Ethnicity - Asian Guys",
    "Ethnicity - Latin Guys",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Angel & Sean Peyton - Serviced"
}