{
  "collections": [
    "ChaosMen"
  ],
  "description": "Sorry to make you wait, but Rydell has a REALLY big cock and I had the find the right guy!\nKodi was the first who thought he was up for the challenge, and boy was he!\nKodi even pushes Rydell's limits. He starts by sucking his cock, then licks his musky armpits. He keeps sneaking in little kisses, and each time Rydell responds a little more.\nAfter fucking Kodi's throat, Rydell sucks on Kodi's cock. That's when Kodi gets in his best kiss of the shoot. I think Rydell liked sucking dick again.\nAnd then it was time to wedge that cock inside Kodi. It took a bit, but once it was in, Kodi was loving it!\nMy favorite part is when he is riding Rydell reverse, and you can see the precum dripping out of Kodi's cock. Kodi works-up a major sweat riding his dick, so we get him in a more comfortable position.\nKodi gets fucked on his back, and he was literally holding back from cumming the entire time. Needless to say, it was easy for Rydell to fuck the cum out of him.\nRydell also nails a perfect creampie, squirting his first wad of cum onto Kodi's hole, then shoving his cock in to unload the rest. His giant cock spasms as it fills him up.\nKodi clean his cock, both dudes are left totally satisfied!\nI hope you all enjoyed the Holiday Marathon and have a fantastic New Year too!",
  "models": [
    {
      "name": "Kodi",
      "person_id": 8353
    },
    {
      "name": "Rydell",
      "person_id": 8888
    }
  ],
  "release_date": "2018-01-01",
  "scene_id": 8940,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Kodi & Rydell - RAW"
}