{
  "collections": [
    "ChaosMen"
  ],
  "description": "Peter has done kink work before, so I thought he would be a natural fit to do some Edge videos. However, I think he is the one usually being dominated.\nThis is his first video filming for me, and like all the guys who do the Edge videos, he is a tiny bit hesitant, But once he had a cock in front of him, he is all about pleasing Dante.\nPeter works Dante's cock until it is fully hard, then jerks and sucks his uncut cock.\nDante has sucked a few dicks in the past, but he has never been with another uncut guy. While in the chair, he was fantasizing about sucking his first uncut cock.\nSo, my favorite moment is when Dante is on his knees, sucking on Peter's cock for the first time. He is truly relishing playing with an uncut cock, trying to get his tongue under his foreskin and clearly loving the taste.\nDante also liked having the butt-plug in his ass, so we kept it inside of him for when Peter makes Dante cum.\nPeter duplicates Dante's jerking motion, slowly pull a load out of Dante. The toy slides out as he orgasms.\nPeter stands up and begins stroking his cock to bust his own nut. It took him only about 90 seconds, but in that short period of time, Dante's cock goes limp.\nPeter has another tremendous orgasm (it must be his trademark!), shooting his load all over Dante's totally spent cock!",
  "models": [
    {
      "name": "Peter Marcus",
      "person_id": 8932
    },
    {
      "name": "Dante Pierce",
      "person_id": 8935
    }
  ],
  "release_date": "2017-12-31",
  "scene_id": 8946,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Edge",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Dante Pierce & Peter Marcus - Edge"
}