{
  "collections": [
    "ChaosMen"
  ],
  "description": "Barney sure was ready to do a blow job video. His experiences with guys have been jerking-off and swapping oral. It sounds like it happens infrequently, and he was very eager to mess around with a guy again.\nHe is somewhat serious and focused at the beginning of the video. Intensely interested as he watches Roman stroke his thick cock.\nThere is a little bit of a 'tell' during this video as you can tell Barney has never been intimate with a guy. No kissing or even eye contact. I can imagine what it has been like when he has messed around with guys. Nothing too intimate.\nHaving said that, Roman was having none of it. He urges him to kiss several times, and it does eventually break the ice.\nRoman sucks on Barney's cock first, but Barney looks most happy sucking on Roman's cock. Clearly, he has some skills, and is way into it.\nRoman rims Barney's hole for the first time, and that seems to bring out even more passion.\nBarney gives Roman an amazing thick facial. This dude cums A LOT! He literally coats one side of Roman's face.\nRoman bust his own load, which is clear and a little hard to see, but I think with Barney's cum oozing into his eye, most of us can relate.\nI really like both of these guys. Roman is a very lean dude, but he knows what he is doing in bed, while Barney still has that frenetic electricity from being so turned-on that he tries to keep a lid on it. I see lots of growth with him.\nI have Roman doing a few more oral videos, and am eager to see him fuck and get fucked. I believe Barney is wanting to come back and try both as well.",
  "models": [
    {
      "name": "Roman",
      "person_id": 8894
    },
    {
      "name": "Barney",
      "person_id": 8936
    }
  ],
  "release_date": "2018-01-10",
  "scene_id": 8954,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Barney & Roman - Serviced"
}