{
  "collections": [
    "ChaosMen"
  ],
  "description": "I just can't come up with enough superlatives for this video.\nIt is definitely a dream match-up.\nIn one corner, you have Vander, power Bottom and a very dirty boy. He does like to Top too.\nIn the other corner of the couch, we have Calhoun. Another VERY dirty boy, who has discovered he not only likes topping, but bottoming as well.\nThese two enter the ring hungry for each other's cocks. Both guys can easily deep-throat each other's massive cocks. Calhoun loves big cocks, and chokes himself until his eyes are red and watering! One of my favorite parts is when Vander pulls away after face fucking him, and Calhoun just looks dazed and tearful.\nAfter clearing the fog from his head, Calhoun is treated to Vander massaging his cock with his ass. Vander rides him, and they kiss passionately.\nVander and I both were unsure if Calhoun would bottom this video. But he took one look at Vander's cock and he really wanted to see if he could handle it. There is a cute OutTake at the end if you want to see Calhoun gasp after taking his first big boy cock.\nBoth guys are good at cleaning each other cocks, so lots of ass to mouth for fans of that.\nCalhoun easily fucks the cum out of Vander. Vander than props himself up on the couch from the floor and makes a target of his hole for Calhoun. Calhoun rubs his nut out, and fills Vander up with his seed.\nBoth men are hot and sweaty from all the passion, and share an intense kiss!",
  "models": [
    {
      "name": "Calhoun",
      "person_id": 8779
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2018-01-05",
  "scene_id": 8956,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Calhoun & Vander - RAW"
}