{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had a little trouble getting a guy for Tyger to play with. Peter Marcus was set to come in and do it, but through-out the week before the shoot, he was radio silent.\nAt the last minute, I reached out to Franco and got him to Austin. Well of course, after I got that settled, Peter emailed me just before the shoot, that he would indeed be there. He apologized as he had lost his phone, and had to wait for a new replacement.\nWith Tyger being very unsure about sucking dick, but really wanting to try, I figured having both guys there to help him along was actually a stroke of luck. Suddenly, I had a TagTeam Serviced video.\nSure enough, both Franco and Peter carry this video, while Tyger is playing catch-up. I totally expected this, and despite it being his first time with guys, he looks like he wants to be there, just not sure what to do.\nI don't know if I have ever had a TagTeam Serviced video on the site, but this one really is great, and there is a good balance between newbie and pro.\nThe ending is rock solid, with all guys nutting in quick succession. Tyger is best on his back, so he nuts first. Peter then has one of his tremendous orgasms and adds his own load to the pile. As usual, Franco was just edging himself ready to go. He stands up quickly (faster than I can move all the cameras!) and sprays Peter's face and beard with his load!",
  "models": [
    {
      "name": "Franco",
      "person_id": 8102
    },
    {
      "name": "Peter Marcus",
      "person_id": 8932
    },
    {
      "name": "Tyger",
      "person_id": 8957
    }
  ],
  "release_date": "2018-01-24",
  "scene_id": 8968,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Franco & Peter Marcus & Tyger - Serviced"
}