{
  "collections": [
    "ChaosMen"
  ],
  "description": "Draven said he really wanted to make a go at doing gay porn. He certainly brought his 'A Game' to his first time with a guy. I wasn't sure he would suck Roman's cock, so we set the scene up so he could sit in the chair and be Serviced.\nRoman works his cock from soft to hard in no time. Draven is clearly enjoying the head. It is great to hear a guy moan, be verbal and really get into it.\nRoman stands up and Draven tentatively tastes his cock. He sucks on Roman until his cock is fully hard. At first, I thought he was going to be fussy about sucking dick, but boy he turns it up to 100 and gives Roman a very good blowjob.\nSince things were going so well, Roman moves Draven over to the bed and proceeds to rim his hole. Draven said that was the first time, though he has rimmed many a girl's hole. He wasn't quite ready to rim another dude, but I think it is in his future. This guy really is motivated to entertain you, he just needs to step his way through his limits.\nThey also 69 suck, and poor Roman has Draven's cock wedged down his throat for most of it, occasionally gasping for air. I think Draven was just distracted by sucking on Roman's dick like a kid with a new toy he didn't realize he was practically suffocating Roman.\nFor the ending, I had told Draven that Roman had just had a couple recent facials, and I didn't want to get stuck in a rut with him always being the cum dump. Could he possibly handle a facial?\nDraven thought he could do the facial, and though his mouth is open, I think Roman took it on himself to not nut right in his mouth. It does leave a nice trail of jizz on his face.\nDraven stands up and quickly unloads his cock on to Roman's spent cock.\nI love Draven's energy and will get him back as soon as I can!",
  "models": [
    {
      "name": "Draven",
      "person_id": 8967
    },
    {
      "name": "Roman",
      "person_id": 8894
    }
  ],
  "release_date": "2018-02-07",
  "scene_id": 8972,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Draven & Roman - Serviced"
}