{
  "collections": [
    "ChaosMen"
  ],
  "description": "Thompson sure has enjoyed bottoming, but he reminded me he does like to top too. I was interested to see his Topping skills.\nBoth Thompson and Timmy have great chemistry with their scene partners, often making out before we get the cameras rolling. This video was no exception.\nThompson loved sucking on Timmy's big cock, and when he took it in his ass, his cock momentarily wilted from dealing with his biggest cock yet. But the dude recovers fast, and at this point I have to put him in the Power Bottom category.\nAlthough, when it came time to fuck Timmy, he did an excellent job as a Top. He fucked Timmy while stroking his cock, and a couple times Timmy had to brush his hand away or risk cumming to soon.\nThere is also a great moment where Thompson is eating Timmy's ass. Timmy is all curled up with his ass in the air, making it so his own cock was an inch away from his own mouth. Thompson pushes it closer, while Timmy sucks and licks the tip of own cock head. I think if they were on a hard surface, Timmy might have been able to get more of his own cock in his mouth.\nAnyway, these two are fantastic together, clearly both are some of my most talented performers! You won't be disappointed by this terrific flip-fuck!",
  "models": [
    {
      "name": "Timmy",
      "person_id": 8691
    },
    {
      "name": "Thompson",
      "person_id": 8840
    }
  ],
  "release_date": "2018-01-19",
  "scene_id": 8976,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Self Suck or Self Facial",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Thompson & Timmy - RAW"
}