{
  "collections": [
    "ChaosMen"
  ],
  "description": "When Nikojai came in for his first videos, he reminded me a lot of Wren. They both are tall and lean, though Wren sure has morphed his body from bean pole to Twunk.\nNikolai has had experience with guys, sucking and fucking, but I didn't realize he had bottomed. So I was glad to hear he wanted to flip fuck.\nWhile not technically his first time on set filming porn, he kind of has a nervous smile or laugh through out the first part of this video, as if he can not believe what he is doing. Wren just plows through, always eager to suck and get fucked.\nThat's not to say Nikolai was not enjoying himself. He enjoys sucking cock, and he really didn't have too much trouble sitting on Wren's cock. He was hard for most of it, but near the end I think his legs were giving up and he began to droop.\nThen it was Wren's favorite part, getting fucked! Nikolai does a great job, but part of me thinks this boy might be tilt just a little bit more to the bottom boy side.\nHe fucks the cum out of Wren, and then cream pies his hole.\nI'd love to get him back and have him bottom a whole video, and see if we can work him up to him nutting from being fucked.\nEveryone's got to have goals!",
  "models": [
    {
      "name": "Nikolai Rapid",
      "person_id": 8915
    },
    {
      "name": "Wren",
      "person_id": 3581
    }
  ],
  "release_date": "2018-01-26",
  "scene_id": 8981,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Nikolai Rapid & Wren - RAW"
}