{
  "collections": [
    "ChaosMen"
  ],
  "description": "Both of these dudes bring a lot of passion to this video. They each have terrific sexual energy and it is an amazing match!\nBarton is in full-on Daddy Mode, looking beefier than ever. Thompson, while not passive, makes the perfect Bottom Boy and completely matches his energy.\nThompson and Jerome both seem to always stay hard for their videos, (That would be a great pair up!) and seldom do they wilt. Both these guys started out as straight/bi but are so electrified when getting a chance to play with another dude, they are surely on their way to playing on Team Gay full-time.\nI think this is the first time I have seen Thompson expend so much energy fucking and also enjoying being fucked. He grinds his ass onto Barton's cock, trying to give Barton as much pleasure as possible. Thompson just forgets about his own cock, trying to please his buddy. Barton works him over aggressively, while Thompson gets lost in the anal stimulation.\nI think this is the only time I have seen him wilt. He was working it!\nWhile one on his back, Thompson has full access to his cock and he easily nuts from Barton fucking him in his sweet spot.\nBarton goes to creampie his hole, but ends up painting Thompson's cock and balls with a massive load. He starts scooping it into Thompson's hole, making sure he gets every last drop inside his Boy!",
  "models": [
    {
      "name": "Barton",
      "person_id": 8564
    },
    {
      "name": "Thompson",
      "person_id": 8840
    }
  ],
  "release_date": "2018-02-23",
  "scene_id": 8984,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Barton & Thompson - RAW"
}