{
  "collections": [
    "ChaosMen"
  ],
  "description": "There is an interesting backstory to the pairing in this video.\nI did not realize that Ledger and Zane knew each other outside of the studio. Based on what they each told me, it was just a bit more than friends.\nNo, they have not hooked-up with just each other, but from what I can tell, Ledger likes a little live sex show to watch, and Zane has a fucked a girl Ledger knows while he watches. I think they all had sex, but Ledger and Zane stayed in their respective lanes.\nNot sure when this happened. It could have happened before Ledger was doing scenes for ChaosMen, but it sounded like it happened recently.\nEach guy suggested they could easily do a scene together. I think Zane wanted to fuck Ledger, but Ledger wants to remain a Top. Not sure if he bottoms or does ass play in his personal life. Sometimes I get the feeling he is down for it, but not on camera.\nSince it has been a while since Ledger has been in the studio, he arrived with long hair. At first, I was worried, but it quickly grew on me.\nDespite their friendship, there isn't much awkwardness. I think Zane was looking forward to finally sucking on Ledger's cock after all this time, and Ledger seemed just as eager to suck Zane's big 'ole cock.\nI also think Ledger took great delight in fucking his buddy and fucking the cum out of him, and then unloading on Zane's hole and filling him up!",
  "models": [
    {
      "name": "Ledger",
      "person_id": 8346
    },
    {
      "name": "Zane",
      "person_id": 3306
    }
  ],
  "release_date": "2018-02-21",
  "scene_id": 8989,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Ledger & Zane - RAW"
}