{
  "collections": [
    "ChaosMen"
  ],
  "description": "For Draven's first time fucking a dude, he really wanted to work with a gay guy because he thought that his partner should be into it, and he also really wanted to please him.\nBut I put Phillip in the mix, assuring Draven that despite Phillip identifying as straight, he really liked to get fucked.\nLike many of the audience, Draven was dubious that a straight guy would like getting fucked, but Draven went with it. Once Draven met Phillip, he was confused because he was indeed a straight guy and I guess he just didn't get how he could like getting fucked.\nDraven is a little awkward at the beginning, trying his best not to smile, yet he was definitely turned-on. He sure likes not only getting his cock sucked, but he likes to show-off and really suck a guy back. So, I am not sure why he finds it so hard to believe that another straight guy could actually have fun on the set. He sure is!\nAnd then when it came time to fuck, Phillip, as usual, enjoyed getting ass-rammed. Draven has some great skills, and a couple times I think Phillip shooed away Draven's hand from jerking his cock or risk nutting too soon.\nThen once Draven saw how intensely Phillip came while being fucked, not only was he turned-on by so visibly making him nut, but also wondering if he was missing out on something.\nAfter unloading inside of Phillip, Draven was asking about maaaaybe trying to get fucked during his next video.\nI think we can make that happen!",
  "models": [
    {
      "name": "Phillip",
      "person_id": 8655
    },
    {
      "name": "Draven",
      "person_id": 8967
    }
  ],
  "release_date": "2018-03-09",
  "scene_id": 9002,
  "tags": [
    "Build - Hairy",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Draven & Phillip - RAW"
}