{
  "collections": [
    "ChaosMen"
  ],
  "description": "Draven is really throwing his all into doing these videos. On one hand he is motivated to make you all happy, but on the other hand, he is loving doing these videos. He seems to have no real limits, and has been bringing amazing energy to each video. Time to plunk him in the Bi category.\nI wanted to pair him with Timmy, but worried that his cock might be a bit 'advanced' for Draven. Well, it turns out Draven can indeed take a big cock. He is not at the point of cumming while being fucked (Yet!), but he loves the challenge.\nHe even gets-off to sucking on Timmy's big cock. My favorite is watching Timmy on his back, while Draven nurses on it. He may not have deep throat skills (Yet!), but he is giving it his all, and sure looks good with that fat dick wedged in his mouth.\nI wanted Draven to get fucked first, just to make sure I hadn't misjudged what he could handle. Timmy slides it in, and fucks him doggie-style with relative ease. Draven lost his boner for a bit, but once Timmy got his rhythm, Draven was fully erect.\nThey swap spots, this time Draven fucking Timmy on his back. Draven loved fucking Timmy while playing with Timmy's cock.\nI wanted Draven to get fucked on his back, just to see if he thought he could nut that way. He thought he might, but after fucking Timmy's hole, his mind was set on loading Timmy's ass up.\nSo, Timmy breeds Draven's hole first, dumping a nice load on and in his hole.\nThey quickly swap places, and Draven fucks Timmy for a bit, getting himself close. Cum is leaking out of Draven's ass as he fucks Timmy.\nDraven then pulls out and squirts a wad onto Timmy, and then shoves the rest inside. They start to kiss, and it is hot to watch Draven's spent cock plop out of Timmy's hole with a splash!",
  "models": [
    {
      "name": "Timmy",
      "person_id": 8691
    },
    {
      "name": "Draven",
      "person_id": 8967
    }
  ],
  "release_date": "2018-03-16",
  "scene_id": 9009,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Draven & Timmy - RAW"
}