{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is sexy and sensual Serviced video!\nTimmy starts by kissing Maurice's neck, working his way down his back, and then rimming his hole. Maurice's cock grows from all the attention to his ass. Timmy teases his cock, and even sucks it backward.\nThen, Timmy flips him over and starts to tackle Maurice's ginormous cock. Timmy has those deep-throat skills and he makes Maurice's cock disappear down his throat.\nIn order to get a better angle to swallow Maurice's cock, he spins around and sits on Maurice's face. Maurice rims Timmy's ass, while Timmy swallows Maurice's entire cock.\nAfter servicing his buddy, Timmy wants his own cock sucked. He straddles Maurice's chest and makes him take as much of his own giant cock. Maurice can only get so much down his throat, so Timmy sits back and lets Maurice properly service him.\nI think Timmy really wanted to choke on his cock, so he lays on his back, head over the side of the bed, allowing Maurice to fully fuck his face. Tears form around his eyes as he gags on his cock. Maurice strokes and sucks his buddy at the same time, further jamming his own cock down Timmy's throat.\nMaurice then busts his nut on Timmy's face. His aim is high, so the cum drips all over the place. Timmy was ramping up to bust at the same time, but Maurice's cum is dripping down his nose. I jump in quick to save Timmy from drowning in cum, and then Timmy blasts a giant load into the air!\nMaurice licks it up and then shares a tasty cum-soaked kiss!",
  "models": [
    {
      "name": "Timmy",
      "person_id": 8691
    },
    {
      "name": "Maurice",
      "person_id": 9003
    }
  ],
  "release_date": "2018-03-07",
  "scene_id": 9013,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Maurice & Timmy - Serviced"
}