{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Calhoun's amazing video with Vander, I knew he could handle anything.\nVander has an 'advanced' cock size, and Alonso's dick is in the same category, but it is bigger. Calhoun's has always liked sucking the extra big dicks, and now he can take one up his ass too!\nAnd you can tell Calhoun is in piggy heaven. He is slobbering all over Alonso's cock, gagging to the point his blood-shot eyes are watering. Alonso gives him great head too, though you can tell he hasn't mastered throating a big cock. He sure was enjoying it though.\nI think Calhoun was eager to get Alonso's cock back down his throat. Alonso gets on top of him and pile drives his cock into his face. Calhoun is literally gasping for air or risked passing out due to the lack of oxygen. He catches his breath only to rim Alonso's beautiful ass.\nAlonso then eats out Calhoun's ass, trying to get it ready for his massive cock. Calhoun squeals as Alonso slides it in, and then goes balls deep. How did my Power Top turn into a Power Bottom?!?! Alonso fucks him hard, and then makes Calhoun clean his cock.\nThen Calhoun wanted a chance at Alonso's ass. This had me worried as Alonso is not that experienced at bottoming and Calhoun is pretty hung.\nBut Alonso powers through and eventually had an epiphany that he thought he might be able to cum while having his prostate pounded. He finally 'got' what all the fuss was about. Going to save that for a future video.\nIt helped that Calhoun would fuck him, then bend over and suck on his cock at the same time. Calhoun has got the skills!",
  "models": [
    {
      "name": "Alonso",
      "person_id": 8394
    },
    {
      "name": "Calhoun",
      "person_id": 8779
    }
  ],
  "release_date": "2018-03-23",
  "scene_id": 9015,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Red",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alonso & Calhoun - RAW"
}