{
  "collections": [
    "ChaosMen"
  ],
  "description": "With Constantine literally having no experience with guys, I was not sure what to expect. He was a little worried that since Draven was a straight guy, that it might be awkward.\nBut I put on a porn that they both liked and Draven took him through his paces like a pro.\nAt first, Constantine was a little focused on the TV. Then he realized he was turned on by Draven sitting next to him with his cock out. Once he was confidently hard, he just let Draven lead the way. As soon as Draven starts sucking his cock, he puts his arms behind his head and kicks back to enjoy being serviced.\nConstantine was going to push as many boundaries as he could, and he gave head for the first time like, well, it was like his first time. Not bad, but you can tell it was his first time up to bat with another bat.\nBoth guys enjoying rimming women, and with Draven's long tongue he rimed Constantine first. After that, Constantine licked Draven's hole. I think it made Constantine even harder.\nHe straddles Draven's chest and bust his load onto Draven's chin. I don't think Draven is quite ready to eat a load, but he licks the last drips from Constantine's cock.\nConstantine slides down and watches Draven bust his own nut.\nI think Constantine did great his first time out and was a pleasure to work with. Definitely going to try to get him back for more.",
  "models": [
    {
      "name": "Constantine",
      "person_id": 9016
    },
    {
      "name": "Draven",
      "person_id": 8967
    }
  ],
  "release_date": "2018-03-28",
  "scene_id": 9021,
  "tags": [
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Constantine & Draven - Serviced"
}