{
  "collections": [
    "ChaosMen"
  ],
  "description": "One of my favorite things about working with Milan was his willingness to dive right in. He is definitely a straight guy with no experience, but he had the right attitude that he was willing to have fun and also make sure you guys were enjoying watching.\nSo, he was not going to be weird about anything. It helps he is older than some new models, and he has lots of experience with women, including eating ass. He figured he could transfer all that to a guy.\nLorenzo is so great with first-timers too. He started with a brief kiss, and just had to stop and admire Milan's hot body. He loved peeling-off his shorts and seeing his nice hairy pubes.\nHe gets him hard and boy is Milan into having his cock sucked. Lorenzo treats him to a great blowjob, and then stands up and jerks their cocks together. Soon, he lets Milan jerk his own cock, easing him into it.\nNext, Milan starts to suck on Lorenzo and it is clearly his first time. He would wrap his lips around his teeth, worrying most about teething Lorenzo. I saw it a couple times and encouraged him to not worry so much and he would change his technique to something more natural. He sure was trying to take all of Lorenzo's cock down his throat!\nMilan had mentioned he was down to get fucked, and had bought a butt-plug to practice with. I wanted to see how easily he could take it. It took a couple tries, and he gets a little wobbly, but with Lorenzo's mouth on his cock, he was rock hard again.\nI knew the following day that Milan was going to be sitting on a big cock, so a little stretching would do him some good.\nThey both rim each other, and Milan really enjoyed both.\nMilan strokes his cock until a laser beam of cum shoots out and coats Lorenzo's face. Lorenzo scrambles to get as much of it in his mouth as possible.\nHe sucks the last remaining drops of cum from his cock, and then winds his own cock and spills his load on to Milan.\nLorenzo laps it up and they share a nice cummy kiss!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Milan",
      "person_id": 9031
    }
  ],
  "release_date": "2018-04-11",
  "scene_id": 9037,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Long",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Lorenzo & Milan - Serviced"
}