{
  "collections": [
    "ChaosMen"
  ],
  "description": "There was a little miscommunication between the model and Milan's scout. His scout told me he had a fantasy of taking on a big black cock. Milan had no interaction with guys, so I thought it was a bit ambitious for his first time.\nEnglish is not Milan's first language, but his emails are punctuation perfect, and are much like reading a professional essay. Way better than my barely literate summaries here on ChaosMen or any model communication which at this point in time has been reduced to emojis and 3-word replies. I think most of us are guilty of this. But his English and writing skills are elite.\nBut point is, I don't think it was a language issue. Milan just said he'd be down to bottom, and he thought black guys were hot, especially if they have nice muscles.\nTurns out, he just wanted to bottom because he didn't think he could stay hard to top. He had bought himself a butt-plug and started practicing. We used it a bit during his Serviced video, and it makes another appearance today.\nAfter seeing Alonso's big cock, he went into the bathroom, prepped, and just kept the plug in him all the way up to the point when Alonso slides it out, and pushes his cock in.\nI think that is hot, and I would have showed-it-off a bit more when sucking his cock. I would have been more verbal, talking to this hot man with a plug in his ass.\nInstead, I think Alonso was trying to hide it, as if we were cheating. But like I said, I think it is hot when guys are made to wear a plug around, only to be replaced by a cock. I am sure many of you Dom guys will agree.\nAnyway, Milan throws himself into this video, and you can tell that he is new to it, but super eager to try everything, and make it hot for us.\nAlonso's creampies his virgin hole, but Milan did not think he could cum from getting pounded by Alonso.\nWe set him up so he could jerk-off and give Alonso a facial. It is funny to watch him because we do have porn playing for him, but instead he watches himself on the monitor, either getting-off to seeing what was happening, or checking his aim out. He coats Alonso's face like a cake!\nI think Alonso was cleaning cum out of his ear for the next couple of days!\nI have got to give props to Milan for tackling so much his first time, and I am eager to get him back to see him top!",
  "models": [
    {
      "name": "Alonso",
      "person_id": 8394
    },
    {
      "name": "Milan",
      "person_id": 9031
    }
  ],
  "release_date": "2018-04-27",
  "scene_id": 9047,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - African American",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Long",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Alonso & Milan - RAW"
}