{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is an interesting video to watch based only on erections.\nRansom starts off by being intimidated by how huge Zane is. He felt um..petite compared to Zane's ginormous build. This was Zane's first \"real\" full time with a dude. Yeah, I had played with him during and Edge video, but we took baby steps, and most of the time he was blindfolded.\nSo I was a little worried when we got off to a shaky start. Both models suddenly feeling self-conscious.\nBut Zane took the lead, letting Ransom know he didn't have go slow, or he wouldn't break him.\nAnd that's when you need to start watching the boners. Zane, who always is bone hard (He was hard in his jockstrap before starting the Edge video) just stayed pretty wobbly while Ransom gave him some really good oral.\nBut then Ransom takes off his pants, giving Zane a chance to play with another dude's cock, and wammmmo..his dick is standing at a attention. Maybe Zane likes playing with guys as well as girls?\nMeanwhile, Ransom is focusing on getting Zane hard, and not really getting hard himself. Even when they 69, Ransom stays wobbly, while Zane eagerly sucks away, in total bliss to have a cock in his mouth.\nWe moved into fuck mode, and that's when Ransom's dick wakes up. Ransom was a bit embarrassed to admit it, given he thinks of himself as a Top, but he is really enjoying getting fucked. In fact, I should have put some out takes at the end, but we must have stopped 3-4 times cuz Zane was literally fucking the cum out of him. We would get going, and we'd have to stop or he'd nut, once he wasn't even touching his dick. Next time I'm just gonna let that happen.\nThen Zane decided since Ransom was enjoying getting fucked, he wanted to have a turn. He was a little awkward, as he tried to find out how to put it in, but as soon as it is in him, he is riding it and actually making Ransom play with his dick so he can get off. A pro top and bottom!\nSince Ransom was struggling to NOT cum, we tossed him on his back, and Zane shoved his bare dick into him until he cums...giving himself a bit of a facial.\nWe thought maybe Zane would be able to pull out and nut, but Ransom was too tender to be played with, and clearly Zane wanted a dick to play with to help him get off.\nWe reset and Zane nuts all over Ransom's face, giving us a nice creamy kiss for an ending.\nThis video, truly, can't be missed!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Zane",
      "person_id": 3306
    }
  ],
  "release_date": "2009-02-20",
  "scene_id": 905,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Theme - Wrapped"
  ],
  "title": "Ransom & Zane - RAW"
}