{
  "collections": [
    "ChaosMen"
  ],
  "description": "I could spend hours talking about the psychology that is going on in this video.\nCeasar and Clay have been friends since 2nd Grade. They were told they could goof off and zing each other, and I didn't realize they were \"projecting to the mics\" so much. So it feels a little fake or forced, but they truly have been friends forever.\nCeasar is lean boy with a huge cock on him. My initial take is he might be more interested in boys than girls, but the entire time he was going on about the girls in the videos, how hot it is when they squirt. So I was a little thrown.\nNow Clay, he clearly adores his friend. He has great affection and respect for him. He seemed a lot less tense and just more relaxed then Ceasar.\nAdd into the mix that they really are friends and it might be more than awkward had they'd taken it to the next step. Things just don't get beyond a dick grab that feels very rehearsed to me (and perhaps to you too).\nClay is equally, if not just a touch more endowed, and loves his foreskin. He was making a lot of fuss about it. It was funny, but the irony was that Ceasar can really hold his own in the dick department. Both are packin' some meat.\nAnd then the cumshot. They didn't want to spooge on each other, but were determined to nut at the same time. They kept in constant communication, and I will be danged if they didn't pull it off, leaving the audience (and me) wondering if Ceasar waited for Clay to nut so he could cum to it. And yet they both stare pretty hard at the straight porn playing.\nRegardless, I think both guys have their own very differing beauty, and I will have them both back again..but this time, I want to see how they act when the other isn't around!",
  "models": [
    {
      "name": "Clay",
      "person_id": 3622
    },
    {
      "name": "Ceasar",
      "person_id": 3623
    }
  ],
  "release_date": "2009-01-21",
  "scene_id": 906,
  "tags": [
    "Theme - Solo",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Video - HD - High Def",
    "Theme - Best Friends",
    "Ethnicity - Middle Eastern"
  ],
  "title": "Ceasar & Clay - Side-By-Side"
}