{
  "collections": [
    "ChaosMen"
  ],
  "description": "I mentioned in Bentley's summary that he and a buddy were going to do a film together. Nikolai is the one that referred me to Bentley, suggesting since they knew each other, they might as well do a video together.\nNikolai had a little Bro-Crush on him. So, this video does have some of the awkwardness of two friends exploring each other's bodies. Not a lot of romance in this one, as it falls squarely in the 'straight guys go gay' category. Those that like buddies exploring each other for the first time, will definitely appreciate this video.\nNikolai smiles as they watch porn together. Even when Bentley sucks his cock, he looks bemused. It is kind of ironic since he was the one wanting to do a video with Bentley. But as soon as he starts sucking on Bentley's cock he gets down to business.\nThen once Bentley starts fucking Nikolai, it is 'Game On!' as Bentley throws a major fuck into him. That wiped the smile off his face! ~eg~\nNikolai is one of those straight guys that may not be keen on all parts of gay sex, but he DOES like being fucked. He is a passive bottom, and loves stroking his cock while having his prostate hammered. Bentley delivers!\nBentley unloads into Nikolai, while Nikolai strokes a load out for Bentley.",
  "models": [
    {
      "name": "Nikolai Rapid",
      "person_id": 8915
    },
    {
      "name": "Bentley Layne",
      "person_id": 9039
    }
  ],
  "release_date": "2018-05-11",
  "scene_id": 9076,
  "tags": [
    "Build - Average",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bentley Layne & Nikolai Rapid - RAW"
}