{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wills really surprised me for his first interactive video. He had mentioned a couple drunk encounters with guys, but usually there was a girl involved.\nBut he dove in right away, and only had a few moments where he looked like he had a disbelieving grin on his face. Though, I do believe that his smiles when Antonio is servicing his cock was more from surprise at having his cock massaged by another guy's throat. Impressed!\nWills seems to have plenty of experience, and it was the little things in this video that makes me think he would be a great sex partner on or off the set. He not only kisses, but little things, like playing with his buddy's cock, or casually reaching over to massage Antonio's hole, shows a high level of wanting to please his partner.\nAntonio loves sucking dick. He says he can go for hours if a guy can last. Just like in this video, he slides down beside the guy, and will just nurse and suck on the dude's cock till they are begging to cum. Antonio can really attack a cock from a crazy number angles in what seems like a limited position.\nHe also lays in such a way he can stroke his own cock, often edging himself while milking precum from his buddy's cock with his mouth and throat.\nWills is actually a good cock-sucker too. He does most of his sucking while in a 69 position, and despite the awkward angle, really gets in there and sucks Antonio.\nFor the cum shots, Wills fucks Antonio's face until he is close to cumming. He pulls out and easily jerks a load right into Antonio's mouth.\nAnd right on cue, Antonio busts his own nut moments after Wills does!\nI think Wills has a lot of potential, we just need to get those pubes back!",
  "models": [
    {
      "name": "Wills",
      "person_id": 9073
    },
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    }
  ],
  "release_date": "2018-05-09",
  "scene_id": 9088,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Antonio Cervone & Wills - Serviced"
}