{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had a bit of drive to go pick Johnson up in order to do this solo. So, we had a nice long drive to the studio and I got to know him better than most models.\nHe is a very likable guy, intelligent and even a little 'worldly', as he has spent many months traveling around Eastern Europe. He had two favorite locations that he was impressed with, and the descriptions he gave of the landscapes made me feel like I was there and I longed to go there.\nBy the time we arrived at the studio, I had a major daddy crush on him. He has a bit of a stutter which makes him only that more endearing.\nJohnson is a straight guy, and he had just recently done a nude photoshoot, so the solo didn't seem like a big leap for him. I did not get the feeling he would go beyond a solo, but he had such a hot body, and I loved his natural pubes, that I just really wanted to get him in try a solo and that encourage him to do more than just jerk-off for us.\nTurns out he is a natural exhibitionist, and his photos were very easy to do. I had on some big tits and ass porn, and he would just kind of gently squeeze his cock head like an exercise ball. His cock would stand at attention with only 5-6 squeezes.\nI'm always happy when a guy gets aroused easily, but I did worry that this was his actual jerk-off technique. Johnson said had not ejaculated in 3-4 days, and was super ready to go and was extra sensitive. When actually jerking-off, he has a nice technique, and I loved seeing him play with his hole and taint.\nHe strokes himself slowly through most of this video, giving us a great view of his 7-inch cock. Even grinding his ass, he knew we would want to see his hole. His jerk-off speed only increased as he was about to cum, and ropes of jizz shot out in an intense and expressive orgasm.\nI am so glad I drove the distance to get this guy. On the drive back, he was ready to do a blow job video, and by that evening, he wanted to join the team to do full-interactive.\nAs of writing, I haven't got him in yet, but he is scheduled to come in to receive head. He thought a massage video sounded erotic, so that is what I have him set for.",
  "models": [
    {
      "name": "Johnson",
      "person_id": 9083
    }
  ],
  "release_date": "2018-05-21",
  "scene_id": 9090,
  "tags": [
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Theme - Solo",
    "Video - HD - High Def"
  ],
  "title": "Johnson - Solo"
}