{
  "collections": [
    "ChaosMen"
  ],
  "description": "Marty really wants to do full-sex videos, but he is starting from zero interaction with guys.\nSo, I figured it would be best to set him up with a traditional Serviced video and see how far he would go.\nHe got himself hard for the initial photos, and then Lorenzo jumps in while Marty has a start on being hard.\nMarty gets a little wobbly, but Lorenzo works his magic and gets him fully hard. It seemed like Lorenzo's oral skills won out over his stroking skills.\nMarty might not be ready to suck dick back, but he is VERY present in this video. Watching as Lorenzo works his cock. His body language is great too. He puts his hand all over Lorenzo while he gets sucked.\nLorenzo moves into a position to give Marty access to his cock. Marty slowly moves to rub on his cock through his short. Lorenzo removes his shorts, and it takes Marty some time, but he does jerk on Lorenzo's cock.\nLorenzo gets Marty doggy-style and starts to rim him. This is the first time Marty has had his ass licked. The first part is kind of funny to watch as it is clearly tickling him. But Lorenzo persists, stroking his cock backwards and thumbing his hole. Marty's facial expression changes from giggly to intense pleasure.\nLorenzo flips him over and they jerk-off together. Both guys were actually getting pretty close, and I was worried that Lorenzo would bust his nut, then not have the energy to pull a load out of Marty. So, I nudged him to work on Marty's cock.\nSure enough, Lorenzo sucks and jerks an awesome load out of Marty. Marty was so spent, that we just kind of let him have his moment and bask in his orgasm.\nIf you are fan of the more traditional Serviced videos, this one will get you off!",
  "models": [
    {
      "name": "Marty",
      "person_id": 9091
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2018-06-06",
  "scene_id": 9095,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Trimmed",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Pubic Hair - Shaved",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Lorenzo & Marty - Serviced"
}