{
  "collections": [
    "ChaosMen"
  ],
  "description": "With so much passion coming from both Calhoun and Dani, I knew they would be perfect to do a Pure video together. Sure enough, they are amazing in this video.\nThis is one of those videos that I didn't have to do much but chase the guys around with my camera, occasionally I had to remind them I was there and needed to see what they were doing. We stopped only once to take pictures just before they started fucking.\nOnce they started fucking with such passion, I barely could keep up. In fact, you may notice Calhoun cums abruptly while I am down on the ground filming Dani's cock slam into Calhoun's hole. Calhoun is always so vocal, and he was talking about how beautiful Dani was to him, so I thought it was just part of his normal verbal play.\nBut he was in fact ramping up to cum. I caught the tail end of it, but he had pretty much busted a huge nut already.\nDani has no problem playing catch-up. He jerks his cock and shoots a glob of cum on his hole, then dumps the rest inside. His entire nut sack and taint are throbbing as his load spasms inside of Calhoun.\nCalhoun then clean his buddy's cock, while Dani fingers his sloppy hole!",
  "models": [
    {
      "name": "Calhoun",
      "person_id": 8779
    },
    {
      "name": "Dani deMuse",
      "person_id": 8990
    }
  ],
  "release_date": "2018-06-08",
  "scene_id": 9097,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Pure",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Calhoun & Dani deMuse - Pure"
}