{
  "collections": [
    "ChaosMen"
  ],
  "description": "I mentioned during Chett's solo summary that he is Bi. But has not had a lot of chances to explore with guys. So, he was eager to do a video with another guy. Chett is a big fan of oral, and most especially likes grinding cocks together.\nWills seems to be really enjoying messing around with guys, and he says he is active sexually and I think that shows by his high skill level, and willingness to try new things.\nThey start by jerking their dicks side-by-side. Wills beats him to being fully hard, so Chett dives down and sucks his cock. He uses his fist mostly to start with, and I think his technique was an intense sort of, \"I am going to make you cum NOW!\" as if all his previous experiences had to be quick.\nI encouraged him to take his time and just have fun toying with him. That's when you can tell he realized how much fun it is to make another guy squirm using his mouth in a variety of ways. Wills was certainly enjoying it!\nWills then sucks on Chett, getting him fully erect. Once Chett was super hard, he took to grinding their cocks together, and I suspect he could cum like that.\nDuring the grinding, there is a moment where Chet goes to kiss Wills, who is not too sure. So Chett went back to stroking their cocks together, turning Wills even more on. Chett drops down again, and this time, Wills is eager to kiss and thanks his buddy for making him feel so good.\nChett said he would try some rimming, and he is very tentative about it. He eventually gets in there, and I expect he will be more eager for future videos. Or maybe someone will be eating his ass to the point he wants a cock in it. Ya never know!\nAnd then, it was a race to the finish!\nWhile watching Wills jerk his cock over him, Chett strokes his own dick until he nuts. Soon after, Wills gives Chett a facial, ending it with a tender cum-soaked kiss!",
  "models": [
    {
      "name": "Chett",
      "person_id": 9099
    },
    {
      "name": "Wills",
      "person_id": 9073
    }
  ],
  "release_date": "2018-06-20",
  "scene_id": 9109,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Chett & Wills - Serviced"
}