{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had Declan coming in to do a solo and an oral video when Adam Gomez showed up on my radar. I never did get him back in for an oral video, so I thought it was perfect timing seeing that Declan needed a guy to swap head with.\nDeclan is eager to do everything, but he has little to no experience with guys. He was going to push his limits in this video.\nThey start by watching a video, and you can really tell it is Declan's first time. He is a bit glued to the TV, mostly worried about staying hard. But I think he was also excited and was having no issues. He was actually trembling a little with excitement.\nIt took Adam breaking the ice. He slides down and starts sucking him. Declan has to take a moment for reality to set in, then a switch is flipped and he was happy to have his dick sucked.\nHe even flipped Adam around and serviced his cock. Yep, he is a newbie, so you have to appreciate him for trying.\nWhen they both go to suck each other though, he really seemed to take on the challenge. The angle was better for him, plus having Adam suck on him, while he got to suck dick, turned him on.\nWe then let Adam take charge, trying to get him to nut. First, he tries sucking him while on his knees, then Declan fucks his face.\nDeclan needs to stroke his own cock in order to cum, and Adam tries to keep pace, trying to time his own load to just after Declan cums.\nDeclan started breathing really heavy, and Adam thinks he is about to shoot, but actually needed another minute. Adam shoots his load first.\nThis actually turned Declan on, and he quickly dumps his load into Adam's mouth.\nBoth these guys have a lot of potential, and I wouldn't mind seeing each of them getting fucked in the ass!",
  "models": [
    {
      "name": "Adam Gomez",
      "person_id": 9040
    },
    {
      "name": "Declan",
      "person_id": 9110
    }
  ],
  "release_date": "2018-06-13",
  "scene_id": 9120,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Adam Gomez & Declan - Serviced"
}