{
  "collections": [
    "ChaosMen"
  ],
  "description": "Espen had just turned 18 the month before, and he was eager to start doing porn right away. He doesn't strike me as super horny guy trying to fuck everyone around him. I think he thought of it as his Summer job before college starts, and he marked his sexual orientation as 'curious'.\nI also thought that since he had a big dick, that was another reason he wanted to get into adult video.\nBut on his application, he thought his cock was 5.5\" long so he actually wasn't one of those guys that thought, \"Fuck ya! I have a big dick, of course I am going to do porn!\"\nEven based on his submission photos, I knew had seriously misjudged. This makes me happy, because I know I will have good news for them once we do an official measure.\nOn our first round of photos, he fired-up his cock and got decently hard. It was nearly 8\" long. He was shocked! He was just happy and amazed, and literally had no idea.\nThis excited him further, and I could just tell his cock was getting even bigger throughout the shoot.\nWith his lean, twink type build, and at 6'1\", his cock looks even more impressive.\nHe is an adorable guy, relaxed, and basically thought this would be a great adventure.\nHis solo is awesome, and though he wants to start by topping dudes, that perfect pink hole of his needs a cock to plunge into it.\nEspen has zero experience with guys, so as usual, we will have to step him through his limits, but he said he would be down for sucking a guy's cock.\nCheck him out next week for his Serviced video, and let's see how far he will push his limits in the future!",
  "models": [
    {
      "name": "Espen",
      "person_id": 9123
    }
  ],
  "release_date": "2018-06-25",
  "scene_id": 9125,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Theme - Solo",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Espen - Solo"
}