{
  "collections": [
    "ChaosMen"
  ],
  "description": "Espen is young and really doesn't have too much experience. He definitely has some with girls, but with guys, he just said he was curious.\nBentley Layne is more used to taking charge, but I wasn't sure what setting to start Espen in for his intro to sex with other guys.\nThis video has all the hallmarks of a newbie's first time, and the skill level matches. Both guys seem nervous and unsure.\nEspen was curious about an uncut cock and wanted to see how it felt to stroke it. They both end up stroking each other.\nBentley offers to suck his cock first, trying to break the ice.\nIt is kind of fun to watch Espen's cock go from soft to hard a couple times throughout the video. Anytime he had a chance to watch Bentley jerk-off, or if Bentley touches him, he gets very hard.\nI didn't think either guy was down for a facial, and I wanted to see if the guys could race to cum on each other's cocks.\nI have only worked with Bentley a couple times, and when it was time to cum, he would just rapidly jerk himself and cum in under a minute.\nEspen also shot his load pretty easily the day before. I was of course hoping for excellent timing.\nIt was race to see who could cum first!\nEspen won, shooting his cum on to Bentley's uncut cock first.\nBentley continues to jerk his cock, churning Espen's cum into paste. Using Espen's jizz as lube, he rapid-fire jerks a load all over Espen's cock!",
  "models": [
    {
      "name": "Bentley Layne",
      "person_id": 9039
    },
    {
      "name": "Espen",
      "person_id": 9123
    }
  ],
  "release_date": "2018-07-04",
  "scene_id": 9127,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bentley Layne & Espen - Serviced"
}