{
  "collections": [
    "ChaosMen"
  ],
  "description": "Yet another amazing TagTeam video where you will not know at which point you want to time your own load with!\nI focused on keeping shoes and socks in this. I always think it is hot when guys have athletic shoes on, and the guys actually fuck better with the increased traction. The shoes come, go, then come back again, juuust in case somebody was more interested in socks.\nAs usual, I don't get too into the fetish, and mostly this is 3 guys taking turns sucking and fucking each other. Everyone gets fucked!\nLots of sucking cock, and plenty of rimming. Favorite part is watching Jerome go back and forth rimming JJ and Mason, who are stacked on top of each other.\nYou will have to decide when you want to cum:\n1. When Jerome is getting fucked by JJ, and Mason makes him cum by jerking and sucking his load out?\n2. After Jerome cums, Mason starts to fuck JJ, then Jerome makes Mason suck the last bit of cum off his cock?\n3. JJ shooting his load while Mason fucks him, feeding his load right into Jerome's mouth?\n4. Mason unloading inside of JJ, then having Jerome repeatedly clean his cock. Mason then eats his own load out of JJ's ass?!\nPick one of those moments, and then save the other three more rounds!",
  "models": [
    {
      "name": "JJ Smitts",
      "person_id": 9026
    },
    {
      "name": "Jerome",
      "person_id": 8561
    },
    {
      "name": "Mason Lear",
      "person_id": 9050
    }
  ],
  "release_date": "2018-07-13",
  "scene_id": 9134,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jerome & JJ Smitts & Mason Lear - TagTeam RAW"
}