{
  "collections": [
    "ChaosMen"
  ],
  "description": "Owyn had only done oral with other guys. He seemed very cavalier about it, like it was no big deal. I got the feeling it was never something that he searched out, but rather it just would kind of happen.\nWills was up for doing the oral, and I think this is the first time Wills has not been towering over his scene partner. Owyn is nearly his height and they are about the same in cock size as well. A complete match. I think Wills was surprised to be able to looks someone right in the eyes.\nWills has more experience, so he led him through the shoot where they swapped oral back and forth, and Wills actually loves to eat ass, so Owyn gets his salad tossed.\nOwyn is wobbly the first time he gets head, but after sucking on Wills, he laid back down and truly got into the scene, bone hard and ready to cum.\nThe ending is, well, comical. And yet, very hot.\nOwyn goes to give Wills a facial, with a prior warning from me to avoid Wills' eyes. Instead, Owyn makes sure that every single drop goes into Wills mouth. Ok, maybe one drop lands on the bed.\nNow Wills, he is down with a little cum in his mouth, but this was a giant load, and he panics, unsure what to do with it. He's not ready to swallow that amount, plus I usually tell the guys to spit a little to the side so we have nice cum to show case at the end.\nBut his mouth was overfull and he looks around at me like, 'Help! What do I do with it all?!' I\nI told him to just spit some out. You can tell there is a debate going on, but instead he just swallows the load because the guy was nearly about to cum. Maybe he liked swallowing the load?\nOwyn had sat down, ready to get his own facial, but the Owyn is just too tall to for the placement of Will's load on his face. Plus, I suspect after filling Wills mouth and watching him struggle to swallow it, Owyn was not about to find himself in the same situation and seemed relieve his chest took the load.\nWills dumps his load on Owyn's chest and the video ends a little quick as I take mercy on Wills and throw him a spit towel.\nI gotta give Wills credit. It was more than he expected, but he literally choked it down and never lost his own orgasm inertia!",
  "models": [
    {
      "name": "Wills",
      "person_id": 9073
    },
    {
      "name": "Owyn",
      "person_id": 9179
    }
  ],
  "release_date": "2018-08-29",
  "scene_id": 9190,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Owyn & Wills - Serviced"
}