{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jockstrap fans rejoice!\nVander loves his dirty jockstraps, and we got both of them suited up in their favorites. It was a little musky in the studio that day!\nVander loves this accessory, though Michael feels it doesn't show his bubble-butt in a good way, but I have to disagree. He looks even more tasty! Vander agrees with me as he could not stop having Michael sit on his face so he could tongue his hole while grabbing his straps.\nI thought perhaps they would abandon the jockstraps, but both were enjoying it so much that they keep them in place the entire video.\nYou can tell this is a legitimate fetish for both these guys, indicated by the hungry and intense need for each other.\nVander runs the table on Michael's ass. He constantly goes back and forth from licking his hole, to jamming aggressively his thick cock deep inside his ass.\nI do believe we might have tired voracious bottom-boy Michael.\nVander fucks him until he cums, filling his Boy up. By then, Michael's abused hole needed to be kissed and rimmed, not being able to take any more hammering.\nVander tenderly licks and sucks the cum out of Michael's hole, while Michael squeezes out a load which he feeds to Vander!",
  "models": [
    {
      "name": "Michael Shores",
      "person_id": 9111
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2018-09-07",
  "scene_id": 9202,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Michael Shores & Vander - RAW"
}