{
  "collections": [
    "ChaosMen"
  ],
  "description": "This is clearly Espen's first time (on film) fucking a guy.\nBefore the shoot, he confessed a gay friend of his 'volunteered' to let him fuck him so he would not be a complete newbie. Such a generous offer!\nIt does make ya wonder. He gets hard so easily, and for his private tutoring he says has no problems getting hard, as long as he has his phone handy to watch a little straight porn to kick things off.\nSo that's why I started-off with him and JJ watching a video together. JJ is Bi, so we just tossed on some straight porn, and both guys were easily hard.\nBut boy, you can tell that Espen is working through his limits and is very focused on the TV. JJ just pushes him along, jerking each other and then giving him head.\nEspen returns the favor and you can tell he is not very experienced. Espen loses a little bit of his boner, so JJ has him lay back down and uses his mouth to get him fully hard again.\nJJ then straddles him and slides his giant cock inside.\nAccording to JJ, he thinks that Espen accidentally cums during this first portion. I thought Espen was concentrating on trying to stay hard, but JJ insists that Espen was trying to not cum.\nWhen they moved to fucking doggie-style, JJ felt cum leaking out his hole.\nEspen's cock seemed spent too. So, I am inclined to agree with JJ.\nIronically, I feel like JJ had the same issue himself. When Espen fucks him on his back, I am down getting a nice undershot. I got up off the floor to stand and get more coverage, when JJ is shouting he is already cumming.\nHe blows his load, not being able to decide to hold it in or just go for it.\nEspen pulls out and begins to stroke his cock rapidly, trying to catch-up. He finally gets there, juices JJ's hole, and JJ busts his second load as Espen breeds him!",
  "models": [
    {
      "name": "Espen",
      "person_id": 9123
    },
    {
      "name": "JJ Smitts",
      "person_id": 9026
    }
  ],
  "release_date": "2018-09-14",
  "scene_id": 9223,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Espen & JJ Smitts - RAW"
}