{
  "collections": [
    "ChaosMen"
  ],
  "description": "Since Volker has experience with guys, I put him in charge of servicing Timmy first.\nI might have given him too big of a stick to work with though. He enthusiastically goes after Timmy's cock, using mostly his mouth, but gags himself a bit like a newbie. Though, I love seeing Volker's blue eyes water as he tries to take as much as he can!\nTimmy encourages him to use more of his hand to stroke his shaft and that manages to get his cock standing at attention.\nVolker spent all his energy on Timmy. Timmy gets him standing and starts to work on his soft cock. Timmy get it hard and treats Volker's dick to his expert mouth.\nVolker than goes for round two on Timmy's cock, his angle of attack much better!\nSince Volker has ass for days, Timmy was eager to rim him, so he got Volker on his back. I think Volker has bottomed, and you can sure tell he liked the anal attention.\nAfter they suck each other 69 style, Volker gets on the floor so Timmy can bust his nut on his face.\nGeez! Timmy came a lot! He not only coated Volker's face, but also Volker's chest. We knew that Volker was going to stand and try to give Timmy a facial as soon as Timmy was done nutting. Timmy took pity on him and scooped the massive amount away so Volker could focus.\nEven still, Volker has cum all over him as he shoots his load on to Timmy's face.\nAnd of course, it goes right in the eye! I swear I need to hand out eye shields for these guys. How is it possible so many guys nail the other guys in the eye?\nRegardless, this time it is Volker who takes pity on Timmy, clearing his eye, but leaving these two guys coated in sweat and cum!",
  "models": [
    {
      "name": "Timmy",
      "person_id": 8691
    },
    {
      "name": "Volker",
      "person_id": 9213
    }
  ],
  "release_date": "2018-10-03",
  "scene_id": 9224,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Timmy & Volker - Serviced"
}