{
  "collections": [
    "ChaosMen"
  ],
  "description": "There is just something really hot about this Serviced video.\nI think it is the fact that Lorenzo likes the daddy types, and Kane definitely gives off that vibe.\nPlus, it helps that Kane has a huge cock that Lorenzo gets to toy with. He is clearly having a blast servicing him.\nKane just doesn't lay there either. He is nice and verbal, turning on Lorenzo even more. Kane then jerks on Lorenzo as he continues to suck his cock from another angle.\nThe daddy-vibe really comes in to play when Lorenzo sits on Kane's chest, shoving his ass near Kane's face. Kane keeps smacking Lorenzo's ass, while Lorenzo keeps asking him to slap harder!\nAfter getting Lorenzo's ass cheeks bright red, Kane buries his face in Lorenzo's cheeks and gives him a professional rim job.\nKane then rolls Lorenzo on his back and shows that he can deep-throat a cock. I'm impressed!\nWe have done this trick before with Lorenzo. He wanted to have Kane over him, while they each jerk their own cock. Lorenzo is very visual and he loves watching a guy stroke on top of him. He loves seeing a muscle daddy, and even reaches out to stroke his firm body.\nLorenzo blows a huge load, then scoops it up and jerks Kane's cock with his own load.\nKane then straddles Lorenzo's chest and shots is load onto Lorenzo's face. The aim is actually pretty decent.\nPerhaps the hottest moment is watching Kane slap his cock against Lorenzo's cum-soaked tongue, with jizz dripping down his neck!\nIt is a hot gooey mess!",
  "models": [
    {
      "name": "Kane Haney",
      "person_id": 9218
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2018-10-10",
  "scene_id": 9226,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Kane Haney & Lorenzo - Serviced"
}