{
  "collections": [
    "ChaosMen"
  ],
  "description": "For Espen's second full romp with a guy, he turns it up a bit. Well, he seems a little less lost.\nOf course, it helps having Wren there. He is such a pro. He has been with all kind of guys. From complete newbies to hungry Tops wanting to ass pound him aggressively.\nWren can step it up when it comes to being a Bossy Bottom, but Espen didn't have to be led around like his first time. Still, Wren is so verbal, it also helped engage Espen.\nEspen surprised me though. I know he is 18, and he gets hard SO easy. He occasionally droops, and Wren figured out all he had to do was stop and suck on his cock to get Espen fully-charged again. Espen has gotten head from guys before, and I guess this is where he is most confident.\nEven at the age of 18, Espen has said he has had a lot of sex with women, but with all the guy-guy stuff being new to him, I had yet to see any real skills. But this video we get more than a hint of his hetero skills translating into gay sex.\nEspen fucks Wren on his stomach, and he knows just how to fuck him in that position. He gets his right knee in the air, and power fucks poor Wren. He had to occasionally squirm away from Espen's impressive cock the attack was so relentless!\nThere is even quite a bit of kissing and tenderness mixed in. After Espen fucks Wren hard and aggressive, he stops and nuzzles the back of Wren's neck as if to apologize for the pounding.\nWren busts a load easily as Espen fucks him, while Espen squirts one glob on Wren's hole, and then dumps the rest inside of Wren!",
  "models": [
    {
      "name": "Wren",
      "person_id": 3581
    },
    {
      "name": "Espen",
      "person_id": 9123
    }
  ],
  "release_date": "2018-09-28",
  "scene_id": 9228,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Espen & Wren - RAW"
}