{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ron came in to do a solo/oral combo several years ago. He then then promptly met a guy he really liked. They dated for quite some time, and in that time, he got a lot more experience under his belt. That is over, and he wanted to try doing a video.\nAt first, he wanted to Top only for this shoot, but he admitted he loved bottoming, and would be down to get fucked for some of the video.\nI picked Thompson for him work with because they look so much alike.\nWe start with some body worship, but you can tell Ron just wanted to kiss in order to get hard. There is a lot of passionate kissing in this video. Anytime Ron's cock would droop, he'd pull Johnson in for some scruff on scruff action.\nI really love Ron's handsome face, and my favorite moment is when Johnson sits on Ron's chest and makes him suck his cock. His face is all angles and brown eyes. With Johnson slapping his cock across his tongue it is quite a sight to behold.\nThompson then flips Ron over and begins to rim him. Ron responds like an eager Bottom. So much so that Thompson drives his cock into Ron's hole and plows him right then and there. This is apparently Ron's favorite way to get fucked, flat on his stomach.\nNext it was time to check out Ron's Topping skills. He has a big dick, and it took Thompson a bit to take it. Once his cherry was popped, Thompson was good for a nice long hard fuck.\nI don't know which Ron is better at? I feel like he is a better Bottom than a Top, but that big cock is a shame to waste by not shoving it in a hole.\nThompson then gets on his back and the build-up to him cumming is quite intense. Ron uses the last of his energy to pound him until a giant nut flies out of Thompson's cock.\nRon then jerks his cock, doing his best to breed Thompson. I think he fills him up, but he doesn't seem to be able to let go of his pulsating cock when he unloads. Another full breeding moment!\nAfter filling Thompson up, Ron wanted to tenderly make-out with his buddy. His cock slides out, and a wee bit of cum oozes out of Thompson's hole.",
  "models": [
    {
      "name": "Thompson",
      "person_id": 8840
    },
    {
      "name": "Ron",
      "person_id": 8499
    }
  ],
  "release_date": "2018-10-05",
  "scene_id": 9234,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Ron & Thompson - RAW"
}