{
  "collections": [
    "ChaosMen"
  ],
  "description": "A lot of hot Latin passion in this video!\nClearly, Davos loves to kiss, and these two have a great make-out session. I clued Lorenzo that Davos was into some nipple play, so he zeroed in on his nips, rubbing, sucking, biting until Davos was writhing around in ecstasy.\nLorenzo moved down to Davos's uncut cock and literally treated his uncut cock to every technique he knows. My favorite is watching him slobber all over it, and then ramming it down his throat.\nDavos returned the favor, though I think you can tell he does not have as much experience with cut guys. At times, I think it was obvious that Lorenzo was his first circumcised guy. His tongue searches out for a foreskin, so he had to adapt. I guess most Puerto Rican guys are indeed uncut.\nThough, when they went for a 69-sucking, both guys shinned, and by then Davos knew what to do with a cut cock.\nLorenzo rimmed Davos and he was a bit jumpy. We stopped to find out if he was being tickled or that it hurt, but he looked confused at us. He said it felt amazing, so Lorenzo dived back in, and yet it still seemed like he is squirming more than enjoying.\nI wanted to watch Davos jerk his own cock while Lorenzo worked his nipple dials. Davos also really wanted to kiss. So, Lorenzo hovers over him, kissing him, biting or pinching both nipples until he gets close. Davos even begins to suck on Lorenzo's nipple, sending him into nipple overdrive.\nDavos blasts out his load. He has a cool technique where he jerks his foreskin over his head rapidly, but once he starts cumming, he releases, and kind of cums hands-free.\nLorenzo then goes to give him a facial. He did have to stop and get himself close after spending all his energy working all Davos's dials and buttons.\nHe abruptly cums, and Lorenzo swears that it was one of his biggest cum shots to date. I'd have to do some research, but I tend to agree. It is a LOT!\nLorenzo then bends down, sharing his cum with Davos!",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Davos",
      "person_id": 9233
    }
  ],
  "release_date": "2018-10-17",
  "scene_id": 9238,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Davos & Lorenzo - Serviced"
}