{
  "collections": [
    "ChaosMen"
  ],
  "description": "Davos returns to get his ass fucked!\nOf course, all that nipple play has to happen to keep him writhing in ecstasy. So once again, if you love nipple action, this dude is for you.\nDavos is definitely looking for passion, and when I had told him he was playing with Timmy, he immediately got a huge crush on him. He researched all his videos, and by the time of the shoot, he was practically begging to touch him.\nHe throws a lot of energy at Timmy, who tosses it right back, though I think initially he was surprised at just how much passion Davos was sending his way. He played catch-up though part of this video.\nDavos sexual experiences with guys has been limited. Again, he wasn't sure what to do with an uncut cock, and the size of Timmy's cock stretched Davos's amateur skills. We kept if brief as Davos's jaw could not spread wide enough and not have Timmy's cock hit his back teeth.\nDavos then sits on Timmy's face, and you can clearly see Timmy was loving this. I think there is actually a lot of rimming in this video as Timmy loved burying his face in Davos's ass.\nDavos grinds around from the tongue lashing. We weren't sure if he was being tickled, or in pain, so we stopped to ask, and Davos seemed mystified why were stopping. Apparently, he is loving every minute of it.\nFucking starts of a little slow. Since Davos has not sucked a big cock before, he certainly had not taken one in the ass. It was a bit like working with a first-timer. We try a couple positions, but when they start spooning, Davos becomes starved for Timmy's cock, eagerly taking the pounding.\nWe were thrilled with this turn of events, and Timmy fucks him until sweat is dripping everywhere, fucking blindly as salty sweat pours into eyes.\nHe gets himself into an upright position, and while water pours off of him, he shoots ropes of cum at Davo's hole. He tries for an insert but the angle is wrong and his cock wilts, so he fingers his load into Davos's ass.\nI knew Timmy was completely spent. I had him lay back and let Davos lay on top of him. Timmy does some nipple play and kisses him, encouraging him to cum.\nDavos lets out a powerful orgasm, pulling on Timmy as if his life depends on it. Timmy neck is exhausted but keeps playing with his buddy's nipples.\nPhew!",
  "models": [
    {
      "name": "Timmy",
      "person_id": 8691
    },
    {
      "name": "Davos",
      "person_id": 9233
    }
  ],
  "release_date": "2018-10-26",
  "scene_id": 9244,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Davos & Timmy - RAW"
}