{
  "collections": [
    "ChaosMen"
  ],
  "description": "I guess I didn't realize what a Top Dog that Declan could be!\nHe likes bottoming a lot better these days, but he really shines as a Top. With Matthew West's elite bottoming skills, Declan really got to fuck him without mercy. This is first video where Declan is only Topping and he really is getting into it.\nAfter swapping oral, he spoon fucks Matthew, and geez, you can really tell this guy knows how to fuck. He works up quite a sweat trying to hammer Matthew's hole from that angle. Matthew is of course lost in Bottom Boy Nirvana.\nDeclan needed a break after that, so he kicks back and lets Matthew ride his cock from every angle. After riding his cock, Matthew cleans Declan's dick like a good boy.\nNext Declan fucks him on his back, playing with his cock while digging his cock in as deep as it could go. Matthew was in painful bliss.\nI did want to see if Matthew could cum doggie-style. The trick with this is you really have to be able to push your cock backwards as you are cumming so we can see it, and Matthew's cock stands complete upright with very little give downwards.\nMatthew informed me if Declan bred his hole, he could make anything happen.\nSure enough, Declan (aggressively) breeds his hole, dumping a nice nut. He quickly starts to fuck him with his load, and Matthew goes into power-jerk mode and nuts moments later. It is really hot seeing Declan's cum leak out of his ass while Matthew shoots his own load.\nMatthew then cleans his buddy's cock off, while Declan fingers Matthew's cum-filled hole!",
  "models": [
    {
      "name": "Declan",
      "person_id": 9110
    },
    {
      "name": "Matthew West",
      "person_id": 9080
    }
  ],
  "release_date": "2018-10-12",
  "scene_id": 9249,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Declan & Matthew West - RAW"
}