{
  "collections": [
    "ChaosMen"
  ],
  "description": "Blaze said he has only bottomed on a few occasions, and he was not a big fan.\nMy goal is to ease him into it with smaller steps. I think before he was just tossed into the deep end.\nWills is incredibly versatile and is so easy to work with, that I thought these two might make a good flip-fuck video. They sure did!\nWills also likes to eat ass, so in order to get Blaze more in the mood to take a cock, Wills does a great job of slicking up his hole.\nWills then slides his cock in, and Blaze makes a few ouchie faces. Wills slowly fucks him and I swear you can see the epiphany when Blaze realizes it actually feels good. Success!\nHe starts encouraging Wills to fuck him harder, and he keeps stroking his own cock, getting lost in the sensation.\nWills then swaps places with him, letting Blaze slide his long cock in and out of his hole.\nI am still trying to get Wills to cum from being fucked but he just thinks he can't. Some guys take a long time to nut, but not Wills, within a minute of putting his mind to it, he can usually nut. So I think it is all in his head.\nSo, I had him on his back again, but Blaze got close to cumming first. He paints his hole with his load, then shoves in as much in as he can.\nAfter getting fucked, Wills ramps-up and quickly sits up to unload on Blaze's beard.\nI admit I wanted to see what Blaze's beard would look like cum-soaked. With cum all over it, Blaze sucks the last drops from Will's cock!",
  "models": [
    {
      "name": "Wills",
      "person_id": 9073
    },
    {
      "name": "Blaze Burton",
      "person_id": 9205
    }
  ],
  "release_date": "2018-10-19",
  "scene_id": 9250,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Blaze Burton & Wills - RAW"
}