{
  "collections": [
    "ChaosMen"
  ],
  "description": "We had a bit of drama with ChaosMen studio's water well. It ran dry. Strange because we have a very deep well, and we made it through the 6 years of drought. But they have built over 30,000 homes out here, and they are all sucking on the aquifer.\nWe went about two weeks with out water before a new well could be built, along with a storage system for water delivery. Yes, that is now going to be a thing for many people here. $18,000 later we now have water.\nIf you'd be so kind to sign up, I know it takes a lot of $20-25 memberships to help cover that amount. (Remember half of that may go to an affiliate if you came from their page) but if you haven't been a member in while, take pity on us and sign-up and watch some hot porn.\nAnd this IS a hot porn. Since there was no water, I really couldn't shoot at the studio. Doing an AirBnB has gotten a few other studios in trouble, and I don't have any rich mature friends that want to offer up their million-dollar mansions to come fuck in.\nI believe this is our first hotel sex shoot. It looks fantastic. We had a great view and lots of natural light.\nI was also lucky that both guys were totally hungry for each other.\nAidan clearly has some great skills, and proved he is a porn star. JJ has stepped up his game too, and we get to see him breed Aidan's hole in this one. He cums so easy from being fucked, that we often have him as bottom, so it was hot to see him Top like a pro.\nAnyway, as I said, these guys are hungry for each other, and I know you will not be disappointed and the change of location is lovely.",
  "models": [
    {
      "name": "JJ Smitts",
      "person_id": 9026
    },
    {
      "name": "Aidan Anthony",
      "person_id": 9180
    }
  ],
  "release_date": "2018-11-02",
  "scene_id": 9255,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Aidan Anthony & JJ Smitts - RAW"
}