{
  "collections": [
    "ChaosMen"
  ],
  "description": "Beckett was more nervous than he thought for this video. He has done some Bi video work before, but my understanding was he never even sucked cock.\nBut he was willing to give it a try, and actually was very optimistic if not eager.\nI start Becket and Timmy with a side-by-side jerk-off. I knew Beckett would be relying on the porn to keep him going. Thankfully Timmy is Bi, so they settled on a video they both liked.\nTimmy was shocked at how big Beckett's cock was and a little sad when he thought Becket might be bigger. But I dunno, I think Becket is thicker, but Timmy has some length on him.\nTimmy sucked on a nervous Becket until he lost his inertia, so Timmy sat back and I will be damned if Beckett didn't dive into sucking cock eagerly. Timmy was even a little wobbly to start with, but Beckett managed to get him very hard.\nBeckett said the easiest way to cum was to fuck someone's face. Timmy gets on his back while Beckett uses his throat. Poor Timmy, but he was loving it!\nBeckett makes him choke on his load.\nThen the two swap places and I was little concerned Beckett might be weird about a facial. He said he was totally down for it and kept his mouth wide open.\nTimmy blows his load everywhere. Hitting his mouth and coating his face and quite a bit of Beckett's chest.\nOne of Timmy's best cum shots!\nBecket did a great job of sucking the cum out of Timmy's spent cock, and I think we can cross this off his list of limits as a complete success!",
  "models": [
    {
      "name": "Timmy",
      "person_id": 8691
    },
    {
      "name": "Beckett",
      "person_id": 9256
    }
  ],
  "release_date": "2018-11-07",
  "scene_id": 9260,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Facial  Cum Eating",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Beckett & Timmy - Serviced"
}