{
  "collections": [
    "ChaosMen"
  ],
  "description": "Both Barton and Tatum hit me up the same week, posting pictures of their new workout results. Barton also is working at clubs, becoming known as the harness clad server. Tatum, as many of you may know, loves bondage and kink.\nMy site only dabbles in it, but both guys brought their gear and attitude to this shoot. I didn't want to go too deep into fetish territory, but I set the scene up so they could just do what they wanted.\nBarton is the bossy one of the two, and Tatum enjoys being passive. He also likes a lot of pain with his sex. He brought his flogger, and Barton whipped his ass until it fell apart. Which is a good thing because I don't think it was making Tatum's ass bright red enough.\nBarton switched to his hand, smacking him until Tatum's ass was glowing.\nThis video doesn't just have bossy attitudes. There is some tenderness, kissing, nipple biting, and pit worship. Barton pushes a butt plug into Tatum and makes him suck his cock.\nHe pulls the plug out, then aggressively fucks Tatum.\nEven Barton wanted to get his ass fucked, so Tatum tops him, pounding his body into the bed.\nBut Barton wanted to be last man on top, so he fucks Tatum until he cums. He then breeds Tatum's hole like a pro, making Tatum clean his cock after the bruising fuck they both throw down.",
  "models": [
    {
      "name": "Barton",
      "person_id": 8564
    },
    {
      "name": "Tatum Parks",
      "person_id": 3496
    }
  ],
  "release_date": "2018-10-29",
  "scene_id": 9264,
  "tags": [
    "Build - Hairy",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Bald",
    "Hair - Brown/DK Blond",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - Bossy",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Barton & Tatum Parks - Bossy RAW"
}