{
  "collections": [
    "ChaosMen"
  ],
  "description": "I mentioned that JJ Smitts referred Terry to me. The two have been hooking-up every now and then since they did a photoshoot together. JJ loves fuckin him, and I think he wanted to capture that on film.\nTerry was nervous despite having a bed partner he already knew how to dance with. But, JJ takes control, and with Terry's passive vibe, it is a very nice fit. Despite the Dom/Sub vibe, there is a ton of tenderness between these guys.\nI believe Terry mentioned sucking dick as being his favorite thing. Well, it was a toss-up between that and bottoming when he answered that question previously. Not sure which is his favorite.\nTerry focused a lot on servicing JJ's cock with his mouth. And when his mouth got tired, JJ was more than happy to switch to fucking Terry's ass.\nAlthough Terry loves to bottom, he still has not mastered cumming while being fucked. So, JJ fucks him until he himself cums, breeding Terry's juicy hole.\nWith cum dripping from his ass and JJ sucking on his nuts, Terry cums easily after being breed so thoroughly.\nJJ laps up some of the cum and shares a passionate kiss with Terry at the end!",
  "models": [
    {
      "name": "JJ Smitts",
      "person_id": 9026
    },
    {
      "name": "Terry",
      "person_id": 9268
    }
  ],
  "release_date": "2018-12-03",
  "scene_id": 9278,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Ethnicity - African American",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "JJ Smitts & Terry - RAW"
}