{
  "collections": [
    "ChaosMen"
  ],
  "description": "Carter Sloan thought for a good while before saying he wanted to do more with a guy then simply get head. He actually thought fucking a guy would be easier than just having head. He definitely does not have a Dom vibe, but I think he takes joy in seeing his dick split another person's ass in two. His limits are still very narrow.\nI knew Antonio could handle the oral portion for a marathon period. He is without a doubt my best deep throat guy. He may not have the hand motion to really stroke and suck, but he is all throat, and literally I think he could curl up humping a guy's leg while he nurses on his cock for hours.\nWe actually start in Antonio's all-time favorite position. He humps Carter's thigh while choking down his big cock.\nAfter getting him very hard and eager to stick his cock in another hole, Antonio took the plunge, and slowly eased himself down on Carter's cock. It looks like Antonio is pushing his pain limits. Ow!\nPut he pushes through and although none of the fucking is too energetic, Antonio loved slowly sliding his cock in and out of his hole. It was not long before the pain turned into pleasure, and his cock only wilts a couple times when Carter goes balls deep.\nAfter getting fucked and all stretched out, Antonio decides to give his ass a break He lets Carter throat fuck him with his head draped over the side of the bed. Antonio recovered his mojo, and was ready to get fucked doggie-style.\nEven still, Antonio is doing his best to accommodate, and with Carter in complete control, he fucks him more aggressively and shoves every last fat inch into him. Antonio is hating/loving it!\nI thought maybe Antonio could cum on his back while Carter eased his cock into him, and we definitely tried. I think it was just too much. He'd get close, and Carter would suddenly go balls deep, and it would send Antonio back down a couple steps on his orgasm ladder.\nI felt a little bad for him, so we had Carter just fuck him until he bred his whole.\nI took advantage of Antonio's love of just nursing on a spent cock. Carter finishes creaming him, then crawls up and lets Antonio just suckle all the remaining cum inside Carter's cock. You can really tell this just turns him on, and he easily bust his own load!",
  "models": [
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    },
    {
      "name": "Carter Sloan",
      "person_id": 9172
    }
  ],
  "release_date": "2018-11-12",
  "scene_id": 9282,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Antonio Cervone & Carter Sloan - RAW"
}