{
  "collections": [
    "ChaosMen"
  ],
  "description": "While Espen has a nice big cock for fucking a guy, I really want to get him to be versatile. Top only guys don't seem to work as much, and he is such a cute guy, I want to get him on the site more often.\nHe worked with JJ Smitts, who actually convinced him he should give it bottoming a try. Thanks JJ! Espen got a toy (a very small one I am assuming) and practiced a bit at home.\nI did not start him out small as far as cock size goes. In fact, Easton and Espen have nearly identically shaped and over-sized cocks. On one hand, I knew Espen would see what it was like to take a cock his size, but on the other, I worried I was starting him with an advanced-sized cock.\nSo, we start off with some colorful butt-plugs. Even the smallest one had Espen squirming, and the mid-sized butt plug opened him up a bit, but he still looks like he is barely able to handle it. Easton keeps stroking and sucking his cock, trying to turn that pain into pleasure, and I think we actually got there.\nAnd then Easton slides his cock in. Muuuuch better! Sometimes toys help open up the guys, while other's just fight against them.\nBut there was no fighting against Easton's cock. He didn't pound Espen by any means. He took it slow and steady, trying to break Espen in nice and easy. He popped his virgin boy hole like a pro.\nAfter that, Espen takes over topping. He is a little more tentative fucking Easton after having just been skewered by a cock his own size.\nEaston was having none of that. He encouraged Espen to fuck him hard, reaching back and grabbing Espen's ass to pull him in and pound him harder. I think Espen was shocked at how aggressively he could fuck Easton.\nEspen fucks the cum out of Easton, who ends up shooting his own cum up over his shoulder and head.\nAfter scooping up some of Easton's jizz to lubricate his cock, he nudges a nice load up against Easton's hole, then pushes the rest in.\nHe falls forward and kisses Easton, and we get to see his cock slowly plop out of Easton's battered hole.",
  "models": [
    {
      "name": "Easton",
      "person_id": 8522
    },
    {
      "name": "Espen",
      "person_id": 9123
    }
  ],
  "release_date": "2018-11-16",
  "scene_id": 9288,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Easton & Espen - RAW"
}