{
  "collections": [
    "ChaosMen"
  ],
  "description": "I had so many issues with paring Aidan with a model this visit. The first guy I set him up with got a new job with 4-day training that took him out of the running. I had a decent amount of time to find another model. The second guy was tested and ready to go, but then couldn't get off work. Third guy was waiting for a delivery that was running late.\nRansom, who had picked Aidan up from the hotel, were sitting waiting for the third model who just could not leave. The clock was ticking for Aidan's return flight home.\nAidan just flat out told Ransom he would rather fuck him. Ransom texted me and said he was down to be fucked. He'd just done an oral video earlier that week, and wished it had been a sex film.\nI said, \"Let's do it!\"\nRansom put the car in drive and they were soon at the studio showering and getting ready.\nAnd thankfully, they both were in to each other and shoot was a breeze. Ransom is a little out practice getting fucked, saying it had been since his last video with ChaosMen. Aidan goes nice and easy on him, but occasionally Ransom is whispering to him to slow down.\nAt first, I thought he was hurting, but nope, he is trying to not cum!\nSince he was so close, Aidan's cums first, juicing Ransom's hole. I had to jump up really quick to catch Ransom as he started cumming as Aidan fucks him with his cum!",
  "models": [
    {
      "name": "Aidan Anthony",
      "person_id": 9180
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2018-12-14",
  "scene_id": 9301,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Aidan Anthony & Ransom - RAW"
}