{
  "collections": [
    "ChaosMen"
  ],
  "description": "With Steve being the new guy, at first, I thought I would get him on the massage table to be serviced. But Steve mentioned he is trained to give a 'real' massage, I figured we'd have him do the massaging. Of course, the massage is more of an oiling-up of Blaze rather than full massage, but Steve did appear very confident and in control of the table.\nBlaze is smoking hot on that table. He is so expressive and turned-on, it makes me wonder if he has ever had a happy ending massage from a guy or girl before?\nSteve does an amazing job slicking-up Blaze's body, playing with and tonguing his hole, all the while making sure Blaze's cock is teased, keeping him hard and wanting to cum.\nSteve is also a great cock sucker. He starts with a hand-job, then begins to use his mouth. Blaze squirming from the extra attention to his cockhead.\nThey swap places so Blaze can fuck Steve's face, but first Blaze jerks and sucks Steve's cock. He pinches and tweaks Steve's sensitive nipples while he swallows his cock.\nBlaze then slides up and fuck's Steve's face, getting himself close enough to cum. He ramps up his stroking, while Steve beats his own cock.\nBlaze unloads in Steve's mouth, triggering Steve to stroke even faster and then blow his own load.\nThat's a lot of sticky cum in his beard and tummy hair!",
  "models": [
    {
      "name": "Blaze Burton",
      "person_id": 9205
    },
    {
      "name": "Steve Strongarm",
      "person_id": 9304
    }
  ],
  "release_date": "2018-12-26",
  "scene_id": 9308,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Blaze Burton & Steve Strongarm - Serviced"
}