{
  "collections": [
    "ChaosMen"
  ],
  "description": "Espen made quite a bit of progress in this video. It helped that Jerome is one of my best guys.\nFirst, Espen looks great with his new haircut. He is only going to get more handsome as he matures. Jerome got a haircut the day before, I think he was looking sharp too.\nSecond, his skills really jumped in this video. Espen seems to have cock-sucking down as a legitimate skill. With his head resting on Jerome's abs, it was a much better angle for him to suck from.\nJerome plays a lot of attention to his hole, fingering it, and rimming him, trying to get him in the mood to be fucked.\nAnd then Jerome got a little nervous when he saw how big Espen's cock was getting when he sucked him from soft to hard.\nI told him his cock was no bigger than Easton's, the guy that took his cherry. Plus, he handled Vander's ample cock, So I knew he would be fine.\nJerome then fucks Espen, taking it easy on the boy. Espen was not very hard when he first got penetrated, so I was very happy to see his cock got harder as he was getting fucked. He is definitely getting some pleasure out of it, though I think we are far from getting him to cum from being fucked.\nThen it was Jerome's turn, and he wanted to sit on it so he could ease it in himself. This guy can really bottom after that initial penetration. At first, he rides Espen facing him, but then switches it up so we can see him bounce around on Espen's giant cock, pre-cum leaking out of Jerome's dick.\nIn the end, Jerome is on his back and I knew I had better start with the under shot, because Jerome cums so quickly in this position. Espen fucks him deep!\nI'm down on the ground getting good penetration and I can hear Jerome is nearing an uncontrollable climax. I shuffle up and get my camera in place, and SPLAT! Jerome is shooting out creamy white goodness.\nAnd Espen must have been close too. He only needed a moment to jerk-off and then breed Jerome's hole.\nWith his own cum still stuck on his cock, Espen has Jerome clean and lick up the rest of his load from his dick!",
  "models": [
    {
      "name": "Espen",
      "person_id": 9123
    },
    {
      "name": "Jerome",
      "person_id": 8561
    }
  ],
  "release_date": "2018-12-07",
  "scene_id": 9322,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - African American",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Espen & Jerome - RAW"
}