{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ever since I discovered how much passion both these guys have been bringing to their scenes, I have been wanting to put them together.\nIt sure paid off!\nI am going to have move Declan into the Bi category. Despite recently getting engaged, he is having a lot of fun during these scenes. He is eager to please his partner, and is enjoying getting fucked.\nAfter sucking each other's cocks and rimming holes, Declan is up first for getting fucked. JJ jerks Declan's cock while pounding his hole. Declan is squirming around and you can tell it he is close to cumming.\nThey switch it up, this time JJ getting fucked on his back. I made sure to warn Declan to not play to much with JJ's cock when fucking him like this, telling him JJ tends to cum super-fast.\nSince JJ cums so easily while being fucked, I actually wanted to see if JJ could cum while getting fucked doggie-style.\nDeclan flips him over and JJ takes his cock with a little bit of struggle. With his face planted in the bed, Declan's angle of attack was not hitting his prostate.\nI tell JJ to stay more upright and that did the trick for both of them.\nAnd then we get one of the best-timed cumshots.\nDeclan strokes his cock and juices JJ's hole. Meanwhile JJ is jerking his own cock, cumming about a minute after Declan creampies his hole.\nThere is cum flying and oozing everywhere!",
  "models": [
    {
      "name": "Declan",
      "person_id": 9110
    },
    {
      "name": "JJ Smitts",
      "person_id": 9026
    }
  ],
  "release_date": "2018-12-21",
  "scene_id": 9327,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Declan & JJ Smitts - RAW"
}