{
  "collections": [
    "ChaosMen"
  ],
  "description": "I kept this one simple for a couple reasons.\nI was WAY surprised when Javen called me a week or so later saying he needed to get caught up on his mortgage, and would do an oral scene.\nThe one caveat, he needed the money in very short order. I DO try to spread these vids out amongst other performers, and knew I was getting way too many of me (LOTS of EDGE vids on the horizon!), but hey I was free, and he sure is cute.\nSo he was very nervous and surprised he was getting his dick sucked by a guy, though when I told him it was too short notice and I would be the instigator, he said he would rather I do it since he knew me. Another reason I often end up in the driver's seat.\nBut there were other reasons I kept it simple. By the time I would get him hard, he would almost nut. You can see once, at about the 3 minutes mark, where he tells me to ease up. His dick would quickly wilt. Then I would get him hard and ye then would signal me he was too close again.\nEach time he would get close, I had a little bit of time to showcase his erect dick, and then it would wilt. So he was either On, or Off. And when it was On, it was ready to fire.\nI for sure know its not my cocksucking skills. He told me before hand he loves blow jobs and they are the sure fire way to make him nut. He wasn't lying!\nI gave up on the dick sucking and tried to do a bit of anal action.\nHe was just not going to get relaxed for a rimming. He was all clenched up and despite his willingness to show his ass off for the solo AND saying he was looking forward to it, he was really hard to get him in \"Cat in Heat\" mode.\nSo I gave up on that pretty quickly and then just decided I wanted to just make him cum straight away. Since we had to stop a couple times I figure it would be easy to make him nut\nThe build-up is continually shot as I take him from wobbly to spurting. On an energy meter, the graphic would by shaped like a pyramid! He quickly builds up to the pinnacle!\nHe's one VERY sexy dude. I think he has his bills squared away, so not sure if I will see him again, so enjoy him now. Or pray for more late payments in his future!",
  "models": [
    {
      "name": "Javen",
      "person_id": 3311
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2009-03-11",
  "scene_id": 937,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Theme - Serviced",
    "Video - Bryan Appearance",
    "Video - HD - High Def"
  ],
  "title": "Bryan & Javen - Serviced"
}