{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kurt has done guy-on-guy stuff before, but Shad had only run around naked in front of his buds, and there was that one time he messed around when a stranger picked him up in his car. (He wasn't hitchhiking, and for some reason that makes the story less pass?\nShad was still unsure about doing the dude thing, but I asked him to come in and do a jerk off with Kurt, and if things were popping up (namely his dick) we could try doing some oral.\nKurt is one horny bugger. He stayed at my place for the weekend, and the kid is a walking boner! Normally that is a great trait to have in an adult model, but having him run around my house with all that sexual tension was making me woozy with lust. So I had my friend Ben take him to the porn store. I told him to pick out some new straight DVD's that both him and Shad could watch during their scene later that day, and maybe pick up a few toys to try out.\nThey got back and Kurt had bought a Cream Pie video and a couple jack-off toys. It was like Christmas for him, as he showed off his finds with enthusiasm.\nKurt immediately pulled out the videos and began watching it for the next hour or so. Shad arrived to do the scene, and by then I think Kurt would have fucked anything in order to get off.\nThey tried a few toys, but the one Kurt had picked (A blue-ish colored one) wouldn't fit over his thick shaft, and between the slippery lube, we gave up on trying to use it. \"Cut!\" Shad offered up his cock sleeve, we cut it in half, and the two tried them out. The sleeves look a bit odd, but hey, its something different, and I will be damned if Shad's dick didn't really dig it. It soon lost its wobbly mass, and became rock hard. I love watching Shad sneak peeks at Kurt's dick.\nFinally Kurt asked if he could suck on Shad's dick, and the two went at it. They soon forgot about the new video.\nOk, about the cum shot. This shot has to go down in history as one of the best timed cum shots. Very rarely will you see something so smooth. Normally one guys pops his nut, we reset the cameras to capture the second guy, and there is always a gap or loss of energy that most avid porn watchers see (not to mention dried cum and a very wilted spent dick on the 1st guy who popped- thus showing the time gap) But it ensures that both cumshots are both captured from every angle.\nBut during their cum shot, Shad sprays like a hose all over Kurt's chest, DOUSING him with sperm. After Kurt had teased himself all day, and the smell and seeing Shad spray all over him, put him over the top. He just started busting while Shad was busting. Thankfully he let me know he was cumming.\nNormally I think a director would be mad, but Kurt is no amateur, and he knew where the cameras were, and took the moment to do the Right thing. That's what I love about Kurt, and want to work with him again. I got the shot from both angles, and it is seriously one of the most Real and seamless things I have seen in amateur video.\nTake a look, and tell me what you think.",
  "models": [
    {
      "name": "Kurt Wild",
      "person_id": 3133
    },
    {
      "name": "Shad",
      "person_id": 3131
    }
  ],
  "release_date": "2006-03-03",
  "scene_id": 94,
  "tags": [
    "Sex Act - Oral Only",
    "Sex Act - Toys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - Standard Def",
    "Chest - Hairy/Hair"
  ],
  "title": "Kurt Wild & Shad - Serviced"
}