{
  "collections": [
    "ChaosMen"
  ],
  "description": "Aidan loves to rim guys, so he started this video with some of the hottest rimming action on the site. Antonio squirms around in ecstasy as Aidan takes his sweet time, sniffing, fingering, and licking Antonio's hole.\nIt is very erotic, and it even had Ransom running around the set with a boner. As you may know, he helps me film anything interactive, and neither of us is immune to the sex happening in front of us.\nRansom was standing off to the side working a camera, rubbing his cock through his shorts, indicating to me that he had a boner.\nBy the time Aidan is fucking Antonio, Ransom was dripping through his sweats. Antonio spotted this, and made a motion for him to join in and get his dick sucked.\nRansom jumps in, shoving his cock into Antonio's mouth, while Aidan hammers his hole. After Ransom gets close to cumming, he steps back and strips off his clothes.\nBy that time, Aidan is fucking Antonio on his back. Ransom comes back in and feeds Antonio his cock.\nAidan is watching this closely and starts to cum. This starts a chain reaction as Ransom ramps up and cums all over Antonio face. Then Antonio jerks rapid speed and shoots his own load.\nAfter leaving his load on Antonio's face, Ransom steps out and Aidan kisses Antonio, sharing Ransom's load!",
  "models": [
    {
      "name": "Ransom",
      "person_id": 3289
    },
    {
      "name": "Antonio Cervone",
      "person_id": 8287
    },
    {
      "name": "Aidan Anthony",
      "person_id": 9180
    }
  ],
  "release_date": "2019-02-08",
  "scene_id": 9420,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Aidan Anthony & Antonio Cervone & Ransom - RAW"
}