{
  "collections": [
    "ChaosMen"
  ],
  "description": "Jerome saw Damien Reign on the site, and said he thought he was a hot guy.\nI told him that so far, Damien has only topped, and that he would need to be a bossy bottom. Jerome of course is totally down to get fucked, and is very polished. I knew while filming Jerome would amp-up Damien's performance.\nJerome starts by kissing him while humping him. Damien seems taken aback, but Jerome was relentless.\nAfter getting Damien's pants down, some nipple biting, and erotic licking, Damien was getting really turned-on. A switch was thrown in Damien's brain, and he passionately kissing Jerome back.\nJerome kept at him. Sucking his cock until he was fully hard, and as the shoot goes along, Damien just gets more and more aroused.\nDamien's dominant side also made an appearance so that Jerome could sit back and let him take control.\nWhen Jerome rides Damien facing him, Jerome's cock kept pushing into Damien's abs, and that literally turned Damien's cock bone hard. I think he loved seeing how turned-on Jerome got while riding his cock.\nDamien does a great job making Jerome cum. They are kind of in an awkward position, but Damien nails hitting Jerome's prostate with a few tips for Jerome, \"Yeah, that's the spot!\"\nI can't remember if Jerome has said this before, but he swears it was the biggest load he has shot. He had held out not jacking-off a week this time, and that backlog sure showed.\nDamien makes Jerome eat some of his load, then uses the rest to slick up his cock.\nWith jizz all over his abs, Damien flips Jerome over on to his stomach so that he can shoot his load on Jerome's hole. My poor pillow!\nJerome spreads his cheeks, giving Damien a perfect target to dump his load!",
  "models": [
    {
      "name": "Damien Reign",
      "person_id": 9012
    },
    {
      "name": "Jerome",
      "person_id": 8561
    }
  ],
  "release_date": "2019-01-18",
  "scene_id": 9422,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - African American",
    "Ethnicity - Asian Guys",
    "Ethnicity - Latin Guys",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Damien Reign & Jerome - RAW"
}