{
  "collections": [
    "ChaosMen"
  ],
  "description": "Another scorching hot massage table Serviced video!\nJerome has done one previous massage themed video, but he was on the table and not doing the actua1ly 'massage.'\nHe totally takes charge during other videos, and I was certain he would be into rubbing Kelly Evans.\nKelly got on the table, and then Jerome slicks up his hot body. We even get some foot massage and nibbling.\nJerome snakes Kelly's cock out from underneath and starts stroking him until he is fully hard. Unable to keep a super hard cock in that backward position, Jerome lifts him into a doggie-style position so he could stroke and rim Kelly.\nAt times, Jerome's cock would get hard, so he oiled up his shorts so we could see his cock through his shorts.\nAfter flipping Kelly on his back, Kelly's hands went right for Jerome's cock, rubbing him through his gym shorts.\nJerome dabs the precum from Kelly's cock with his mouth, making a strand of slick juice from his lips to Kelly's cockhead. After the taste treat, Jerome then dives and starts working Kelly's dick like a pro.\nKelly does get a chance to suck back too, his neck craning so that Jerome could fuck his face.\nJerome climbs on top, and jousts their cocks together.\nFor the end, we knew that Kelly would have to have his face in an ass to drive him over the top. Jerome strokes Kelly's cock while sitting on his face. Kelly play's and licks Jerome's hole, getting closer and closer to cumming.\nJerome does a great job with his left hand, and with a few verbal hints from Kelly, Jerome makes him blast a load from his cannon. It is VERY intense! Kelly is trapped underneath Jerome's body, and can't escape the teasing of his head once he has ejaculated.\nJerome flips around and shoves his cock in Kelly's face and milks a nice load into Kelly's mouth, filling him to the brim.\nBefore Kelly can even swallow, Jerome is kissing him, sharing his load between the two of them!",
  "models": [
    {
      "name": "Kelly Evans",
      "person_id": 9416
    },
    {
      "name": "Jerome",
      "person_id": 8561
    }
  ],
  "release_date": "2019-02-06",
  "scene_id": 9424,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Ethnicity - African American",
    "Ethnicity - Mixed Heritage",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Non-Nude Photos Only",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Jerome & Kelly Evans - Serviced"
}