{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wright has been on hiatus spending time with his girlfriend and career.\nHe did tell me he has been enjoying ass play, and I asked him if he thought he could cum from being fucked. He said he didn't think so.\nWright really was into this video, and I think it is in good part because Bentley was so great. I also think Wright liked sucking on another guy's uncut cock.\nWhen Wright is bent over the bed, getting hammered by Bentley, he whispers that he was actually close to cumming. Standing is his easiest position to cum in, and I figured we could come back to that position if we needed to. I was happy we were making progress and might be able to see him nut from getting fucked.\nWith Wright's new positive mind set, I promised him that getting fucked on his back would also make him cum.\nI swear Wright is really enjoying being fucked. I think we turned him into a Bottom!\nBentley gets him on his back, and fucks Wright hard. Wright starts jerking his cock, and in no time at all he busts his first load while being fucked. And it was a HUGE load too!\nBentley then creampie'd Wright's hole, and even after just having been fucked hard, Wright was eager to have Bentley's cum-soaked cock back in his hole!",
  "models": [
    {
      "name": "Bentley Layne",
      "person_id": 9039
    },
    {
      "name": "Wright",
      "person_id": 8507
    }
  ],
  "release_date": "2019-02-04",
  "scene_id": 9432,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bentley Layne & Wright - RAW"
}