{
  "collections": [
    "ChaosMen"
  ],
  "description": "Every time I see Lorenzo out and about, he hangs with a more mature crowd. He definitely is into guys older than him.\nFor Kelly Evans sex first sex scene with ChaosMen, I tossed out a couple model names to see if it sparked any interest. Given Lorenzo's love of daddies, he was the first on the list, and Kelly said Lorenzo was the one he would most like to play with. I love it when it is that easy!\nSo, the two had chemistry even before getting in the room. Lorenzo got immediately into servicing mode, trying to please his daddy. Kelly has a subtle dom vibe and takes control of the scene.\nThey swap oral, and do some amazing ass eating. Kelly LOVES to eat ass!\nIt had been a while since Lorenzo had been fucked, so Kelly took it nice and slow. Once he was fully-embedded, he grinded his cock perfectly into Lorenzo's hole.\nThere is a great moment when Lorenzo is laying on his side facing us, where he almost shoots too soon. Lorenzo has to make Kelly slow down or risk nutting too soon. He was REALLY close to cumming.\nThey quickly change positions and I crawl under to get some close-up footage of them fucking and before I know it, Lorenzo is spilling a giant load. I guess he WAS really close!\nI have been working on this angle for cum shots, and this one is definitely in the top 5 of the best. It was one of Lorenzo's biggest loads and is explosive!\nKelly then breeds Lorenzo hole, dumping even more cum inside of him. Lorenzo cleans-off Kelly's cock and then shares a thankful kiss for great fucking!",
  "models": [
    {
      "name": "Kelly Evans",
      "person_id": 9416
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2019-02-25",
  "scene_id": 9466,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def"
  ],
  "title": "Kelly Evans & Lorenzo - RAW"
}