{
  "collections": [
    "ChaosMen"
  ],
  "description": "These young guys keep surprising me.\nAt 18, I wasn't expecting Rio to be too advanced. But Rio jumped right into sucking cock like a pro! He is really quite good!\nDamien sure was enjoying it. I loved it when he got a little smile on his face when he realized just how good it was.\nDamien returns the favor, but we soon get to his favorite part- eating ass. Rio writhes around from the rimming, and now I want to see him get fucked ASAP.\nDamien is a guy who does not jack-off on his own. He is always wanting his partner to help get him off.\nWe both knew in the first few minutes of this video that Rio could easily make him cum.\nDamien settles back down to sitting and Rio starts sucking then jerking with intent. He was moving back and forth from sucking and jerking, not giving Damien enough repetitive motion. He had the jerking motion right. Damien kept telling him to keep jerking, but Rio didn't stick with the same motion.\nThis technique is a learned skill. I can do it of course, but so cam Ransom, Vander, Griffin, Lorenzo, and Sean Peyton. It is one of the reasons they do so many of the blow job videos. They get in there with their strong arms, and relentlessly jerk until the other guys busts.\nI reinforced what Damien was whispering to him, \"Just keep jerking him!\" So, Rio starts jerking him consistently. With only a minute of repetitive motion, Damien spilled his load.\nI love that Rio caught on so quickly, and I think he will make a great \"Servicer\" in the future.\nAfter his effort, Rio stood up and needed only a few minutes to play catch-up. He nutted all over Damien's chest and cock, something that was new for Damien.\nDamien liked it, and rewarded Rio with a kiss for a blow-job well-done!",
  "models": [
    {
      "name": "Damien Reign",
      "person_id": 9012
    },
    {
      "name": "Rio Rodriguez",
      "person_id": 9476
    }
  ],
  "release_date": "2019-03-27",
  "scene_id": 9492,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Damien Reign & Rio Rodriguez - Serviced"
}