{
  "collections": [
    "ChaosMen"
  ],
  "description": "After Wright got the cum fucked out of him by Bentley Layne, Wright was eager to duplicate the experience.\nI was eager to pair him up with an experienced and hot-bodied daddy type that would be able to fuck him just right.\nKelly Evans was perfect for Wright. Kelly starts by doing some body worship, mostly wanting to feel Wright's amazing pecs and abs. He pulled out Wright's cock, and sucked his uncut cock like a pro. Kelly then sat on his chest and made him suck his cock.\nIt was hot watching Wright try to take his cock this way, and I think after doing a few Serviced videos, Wright is able to handle any cock shoved his way.\nAfter getting his hole rimmed, Wright sits on Kelly's cock, whispering to him that he had a very thick cock. He slowly slid it in, and eased into it nicely.\nWe stopped to do some pictures and I asked Wright if the thought maybe he could cum from getting fucked. He wasn't sure as he had not been stroking his cock too aggressively, but instead, just keeping himself in a nice pleasure zone.\nBut after getting his legs up in the air, and with some skillful fucking by Kelly, Wright shot a huge load. Wright now is officially VERY interested in the extra-strength orgasm that happens when getting fucked. He finally had that epiphany, and my guess is he is going to want to bottom a lot more often.\nKelly was also pleased to make him cum this way, and blew his load all over Wright's hole, and then using his cum to fuck him.\nKelly sucks the last bit of cum from Wright's cock, while fingering his cummy hole!",
  "models": [
    {
      "name": "Kelly Evans",
      "person_id": 9416
    },
    {
      "name": "Wright",
      "person_id": 8507
    }
  ],
  "release_date": "2019-04-08",
  "scene_id": 9497,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Kelly Evans & Wright - RAW"
}