{
  "collections": [
    "ChaosMen"
  ],
  "description": "Mike, he's been looking for work. He needs the money, true enough, but he also has always wanted to show off his dick on film. He did really well fucking Westin, and wanted to get back to doing more after his girlfriend stole a good chunk of his earnings from his shoot with Westin.\nSo Mike needed cash quick, and I had no one to pair him with on such short notice. Mike really just wants to top, and all I have in my corral right now are a bunch of straight guys that want to be given head or maybe top a dude..but certainly not bottom.\nI thought I might be able to break Mike in to the idea of bottoming. I set him up with a couple dildos, and he just kind of went with it. His dick stayed hard, but I don't think he was digging it like we all fantasize that he would. This is Reality here. But he busted with one up inside him, and he was really amazed at how good it felt when he shot his load. Westin later assured him that dildos suck, and that even being primarily a bottom himself, he thinks toys are overrated- that he should go for the real thing sometime. Thanks Westin!\nWe finished the film, and as he was leaving, he casually mentioned he could suck his own dick. I said, \"What? Why didn't you tell me that?! We could have done that video tonight, and you wouldn't have had to shove dildos up your ass!\"\nHe asked if maybe he could come back and give it a try(for more money of course), warning me that he could only get a bit beyond his dick head in his mouth. Was that enough? Uh, Sure!\nSo a couple weeks later he was back, and he totally got in to it. He even fingered himself a bit after discovering his prostate in the last video.\nProgress!",
  "models": [
    {
      "name": "Mike North",
      "person_id": 3134
    }
  ],
  "release_date": "2006-03-10",
  "scene_id": 95,
  "tags": [
    "Theme - Solo",
    "Sex Act - Self Suck or Self Facial",
    "Sex Act - Toys",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Video - Standard Def"
  ],
  "title": "Mike North - Toys"
}