{
  "collections": [
    "ChaosMen"
  ],
  "description": "Argos is back to get fucked!\nI mentioned in the summary for his solo, that he was very quiet and it was hard to learn more about him. He thought he was Bi, and just starting playing with guys. Although he had topped a guy before, he bottomed more often. So we set him up to bottom his first time.\nAfter doing his Edge video with Ransom, he was pretty sure he was all about guys, and his Bi category evaporated.\nHe quickly met a guy and started dating him, and now I feel he is solidly in the gay camp.\nHe is back, but I still felt like he needed some beginner tips.\nI started him and Declan doing a side-by-side jerk-off. Declan is now the pro leading the new guy. Argos kept glancing over at Declan's cock, but Declan lead the way by sucking Argos first.\nArgos sucks back, and he is totally in to it. Argos loved sucking on Declan while Declan played with his hole.\nDeclan also rimmed him, getting him in the zone to be fucked. I was a little nervous that Argos might not be very advanced taking a cock, and you can tell the first couple inserts are a struggle, but after a few minutes, his cock was dripping pre-cum through out the shoot.\nI zoomed in and showed the puddles of pre-cum his cock was dripping. Mixed with some spit from the rim job, it is quite a bit of pre-cum!\nNext Argos got on top of Declan and rode his cock. This gave him more confidence and further loosened him up. Every now and then Argos whispered to Declan he was his daddy. Listen closely as it is really hot.\nBy the end, he was really ready to cum. Declan fucked him on his back, while jerking his cock.\nThen suddenly, Argos was shooting his load!\nI think Declan was just as surprised, but immediately fucks him full-tilt to push out every ounce of jizz.\nAnd jizz flew high! It hit Argos right in the face and coated his torso!\nDeclan juiced his hole, then slid his cock in, filling our new boy up!",
  "models": [
    {
      "name": "Argos",
      "person_id": 9458
    },
    {
      "name": "Declan",
      "person_id": 9110
    }
  ],
  "release_date": "2019-04-12",
  "scene_id": 9500,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Argos & Declan - RAW"
}