{
  "collections": [
    "ChaosMen"
  ],
  "description": "With these two Bi guys, it was easy to find some porn that they both liked. I tossed on some Bi videos and they both easily got hard.\nSince this video was essentially their first ChaosMen sex film, they both were not sure what to expect. I started them off with a side-by-side jerk-off, and it worked like a charm.\nYou can tell James Dawn is going to be one hot ass performer. Normally the passive one with guys, he took the lead in this video. Volker, in general, is always passive in bed. He looks a little tense at the beginning, I think fearing he would not stay hard.\nJames started sucking him and he loosened up a tiny bit. It was not until he started sucking James back that a switch was turned, and he could relax. The dude likes to suck dick!\nI did try to push their boundaries a bit. I made sure they both tried rimming. I suspect James has done it before, but it was a new experience for Volker.\nBoth guys actually prefer to Bottom with guys, but they can be Top, so I knew we could a flip-fuck.\nVolker starts by fucking James, and he goes easy on him at first. But once James turned his pain into pleasure, he was telling Volker to fuck him harder.\nThey swap places, this time James getting his rather large cock wedged into Volker's tight hole. Again, slow and easy at first, but then Volker was demanding to be fucked hard!\nNeither guy has cum from getting fucked, but James is one of those dudes that is confident about his ability to cum on command.\nSo, we had Volker fuck him until he cums. There is a cute OutTake at the end where he was surprised it felt so good.\nVolker then ramped up his cock, breeding's James's hole with a sticky mess!",
  "models": [
    {
      "name": "James Dawn",
      "person_id": 9467
    },
    {
      "name": "Volker",
      "person_id": 9213
    }
  ],
  "release_date": "2019-04-15",
  "scene_id": 9515,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Video - OutTake"
  ],
  "title": "James Dawn & Volker - RAW"
}