{
  "collections": [
    "ChaosMen"
  ],
  "description": "James Dawn was in town to do two sex films. The first one was with Volker, another Bi guy. They both did great, but you could tell they were still trying to figure out the whole filming part.\nThis time, despite this being Nate Drow's first time filming a sex scene, the video feels a bit more polished.\nNate Drow definitely knows what he wants, so he took the lead in the video.\nJames also likes mature guys and though Nate is only 30, I think James loved having someone take charge of him.\nDespite being only 19, James has had a lot of sexual experiences, but had never had someone quite a thick inside of him. He kept his hand in place on Nate's thigh, just making sure he didn't go too deep. His favorite was riding Nate's cock.\nJames bottoms this whole video. He prefers it to topping, especially with the bossy vibe Nate was giving off.\nHe once again cums from being fucked. His legs go straight and nearly pushes Nate out of his hole. Nate has had experience with this phenomenon, and I am pretty sure he kept his cock planted inside of James as he came.\nNate then creampies his hole. James watches with fascination on one of the monitors setup. But as soon as Nate plunges his cum-soaked cock in his hole, James was lost in pleasure (and maybe a little pain!).",
  "models": [
    {
      "name": "James Dawn",
      "person_id": 9467
    },
    {
      "name": "Nate Drow",
      "person_id": 9506
    }
  ],
  "release_date": "2019-04-29",
  "scene_id": 9526,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "James Dawn & Nate Drow - RAW"
}