{
  "collections": [
    "ChaosMen"
  ],
  "description": "Holy Barely Legal!\nStash cut off his air, and he looks even younger! He is now 19, and the recent change of hairstyles has him looking younger than ever, and a little bit like a young Ricky Schroeder!\nI just love working with Stash, he just brings out the animal in whoever I put him with. Ceasar was certainly nervous, but eager to please and totally felt comfortable with Stash.\nI dunno, Ceasar might be a hard sell as a \"Straight Guy\". I don't want to offend his sense of masculinity, but there is just that touch of sugar that I am sure makes ya think, \"Hmmmmmm.\"\nAll I can say is he LOVES the straight porn I have on hand (especially the girls who squirt...yicky!) and somehow I find it hard to believe a closeted guy would be THAT into the straight porn.\nNow you might think he might be bi or a gay ringer, but all you have to do is see his cock sucking skills. They are terrible! CLEARLY he has never had a dick in his mouth!\nBut I gotta tell you, he is so eager to please, and wants YOU guys to enjoy what he does, he just gets down to it. We will all just have to pitch in and show him how to do it right.\nBut that is where his amateur skills end, 'cuz his fat cock looks amazing splitting Boy Wonder Stash in two!\nSo enjoy this first time, it's a little clumsy here and there, but then again, if it was too smooth, you wouldn't believe it was his first time!\nI normally air solos on Monday so I thought I would sneak in some extra meat!",
  "models": [
    {
      "name": "Stash",
      "person_id": 3263
    },
    {
      "name": "Ceasar",
      "person_id": 3623
    }
  ],
  "release_date": "2009-04-27",
  "scene_id": 953,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Twink",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Ethnicity - Middle Eastern",
    "Theme - Wrapped"
  ],
  "title": "Ceasar & Stash - Wrapped"
}