{
  "collections": [
    "ChaosMen"
  ],
  "description": "We went all out with butt-plugs and dildos in this video!\nWe learned during his solo that Michael Mission does love to have his ass played with. He also likes to be a little dominated when with a guy.\nHe doesn't seem to have many limits, and Lorenzo does a great job taking him through his paces.\nThey start by kissing, but soon Lorenzo makes him suck his cock, fingering his ass as he sucks.\nAfter rimming Michael's hole, Lorenzo then starts with a blue butt-plug. First, he makes Michael suck it and get it wet before sliding it in and out of his hole. While this plug looks interesting, we found out it just wouldn't stay in place on its own.\nLorenzo grabs for a black plug and easily slides it in to him. Having successfully plugged his boy, he goes back to having his dick sucked.\nLorenzo then starts sucking on Michael's cock, and while they 69 suck, Michael slips a plug into Lorenzo's hole. Both guys are officially plugged!\nThey next try a double-ended dildo. Lorenzo works it into Michael first, then his own hole. He keeps a grip on it as they ride it doggie-style. Lorenzo pushes it in and out of both their holes.\nThey both get on their backs and fuck each other with the dildo.\nMichael cums first, easily nutting while they both thrust the dildo into each other. Lorenzo blows a huge load next, and it looks amazing!\nLorenzo then straddles Michael's chest and make him clean his cock.",
  "models": [
    {
      "name": "Lorenzo",
      "person_id": 7735
    },
    {
      "name": "Michael Mission",
      "person_id": 9528
    }
  ],
  "release_date": "2019-04-10",
  "scene_id": 9533,
  "tags": [
    "Build - Hairy",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Lorenzo & Michael Mission - Serviced Toys"
}