{
  "collections": [
    "ChaosMen"
  ],
  "description": "Wow! What a hot pairing!\nI think I found someone to put with Zane that doesn't look miniaturized. Silas's body is just getting better and better, and though he is not as tall as Zane, Silas sure brought the muscle on this time.\nI love working with Zane because he is down for anything. Silas has been bottoming a lot and I knew Zane likes to get fucked when he cums. So i knew it was time to have Silas top.\nOne thing I always forget is how meaty Zane's ass is. Despite Silas's not insubstantial dick, it's just dang hard to see him fucking Zane. Then of course each one of Zane's thighs is the size of small guy's waist, it's hard to maneuver him into position.\nBut Silas tries his best to fuck him and we even get to see him fuck the cum literally out of Zane.\nZane is also an amazing top, and I think we got some of the best fucking footage in this video. Lots of raw plunging in and out of Silas's hole! I put Silas in Reverse Cowboy position, one I knew he was really good at, and again, we got some amazing shots!\nThe video is long as they did lots of sucking, ass eating, and cock play that was just too awesome to leave on the cutting room floor.\nThis video has everything complete with Silas nutting all over Zane's face and Zane sucking the last drops of cum out of Silas's dick!",
  "models": [
    {
      "name": "Silas",
      "person_id": 3229
    },
    {
      "name": "Zane",
      "person_id": 3306
    }
  ],
  "release_date": "2009-05-22",
  "scene_id": 954,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Silas & Zane - RAW"
}