{
  "collections": [
    "ChaosMen"
  ],
  "description": "Argos and James Dawn are two new guys that I think really have a lot of potential.\nI think Argos is better at Bottoming, but he sure can also Top. I think the same is true for James. We decided to do a flip fuck, so both guys could have fun getting fucked.\nThey start by standing and making-out. Argos sucks on James' big uncut cock first, and he does a great job. Not his first uncut cock, and he hit the right notes with James.\nI told James before the shoot that Argos always had a lot of pre-cum. James went to suck Argos, and realized I wasn't kidding around. He rolls the clear liquid around Argos's head, and starts to suck his tasty cock. Some really hot cock-sucking!\nJames fucks Argos first, and he has to go slow and easy on the first insert. He nudges his head around slowly sliding it into Argo's hole.\nAfter a bit of slow fucking, Argos encourages him to fuck him faster and harder.\nJames' balls are swinging wildly as he fucks Argos. James' balls are actually slapping Argos' balls when they fuck! Fwap Fwap!\nNext, James gets fucked by Argos, and you can tell he really wants to cum this way. I really wanted to see him breed a guy, so I warned him to hold out a bit.\nArgos gets fucked in the end, nutting a nice load, and we get to see James breed his hole like a pro!",
  "models": [
    {
      "name": "Argos",
      "person_id": 9458
    },
    {
      "name": "James Dawn",
      "person_id": 9467
    }
  ],
  "release_date": "2019-05-24",
  "scene_id": 9550,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Argos & James Dawn - RAW"
}