{
  "collections": [
    "ChaosMen"
  ],
  "description": "So Jax is clearly a straight guy. But he learned he can get in the \"zone\" if he just gets lost in the moment (and buries his face in the pillow). I think that is what made his Serviced video doubley hot. You knew he was straight, and was just in the \"moment.\" It was all very passive, which made it more like a massage.\nJax had scheduled this shoot a couple months earlier, but cancelled it a week before. He wasn't sure he could do it. A couple months go by, and he is certain that now he could give it a try. Not sue what changed- could have had a successful round of experimenting on his own? Or was it more likely financial need?\nRegardless, he said he wouldn't cancel again, and he went forward very certain with a twinge of anxiety.\nThankfully I had ringer Jayce on hand. He is excellent with the nervous straight guys, and since he loves to get fucked, his energy is always just right.\nYou can tell Jax was nervous to begin with, tentatively touching him here and there. Though, look how locked his eyes are on Jayce's dick when he takes of his boxers! Alas, he couldn't really bring himself to touch or suck it.\nThere is some premium ass fucking going on, as Jayce is more than confident and is pretty much a dominant Top in this video.\nHighlights of this video are watching Jax fuck the cum out of Jayce. Since I edited this movie I can't figure out when exactly Jax's dick falls out and he keeps fucking. Jayce had warned him to stop fucking him once he came, so my guess is right after the first squirt he popped out, then continued to play fuck.\nI always try to get cumshots where you see the guy is getting fucked when he comes. Don't know why that is hotter, but I suspect its cuz it seems faked in so much porn I grew up watching.\nFor Jaxes cumshot, he was confident he could fuck Jayce till he came. I gotta give Jayce props for getting fucked AFTER he nuts. It's really not all that fun anymore! But sure enough Jax had to fuck him only a bit, pull out and spooge a major load all over his ass cheeks and hole.\nA very creamy ending!",
  "models": [
    {
      "name": "Jax",
      "person_id": 3269
    },
    {
      "name": "Jayce",
      "person_id": 3226
    }
  ],
  "release_date": "2009-05-29",
  "scene_id": 959,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Hair - Shaved",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - RAW"
  ],
  "title": "Jax & Jayce - RAW"
}