{
  "collections": [
    "ChaosMen"
  ],
  "description": "It took a couple weeks for Jay D to decide to come do a Serviced video.\nNot that he didn't want to swap blow-jobs, he said he was more nervous than he thought he would be During his solo.\nThat really surprised me. I had to get him to watch his solo to see it was really good. During the solo, after watching only a little bit of porn, he was hard and showing-off for us. He even came super easy. I think having more people in the room was what worried him.\nMaxi is very chill, and I knew he would put Jay at ease.\nJay D sits in his chair while Maxi pulls his cock out. Jay D starts-off strong, but in only a minute or two the anxiety seeped in and he started to lose his boner.\nThankfully I had told him if that happens just switch it up and suck on Maxi. That's what they did, and once he had a cock in his mouth, he was fine the rest of the video. Phew!\nHe sucks cock great, and I have a cool shot of him sucking dick with drool flying everywhere, spilling onto the camera lens.\nWith renewed energy, Maxi goes back to sucking on Jay D, and this time we get to see is uncut cock professionally handled my Maxi.\nThey switch to a 69 position, and Jay D greedily tries to deep-throat Maxi's cock.\nJay D then gets on his knees while Maxi feeds him his load. Sticky!\nNext, Jay D got on his back and sucked the last bit of cum from Maxi's dick. While sniffing and sucking Maxi's balls, Jay D fires an awesome load.\nMaxi then bends over and laps up the cum, paying special attention to the load that had pooled in Jay D's belly-button.\nMaxi shares the cum with Jay D with a passionate kiss!",
  "models": [
    {
      "name": "Jay D",
      "person_id": 9523
    },
    {
      "name": "Maxi",
      "person_id": 9274
    }
  ],
  "release_date": "2019-04-24",
  "scene_id": 9590,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - African American",
    "Ethnicity - Latin Guys",
    "Ethnicity - Mixed Heritage",
    "Hair - Brunette/Black",
    "Hair - Shaved",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jay D & Maxi - Serviced"
}