{
  "collections": [
    "ChaosMen"
  ],
  "description": "Since Colton has a lot more experience with guys than Wright, I thought it would be better to have Wright on the massage table, while Colton took control and did the rubbing.\nColton lightly oils up Wright's back, paying close attention to his ass and his feet. Wright groans every time Colton gets near his hole. Colton reaches under Wright to stoke his cock, but he is so hard it was hard to bend his cock backwards.\nWith Colton's cock dripping, He decided to move to the head of the table and well, get some head.\nWright does his best to suck Colton's giant nob, and I always love how submissive Wright gets when a dude has a bigger cock than his substantial uncut dick. Colton tries not to gag him with it.\nColton flips Wright on his back and immediately the guys start stroking each other cocks. Colton really slicks-up Wrights cock, making him writhe around in pleasure.\nThen, Colton sucks his cock, and I love the little sounds of pleasure that Colton makes while sucking such a nice dick.\nNext, Colton gets up on the table, and gets Wright in a better position to service his cock. A much better angle!\nFinally, as mentioned in the summary for his solo, Colton had said having an ass to eat would always make him cum.\nColton lays on the massage table while Wright sits on his face. Wright grinds his ass around, while jerking and sucking on Colton's dick.\nColton grabs his own cock, and with his own tongue buried deep in Wright's ass, he shoots a huge load.\nWright spins around, and jerks his cock until he gives Colton an amazing facial!",
  "models": [
    {
      "name": "Colton Andrews",
      "person_id": 9584
    },
    {
      "name": "Wright",
      "person_id": 8507
    }
  ],
  "release_date": "2019-06-12",
  "scene_id": 9591,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Sex Act - Kissing"
  ],
  "title": "Colton Andrews & Wright - Serviced"
}