{
  "collections": [
    "ChaosMen"
  ],
  "description": "This video is all about the cum shot.\nSure, it is awesome to see Kyle Wyncrest in full-action. And he and JJ really hit-it-off sexually.\nA couple times throughout the video Kyle needed to stop or risk nutting. He seemed extra sensitive this day, saying he had not cum in nearly a week. He was very horny and though Kyle identifies as straight, he and JJ clicked and he seemed eager to please JJ.\nActually, JJ was having the same issue. We stopped a couple times for him also, and I was little surprised as JJ's dick would go soft from lack of jerking. Not even touching himself he was going to cum. I told him that Kyle has 'boyfriend dick' and that is a perfect size and angle to hit his prostate.\nWhen it came time to cum, JJ went from fully soft to cumming in a matter of minutes.\nKyle pounds him so that JJ can cum. But you can see a grimace forming on Kyle's face. A touch of anxiety?\nSure enough, as JJ begins to cum, Kyle pulls out, fearing he was going to cum before JJ.\nToo late!\nHe does his best to hold it back, but begins shooting a load. He crouches, holding it back, but it was indeed too late. Kyle shoves his cock back into JJ as he is finishing nutting.\nIt is a very well-timed cum shot, despite Kyle's momentary panic.\nIt must feel REALLY good to have your cock inside JJ!",
  "models": [
    {
      "name": "JJ Smitts",
      "person_id": 9026
    },
    {
      "name": "Kyle Wyncrest",
      "person_id": 9545
    }
  ],
  "release_date": "2019-06-21",
  "scene_id": 9598,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "JJ Smitts & Kyle Wyncrest - RAW"
}