{
  "collections": [
    "ChaosMen"
  ],
  "description": "Devin didn't seem too opposed to joining the team to do \"more.'\nBut with the economy tanking, I was trying to get my current set of guys gigs with each other, keeping them busy and afloat. So I kind of forgot that Devin had indicated he wanted to do more.\nA month or so later I started editing his video, and I realized just how hot this guy was, and how tasty his curvy cock is.\nSometimes I decide to do the oral video,based on how they jack off. I know my tricks will work. Or if they will allow rimming. I figure if they say no to rimming, I I just have one of the straight guys do the blow job, 'cuz most just can't bring themselves to eat another dude's hole out.\nDevin had a great \"head intensive\" jack-off technique, that I could work with. I liked his hairy asshole, and he wasn't opposed to being rimmed.\nBut when we got down to doing the rimming, he was pretty rigid, and I struggled to get some good footage. I don't think he didn't like (he sure stayed hard) I just don't think he knew what to do.\nBut overall, this is a solid Serviced video. He starts off watching a lot of TV and then slowly succumbs to the oral sensations.\nDevin was a bit of stealth cummer as I thought he was only just getting there, but next thing I knew I had globs of DNA going down my throat. It splats out with a satisfying sound.\nAnyway, Devin says he will receive oral and top a dude. A somewhat narrow starting point, but it would be cool to see him in action. And who knows, many of the guys just keep trying new things!",
  "models": [
    {
      "name": "Devin",
      "person_id": 3314
    },
    {
      "name": "Bryan",
      "person_id": 3120
    }
  ],
  "release_date": "2009-05-20",
  "scene_id": 960,
  "tags": [
    "Build - Lean",
    "Cock - Hung",
    "Sex Act - Ass Eating Rimming",
    "Hair - Long",
    "Pubic Hair - Trimmed",
    "Hair - Brown/DK Blond",
    "Chest - Smooth/Trimmed",
    "Theme - Serviced",
    "Video - Bryan Appearance"
  ],
  "title": "Bryan & Devin - Serviced"
}