{
  "collections": [
    "ChaosMen"
  ],
  "description": "Michael Mission is such an amazing find!\nI love his Daddy vibe that is pure Bottom Boy. How is that possible?!\nWe all found out how much he likes anal stimulation during his solo and oral, and I wanted just the right Top to challenge him. Aidan was the perfect match!\nDespite all the toys he has had in his ass, Michael has only had sex with two guys. I might have misjudged the pounding he could take, but he sure looks like he is in loving every minute.\nAidan begins by sucking his cock, getting him nice and hard. But once Aidan stands up and feeds his cock to Michael, you can see just how happy Michael is to suck a dick. He has an intensity that says, \"Use me, and I want to make you happy.\"\nI definitely need to setup a TagTeam as I think he really would love to be spit-roasted.\nThere is some great footage of Michael as Aidan fucks his hole. One in particular from underneath as you see Aidan's cock slide in and out of his ass, while seeing these awesome facial expressions that Michael makes.\nHe also rides Aidan's cock like a pro. When he sits on Aidan's cock reverse-style, you can tell Michael has a lot of experience riding his dildo at home.\nAidan gets his legs up in the air and really fucks Michael deep and heavy.\nMichael's cock started to go limp, so Aidan grabs a hold of his cock and starts stroking him. He started to get hard, and I was getting a great overhead shot of the fucking.\nI didn't think he was so close to cumming, because only minutes before he was wobbly, but thankfully I was in the perfect spot to catch Aidan making Michael cum. I love watching his whole body shake with his orgasm. Props to Aidan for his multi-tasking skills!\nAidan continues to fuck him and Michael, despite being in a post-cum coma, was alert and encouraging Aidan to breed him. Aidan is simply fantastic in this video! He is a bossy yet generous Top, taking care of his Bottom.\nThis is one scorching hot pairing, and I can't wait to get Michael's ass back in the studio!\nPay attention to Michael, he is on a Mission to make you shoot your load at home!",
  "models": [
    {
      "name": "Aidan Anthony",
      "person_id": 9180
    },
    {
      "name": "Michael Mission",
      "person_id": 9528
    }
  ],
  "release_date": "2019-07-05",
  "scene_id": 9612,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Aidan Anthony & Michael Mission - RAW"
}