{
  "collections": [
    "ChaosMen"
  ],
  "description": "The more I spoke with Jake, it sounded like he wanted to get piggy for his oral scene.\nBlow job videos are his favorite to watch, and he loves watching a guy get face fucked until tears are streaming down his eyes.\nJake also likes older guys with beards, and before the shoot, Ransom suggested he should jump in so he and Espen could TagTeam his mouth.\nJake immediately turned submissive as he worshiped Espen's big cock. Ransom gets in there with a camera and his dick out. Jake takes turns sucking both their cocks, eventually managing to get both in his mouth.\nThe two dudes didn't want to be unfair and get all the attention, so they got Jake on his back while they took turns sucking his cock and having him suck their dicks.\nEspen sat on Jake's face too, which is also one of Jake's favorite things to do.\nEspen then fuck Jake's face. While his eyes only teared-up some, he managed to take Espen's cock all the way down his throat.\nJake stays on his back while Espen shoves his cock and balls in his face. Ransom turns up the speed on jerking and sucking on Jake, making his dick cum.\nEspen then coats his face with his load. Ransom climbs on top of Jake's chest and adds his own jizz to Espen's, coating Jake's face with two giant loads!",
  "models": [
    {
      "name": "Espen",
      "person_id": 9123
    },
    {
      "name": "Jake Pierce",
      "person_id": 9615
    },
    {
      "name": "Ransom",
      "person_id": 3289
    }
  ],
  "release_date": "2019-07-03",
  "scene_id": 9622,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Theme - Tag Team",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Espen & Jake Pierce & Ransom - Serviced"
}