{
  "collections": [
    "ChaosMen"
  ],
  "description": "Calvin and JJ really hit it off on the car ride to the studios. They both had a lot in common, and clicked right away.\nThis is Calvin's first time filming a full sex scene and he needed some guidance from JJ who can show the guys the ropes.\nI was also excited to see Calvin get fucked. While he considers himself Bi, he has not had a lot of bottoming experience. He has been fucked, but he was worried I would pair him with some donkey-dicked dude for his first time on film.\nI picked JJ because while he has a decent sized cock, he is very sensitive to whoever he tops. I think mainly because he has bottomed before with guys outside of the studio who just railed on him, not checking in to see how he was doing.\nThey swap head, and I just let it flow. JJ began rimming Calvin, and it was the perfect opportunity for JJ to fuck Calvin. He slides his cock in nice and easy, and Calvin quickly was enjoying being fucked.\nCalvin then takes control and begins fucking JJ. I think you can tell he has a lot more experience Topping. As usual, JJ stops us or won't allow Calvin or himself to play his cock while getting fucked. Always just too close to cumming! We really should try seeing if he can bust hands-free while getting fucked.\nAlthough, when it is time to cum, he does jerk-off fairly aggressively, but last only about a minute. He cums easily with Calvin banging his hole with his cock.\nCalvin also nuts quickly, easily coating JJ's hole, plunging the rest of his load in, and then uses his thumb to make sure every last drop is deep in JJ's hole.",
  "models": [
    {
      "name": "Calvin",
      "person_id": 9574
    },
    {
      "name": "JJ Smitts",
      "person_id": 9026
    }
  ],
  "release_date": "2019-07-19",
  "scene_id": 9632,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Calvin & JJ Smitts - RAW"
}