{
  "collections": [
    "ChaosMen"
  ],
  "description": "These two really connected and I am so glad I paired them up.\nArgos has really become a lot more skilled. He has been practicing with lots of other guys at other studios, and now he is a proper Power Bottom.\nColton also turned-out to be a great Power Top! My first sex film with him, and he was a total pro. He has style and flair to his fucking style.\nOf course, it doesn't hurt that he has a such a huge cock to drill Argos with. Well, maybe it did hurt Argos a little the first time he squeezed his thick dick into Argos' hole.\nLots of chemistry and my favorite part is when Argos laid down on his back on top of Colton, while Colton drilled him from behind. They kiss, and though Argos was unsure of this position, he looked so turned-on that I am sure he is going to add this position to his arsenal.\nBoth of their cum shots are amazing! Colton takes fast but long strokes to make Argos bust a HUGE load. Argos said he had been saving up a couple days and it sure shows.\nColton also nails Argo's but hole with a few squirts and then breeds the rest into Argos. Argos jump a bit on that first re-entry, but once Colton was buried deep again, Argos likely could have gone for round two.\nColton drops down for a hot kiss, playing with Argos' sloppy and cummy hole!",
  "models": [
    {
      "name": "Argos",
      "person_id": 9458
    },
    {
      "name": "Colton Andrews",
      "person_id": 9584
    }
  ],
  "release_date": "2019-08-02",
  "scene_id": 9645,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Argos & Colton Andrews - RAW"
}