{
  "collections": [
    "ChaosMen"
  ],
  "description": "I am very excited to have Michael Mission back. He has a very busy work schedule, so I am always thrilled when I can get him in.\nI definitely have a crush on this hot dude that loves to Bottom. And pairing him with Kevin Texas was amazing.\nMichael has not had a lot of actual cock in his ass before. He has toys at home that he and his wife use, but only a little bit of real cock in his ass.\nDuring his last video with Aiden, we learned quickly that a cock is not the same as a dildo, and it took Michael more adjustment time than I thought.\nThis time we planned ahead to prep Michael. Kevin inserts a plug in his hole, and then makes Michael suck his cock. This loosened Michael's hole, plus Michael really wants to be in the center of a TagTeam. He loves sucking as much as sitting on them.\nMichael was also very submissive to Kevin's military and bossy vibe.\nThey fuck side-by-side, and Kevin really shows us his fucking skills.\nJust adding the butt-plug at the beginning did wonders, and Michael was loving getting hammered by an actual cock.\nKevin fucks him bent over, and it took very little effort for Michael to make it rain cum down on to us.\nAnd Kevin breeds him like a pro, adding another slight shower of cum, but dumps most of into Michael's eager hole!",
  "models": [
    {
      "name": "Kevin Texas",
      "person_id": 9599
    },
    {
      "name": "Michael Mission",
      "person_id": 9528
    }
  ],
  "release_date": "2019-07-26",
  "scene_id": 9655,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Toys",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Kevin Texas & Michael Mission - RAW"
}