{
  "collections": [
    "ChaosMen"
  ],
  "description": "Under the Search criteria, I marked this video as a Best Friend video. I don't think it deserved it in the title, but there is a familiarity and bond between these guys that is somewhere between. If you watch only the fucking, you won't see it.\nYou have already met Davin, and that is thanks to Mio. They met a while back, and Mio actually suggested to Davin that he should do porn with my site.\nEven though Davin is married and Mio is gay, it sounds like they all party and hang together. I don't know how close they are, but they seem like good enough friends.\nWell when I offered Davin work, he suggested that Mio had hinted at wanting to try to ride his dick. I think Davin was eager to do a scene with someone he knew, rather than a stranger, and I couldn't think of which model would be willing to sit on his fat cock.\nPlus, I was waaaay over budget for the month, (yes, I have a tight budget) and just didn't think I could afford to do another sex film.\nBut the two of them worked out a rate, and they showed up a little nervous but ready to go.\nSo this is how I want you to view this video.\nHave you ever pined away for that well-hung straight guy and just thought if you had a chance you could show him a thing or two?\nWell, that's what is happening in this video...Live! Mio was awesome at showing off his cock sucking skills and we finally get to see Davin's cock deep throated.\nMio takes his giant cock like a champ too, and we get to see Davin's dick plunge deep and long.\nCumshot is pretty amazing. Imagine your best straight bud filling your mouth with his load and gulping it down, while simultaneously busting your own load.\nIt's quick and subtle, but check out the hand hold at the end. It says everything.",
  "models": [
    {
      "name": "Davin",
      "person_id": 3316
    }
  ],
  "release_date": "2009-06-05",
  "scene_id": 966,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Ethnicity - Latin Guys",
    "Build - Lean",
    "Build - Mature",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Theme - Best Friends",
    "Theme - RAW",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Davin & Mio - RAW"
}