{
  "collections": [
    "ChaosMen"
  ],
  "description": "I don't want you to jump to the ending of this video, because it is all good, but this one had some interesting things going on at the end.\nWright had not had sex or jerked-off in quite some time. He said he was working too much to have time even beat-off. So, he was in the mood to be fucked and eager to cum throughout the shoot.\nAs Kevin was fucking him on his back, it was clear that Kevin could make Wright cum while Kevin also stroked his cock. I think it is the first time I have seen Wright cum, while being fucked, while someone else jerks him.\nYou can tell it is a powerful orgasm too. It is so ironic given how he only wanted to be a Top when he started.\nKevin was very focused on making Wright cum, so he wasn't very close to cumming. He pulls out to jerk his cock and catch up, but instead, spins around and puts Wright's cock inside him. Now, Kevin says he has not bottomed before, but has had some ass play at home. I really didn't think this would help.\nKevin gingerly inserts and rides him. The hottest part is watching his cock drool precum!\nWright is starting to look a bit worried his cock would bend too far as he was starting to lose his boner. But he stayed hard enough for Kevin to get some anal stimulation.\nKevin steps off, takes a moment to jerk-off and turns back around and fires laser beams of cum at Wright's hole and torso.\nIt was kind of shocking to me, given how much pre-cum had been oozing out, almost as if he was cumming in slow motion while riding Wright's cock. Then ZING! Wright is dodging his head from cum hitting him in the face!\nI left it in as kind of an OutTake. You can tell how surprised I was! It is a great ending!",
  "models": [
    {
      "name": "Kevin Texas",
      "person_id": 9599
    },
    {
      "name": "Wright",
      "person_id": 8507
    }
  ],
  "release_date": "2019-08-23",
  "scene_id": 9705,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Video - OutTake"
  ],
  "title": "Kevin Texas & Wright - RAW"
}