{
  "collections": [
    "ChaosMen"
  ],
  "description": "I often have Lorenzo on hand to do the oral videos and over the years he has become one of my best cock handlers. I have to remind myself that Lorenzo does love to fuck and get fucked.\nHe and I had talked about paring with horse-hung James Dawn for a while, and we finally got their schedules aligned. It was worth the wait!\nWe definitely wanted to do a flip-fuck scene, mainly because it has been a while since James had topped and he is quite good at it, and Lorenzo has been bottoming a lot too, so seeing him fuck a dude was crucial to keeping both guys on their versatile toes.\nLorenzo takes the lead by fucking James. As always, James loves being fucked and can't bring himself to touch his cock while getting fucked for fear of cumming too soon.\nIronically, Lorenzo has the same issue and after James begins to fuck him, he is relatively hands-off his own cock.\nThey both cum SO easily while being fucked, it was hard to determine who would fuck the cum out of who.\nLorenzo was the lucky bottom, so James fucked Lorenzo until he blows a massive nut.\nThey slide a butt-plug into James's ass, and James begins fucking Lorenzo, ramping up to cum. Just before he cums, the plug flies out as James's ass expanded and contracted in the throws of orgasm. James dumps a huge load onto Lorenzo's hole, then spears him with his big uncut cock, using his own cum as lube to penetrate Lorenzo.\nJames finished by sucking the last bit of cum out of Lorenzo's cock!",
  "models": [
    {
      "name": "James Dawn",
      "person_id": 9467
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2019-10-11",
  "scene_id": 9740,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Twink",
    "Chest - Smooth/Trimmed",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "James Dawn & Lorenzo - RAW"
}