{
  "collections": [
    "ChaosMen"
  ],
  "description": "I haven't had a chance to see Greyson in full fuck-mode while in the studio. He had been doing some homemade videos and he is always terrific in them.\nIt was awesome to get him in the studio for some great lighting and detailed angles of this boy getting his ass rammed.\nKevin gets his cock worshipped first, followed by Greyson rimming his hole.\nKevin returns the favor, sucking his dick then rimming his hole until Greyson is begging for his cock. Kevin wedges his cock in and begins to fuck Greyson.\nGreyson loves it rough, so he kept encouraging Kevin to spank, slap, and choke him. Greyson was in Piggy Bottom Bliss!\nKevin easily fucks the cum out of him. Greyson makes it rain down on us as a ton of cum flies out as Kevin aggressively fucks his hole. I better check my lens as cum was flying everywhere!\nKevin keeps fucking him until he is about to cum. He pulls out and squirts a couple times on his hole, then buries his cock in Greyson's ass. Fans of watching a cock pulsates as it unloads inside of a dude's ass will not be disappointed!\nKevin pumps a major load into Greyson's hole. Spasming as his load is injected.\nKevin then spins Greyson around, making him clean his cock!",
  "models": [
    {
      "name": "Greyson Harper",
      "person_id": 9708
    },
    {
      "name": "Kevin Texas",
      "person_id": 9599
    }
  ],
  "release_date": "2019-10-18",
  "scene_id": 9741,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Chest - Smooth/Shaved",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Greyson Harper & Kevin Texas - RAW"
}