{
  "collections": [
    "ChaosMen"
  ],
  "description": "My goal for this video was to see if we could get Basil to cum while being fucked. He was yet another guy who does enjoy bottoming, but had not had an orgasm while being fucked.\nThis is a flip-fuck video. Basil fucks Aidan first, and the rest of the video Aidan pounds Basil's ass.\nIt is ironic that a lot of these guys have a mental block on being able to cum while being fucked, yet with all these cameras and myself in the room, they not only manage to cum while being fucked, but they shout out within about 2 minutes that they are cumming.\nThis video is a little shorter than others because it was way too easy to make Basil cum. I was filming the undershot when Basil shouted-out that he was cumming. I scrambled up ASAP, and barely caught his cum shot in time.\nYou might notice Basil's legs are flexed very straight as he cums which tends to push the top out, and I now wonder if it was not a mental block, but with Basil flexing his VERY muscular legs like that, it must push the Top out of his ass last minute.\nAidan does a fantastic job supporting his legs, and trying to keep fucking Basil's prostate. Basil still managed to flex his legs so intensely that Aidan pops out for a second, But like a pro, he got his cock back in, drilling him throughout Basil's orgasm!\nAidan then creampie's hole and then rolls Basil up so we can see his hot, cum-soaked hole!",
  "models": [
    {
      "name": "Aidan Anthony",
      "person_id": 9180
    },
    {
      "name": "Basil",
      "person_id": 9657
    }
  ],
  "release_date": "2019-11-08",
  "scene_id": 9749,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Asian Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Aidan Anthony & Basil - RAW"
}