{
  "collections": [
    "ChaosMen"
  ],
  "description": "Mica showed up to do his Solo and right aftward asked if there was another gig he could do. I was a bit unprepared, so I told him he could do a Serviced video the next day (even though I am trying get the other guys in on the blowing action)\nThere is just something so perfect about Mica's build. Perfect chest and abs, that I started him off kneeling, and out plopped his half-chubby left over from doing the thumbnail shots for the video.\nOn advantage is, wow, I don't turn so red! You guys might not realize but in order to shoot these vids, I have to keep one arm braced out of the line of fire, thus I am basically balancing myself with my mouth and stoking hand. I think I might hold my breath the entire time too.\nAs I have said before, I never really notice what the guys are doing face wise. There are sections when Mica is watching himself get blown, and I swear he gets harder from it!\nHe was also pretty good about having his ass rimmed. I dunno if it means we have a bottom in the future, but he was a lot less shy about this portion of the video than most.\nAnd true to what he said in his solo, he wanted to make sure (And so did I!) that every last drop went down the throat when he came. A little bit dribbles out, but for the most part, I think it even bypassed my tongue and coated my throat.\nIt's always a tricky thing swallowing a load for the camera. Half the audience loves it, while the other half doesn't believe they actually came. Clearly this kid nutted big time!\nI do try to squeeze out a little at the end....just like you would.",
  "models": [
    {
      "name": "Bryan",
      "person_id": 3120
    },
    {
      "name": "Mica",
      "person_id": 3320
    }
  ],
  "release_date": "2009-06-10",
  "scene_id": 975,
  "tags": [
    "Ethnicity - African American",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Build - Muscular",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Pubic Hair - Trimmed",
    "Video - Bryan Appearance",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Bryan & Mica - Serviced"
}