{
  "collections": [
    "ChaosMen"
  ],
  "description": "I normally would have Claudio do a Serviced video before moving him on to a full sex scene, but with James Dawn in town and Claudio all ready to go, I paired them up.\nBecause it was his first time, he was a bit nervous. Claudio would look about at me and the monitors, trying to make sure he was doing a good job. That is one of the advantages of having the models do a solo and oral. They tend to be training or perhaps relaxation sessions where the guys learn to chill, just get in the moment and worry less about what is going on around him.\nBut Claudio learned quick, and after James gave him a blow-job, he got lost in the moment and focused on pleasing James. He turned the table and began to suck on James, giving him a skilled blow-job.\nClaudio tends to be more of a Top, but he also enjoys bottoming. Claudio rims James's hole and then slide his rather big uncut cock inside of James. It only took James a few moments to accommodate Claudio's cock, and then James began telling him to fuck him harder.\nClaudio wanted in on the bottoming action, so they swap places. This time, James pounds Claudio's ass. Once again, I am reminded of what a great Top James is.\nClaudio looks really turned-on and between the toy he used during his solo, and his love of being fucked in this video, I think Claudio is completely versatile.\nThey spoon fuck last, and James loved this angle so much that he blows his load.\nClaudio fucks him until he is close to cumming, then jerks his cock, and easily breeds James's hole. His aim is a little off given his position, so Claudio uses his cock and fingers to push his jizz into Jame's hole and fucks him with it!\nI love these well-timed videos where everyone practically cums at once!",
  "models": [
    {
      "name": "Claudio Carrera",
      "person_id": 9759
    },
    {
      "name": "James Dawn",
      "person_id": 9467
    }
  ],
  "release_date": "2019-11-04",
  "scene_id": 9803,
  "tags": [
    "Build - Lean",
    "Build - Mature",
    "Build - Muscular",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Claudio Carrera & James Dawn - RAW"
}