{
  "collections": [
    "ChaosMen"
  ],
  "description": "I have been wanting to put these two together since Kevin Texas joined Team Chaos.\nAidan loves to top, but he also loves to bottom, and he was eager to get fucked by Kevin.\nAidan starts by sucking Kevin's cock, and then Kevin returns the favor. Kevin sure puts a lot of energy into it, and the boy makes me think he is more Bi with every shoot.\nOnce they start fucking, the sparks fly. I love watching Kevin fuck Aidan in a spoon position while wrapping his hands around Aidan's neck. Aidan loves to be used and abused!\nBoth their cum shots are amazing! Kevin fucks him until he is cumming. He pulls out at the last second, squirts some jizz, then dumps the rest inside of Aidan.\nAidan immediately ramps up, racing to cum before Kevin goes soft. Kevin's cock is coated in his cum as he pounds Aidan's hole. Aidan is extra turned-on knowing he has Kevin's fresh load inside of him.\nAidan cranks out a massive load, spraying the camera (and myself!) with giant glops of cum!\nHis cum hit my glasses and it managed to drip in my eye, so I stumble through filming the last bit with one eye closed. I did manage to catch Aidan cleaning Kevin's cum-frothed cock!",
  "models": [
    {
      "name": "Aidan Anthony",
      "person_id": 9180
    },
    {
      "name": "Kevin Texas",
      "person_id": 9599
    }
  ],
  "release_date": "2019-12-06",
  "scene_id": 9809,
  "tags": [
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Red",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Sex Act - ATM Ass To Mouth"
  ],
  "title": "Aidan Anthony & Kevin Texas - RAW"
}