{
  "collections": [
    "ChaosMen"
  ],
  "description": "Kyle starts by giving Calvin a quick rub-down, sliding down to rim his ass quickly.\nThis gets Calvin all revved-up, so Kyle flips him on over and sucks his cock.\nKyle then face fucks Calvin, and the spit flies everywhere! They then 69-suck and Calvin gets some ass eating in too.\nKyle gets Calvin doggie-style and rims his hole. He fingers his ass too, getting him all lubed-up for his cock. With this perfect angle, Kyle really opens up Calvin's hole.\nThey then spoon fuck, which I think is the hottest part of the video. You can really see both their skills, and Kyle has mad concentration going as he pummels Calvin's hole from the side. There was a reason Kyle was concentrating so hard.\nI didn't keep it in the final cut, but Kyle kind of cums in this position.\nKyle pulls out and clenches his cock, but cum spills out. He looked so panicked that I felt for him. His cum was pinched in the palm of his hand and we did a quick clean-up. He dove right back into fucking.\nI think we should try to get multiple ejaculations out of him. He is always having to stop or risk cumming, and I think he just needs to get one out of the way, and then pound with impunity for the rest of the scene.\nSo, we re-directed and got Calvin on his back. Calvin is jerking his cock, enjoying the fucking, and working his cock up to cum.\nNope!\nKyle beats him to it! So much for my theory that he needs to just get one load out of the way! Jet always could cum multiple times as a Bottom, but I haven't seen it too much from a Top.\nKyle cums on and in his ass, and this gets Calvin all charged-up to shoot his own load!",
  "models": [
    {
      "name": "Calvin",
      "person_id": 9574
    },
    {
      "name": "Kyle Wyncrest",
      "person_id": 9545
    }
  ],
  "release_date": "2019-12-13",
  "scene_id": 9814,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Calvin & Kyle Wyncrest - RAW"
}