{
  "collections": [
    "ChaosMen"
  ],
  "description": "Dietrich really wanted to play with Kevin Texas. He kept browsing the site looking at other ChaosMen models, and Kevin was his top pick.\nHe was really excited to do the video. Dietrich has a few things fetishes he wants to show us. From ballcaps, jock-straps, and sneakers, which all seem to be clothing oriented, really turn him on. Of course, he loves to worship a guy and royally service a dude. Cock-sucking is his forte!\nA massage video was a perfect scenario for him to get himself and Kevin all worked-up.\nDietrich oils him up, paying attention to his feet for foot lovers.\nYou can tell how turned-on Dietrich is because his cock is dripping precum. He pulls it out for Kevin to suck it, and Kevin dives right in.\nKevin flips on to his back, and Dietrich rubs him down, playing close attention to his cock. Kevin seems very interested in stroking Dietrich's dick too.\nDietrich then finally shows-off his amazing cock-sucking skills, and Kevin definitely seems impressed. Next, Dietrich gets Kevin's legs up in the air and gives him a good rimming. He crawls on top of Kevin and grinds his ass onto Kevin's hard cock.\nThey switch things up, Kevin rimming Dietrich's hole to get it nice and lubed-up before pounding Dietrich over the edge of the massage table.\nKevin flips him over and gets Dietrich's feet (with sneakers on for fans!) in the air. Kevin fucks the cum out of Dietrich!\nKevin then shoots his load like a laser, coating his hole with his first blast then plunges in to unload inside of him.\nHe makes Dietrich clean his cock, then gets him up on the table to play with his cummy hole!",
  "models": [
    {
      "name": "Dietrich",
      "person_id": 9681
    },
    {
      "name": "Kevin Texas",
      "person_id": 9599
    }
  ],
  "release_date": "2019-12-20",
  "scene_id": 9821,
  "tags": [
    "Build - Mature",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Dietrich & Kevin Texas - RAW"
}