{
  "collections": [
    "ChaosMen"
  ],
  "description": "I think I got Reese Arden back in the studio fairly quickly. This pint-sized dynamo is so much fun to be around that I tried to get him back as soon as possible.\nHe of course loves to bottom, and I thought Drew would be great with him.\nSure enough, they were glued to each other the moment they walked into the room. I was setting-up cameras, getting lights on, etc., and they were making-out and even sucking dick. I was like, \"Can you guys just wait a minute, we will have to start all over!\"\nOf course, they didn't mind going back to kissing. In fact, there is a lot of kissing in this video.\nBoth of these guys know how to suck and fuck, and as usual when this happens, I just chased them around with the cameras, trying my best to keep up.\nYou might notice Reese has razor burn on his bum. A couple days before the shoot, he asked if he could shave it and I told him no, but he could use some trimmers to avoid red splotches. Instead, he used hair removal cream! Argggh! Live and learn. I am not even sure he knew how red his bootie was.\nDrew didn't care, he just wanted to fuck the hell out of his new play toy.\nThis was Reese's first shoot and there was one other little mishap. I was down on the ground trying to get a close-up shot of Drew cumming. Drew was giving it all to him, when I could hear Reese's moaning was a bit louder than before. Apparently, he was trying cum along with Drew.\nDrew turned to me on the ground and said, \"Uh, he just came.\"\nThank goodness for multiple cameras or I would have missed it completely. I scrambled up to pan over the aftermath but Drew started to cum too.\nDrew bred his boy, dumping a huge load. Reese drops to his knees, teasing Drew's cock with his tongue, before sucking the last bit of cum from his cock!",
  "models": [
    {
      "name": "Drew Foxx",
      "person_id": 9717
    },
    {
      "name": "Reese Arden",
      "person_id": 9780
    }
  ],
  "release_date": "2019-12-27",
  "scene_id": 9833,
  "tags": [
    "Build - Average",
    "Build - Hairy",
    "Build - Lean",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Sex Act - ATM Ass To Mouth"
  ],
  "title": "Drew Foxx & Reese Arden - RAW"
}