{
  "collections": [
    "ChaosMen"
  ],
  "description": "Basil was talking about getting fucked, and I told him I had Vander in town for a couple days.\nI did warn him he has a big dick, but Basil thought he could handle it. But just in case, I made sure both guys were ready to top or bottom\nVander really wanted to fuck him too. You can tell when he is laying on his back, while flipping his semi-hard cock against Basil's tight ass.\nBut I wasn't too sure Basil could handle him right out of the gate.\nSo, Basil fucks Vander first, fucking him good, and trying to jerk Vander's cock as he does. Vander's cock looks huge in Basil's small hand!\nThen it came time for Basil to get fucked. Oh boy! They tried and tried. Vander would get inside about half-way and Basil would squirm away. Eventually we pulled out a vibrator to loosen Basil up.\nVander fucks him with it, then slowly slides his cock in. Let's just say he modestly took his fat cock.\nWith some relief, Basil swapped places with Vander and started fucking him really hard. Perhaps trying to get some pay back?\nDespite having his ass stretched beyond any level before in his life, Basil still got close to cumming quickly. He blows his nut all over Vander's hole, shoving it in and fucking his cum into Vander.\nVander ramps-up, and with Basil's load deep inside of him, he shoots his own load!\nThis is a hot video, especially if you like watching a somewhat inexperienced bi-guy try to take on a Kong-sized dick!",
  "models": [
    {
      "name": "Basil",
      "person_id": 9657
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2020-01-03",
  "scene_id": 9844,
  "tags": [
    "Build - Mature",
    "Build - Muscular",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Asian Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Sex Act - Toys",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Basil & Vander - RAW"
}