{
  "collections": [
    "ChaosMen"
  ],
  "description": "Ivan is headed off for foreign lands, and he wanted to do a video before being out of commission for a while.\nHe figured he would go out with a bang, and finally agreed it was time for him to not only suck some dick, but to take it up the ass.\nI wanted someone who had experience but wouldn't split him in two and scare him away from doing more.\nVance was just the man, and I thought I would get out the 'ole massage table to do the scene on.\nUsually the \"top\" takes control, and Ivan has struggled with knowing what to do.\nSo it is great to see him be more passive, and Vance takes control of the situation.\nWhat is so awesome about this video is Ivan is clearly turned on by this. His dick rarely wilts, and it's so cool to see his dick hard with a butt plug up his ass, and a cock in his mouth!\nIn between takes, he was basically commenting, \"Golly gee, I think I can cum while being fucked!\" Duh! He was always very skeptical that the guys he was fucking were actually enjoying it.\nNever one to pass up that opportunity, we recycled the \"on his back, legs in the air\" position. Vance tentatively fucked him until he nuts. He pulls out just as he is cumming, but overall, a pretty good \"fuck the cum out of your buddy\" shot. You can tell Vance thinks Ivan will not nut if he pokes him too much, but Ivan is yelling \"Harder!\" What a reversal!\nVance has a tough time playing catch up, so it takes him a minute or two to bust. Ivan's dick goes down, but the cum is still wet when Vance nuts all over Ivan's spent cock.\nIt's a very hot video where Ivan finally gets a cock in his mouth and ass!",
  "models": [
    {
      "name": "Ivan",
      "person_id": 3277
    },
    {
      "name": "Vance",
      "person_id": 3281
    }
  ],
  "release_date": "2009-07-10",
  "scene_id": 985,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Brunette/Black",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW"
  ],
  "title": "Ivan & Vance - RAW"
}