{
  "collections": [
    "ChaosMen"
  ],
  "description": "If a Serviced video could be labeled Serviced Stoically, this one would be at the top of the list.\nI really wanted to do this video, but at 5'8\" I felt like I was way too small to be working with 6'5\" Novak. And I just had Kale show up and at 6'3\" I thought would be a better match visually. I felt like I was in the land of the giants while working with them!\nNovak actually contacted me a week after his solo, saying some auto repairs were more than he thought they were and he was ready for a blow job. Kale was eager to suck some straight boy cock, so it all worked out.\nBut from Novak's stoic attitude, you'd think I had twisted his arm to do the video. I feel for Kale cuz you don't know what technique to use to make them aroused. He tries everything, yet Novak gives very little feedback to let him know what felt really good.\nClearly the boy's dick liked the attention. He stayed bone hard. Kale did some things that I would never do, like rubbing stubbly chin hair on a cock head. OUCH! And no sense reminding them their is a dude sucking their dick. I can't tell from Novak's reaction if he liked it or not. I think he did though!\nBut over all he kept him charged up, and it was nice to find someone young who enjoys eating ass (seems to be an acquired taste), and Novak didn't seem to hate it, so having some rimming in a No Bryan video is always a plus.\nWe knew Novak was gonna be a guy who needed his dick jerked hard and bless Kale's heart, he kept that pace fast and furious until he nutted.\nKale eagerly gobbles up the cum as Novak is not quite sure what just happened!",
  "models": [
    {
      "name": "Kale",
      "person_id": 3318
    },
    {
      "name": "Novak",
      "person_id": 3324
    }
  ],
  "release_date": "2009-07-08",
  "scene_id": 986,
  "tags": [
    "Build - Lean",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Sex Act - Oral",
    "Sex Act - Ass Eating Rimming",
    "Hair - Brown/DK Blond",
    "Theme - Serviced",
    "Video - HD - High Def",
    "Sex Act - Facial  Cum Eating"
  ],
  "title": "Kale & Novak - Serviced"
}