{
  "collections": [
    "ChaosMen"
  ],
  "description": "How about some hot Twink-on-Twink action?!\nJacob immediately got a crush on James when they met, and I don't think I have seen James so excited to start filming. He is usually very professional, and once I yell, \"Action!\" he starts getting into it. But this time he was sneaking peeks, and grabbing Jacob, to the delight of Jacob.\nAnother easy video to film and to edit because of their chemistry. They just straight-up start making out, sucking then, fucking. Every now and then James moves Jacob around to show the cameras what he is up to, so I know he hadn't lost touch with reality. Jacob though, he was in a daze, especially when he got to fuck James.\nThey flip-fuck, so you guys will all have to vote on who positioned better? Jacob or James better as Top or Bottom?\nWe ended with James getting the cum fucked out of him. We know for sure he can, but Jacob wasn't so sure he could cum from getting fucked. He promised to get a dildo and practice. I think next time we will see if we can get Jacob to cum from being fucked.\nBut Jacob sure is a good Top and found it easy to fill James's hungry hole!\nEven if you are not a fan of younger leaner types, these two have great chemistry, and it worth signing for!",
  "models": [
    {
      "name": "Jacob Jax",
      "person_id": 9830
    },
    {
      "name": "James Dawn",
      "person_id": 9467
    }
  ],
  "release_date": "2020-01-17",
  "scene_id": 9866,
  "tags": [
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Flip-Flop Fuck",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jacob Jax & James Dawn - RAW"
}