{
  "collections": [
    "ChaosMen"
  ],
  "description": "How about quickie for Wednesday morning?\nI seriously misjudged Teague's ability to handle pain. He has always kind of bragged about his tolerance level.\nNow Nathaniel may not look like he has a giant cock on his large frame, but it IS quite large. Long and wide.\nWhen they were getting charged up playing with their own dicks while watching a pussy porn, Teague took one look at his dick and said to me, \"I don't think I can sit on it.\"\nSo we stopped and found some large toys and he loosened up a bit.\nBoth models wanted to get paid, and I will be real honest, it took us quite some time to get Nathaniel's dick up inside Teague. You may think I am gypping you out of some Behind the Scenes footage, but it's just no fun to see them try ,try and try again.\nWe finally got him loose enough and once the dick was in, they both were hurrying to fuck like rabbits. Nathaniel was getting tired of trying to go slow. The slow pace just can't keep him hard. He fucks fast and furious.\nI think Teague did get pretty hard when he was on his back while getting fucked, and finally got into it. Phew!\nI shortened the video a bit, with only two positions. I promised Teague that we would give him a break if he did one of his great facial shots.\nNathaniel delivers gobs of globs of cum, and one giant stream hit Teague square in the eye. As\nMiss Coco Puru says, \"It Buuuuuurrrns!\"\nSo we all have to give him props for not only continuing to suck the cum out of his cock, but after a bit of cleanup (and one very irritated red eye) he pops out a high velocity cumsot. (It's funny to watch Nathaniel jump out of the line of fire..the big baby!)\nI even asked Nathaniel to give Teague a kiss, and I think he felt so guilty for the anal probe and cum in the eye, he figured it was the least he could do.\nI gotta say, watching this masculine dude kiss passionately with another guy is a perfect ending!\nNow I just got to get Teague to stop affectionately saying, \"Damn Bryan, I can't believe you made had me have sex with Sasquatch!\"\nIn the future I am going to find someone who can really get off on Nathaniel's over-sized unit. Lesson learned!",
  "models": [
    {
      "name": "Nathaniel",
      "person_id": 3258
    },
    {
      "name": "Teague",
      "person_id": 3295
    }
  ],
  "release_date": "2009-08-19",
  "scene_id": 987,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Build - Muscular",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Hair - Brown/DK Blond",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair",
    "Theme - RAW"
  ],
  "title": "Nathaniel & Teague - RAW"
}