{
  "collections": [
    "ChaosMen"
  ],
  "description": "You can really tell how \"thick\" Kocxin's dick is in this video. Once you see if up agains't Bentley face, you really see the scale of it.\nHe and Bentley start by jerking-off together. Kocxin is a little behind Bentley on getting hard. Bentley reaches over and with just a bit of stroking, Kocxin got fully-hard. Bentley had some inertia going, so he dives in and starts sucking on his cock. He rubs his taint too, and I think that got Kocxin REALLY hard.\nBentley got up on his knees so Kocxin could suck on his dick, and WOW, Kocxin sure can suck dick like a pro! He deep-throats Bentley and gives him a nice sloppy blowjob.\nThis impressed Bentley, and he wanted to see if he could take all of Kocxins' dick. He laid on his back while Kocxin face-fucked him. Bentley does a great job taking his oversized cock.\nThey then 69-suck and they both rim each other. Kocxin seemed extra thrilled to have his hole rimmed, but also hungrily licked Bentley's hole.\nKocxin also wanted to try getting face fucked, so Bentley slams his cock down his throat while Kocxin opens his passage by bending his neck over the side of the bed.\nThis gets Bentley turned-on and he starts to cum. He aims for Kocxin's face and he stripes his face nicely.\nAt the same time, Kocxin begins to cum. Such perfect timing that you can see I am panning my close-up shot of his orgasm as he is suddenly shooting his load.\nI really enjoyed working with Kocxin. He is very sexual and down for pretty much anything, and would loves to see his fat cock spurting while getting his ass fucked.",
  "models": [
    {
      "name": "Bentley Layne",
      "person_id": 9039
    },
    {
      "name": "Kocxin",
      "person_id": 9863
    }
  ],
  "release_date": "2020-01-15",
  "scene_id": 9873,
  "tags": [
    "Build - Average",
    "Build - Stocky",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bentley Layne & Kocxin - Serviced"
}