{
  "collections": [
    "ChaosMen"
  ],
  "description": "I would say Ian is a little punker kid.\nHis look kept changing every time I would see updated photos of him. Long bleached out hair, then a Mohawk, tons of piercings. and of course, trademark baby pins holding his clothes together.\nI just felt like I couldn't count on him to keep a look that would be a bit more universally appealing for a wider audience, or not show up with neon hair.\nFinally he shaved his 'Mo off and that beautiful face and body that he was hiding with waaaay to many accessories shone through!\nThe kid has an amazing face and you just have to wonder why he insists on all the distraction techniques. Perhaps we should save the psycho analysis for another day, but it does beg the question...why?\nMany of you notice (and probably drive you crazy) that I use a set of standard questions to ask the guys.\nWell, here is a video that shows exactly WHY I don't ask them anything beyond the basic questions. Most of which I have already asked him during the photo shoot, so it will be fresh on his mind.\nIn other words, I am trying to avoid the \"duh\" factor. I'm not asking them the Vice President's name. I stick to the things they can roll off the top of their head.\nBecause honestly, most of you will fast forward through it, maybe listen to his voice to see if he really sounds like a straight guy, and I have to make the videos short enough to be a quick download but still satisfying.\nAnd Ian is an example of when I asked question that veered off from what I normally ask. He had said he had worked at a porn shop and was bored with porn. When I ask him on film, it is a completely different answer, and frankly not very interesting.\nAnd when I ask what he likes to do with girls, he is just flummoxed.\nMaking me think that I should probably stick to the Age, Height, and Weight questions.\nOther than that, Ian IS an interesting guy. Pretty sure he has some serious choking fetishes. Likely why he didn't want to answer the question about what he does with girls.\nIt's kinda hot watching him pull his choke chain and do a little auto-erotic-asphyxia!",
  "models": [
    {
      "name": "Ian",
      "person_id": 3325
    }
  ],
  "release_date": "2009-07-27",
  "scene_id": 988,
  "tags": [
    "Theme - Solo",
    "Build - Lean",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Cock - Hung",
    "Build - Twink",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Blond",
    "Hair - Shaved",
    "Video - HD - High Def"
  ],
  "title": "Ian - Solo"
}