{
  "collections": [
    "ChaosMen"
  ],
  "description": "Once again, I was worried that I might have picked a guy that was too hung for a newbie.\nKocxin does have some toys and has been fucked, but the size of both were not too great. Espen is packing quite a tool for someone new.\nBut Kocxin is a champ and really takes Espen's cock like a pro. He did say that at times it hurt and other times it felt fantastic, so I think he is just trying to get used to being fucked with more aggressive tactics.\nKocxin also doesn't seem to have many limits. Rimming is a fav, plus he can swallow a huge cock down his throat. Espen fucks his face with Kocxin's head over the side of the bed, and the gagging was pretty hot. A lot of slobber, but not a single complaint\nWe didn't know which position Kocxin could cum in, as he has only cum with a toy inside of him, so I opted to play it safe and leave the final position with Kocxin on his back.\nSo, they start with Espen fucking him doggie-style, followed by some damn good spoon fucking.\nKocxin ends on his back and sure enough we got him to cum while Espen slowly ground his cock against his prostate!\nEspen pulls out and shoots a nice load on his hole. He really has got this down, and inserts his cock as he is cumming, his cock spasming as he unloads inside of Kocxin!",
  "models": [
    {
      "name": "Espen",
      "person_id": 9123
    },
    {
      "name": "Kocxin",
      "person_id": 9863
    }
  ],
  "release_date": "2020-02-28",
  "scene_id": 9890,
  "tags": [
    "Build - Average",
    "Build - Lean",
    "Build - Twink",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Espen & Kocxin - RAW"
}