{
  "collections": [
    "ChaosMen"
  ],
  "description": "Some really amazing chemistry in this video.\nYou can tell right away these boys are hungry for each other. Lots of passionate kissing, and Maverick couldn't wait to get his throat wrapped around Jacob's thick cock. Maverick is an amazing cocksucker!\nNot that Jacob is any less skilled, he just had a harder angle to work from. They move 69-suck and that helped Jacob get more of Maverick's cock into his mouth.\nMaverick then sat on his face, getting his hole all slicked-up. Jacob moves Maverick down his body so Maverick can sit on his big nob. Maverick looks like he is being split in two, but he sure can take it!\nHe even spins around and lays down on top of Jacob while Jacob fucks him silly.\nNext, Jacob fucks him on his back, really drilling Maverick deep.\nMaverick thought he could cum in a standing doggie-style position, and we tried that. But you can see Maverick's legs trembling as he tries to bust a nut in a somewhat awkward position.\nMaverick is very close to cumming but just felt like his legs would buckle out from under him. So, he gets on his back and as soon as Jacob inserts his cock a MASSIVE load of cum flies out of his cock, coating his body and face!\nThe look of surprise on Jacob's face is priceless, and I even left a CamCap of it in the preview CamCaps for everyone to see. Since he came so quickly, I struggled to get my close-up shot, but with a little camera jarring, I managed to catch him shooting.\nAnd then oh boy did Jacob cum! He had been fucking Maverick for so long in the standing doggie-style position, he was edging the entire time.\nAnd what a massive load he released onto and into Maverick. I think this has got to be the cummiest creampies I have seen in recent years.\nYou don't want to miss this video, these two really connected!",
  "models": [
    {
      "name": "Jacob Jax",
      "person_id": 9830
    },
    {
      "name": "Maverick Magnussen",
      "person_id": 9695
    }
  ],
  "release_date": "2020-02-21",
  "scene_id": 9896,
  "tags": [
    "Build - Lean",
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jacob Jax & Maverick Magnussen - RAW"
}