{
  "collections": [
    "ChaosMen"
  ],
  "description": "Calvin was a bit more reserved than even his solo. Definitely a complete newbie to filming.\nJacob draws him out as much as he can. They start by stroking themselves and Jacob is hard rather quickly as usual. Meanwhile, Calvin is still trying to wake his cock up on his own.\nJacob lends a hand, or rather a mouth, and he gets his cock hard enough. Calvin sat back to enjoy the blowjob.\nThen it was his turn to suck on Jacob, and despite his lack of skills (You can really tell it is his first time sucking a dick), it looked like Calvin really got-off on sucking on a big 'ole cock.\nIn fact, every time Calvin would go soft, we would just have him suck on Jacob's cock and he would bounce right back.\nAs nervous as Calvin looked, we kept the cum shot simple, and it turned out to be quite nice. This worked easily, as both guys nutted very quickly. I thought given Calvin's nerves we might be in for a long-haul.\nYet Calvin easily blast his load on to Jacob's face with quite some distance. He striped Jacob's entire face and even his hair. Of course, he nails Jacob right in the eye!\nBut Jacob was on roll, ready to cum. I did a real quick wipe to his eye area, and by the time I stepped back, Jacob shot a high-flying load!\nYou'd think it had been weeks since Jacob had last ejaculated!",
  "models": [
    {
      "name": "Calvin Diego",
      "person_id": 9891
    },
    {
      "name": "Jacob Jax",
      "person_id": 9830
    }
  ],
  "release_date": "2020-01-29",
  "scene_id": 9897,
  "tags": [
    "Build - Average",
    "Build - Lean",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Facial  Cum Eating",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Jacob Jax & Calvin Diego - Serviced"
}