{
  "collections": [
    "ChaosMen"
  ],
  "description": "When I interviewed Gavin during his solo, he said Teo was his favorite guy on the site.\nTeo was in town and ready to shoot, so while Gavin was here I thought I would make some magic happen.\nTeo has been on a kick to Top as he has gotten more confident with staying hard to fuck. Not that he doesn't mind being fucked, but topping involves less prep time for doing the shoot.\nI think Gavin was in heaven as he finally got to suck on Teo's uncut cock.\nSome great fucking in this video while Teo tries to up the ante to try new things!\nWe all realize he has been on the site over a year now, and though I try to spread him out to one release a month, I know you, the audience, wants to see new things.\nBut his energy is so good, and he is a \"ringer\" when working with new straight guys. He is clearly straight as well, and for some reason that puts the new guys at ease. Plus he is a total goofball and that takes the grim seriousness out of the other model's attitude.\nWhile Gavin is not straight, it gave us the chance to do some new stuff... more freedom.\nGavin was eager to eat Teo's load, and Teo himself suggest that after he dumps his load to go down for a cum-soaked kiss. While I don't think he is ready to eat another guy's load yet, he certainly went for it.\nHe's nutted in his mouth by accident so it didn't seem like it would be too hard to try.\nTo be honest, I think most of it went down Gavin's throat anyway, but you gotta give Teo props for trying something new!\nYou might have to replay the cumshot over and over as you watch Gavin squirt just as Teo fills his mouth! What Timing!",
  "models": [
    {
      "name": "Teo",
      "person_id": 3261
    },
    {
      "name": "Gavin Walters",
      "person_id": 3321
    }
  ],
  "release_date": "2009-07-24",
  "scene_id": 990,
  "tags": [
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Facial  Cum Eating",
    "Chest - Smooth/Natural",
    "X-Tras - Tattoos",
    "Build - Hairy",
    "Cock - Hung",
    "Cock - Uncut",
    "Build - Swimmer",
    "Pubic Hair - Intact",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Video - HD - High Def",
    "Sex Act - Bareback",
    "Chest - Hairy/Hair"
  ],
  "title": "Gavin Walters & Teo - RAW"
}