{
  "collections": [
    "ChaosMen"
  ],
  "description": "Despite a bit of a language barrier I was worried we had not communicated well about Boris's sexual experiences with guys.\nHe said he had only one experience with a guy, but this formerly married and father of two, sure looked very experience sucking on Aiden Asher's cock.\nAs it turns out, yet it was one guy, but it wasn't just a one-off, but they had sex many times, and as he mentioned during his solo, he really liked getting fucked.\nBut today, we were there to check out his blow job skills.\nAnd as I just said, the dude really knew to get out there.\nAiden also like more mature guys, so this matching was really terrific.\nI loved seeing Boris suck Aiden's cock while he was in a doggie-style position. His ass is all pushed out and ready to be fucked. He came in just before the holidays started, so there was some down time getting models in, but he is on the top of my list to get back to see some great ass pounding of his tight little bootie.\nBoth these guys cum so easily too. Boris can do a quick jerk and cum in under a minute, and after giving Aiden a facial, Aiden blew his own load. Aiden sucks the last of the cum out of Boris's cock, and that puts him over the top.\nI may have to find a new place to Aiden to dump his load. With his alabaster skin, his load blends in, but regardless, the dude shot like a fire hose, coating his entire torso!",
  "models": [
    {
      "name": "Aiden Asher",
      "person_id": 9826
    },
    {
      "name": "Boris",
      "person_id": 9908
    }
  ],
  "release_date": "2020-02-19",
  "scene_id": 9915,
  "tags": [
    "Build - Lean",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def"
  ],
  "title": "Aiden Asher & Boris - Serviced"
}