{
  "collections": [
    "ChaosMen"
  ],
  "description": "Denver continued using his 'dirty talk' skills! Usually a massage is passive and quiet, but Denver kept egging Lorenzo on throughout most of the shoot.\nLorenzo gave him an amazing rub down, while Denver enjoyed having his body worshipped. Of course, he liked the ass and cock play the best.\nThere were a couple of times he was ready to cum, and if you stay tuned for the very end, I kept in one OutTake. He had literally just been flipped onto his back, and once Lorenzo ramped-up the speed, he was ready to cum. You can hear both Lorenzo and I scrambling to tell him, \"Not yet!\"\nWe wanted to tease his cock some more and have him begging to let his load fly.\nDenver is also great at sucking cock, and even rimmed Lorenzo. He really seems to have very few limits.\nWe stopped to take some pictures, and once Lorenzo got him on his back, he focused on making him cum.\nIt was so easy too! Lorenzo skillfully pulled an orgasm right out of him. Lorenzo licked up most of it, spitting it out into a puddle so he could add his own load to it.\nAfter cumming so intensely, Denver could have easily slipped into a post-cum coma, but instead, he encouraged Lorenzo to blow his own load. After a quick sniff from a brown bottle, Lorenzo was ready to go.\nBetween that and the verbal encouragement, it triggered Lorenzo to bust. He added his own DNA to Denver's torso, and then lapped up his own cum, adding even more seed to Denver's cock!",
  "models": [
    {
      "name": "Denver Dubois",
      "person_id": 9919
    },
    {
      "name": "Lorenzo",
      "person_id": 7735
    }
  ],
  "release_date": "2020-02-26",
  "scene_id": 9931,
  "tags": [
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Pubic Hair - Trimmed",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos",
    "Video - OutTake"
  ],
  "title": "Denver Dubois & Lorenzo - Serviced"
}