{
  "collections": [
    "ChaosMen"
  ],
  "description": "Vander has been with ChaosMen for a decade now, and I think he looks better than ever. He started with ChaosMen in March of 2010. He has been doing his own Fans site, as well as exploring bondage with various BDSM sites, mainly because every time we explored his hardcore play (like say Sounding), I think the ChaosMen audience was confused by it. Still, I like doing these occasional more fetish stuff, and will continue to push his limits.\nVander is a little bruised and battered from a roping video he had done the previous week.\nAs for Kevin, I always think of him as this fit military dude. I kind of always forget he is not that tall, and has this tight swimmer's build. You can really see the difference in mass in this video. Alone and in person, he has a bigger presence, but often when I get him in the room with another model, you see he is a smaller power-packed dude.\nSure, Vander is much bigger, but pay attention to when Kevin is sucking Vander's cock. His dick is nearly the size of Kevin's face. And boy was he ever fascinated by it. Most are.\nKevin just seems more confident in this video, and he is already a very confident performer, so I am chalking it up to natural chemistry. They spend so much time making-out at the beginning of this video, that I think it indicates that intensity.\nIt only took Kevin a few moments to see he was working with a pro, and could not only step up his game, but fuck aggressively. Vander loved it!",
  "models": [
    {
      "name": "Kevin Texas",
      "person_id": 9599
    },
    {
      "name": "Vander",
      "person_id": 3382
    }
  ],
  "release_date": "2020-03-20",
  "scene_id": 9936,
  "tags": [
    "Chest - Smooth/Natural",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Video - HD - High Def",
    "Build - Muscular",
    "Build - Swimmer",
    "Chest - Hairy/Hair",
    "Hair - Brown/DK Blond",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - ATM Ass To Mouth",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - RAW",
    "X-Tras - Piercings",
    "X-Tras - Tattoos"
  ],
  "title": "Kevin Texas & Vander - RAW"
}