{
  "collections": [
    "ChaosMen"
  ],
  "description": "It sometimes surprises me how experienced these 18-year-old guys are. They must get a lot of practice earlier than in my day! Daniel Greene has some skills and I already have him booked to come back and do a sex scene.\nBut for today, we get to check out his oral skills with Bentley Layne. Daniel starts by sucking on Bentley, and like I said, he really knew how to suck a dick. They actually spend a fair amount of time making out, and I think Bentley quickly determined that Daniel was not only a good cocksucker, but an excellent kisser.\nThey make-out some more, fondling each other's cocks. Then it was Bentley's turn to show-off his blow job technique, making Daniel squirm as he got his cock sucked.\nBentley than rimmed his hole, and damn, does Daniel have a perfect ass. I know he said he is mostly a Top, but I really want to see a cock sliding in and out of his perfect butt. Fingers crossed!\nThey 69-suck for a bit, then Daniel dives into Bentley's hole with is tongue. Like a good Top, he really knows how to toss a salad!\nDaniel straddles Bentley's chest and ramps up to give him a facial. With just a bit on concentration, Daniel shoots cum all over Bentley's face.\nDaniel moves down to Bentley's cock to encourage him to shoot, and with cum still sprayed on his own face, Bentley busts his nut.\nDaniel licks up some of the cum, then sucks the rest for Bentley's spent dick.",
  "models": [
    {
      "name": "Bentley Layne",
      "person_id": 9039
    },
    {
      "name": "Daniel Greene",
      "person_id": 9944
    }
  ],
  "release_date": "2020-03-25",
  "scene_id": 9949,
  "tags": [
    "Build - Swimmer",
    "Build - Twink",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - Latin Guys",
    "Ethnicity - White Guys",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Facial  Cum Eating",
    "Sex Act - Kissing",
    "Sex Act - Oral",
    "Theme - Serviced",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Bentley Layne & Daniel Greene - Serviced"
}