{
  "collections": [
    "ChaosMen"
  ],
  "description": "Boris is back to show us how good he can take a cock.\nI might have been a bit too ambitious for his first time on film. Ricky has fairly large cock. Boris has bottomed for a few guys before, but I am sure this was much more of a challenge for his ass.\nWe start with a massage theme to help relax him. When Ricky starts playing with his ass, you can totally tell that Boris loves the anal attention. He hitches his ass up in the air, planting his face into the table, and lets Ricky have his way with his ass.\nRicky rims him and it gets him in the mood to be fucked.\nBut Ricky toys with him, licking his hole and stroking his dick. He then flips Boris over and starts jerking his cock. As he gets his cock stroked and sucked, he reaches out to play with Ricky's dick.\nEventually, Boris slides over and starts sucking on Ricky. He got Ricky nice and hard, and they moved around so that Ricky was laying on the table on his back so that Boris could take him time to ease down onto Ricky's cock.\nIt takes him a bit, and Ricky gets a little wobbly as Boris really needed some time to adjust to Ricky's thick cock. After a few minutes, he loosens up and things are quite a bit smoother.\nRicky is much better upright in a more dominant stance, so he fucks Boris doggie-style and he stays confidently hard. Boris, by then, was totally opened-up, and able to take it. I did wince a couple times as Ricky plowed him deep, but Boris just kept taking it like a man.\nIf I remember correctly, Boris said he hadn't cum from being fucked, so of course that was my goal.\nRicky flips him onto his back, which is generally the best position for most guys. Though initially, Ricky was going in deep, and Boris was struggling to take it.\nWe stopped and did some photos really quick. I advised Ricky to try to just use his cock head to rub on Boris's prostate.\nThat did the trick. A slower rhythm with just half the penetration was the secret as Boris rapidly jerked-out his load! Ricky pops out just as he is cumming, and tries to get it in as Boris cums. Boris's orgasm was intense! Seriously, he is lost in another world!\nRicky pulls out and then breeds Boris's hole, leaving cum dripping out of his battered hole!",
  "models": [
    {
      "name": "Boris",
      "person_id": 9908
    },
    {
      "name": "Ricky Roberts",
      "person_id": 9210
    }
  ],
  "release_date": "2020-05-01",
  "scene_id": 9988,
  "tags": [
    "Build - Mature",
    "Build - Swimmer",
    "Chest - Smooth/Natural",
    "Cock - Hung",
    "Cock - Uncut",
    "Ethnicity - White Guys",
    "Hair - Brown/DK Blond",
    "Hair - Brunette/Black",
    "Pubic Hair - Intact",
    "Sex Act - Anal Sex Fucking",
    "Sex Act - Ass Eating Rimming",
    "Sex Act - Bareback",
    "Sex Act - Creampie Breeding",
    "Sex Act - Massage Table",
    "Sex Act - Oral",
    "Theme - RAW",
    "Video - HD - High Def",
    "X-Tras - Tattoos"
  ],
  "title": "Boris & Ricky Roberts - RAW"
}